[{"name": "Where the Water Tastes Like Wine", "details_link": "https://www.metacritic.com/game/pc/where-the-water-tastes-like-wine", "publisher": "Dim Bulb Games", "release_date": "Feb 28 2018", "developers": ["Dim Bulb Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "General"], "meta_score": 74, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/8/43eed2038a450e8df75f80167ec43775-98.jpg", "descriptions": "Where the Water Tastes Like Wine is a Narrative-Adventure game about traveling, sharing stories, and surviving manifest destiny."}, {"name": "Batman: Arkham Origins", "details_link": "https://www.metacritic.com/game/xbox-360/batman-arkham-origins", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 25 2013", "developers": ["WB Games Montreal"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "Fantasy", "Open-World"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/290b2e8274c931ac028a82b0fed9464f-98.jpg", "descriptions": "Developed by WB Games Montreal, Batman: Arkham Origins features an expanded Gotham City and introduces an original prequel storyline set several years before the events of Batman: Arkham Asylum and Batman: Arkham City, the first two critically acclaimed games of the franchise. Taking placeDeveloped by WB Games Montreal, Batman: Arkham Origins features an expanded Gotham City and introduces an original prequel storyline set several years before the events of Batman: Arkham Asylum and Batman: Arkham City, the first two critically acclaimed games of the franchise. Taking place before the rise of Gotham City's most dangerous criminals, the game showcases a young and unrefined Batman as he faces a defining moment in his early career as a crime fighter that sets his path to becoming the Dark Knight. As the story unfolds, players will meet many important characters for the first time and forge key relationships.… Expand"}, {"name": "Marvel: Ultimate Alliance 2", "details_link": "https://www.metacritic.com/game/playstation-3/marvel-ultimate-alliance-2", "publisher": "Activision", "release_date": "Sep 15 2009", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/026f8de193314367dd3194d83d9c562f-98.jpg", "descriptions": "The \"greatest Super Hero action/RPG of all time\" is back with the world’s largest army of heroes and villains in Marvel: Ultimate Alliance 2. Incorporating elements of the acclaimed Marvel Civil War storyline, the game allows players to choose their side and team up with revered heroes andThe \"greatest Super Hero action/RPG of all time\" is back with the world’s largest army of heroes and villains in Marvel: Ultimate Alliance 2. Incorporating elements of the acclaimed Marvel Civil War storyline, the game allows players to choose their side and team up with revered heroes and villains, including Spider-Man, Wolverine, Hulk, Iron Man, Deadpool, Venom, Green Goblin and Captain America. Players can combine characters’ powers and unleash astonishing new attacks. [Activision]… Expand"}, {"name": "Isonzo", "details_link": "https://www.metacritic.com/game/xbox-series-x/isonzo", "publisher": "M2H", "release_date": "Sep 13 2022", "developers": ["M2H & BlackMill Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 40 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 74, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/46d01be4f27e26add6d3aa2a4002a40c-98.jpg", "descriptions": "World War One expands to the mountains of the Italian Front - beautiful but deadly in equal measure. Inspired by the two year struggle for control of the Isonzo river valley and the Alps during World War One, Isonzo elevates the WW1 Games Series, figuratively and literally. From the makersWorld War One expands to the mountains of the Italian Front - beautiful but deadly in equal measure. Inspired by the two year struggle for control of the Isonzo river valley and the Alps during World War One, Isonzo elevates the WW1 Games Series, figuratively and literally. From the makers of Verdun and Tannenberg…\r Take part in historical offensives from the Sixth Battle of the Isonzo to the Strafexpedition. Reflecting the course of the actual battles, as the attackers advance the fighting will shift through vastly different landscapes within a single offensive: from hillside fortresses to mountain trenches and fierce urban combat on city streets. Everything is recreated based on research and field trips, from sound effects and uniforms down to the houses, vineyards and trenches you’ll be fighting over. \r\rThe new Offensive game mode puts you right in the middle of key historical offensives on the Italian Front. Lead the charge across stunning Italian landscapes as you choose your path to victory - cut paths through barbed wire, flank your enemies by following mountain trails, or man a mortar to blast a way through. Shape a dynamic battlefield by laying sandbags and wire, placing ammo crates, deploying trench periscopes or sniper shields, and more.\r… Expand"}, {"name": "Masters of Anima", "details_link": "https://www.metacritic.com/game/xbox-one/masters-of-anima", "publisher": "Focus Home Interactive", "release_date": "Apr 10 2018", "developers": ["Passtech Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "MOBA"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/ef743d197bd3bc56e4f8a81d4e76313c-98.jpg", "descriptions": "Delve into an original adventure and defy the forces of evil in strategic, action-packed battles. Summon and control large armies of up to 100 Guardians thanks to intuitive and innovative gameplay and make quick tactical decisions to prevail."}, {"name": "Zoonies - Escape From Makatu", "details_link": "https://www.metacritic.com/game/ds/zoonies---escape-from-makatu", "publisher": "Kiloo", "release_date": "Aug 18 2011", "developers": ["Kiloo"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/6f7c8b43425dfd9b5ec3ac94246faf08-98.jpg", "descriptions": "The player beats enemies, solves intricate puzzles and avoids dangerous traps on his way through the jungle. Zoonies is a thrilling game for all audiences with plenty of innovative gameplay challenges. The game features creative physics, 3D real time graphics, 4 different worlds, 20 levels,The player beats enemies, solves intricate puzzles and avoids dangerous traps on his way through the jungle. Zoonies is a thrilling game for all audiences with plenty of innovative gameplay challenges. The game features creative physics, 3D real time graphics, 4 different worlds, 20 levels, multiple paths and lots of replay value.… Expand"}, {"name": "Rugby 08", "details_link": "https://www.metacritic.com/game/playstation-2/rugby-08", "publisher": "Electronic Arts", "release_date": "Jul 17 2007", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Rugby"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/9edcf4fb496233788d561d4d2f3e680f-98.jpg", "descriptions": "Own the World. Power your way through a grueling six-week campaign during the 2007 Rugby World Cup in France. Manage squad rotation and player injuries and track the progress of the entire tournament with a user-friendly, in-game information hub. Now you can emulate the style of yourOwn the World. Power your way through a grueling six-week campaign during the 2007 Rugby World Cup in France. Manage squad rotation and player injuries and track the progress of the entire tournament with a user-friendly, in-game information hub. Now you can emulate the style of your favourite team with Authentic Defensive Formations. Adjust your defense on the fly to keep momentum on your side. Counter your opponent’s attacking style by changing your defensive strategy based on score, field position, and more. World Cup Challenge. Replay over 30 classic moments in World Cup history using modern teams and unlock exclusive World Cup highlight videos. All New Set Pieces. Take full command over every scrum and maul with enhanced push and rotation controls. Make lineout throw-ins look easy with a simplified pick-up-and-play control system for the novice player, or master the advanced mechanics to enhance your game strategy for the real pro. Use the new kicking meter to master your drop kicks and score those key penalties and converts. New Truck and Zoom camera angles. With an unprecedented level of customised camera angles, zero in on all the action on the field by zooming in on rucks and scrums. Have a clear angle of the uprights as you slot that game-winning convert. Play as your national side in its official World Cup kit as you go for the ultimate glory on the world stage for the Webb Ellis Cup. Scoring in single player action becomes more difficult as the action moves closer to the try line. Watch as the CPU tightens up defensively, forcing you to create more strategic ways to score. [Electronic Arts UK]… Expand"}, {"name": "Meteos: Disney Magic", "details_link": "https://www.metacritic.com/game/ds/meteos-disney-magic", "publisher": "Buena Vista Games", "release_date": "Feb 20 2007", "developers": ["Q Entertainment"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 74, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/db3c4358cb4566d09c82f14acf15a894-98.jpg", "descriptions": "Meteos: Disney Magic combines the superb puzzle gameplay of the original version with beloved Disney brands.  Featuring an original story within the classic Disney universe, players are asked to help Jiminy Cricket and Tinker Bell in their quest to re-organize the famous Disney storybookMeteos: Disney Magic combines the superb puzzle gameplay of the original version with beloved Disney brands.  Featuring an original story within the classic Disney universe, players are asked to help Jiminy Cricket and Tinker Bell in their quest to re-organize the famous Disney storybook vault after someone accidentally changed the stories. By piecing together three or more Disney-themed blocks with the DS stylus and launching them from the touch screen, players are challenged to create puzzle patterns while interacting with some of their favorite Disney characters, including those from Pirates of the Caribbean, Tim Burton's The Nightmare Before Christmas, Cinderella, Lilo & Stitch, The Lion King and more. [Buena Vista Games]… Expand"}, {"name": "Disney/Pixar Cars 2", "details_link": "https://www.metacritic.com/game/playstation-3/disneypixar-cars-2", "publisher": "Disney Interactive Studios", "release_date": "Jun 21 2011", "developers": ["Avalanche Software"], "platforms": ["3DS", "PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Mission-based", "General", "General", "Arcade", "Automobile"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/4b2667adcb42b873378f6b0fef8ecb5e-98.jpg", "descriptions": "Inspired by the upcoming DisneyPixar animated film, Cars 2: The Video Game lets players jump into the Cars 2 universe with some of their favorite Cars personalities in exotic locations around the globe."}, {"name": "Call of Duty: Vanguard", "details_link": "https://www.metacritic.com/game/xbox-series-x/call-of-duty-vanguard", "publisher": "Activision", "release_date": "Nov  5 2021", "developers": ["Sledgehammer Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 74, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/2/b04a318dfc106be05b5732c2dfa0e693-98.jpg", "descriptions": "This is WWII combat like never before. Witness the origins of Special Forces as you play a pivotal role and change the face of history, forming Task Force One in a gripping Campaign across four major theaters of war. Become an original Special Forces Operator in an online Multiplayer rich inThis is WWII combat like never before. Witness the origins of Special Forces as you play a pivotal role and change the face of history, forming Task Force One in a gripping Campaign across four major theaters of war. Become an original Special Forces Operator in an online Multiplayer rich in innovation with 20 maps available at launch. Prepare for a franchise-first, universe-expanding Zombies crossover. Immerse yourself in a fully integrated Call of Duty®: Warzone™ experience featuring a new and massive map. This is the most connected Call of Duty ever, all powered by the next generation Call of Duty® engine introduced in Modern Warfare.… Expand"}, {"name": "Nuclear Blaze", "details_link": "https://www.metacritic.com/game/pc/nuclear-blaze", "publisher": "Deepnight Games", "release_date": "Oct 18 2021", "developers": ["Deepnight Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "2D"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/d5ee99c2478f26b1ecd0a73d3599e886-98.jpg", "descriptions": "The world is burning.Well, not exactly, but the whole region is.\n\nAs a trained firefighter, you're being air-dropped right in the middle of this hell blaze to investigate and look for survivors. But the unexpected presence of an unknown military facility might somewhat affect your plans.The world is burning.Well, not exactly, but the whole region is.As a trained firefighter, you're being air-dropped right in the middle of this hell blaze to investigate and look for survivors. But the unexpected presence of an unknown military facility might somewhat affect your plans.Nuclear Blaze is a unique 2D firefighting game from the creator of Dead Cells, with all the devastating backdrafts, exploding walls and sprinklers you could expect. Fight your way through a mysterious facility and try to keep the blaze under control.… Expand"}, {"name": "Black Future '88", "details_link": "https://www.metacritic.com/game/pc/black-future-88", "publisher": "Good Shepherd Entertainment", "release_date": "Nov 21 2019", "developers": ["SuperScarySnakes"], "platforms": ["Switch", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 74, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/ac4a0897a52f622187e157e02cce8f5e-98.jpg", "descriptions": "Black Future ’88 is a Synth-Punk roguelike 2D action Shooter. Vertically climb an always evolving procedural tower to reach the top and kill its insane owner…before your heart explodes. Shoot, slash, dash and upgrade yourself to survive the endless waves of Homicidal AI, Traps & ColossalBlack Future ’88 is a Synth-Punk roguelike 2D action Shooter. Vertically climb an always evolving procedural tower to reach the top and kill its insane owner…before your heart explodes. Shoot, slash, dash and upgrade yourself to survive the endless waves of Homicidal AI, Traps & Colossal Wardens.\r… Expand"}, {"name": "Assassin's Creed Syndicate", "details_link": "https://www.metacritic.com/game/pc/assassins-creed-syndicate", "publisher": "Ubisoft", "release_date": "Nov 19 2015", "developers": ["Ubisoft Quebec"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Historic", "Action Adventure", "Open-World"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/befebbd2b53e200e9a08d37b919a309c-98.jpg", "descriptions": "1868 London. The Industrial Revolution. An age of invention and wealth, built on the backs of the working class. As gangster killer Jacob Frye, you recruit a gang to fight for justice on behalf of the oppressed working class. Lead the underworld to reclaim London in an adventure filled with1868 London. The Industrial Revolution. An age of invention and wealth, built on the backs of the working class. As gangster killer Jacob Frye, you recruit a gang to fight for justice on behalf of the oppressed working class. Lead the underworld to reclaim London in an adventure filled with action, intrigue and brutal combat. With Jacob as the leader, players can establish UK's fiercest gang, the only force that can challenge the elite and defeat rival gangs to bring freedom to the oppressed folks. Enemy strongholds can be infiltrated by using an arsenal to dominate London’s underworld. From robbing trains to rescuing child workers, players will do everything they can to bring justice to London’s lawless streets. [Ubisoft]… Expand"}, {"name": "Mercury Hg", "details_link": "https://www.metacritic.com/game/xbox-360/mercury-hg", "publisher": "UTV Ignition Games", "release_date": "Sep 28 2011", "developers": ["UTV Ignition Games"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "Action"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/63e54ff7dd4b8eb8ec574871b15555d3-98.jpg", "descriptions": "Mercury Hg expands on the addictive qualities of its predecessors, crafting 60 all-new deviously constructed levels filled with hazards and obstacles while adding improvements and polish to almost every aspect of the game. The 'Mercury Blob' is still as mesmerizing as ever, moving uniquelyMercury Hg expands on the addictive qualities of its predecessors, crafting 60 all-new deviously constructed levels filled with hazards and obstacles while adding improvements and polish to almost every aspect of the game. The 'Mercury Blob' is still as mesmerizing as ever, moving uniquely under player control, changing color in order to progress through the level and dividing if cut by a protruding surface. While this dissection is important to solve puzzles, the real test of a player's skill is the ability to navigate strategically through varying types of slippery objects and sticky tiles with the use of balance and momentum in order to get to the finish line with their blob fully intact. A scoring system with full online leaderboard support adds a competitive touch to an already engrossing single-player experience. Additionally, the blob and game levels pulsate and react to the in-game music or songs from the player's library in real-time.  … Expand"}, {"name": "Big Brain Academy", "details_link": "https://www.metacritic.com/game/ds/big-brain-academy", "publisher": "Nintendo", "release_date": "Jun  5 2006", "developers": ["Nintendo"], "platforms": "DS", "num_players": "1-8 ", "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/f578b056c9d303a2a06c2fc4a527163e-98.jpg", "descriptions": "(Also known as \"Brain Flex\")  Big Brain Academy features 15 activities that test their brain powers in areas like logic, memory, math and analysis. Up to eight people can play with a single game card, and each activity takes less than a minute to complete."}, {"name": "Expeditions: Viking", "details_link": "https://www.metacritic.com/game/pc/expeditions-viking", "publisher": "Logic Artists", "release_date": "Apr 27 2017", "developers": ["Logic Artists"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/f966ac7827027e002980983b651cd57a-98.jpg", "descriptions": "Circa 790 AD. A small band of Norse warriors lands on the shores of England. History may have forgotten their names, but their actions live on. As the chieftain of your clan, let ambition guide your choices in the party-based RPG Expeditions: Viking. How will history remember you?"}, {"name": "The Quarry", "details_link": "https://www.metacritic.com/game/playstation-5/the-quarry", "publisher": "2K Games", "release_date": "Jun 10 2022", "developers": ["Supermassive Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Survival"], "meta_score": 74, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/88b4116e85a472c9878b7f14e356c59a-98.jpg", "descriptions": "As the sun sets on the last day of summer camp, the counselors of Hackett’s Quarry throw a party to celebrate. Things quickly take a turn for the worse. Hunted by blood-drenched locals and something far more sinister, the teens' party plans unravel into an unpredictable night of horror. PlayAs the sun sets on the last day of summer camp, the counselors of Hackett’s Quarry throw a party to celebrate. Things quickly take a turn for the worse. Hunted by blood-drenched locals and something far more sinister, the teens' party plans unravel into an unpredictable night of horror. Play as each of the nine counselors in a thrilling cinematic tale, where every decision shapes your story. … Expand"}, {"name": "Def Jam Rapstar", "details_link": "https://www.metacritic.com/game/xbox-360/def-jam-rapstar", "publisher": "Konami", "release_date": "Oct  5 2010", "developers": ["Terminal Reality", "4mm Games"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 74, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/1a87b200e975db870b24c78e612dbcde-98.jpg", "descriptions": "This karaoke-style game will feature a robust set of hip-hop hits and extensive online community features."}, {"name": "Far Cry Primal", "details_link": "https://www.metacritic.com/game/pc/far-cry-primal", "publisher": "Ubisoft", "release_date": "Feb 29 2016", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 74, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/fd5d710d8f5e76b834da5c5e7a912edf-98.jpg", "descriptions": "The era is the Stone Age, a time of imminent peril and limitless adventure, when giant mammoths and sabretooth tigers rule the globe, and humanity is at the low end of the food chain. As the last survivor of your hunting group, you will learn to build a deadly arsenal, fight off dangerousThe era is the Stone Age, a time of imminent peril and limitless adventure, when giant mammoths and sabretooth tigers rule the globe, and humanity is at the low end of the food chain. As the last survivor of your hunting group, you will learn to build a deadly arsenal, fight off dangerous predators, and outsmart enemy tribes to conquer the land of Oros and become the Apex Predator. You'll assume the role of Takkar, a seasoned hunter and the last surviving member of your group. You have a single goal: survive in a world where you are the hunted. Grow your tribe and sharpen your skills to lead your people, conquer the land of Oros, and become the apex predator. Encounter a cast of memorable characters who can help push back the dangers of the wild. Face enemy tribes who will do anything to eradicate you and your allies. [Ubisoft]\r … Expand"}, {"name": "Tom Clancy's HAWX", "details_link": "https://www.metacritic.com/game/playstation-3/tom-clancys-hawx", "publisher": "Ubisoft", "release_date": "Mar  3 2009", "developers": ["Ubisoft Romania"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/7d2384d1682f24cca1109ae5bb9a6055-98.jpg", "descriptions": "Tom Clancy's HAWX (high-altitude warfare) promises to revolutionize the way players think about combat in the sky. The story begins in the year 2012. As the era of the nation-state draws quickly to a close, the rules of warfare evolve even more rapidly. More and more nations becomeTom Clancy's HAWX (high-altitude warfare) promises to revolutionize the way players think about combat in the sky. The story begins in the year 2012. As the era of the nation-state draws quickly to a close, the rules of warfare evolve even more rapidly. More and more nations become increasingly dependent on private military companies (PMCs), elite mercenaries with a lax view of the law. The Reykjavik Accords further legitimize their existence by authorizing their right to serve in every aspect of military operations. While the benefits of such PMCs are apparent, growing concerns surrounding giving them too much power begin to mount. The Enhanced Reality System is the backbone of the HAWX flight experience: radars and incoming missile detection, anti-crash system, damage control system, tactical map and information relay, and weapons trajectory control. E.R.S. also allows players to issue orders to their squadron, making this system as iconic to HAWX as the Cross-Com system is to Tom Clancy's Ghost Recon Advanced Warfighter. Players can ease into their flight missions and gain a level of comfort with the use of the assistance mode. Once employed, players can take full advantage of their technological support through the E.R.S and gain maximum piloting security. If the situation calls for the player to unleash the full potential of the aircraft, the assistance mode can be switched off and all safety features will be deactivated. For the first time ever in the air-combat genre, players can experience the entire solo campaign in four-player JUMP IN co-op mode. In PVP mode, players can challenge up to 15 friends in intense dogfighting sessions and find out who's the top gun. Winning players are rewarded with experience points and money to unlock more weapons. Players have the opportunity to take the throttle of over 50 of the world's most famous aircrafts, as well as being able to dogfight over realistic modern landscapes that have endured years of post-war trauma. [Ubisoft]… Expand"}, {"name": "Bad Mojo: Redux", "details_link": "https://www.metacritic.com/game/pc/bad-mojo-redux", "publisher": "Got Game Entertainment", "release_date": "Dec 10 2004", "developers": ["Pulse Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Horror", "General"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/f95c76e071473f556c1067693a37c1ef-98.jpg", "descriptions": "Bad Mojo has evolved into an unqualified cult classic, lauded by critics and fans alike. A testament to its originality, the game is still being reviewed by the gaming press. In this truly unique tale, \"mad scientist\" entomologist Roger Samms has been temporarily turned into a cockroach,Bad Mojo has evolved into an unqualified cult classic, lauded by critics and fans alike. A testament to its originality, the game is still being reviewed by the gaming press. In this truly unique tale, \"mad scientist\" entomologist Roger Samms has been temporarily turned into a cockroach, leading to gritty discovery and exploration that sucks you in with great visuals, and keeps you playing with a poignant story. Clever obstacles bar your progress in the dark and intricate world of a dilapidated San Francisco building. [Got Game]… Expand"}, {"name": "Magicka", "details_link": "https://www.metacritic.com/game/pc/magicka", "publisher": "Paradox Interactive", "release_date": "Jan 25 2011", "developers": ["Arrowhead Game Studios"], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/388aa41220eb5bd2de3b778b01ce964b-98.jpg", "descriptions": "Magicka is an action-adventure game set in a rich fantasy world based on Norse mythology. The player assumes the role of a wizard from a sacred order tasked with the ultimate goal of stopping an evil sorcerer who has thrown the world into turmoil, his evil creations besieging the forces of good."}, {"name": "Mages of Mystralia", "details_link": "https://www.metacritic.com/game/pc/mages-of-mystralia", "publisher": "Borealys Games", "release_date": "May 18 2017", "developers": ["Borealys Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/1dc5dcd36396ca25a14ba74ad98983a4-98.jpg", "descriptions": "Accompany Zia as she strikes off to train and learn to control her magical abilities that had her exiled. Journey across the lands to meet other exiled mages and uncover runes with magical properties that can be combined into millions of different possibilities, letting you come up withAccompany Zia as she strikes off to train and learn to control her magical abilities that had her exiled. Journey across the lands to meet other exiled mages and uncover runes with magical properties that can be combined into millions of different possibilities, letting you come up with completely new and incredible spells.… Expand"}, {"name": "The Walking Dead: Saints & Sinners - Chapter 2: Retribution", "details_link": "https://www.metacritic.com/game/playstation-5/the-walking-dead-saints-sinners---chapter-2-retribution", "publisher": "Skydance Interactive", "release_date": "Mar 21 2023", "developers": ["Skydance Interactive", "Skybound Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Survival", "First-Person", "Arcade"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/f6ded9a891ce8e91e88d50e3ac99e386-98.jpg", "descriptions": "Your tour through undead New Orleans continues in this new chapter to the Tourist's story in The Walking Dead: Saints & Sinners. Hunted by the seemingly unstoppable Axeman and facing off against the Tower's latest push for total dominance, discover what connects these new threats togetherYour tour through undead New Orleans continues in this new chapter to the Tourist's story in The Walking Dead: Saints & Sinners. Hunted by the seemingly unstoppable Axeman and facing off against the Tower's latest push for total dominance, discover what connects these new threats together before it's too late. New faces, places, weapons and gear all await you on your journey to a final showdown for the city's fate.Do you have what it takes to survive it all?… Expand"}, {"name": "The Coma 2: Vicious Sisters", "details_link": "https://www.metacritic.com/game/xbox-one/the-coma-2-vicious-sisters", "publisher": "Headup Games", "release_date": "Sep  4 2020", "developers": ["Devespresso Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/81f3a57a3c3b0e975e35c7a2ff487667-98.jpg", "descriptions": "Mina Park, a student of Sehwa High, awakens at night in her school. It isn't long before she realizes that something is amiss. The once-familiar school where she spends her evenings studying looks twisted by something dark and sinister. She finds herself pursued by someone or something thatMina Park, a student of Sehwa High, awakens at night in her school. It isn't long before she realizes that something is amiss. The once-familiar school where she spends her evenings studying looks twisted by something dark and sinister. She finds herself pursued by someone or something that looks eerily like her teacher. To survive, Mina must venture beyond the boundaries of her school and into the surrounding district. There, she will encounter strange creatures, mysterious strangers, and uneasy allies.The Coma 2: Vicious Sisters is an atmospheric, story-driven game. Immerse yourself in the warped Sehwa district as you encounter an engaging cast of characters, solve puzzles, discover revealing clues, and fight for survival against a relentless psycho.Heroines, forced to confront their worst fears, rarely emerge unscathed. Over the course of the story, Mina will encounter dangerous scenarios from which she could sustain permanent damage. Craft items to anticipate future dangers to avoid injury.Dark Song is now more fearsome and powerful than ever before. Falling into her grasp could spell instant death. Running and wielding your flashlight makes you an easy target. You must precariously balance the urgency of exploration with your absolute need to survive!… Expand"}, {"name": "Life is Strange 2: Episode 2 - Rules", "details_link": "https://www.metacritic.com/game/xbox-one/life-is-strange-2-episode-2---rules", "publisher": "Square Enix", "release_date": "Jan 24 2019", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 74, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/352c2a073f7b651368bc00c9c687ef72-98.jpg", "descriptions": "The two brothers continue their journey into the winter months & struggle against the cold. As Daniel gradually falls ill, Sean decides they must make their way to their distant grandparent’s house to recover. During their stay, they encounter next-door neighbor Chris, a young boy whoThe two brothers continue their journey into the winter months & struggle against the cold. As Daniel gradually falls ill, Sean decides they must make their way to their distant grandparent’s house to recover. During their stay, they encounter next-door neighbor Chris, a young boy who believes he is a superhero by the name of Captain Spirit.… Expand"}, {"name": "The Turing Test", "details_link": "https://www.metacritic.com/game/pc/the-turing-test", "publisher": "Square Enix", "release_date": "Aug 30 2016", "developers": ["Bulkhead Interactive"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/edd24c3f0eb3c1723021cc1d4926f913-98.jpg", "descriptions": "The Turing Test is a challenging first-person puzzle game set on Jupiter’s moon, Europa. Assume the role of Ava Turing, an engineer for the International Space Agency (ISA) sent to discover the cause behind the disappearance of the ground crew stationed there."}, {"name": "3D Thunder Blade", "details_link": "https://www.metacritic.com/game/3ds/3d-thunder-blade", "publisher": "Sega", "release_date": "May 14 2015", "developers": ["M2"], "platforms": "3DS", "genres": ["Scrolling", "Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/12318e75fd37542b831bdc531a730fce-98.jpg", "descriptions": "3D Thunder Blade is a recreation of a one-of-a-kind combat helicopter arcade machine originally released in 1987, re-mastered for the Nintendo 3DS hand-held system. In 3D Thunder Blade, players control a helicopter and use guns and missiles to destroy enemy vehicles while flying between3D Thunder Blade is a recreation of a one-of-a-kind combat helicopter arcade machine originally released in 1987, re-mastered for the Nintendo 3DS hand-held system. In 3D Thunder Blade, players control a helicopter and use guns and missiles to destroy enemy vehicles while flying between buildings, through caves, and into enemy bases. The re-mastered version boasts stereoscopic 3D visuals, support for the Circle Pad Pro or C-Stick, and adds a host of new features including two options for gyroscopic controls, adjustable difficulty settings, and a mode that recreates the look and feel of the original arcade machine with additional sound effects. Replay saving and stage select are also available.… Expand"}, {"name": "Galaga Legions DX", "details_link": "https://www.metacritic.com/game/xbox-360/galaga-legions-dx", "publisher": "Namco Bandai Games", "release_date": "Jun 29 2011", "developers": ["Namco Bandai Games"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Vertical"], "meta_score": 74, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/14cce8cea5eaa9ae0b9055fe42361ad5-98.jpg", "descriptions": "Galaga Legions DX is the follow-up title from the team behind PAC-MAN Championship Edition DX."}, {"name": "Naruto Shippuden: Ultimate Ninja Storm Generations", "details_link": "https://www.metacritic.com/game/playstation-3/naruto-shippuden-ultimate-ninja-storm-generations", "publisher": "Namco Bandai Games", "release_date": "Mar 13 2012", "developers": ["CyberConnect2", "Racjin"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/93e126cd6188083d1d08419c64a6aa88-98.jpg", "descriptions": "Developed by CyberConnect2, NARUTO SHIPPUDEN: Ultimate Ninja STORM Generations (not yet rated) is the latest rendition in the smash hit ‘NARUTO SHIPPUDEN: Ultimate Ninja Storm’ series of games.  The title will power the series into the future by revolutionizing online play and ramping up theDeveloped by CyberConnect2, NARUTO SHIPPUDEN: Ultimate Ninja STORM Generations (not yet rated) is the latest rendition in the smash hit ‘NARUTO SHIPPUDEN: Ultimate Ninja Storm’ series of games.  The title will power the series into the future by revolutionizing online play and ramping up the number of playable and support characters far beyond any NARUTO game in the wildly popular franchise.  Players will compete in a variety of online battle modes with their favorite NARUTO characters, including Naruto and Sasuke.  NARUTO fans have been waiting to see more of Zabuza and Haku since the launch of the original Manga, and now they will have their chance!  These are just a few of the many new ninja in the game.… Expand"}, {"name": "LEGO Batman: The Videogame", "details_link": "https://www.metacritic.com/game/wii/lego-batman-the-videogame", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 23 2008", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/557fabbecdb8598cd2863c874fe6a870-98.jpg", "descriptions": "A stampede of notorious criminals have busted out of Arkham Asylum, where Gotham City houses only the shadiest of characters. It's up to the famed Caped Crusader to sweep Gotham clean of criminal activity using everything at his disposal, including crime-fighting vehicles as well as severalA stampede of notorious criminals have busted out of Arkham Asylum, where Gotham City houses only the shadiest of characters. It's up to the famed Caped Crusader to sweep Gotham clean of criminal activity using everything at his disposal, including crime-fighting vehicles as well as several baddie-bashing bat gadgets. [Warner Bros.]… Expand"}, {"name": "Prince of Persia Rival Swords", "details_link": "https://www.metacritic.com/game/psp/prince-of-persia-rival-swords", "publisher": "Ubisoft", "release_date": "Apr  3 2007", "developers": ["Pipeworks Software", "Inc."], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/c113176d508f356b1e682b9296fae065-98.jpg", "descriptions": "In Prince of Persia Rival Swords, the Prince makes his way home to Babylon, bearing with him Kaileena, the enigmatic Empress of Time, and unspeakable scars from the Island of Time. But instead of the peace he longs for, he finds his kingdom ravaged by war and Kaileena the target of a brutalIn Prince of Persia Rival Swords, the Prince makes his way home to Babylon, bearing with him Kaileena, the enigmatic Empress of Time, and unspeakable scars from the Island of Time. But instead of the peace he longs for, he finds his kingdom ravaged by war and Kaileena the target of a brutal plot. When she is kidnapped, the Prince tracks her to the palace – only to see her murdered by a powerful enemy. Her death unleashes the Sands of Time, which strike the Prince and threaten to destroy everything he holds dear. Cast out on the streets, hunted as a fugitive, the Prince soon discovers that the Sands have tainted him, too. They have given rise to a deadly Dark Prince, whose spirit gradually possesses him. Versus play in timed races as either the Prince or Dark Prince. Interrupt and impede your opponent's progress by activating switches in your own level that will trigger traps and obstacles in their level. Play and master two distinct characters: Wield the powers and weapons of two master warriors with different combat styles, attitudes and histories. Choose your way to kill: Master the expanded Free-Form Fighting system to destroy enemies in your own style, strangle them from afar with the deadly Daggertail, or surprise them with crafty Speed Kills – the choice is yours. Battle freely through Babylon: Dominate enemies on perilous rooftops, dodge through chaotic streets and ambush pursuers in dark underground passageways. Brand-new chariot combat levels: Seize the reins of a chariot and battle through brand-new levels that are immediately available in the Main Menu for a quick adrenaline rush. [Ubisoft]… Expand"}, {"name": "One Line Coloring", "details_link": "https://www.metacritic.com/game/switch/one-line-coloring", "publisher": "MythicOwl", "release_date": "Aug 21 2020", "developers": ["MythicOwl"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "General", "Application"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/76eda695b975796d4a68a28c8f921f09-98.jpg", "descriptions": "Over 100 carefully designed models to uncover and collect\r  6 unique themes to showcase completed models\r\n  Playful scenes presented as dioramas for players to create\r\n  Pastel, eye-catching visuals to relax our mind\r\n  Engaging dot connecting mechanics to   Over 100 carefully designed models to uncover and collect\r  6 unique themes to showcase completed models\r  Playful scenes presented as dioramas for players to create\r  Pastel, eye-catching visuals to relax our mind\r  Engaging dot connecting mechanics to spice up the gameplay\r  Fresh twist to a classic, dot-to-dot games\r  Creative puzzles easy for children, engaging for adults… Expand"}, {"name": "Resolutiion", "details_link": "https://www.metacritic.com/game/switch/resolutiion", "publisher": "Deck 13", "release_date": "May 28 2020", "developers": ["Monolith of Minds"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/b7fc573da0a82b69ba84eba9f1a2bd1f-98.jpg", "descriptions": "An old killer escorts a curious AI through chaotic combat, puzzling secrets, and unsettling calm in a dreamscape of madmen and sane animals. Resolutiion is a fast-paced action-adventure created by two angry German brothers leading a band of vagrants who loaded it with lovely pixels, dirtyAn old killer escorts a curious AI through chaotic combat, puzzling secrets, and unsettling calm in a dreamscape of madmen and sane animals. Resolutiion is a fast-paced action-adventure created by two angry German brothers leading a band of vagrants who loaded it with lovely pixels, dirty jokes, deep ideas and badassemotional tunes for 20 hours of punishing combat, rewarding exploration, and layered storytelling. Will you be the player or will you be played? In the Infinite Empire nothing is as it seems. Explore a fractured future, gathering weird weapons and stories, to piece together the past: a friend betrayed, a family broken, worlds at war. To solve the mystery of the Cradles take on a multi-cultural-mashup of cynical gods, emotional machines, zealots, luddites, and furry critters in a world that doesn’t care if it confuses or kills you — oh hey, a kitty!\r… Expand"}, {"name": "The Surge", "details_link": "https://www.metacritic.com/game/xbox-one/the-surge", "publisher": "Focus Home Interactive", "release_date": "May 16 2017", "developers": ["Deck 13"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/f2526d0649442b674ff9f02e9f2369db-98.jpg", "descriptions": "Set in a heavily dystopian future as Earth nears the end of its life, those who remain in the overpopulated cities must work to survive as social programs become saturated by an ageing population and increasing environmental diseases.\r As the intelligence of technology incrementallySet in a heavily dystopian future as Earth nears the end of its life, those who remain in the overpopulated cities must work to survive as social programs become saturated by an ageing population and increasing environmental diseases.\r As the intelligence of technology incrementally increased over the years, many jobs for the human race had been made redundant, forcing Earths citizens to head out into the suburbs seeking labor, aided by exoskeletons to improve their efficiency. The world of The Surge offers a very grim vision of the future, where the evolution of our technology, our society and our relation with the environment led to a decadent state of the Human civilization.\r The Surge features innovative combat mechanics and an original character progression system based on modular upgrades gained through tight, visceral combat.… Expand"}, {"name": "Borderlands: The Pre-Sequel", "details_link": "https://www.metacritic.com/game/xbox-360/borderlands-the-pre-sequel", "publisher": "2K Games", "release_date": "Oct 14 2014", "developers": ["2K Australia"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/38a60e4a64a6669dd5d8ee2e27561b72-98.jpg", "descriptions": "Learn the story behind Borderlands 2’s villain, Handsome Jack, and his ascendance to power in this new game in the Borderlands series. Taking place between the original Borderlands and Borderlands 2, the Pre-Sequel gives you a bunch of new gameplay featuring the genre fusion of shooter andLearn the story behind Borderlands 2’s villain, Handsome Jack, and his ascendance to power in this new game in the Borderlands series. Taking place between the original Borderlands and Borderlands 2, the Pre-Sequel gives you a bunch of new gameplay featuring the genre fusion of shooter and RPG gameplay.… Expand"}, {"name": "The Sims 3 Supernatural", "details_link": "https://www.metacritic.com/game/pc/the-sims-3-supernatural", "publisher": "Electronic Arts", "release_date": "Sep  4 2012", "developers": ["The Sims Studio"], "platforms": "PC", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 74, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/acbba730ea6c8888ca832f48e68d1226-98.jpg", "descriptions": "Enter the mysterious town of Moonlight Falls where strange things happen by the light of the moon. Create supernatural beings, from menacing werewolves and cackling witches to mischievous fairies and more intriguing vampires. Then stalk the night, use your wand to cast spells, just stay homeEnter the mysterious town of Moonlight Falls where strange things happen by the light of the moon. Create supernatural beings, from menacing werewolves and cackling witches to mischievous fairies and more intriguing vampires. Then stalk the night, use your wand to cast spells, just stay home and claw the furniture and more.… Expand"}, {"name": "Dai Senryaku VII: Modern Military Tactics", "details_link": "https://www.metacritic.com/game/xbox/dai-senryaku-vii-modern-military-tactics", "publisher": "Kemco", "release_date": "Feb 16 2005", "developers": ["SystemSoft"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Modern"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/b428d21a4a2ee87f6a34d2b05bcd0306-98.jpg", "descriptions": "Command an entire military force with the most modern technologies of war. In this strategic war simulation, you must take into account everything from terrain to armor. Test your battlefield tactics against the game's challenging artificial intelligence, or face your friends in multiplayerCommand an entire military force with the most modern technologies of war. In this strategic war simulation, you must take into account everything from terrain to armor. Test your battlefield tactics against the game's challenging artificial intelligence, or face your friends in multiplayer skirmishes. Choose from a wide array of vehicles specifically designed for land, sea, and air attacks. If you don't like the terrain, you can create your own with the map editor, and you can design the map to cater to your specific strategic strengths.… Expand"}, {"name": "Worms 3D", "details_link": "https://www.metacritic.com/game/pc/worms-3d", "publisher": "Acclaim", "release_date": "Mar 11 2004", "developers": ["Team17"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Real-Time", "Fantasy", "Fantasy", "Artillery"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/f365d9bcc32ef987e2285efd17225f54-98.jpg", "descriptions": "Worms comes to PC and console in full 3-D, continuing to capture the true essence of the game as teams of worms battle across bizarre, randomly generated landscapes, or across finely crafted, custom-designed levels utilising an arsenal of devastating weapons. The gameplay remains unchanged,Worms comes to PC and console in full 3-D, continuing to capture the true essence of the game as teams of worms battle across bizarre, randomly generated landscapes, or across finely crafted, custom-designed levels utilising an arsenal of devastating weapons. The gameplay remains unchanged, featuring turn-based fighting and relying on the player to judge the trajectory and strength of their shots in order to inflict maximum damage on opponents. All the favourite weapons such as bazooka, grenade, dynamite, air strike and sheep are present including some new additions. Defensive tactics can also be employed as you choose to dig in with buildings, trenches, sandbags or fortifications, while buildings on the landscapes can also provide shelter against attacks. Adapt your strategy according to the weapons available, landscape and each new opponent you play. With a multitude of tactics available, coupled with the ever-changing, randomly generated landscapes, no battle will ever be the same. Worms 3D is set in a more exciting and immersive game world than ever before, with the emphasis on great multi-player action and challenging single-player fun.… Expand"}, {"name": "Rayman 3: Hoodlum Havoc", "details_link": "https://www.metacritic.com/game/pc/rayman-3-hoodlum-havoc", "publisher": "Ubisoft", "release_date": "Mar 18 2003", "developers": ["Ubisoft"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/fcd996a3a8a74dedd44a2eb3519252ae-98.jpg", "descriptions": "Adventurers beware - Rayman's universe has exploded into a whacked-out world of cartoon mayhem and mind-blowing battles! When Globox accidentally swallows the Lord of the Dark Lums, a fanatic army of trigger happy Hoodlums wreaks total havoc to get their Lord back! Rayman's only chance?Adventurers beware - Rayman's universe has exploded into a whacked-out world of cartoon mayhem and mind-blowing battles! When Globox accidentally swallows the Lord of the Dark Lums, a fanatic army of trigger happy Hoodlums wreaks total havoc to get their Lord back! Rayman's only chance? Journey the vast reaches of the world to purge the Dark Lum Lord from the manic Globox, scour the lands for unearthly new powers, and do battle with hordes of Hoodlum soldiers, contraptions, and maniacal bosses. This time, it's war! [Ubi Soft]… Expand"}, {"name": "Headhunter", "details_link": "https://www.metacritic.com/game/playstation-2/headhunter", "publisher": "Acclaim", "release_date": "May  9 2002", "developers": ["Amuze"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/e329e4975a37f66257bf7945b9dde07c-98.jpg", "descriptions": "In the near future, convicted criminals are required to donate body parts to benefit the rich instead of serving time. A government approved service known as the Anti Crime Network employs 'Headhunters' to capture felons using non-lethal weaponry to preserve their vital organs. AsIn the near future, convicted criminals are required to donate body parts to benefit the rich instead of serving time. A government approved service known as the Anti Crime Network employs 'Headhunters' to capture felons using non-lethal weaponry to preserve their vital organs. As dishonoured Headhunter Jack Wade, you are hired by Angela Stern - daughter of the recently murdered head of the CAN - to discover the truth behind her father's death. Sega's adventure infuses stealth and arcade action with an extremely dark sense of humour. [SCEE]… Expand"}, {"name": "Comanche 4", "details_link": "https://www.metacritic.com/game/pc/comanche-4", "publisher": "NovaLogic", "release_date": "Nov 12 2001", "developers": ["NovaLogic"], "platforms": "PC", "num_players": "Up to 16 ", "genres": ["Simulation", "Flight", "Helicopter", "Helicopter", "Combat", "Civilian"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/478a349fbca3854f0aaf05abf8d29f2c-98.jpg", "descriptions": "A fast-paced action game that moves at 200mph with you at the controls of a Comanche helicopter. Fly the U.S. Army?s next generation attack helicopter in over 30 extreme missions. Fire a 20mm cannon, 70mm rockets, Stinger heat-seeking and Hellfire laser-guided missiles. [NovaLogic]"}, {"name": "Icewind Dale: Heart of Winter", "details_link": "https://www.metacritic.com/game/pc/icewind-dale-heart-of-winter", "publisher": "Interplay", "release_date": "Feb 19 2001", "developers": ["Black Isle Studios"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Role-Playing", "General", "PC-style RPG", "Western-Style"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/274d2a40fa0ebe25bf7f2464af77278e-98.jpg", "descriptions": "In the midst of the harshest winter in decades, the barbarian tribes have united under a mysterious new king and threaten to take up arms against the people of Ten-Towns. Continue your adventure in five huge new areas that add directly into the original \"Icewind Dale.\""}, {"name": "Dino Crisis", "details_link": "https://www.metacritic.com/game/dreamcast/dino-crisis", "publisher": "Capcom", "release_date": "Nov 14 2000", "developers": ["Capcom"], "platforms": ["PC", "Dreamcast"], "genres": ["Action Adventure", "Horror"], "meta_score": 74, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/6/b9734f68de5f8147a04b0d3dbb68c30f-98.jpg", "descriptions": "Raw instinct takes over in this adrenaline-pumping journey into Survival Horror. Something is terribly wrong. Your covert mission to inflitrate an isolated, research compound, has gon haywire... now you find yourself pursued by a relentless, pre-historic terror. Suddenly, your missionRaw instinct takes over in this adrenaline-pumping journey into Survival Horror. Something is terribly wrong. Your covert mission to inflitrate an isolated, research compound, has gon haywire... now you find yourself pursued by a relentless, pre-historic terror. Suddenly, your mission becomes a desperate fight for survival.… Expand"}, {"name": "Summoner", "details_link": "https://www.metacritic.com/game/playstation-2/summoner", "publisher": "THQ", "release_date": "Oct 25 2000", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/81a2b9075f8b16c6f84f3cfd25ff4eae-98.jpg", "descriptions": "Born with the mark of the Summoner, Joseph possesses a power greater than emperors and gods. As a child, he summoned a demon to save his village, and watched in horror as those he loved were destroyed. Nine years later, the armies of Orenia invade, and Joseph must confront the prophecy heBorn with the mark of the Summoner, Joseph possesses a power greater than emperors and gods. As a child, he summoned a demon to save his village, and watched in horror as those he loved were destroyed. Nine years later, the armies of Orenia invade, and Joseph must confront the prophecy he was born to fulfill.… Expand"}, {"name": "Star Trek: Klingon Academy", "details_link": "https://www.metacritic.com/game/pc/star-trek-klingon-academy", "publisher": "Interplay", "release_date": "Jun 21 2000", "developers": ["14 Degrees East"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Simulation", "Sci-Fi", "Space", "Large Spaceship", "Large Spaceship", "Civilian"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/e745d19deda86893df45a0f84bfe8231-98.jpg", "descriptions": "General Chang, the Empire's greatest living warrior, has established an Elite Command Academy to prepare a new generation of warriors for the conflict with the United Federation of Planets. As your mentor, Chang will instruct you in the ways of battle tactics and teach you the rigors ofGeneral Chang, the Empire's greatest living warrior, has established an Elite Command Academy to prepare a new generation of warriors for the conflict with the United Federation of Planets. As your mentor, Chang will instruct you in the ways of battle tactics and teach you the rigors of warship command.  [Interplay]… Expand"}, {"name": "Total Annihilation: Kingdoms", "details_link": "https://www.metacritic.com/game/pc/total-annihilation-kingdoms", "publisher": "GT Interactive", "release_date": "Jun 23 1999", "developers": ["Cavedog Entertainment"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Command"], "meta_score": 74, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/5f3853eeb5af517f57e40c78f1f78f22-98.jpg", "descriptions": "Massive armies will clash. Forests and cities will burn. Tremendous magical forces will level entire fortresses in the blink of an eye. Four completely unique races are vying for control of the mythical world of Darien, each representing one of the four elements -- Earth and Air, Fire andMassive armies will clash. Forests and cities will burn. Tremendous magical forces will level entire fortresses in the blink of an eye. Four completely unique races are vying for control of the mythical world of Darien, each representing one of the four elements -- Earth and Air, Fire and Water. In Total Annihilation: Kingdoms, you'll take the role of one of the four immortal monarch of these nations at war. You'll rally your legions -- swordsmen, archers and knights on horseback -- under your flag. Wizards, beasts and even flame-spewing demons will will heed your every command, waging war on an epic field of battle. The game's stunning 3D terrain of forests, magic-laden ruins and expansive oceans provide a landscape of war fraught with danger, magic and ambush. [Cavedog Entertainment]… Expand"}, {"name": "Disney Infinity", "details_link": "https://www.metacritic.com/game/xbox-360/disney-infinity", "publisher": "Disney Interactive Studios", "release_date": "Aug 18 2013", "developers": ["Avalanche Software"], "platforms": ["3DS", "PC", "PlayStation 3", "Wii U", "Xbox 360"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 74, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/f989cef7a1f05ece4d12ca9f88af070a-98.jpg", "descriptions": "In Disney's most ambitious video game initiative ever, Disney Infinity introduces an all-new game universe where a spark of imagination unlocks a fantastical world where players have unprecedented freedom and endless opportunity to create stories and play experiences starring the belovedIn Disney's most ambitious video game initiative ever, Disney Infinity introduces an all-new game universe where a spark of imagination unlocks a fantastical world where players have unprecedented freedom and endless opportunity to create stories and play experiences starring the beloved characters from Walt Disney and Pixar Animation Studios' most popular franchises.… Expand"}, {"name": "Steelrising", "details_link": "https://www.metacritic.com/game/xbox-series-x/steelrising", "publisher": "Nacon", "release_date": "Sep  8 2022", "developers": ["Spiders"], "platforms": ["PC", "PlayStation 5", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/6/ed57e700fa0e2e8ac42b0146155bfdd9-98.jpg", "descriptions": "Paris, 1789. The French Revolution has been suppressed with bloodshed by Louis XVI and his merciless mechanical army. Aegis, a mysterious automaton masterpiece, must confront the king's army alone to save history in this challenging action-RPG."}, {"name": "Just Dance 3", "details_link": "https://www.metacritic.com/game/wii/just-dance-3", "publisher": "Ubisoft", "release_date": "Oct  7 2011", "developers": ["Ubisoft"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/95d4f2ce59689a5c9f92d149a39eb88f-98.jpg", "descriptions": "Just Dance is back and the party is bigger than ever before.  The new Just Dance 3 gives a new twist to the already spontaneous and outrageous dance game.\r Just Dance 3 kick-starts the party with 40+ tracks from multiple genres, popular artist, and top Billboard tracks.  Whatever theJust Dance is back and the party is bigger than ever before.  The new Just Dance 3 gives a new twist to the already spontaneous and outrageous dance game.\r Just Dance 3 kick-starts the party with 40+ tracks from multiple genres, popular artist, and top Billboard tracks.  Whatever the occasion, the amazing Just Dance 3 soundtrack and fun game features will get the party started and your friends dancing all night long. \r\rYou weren’t able to resist the urge to join the party, now you won’t be able to leave it. The party machine is on!… Expand"}, {"name": "CAPSIZED", "details_link": "https://www.metacritic.com/game/xbox-360/capsized", "publisher": "Namco Bandai Games", "release_date": "Jul  5 2013", "developers": ["Koolhaus Games"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/ff93b86de33e3b61f1347515ffe63030-98.jpg", "descriptions": "As a space traveler who has crash-landed on a mysterious alien planet, players fight through hostile landscapes to save fellow shipmates from alien creatures. The first-person shooter game provides players with a constant sense of action and movement, with 12 new non-linear levels andAs a space traveler who has crash-landed on a mysterious alien planet, players fight through hostile landscapes to save fellow shipmates from alien creatures. The first-person shooter game provides players with a constant sense of action and movement, with 12 new non-linear levels and completely explorable environments. … Expand"}, {"name": "Insurmountable", "details_link": "https://www.metacritic.com/game/pc/insurmountable", "publisher": "ByteRockers' Games", "release_date": "Apr 29 2021", "developers": ["ByteRockers' Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Survival", "Third-Person"], "meta_score": 74, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/d669cc148d280b9555156a6d8b9162d7-98.jpg", "descriptions": "Confront various terrains as a lonely mountaineer and endure the countless dangers of climbing! Many tough decisions await you in a risky environment. Make your way up and down the mountain, overcoming insurmountable heights."}, {"name": "Need for Speed: Hot Pursuit Remastered", "details_link": "https://www.metacritic.com/game/switch/need-for-speed-hot-pursuit-remastered", "publisher": "Electronic Arts", "release_date": "Nov 13 2020", "developers": ["Criterion Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/99b2b542791ad5bc003afde0f366b904-98.jpg", "descriptions": "Feel the thrill of the chase and the rush of escape in Need for Speed™ Hot Pursuit Remastered on Nintendo Switch™. Unleash a savage sense of speed both as an outlaw and a cop in the world's hottest high-performance cars. Outsmart the heat or take down lawbreakers with the tactical weaponryFeel the thrill of the chase and the rush of escape in Need for Speed™ Hot Pursuit Remastered on Nintendo Switch™. Unleash a savage sense of speed both as an outlaw and a cop in the world's hottest high-performance cars. Outsmart the heat or take down lawbreakers with the tactical weaponry at your disposal in a heart-pumping, socially competitive racing experience. Updated with enhanced visuals, cross-platform multiplayer – including the asynchronous competition powered by Autolog – plus all additional DLC content, this is the ultimate edition of Criterion Games’ critically acclaimed Need for Speed debut. It’s time to reignite the pursuit.\r CROSS-PLATFORM MULTIPLAYER AND AUTOLOG – Bolt down the winding Seacrest County roads headfirst in racing that is socially competitive at its core. The groundbreaking Autolog connects you and your friends in head-to-head pursuits and races and instinctively delivers challenges based on your friends’ activities. This highly dynamic system is fueled by friendly competition and is now supported with cross-platform sync and new multiplayer gameplay so that you can race each other no matter what platform you are on.\r ALL DLC INCLUDED, PLUS MORE UPDATES – Get all the additional DLC content delivered at launch including an extra six hours of gameplay and more than 30 challenges. Brand new achievements, wraps, car colors, reduced hard stops, an updated photo mode and gallery, and multiple quality of life updates create an even more well-rounded gameplay experience this time around.\r EXOTIC CARS WITH WEAPONS – Drive the world’s most desirable supercars on both sides of the law. Bust suspects in supercharged cop interceptors enhanced with tactical weaponry, or level the playing field with counterattacks and defensive maneuvers as an elite racer. Strategize to gain an edge over the competition, no matter what side you’re on!\r CHASE AND ESCAPE – A deep and fully-defined single-player career delivers the action of both cops and racers, with a seamlessly linked multiplayer experience across all race modes. Take on friends or play through the career solo to earn Bounty and unlock new cars, weapons, and equipment.\r ENHANCED VISUALS – Need for Speed: Hot Pursuit Remastered delivers a timeless racing experience updated for today’s generation of hardware with enhanced visuals.… Expand"}, {"name": "Grow Up", "details_link": "https://www.metacritic.com/game/xbox-one/grow-up", "publisher": "Ubisoft", "release_date": "Aug 16 2016", "developers": ["Ubisoft Reflections"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "Open-World"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/03b591e747bb69b0d8b0c17d0bb39c00-98.jpg", "descriptions": "BUD, an adorable yet clumsy, stumbling, tumbling robot. Spaceship wreckage scattered across an entire planet of abundant alien flora and thrusting star plants. A distant moon with your spacecraft’s beating heart yearning to be rescued. A fantastical acrobatic adventure in a world that’s asBUD, an adorable yet clumsy, stumbling, tumbling robot. Spaceship wreckage scattered across an entire planet of abundant alien flora and thrusting star plants. A distant moon with your spacecraft’s beating heart yearning to be rescued. A fantastical acrobatic adventure in a world that’s as challenging as it is beautiful. Welcome to Grow Up.… Expand"}, {"name": "Need for Speed Carbon", "details_link": "https://www.metacritic.com/game/playstation-2/need-for-speed-carbon", "publisher": "EA Games", "release_date": "Oct 31 2006", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/66fb1d9e687583af3b5cffe56d8d42d4-98.jpg", "descriptions": "What starts in the city is settled in the canyons as Need for Speed Carbon immerses you into the world's most dangerous and adrenaline-filled form of street racing. You and your crew must race in an all-out war for the city, risking everything to take over your rivals' neighborhoods oneWhat starts in the city is settled in the canyons as Need for Speed Carbon immerses you into the world's most dangerous and adrenaline-filled form of street racing. You and your crew must race in an all-out war for the city, risking everything to take over your rivals' neighborhoods one block at a time. As the police turn up the heat, the battle ultimately shifts to Carbon Canyon, where territories and reputations can be lost on every perilous curve. Need for Speed Carbon delivers the next generation of customization giving you the power to design and tweak your crew's cars in every way using the ground-breaking new Autosculpt technology. Represent your car class, your crew, and your turf in Need for Speed Carbon, the next revolution in racing games. [Electronic Arts]… Expand"}, {"name": "Atelier Totori: The Adventurer of Arland", "details_link": "https://www.metacritic.com/game/playstation-3/atelier-totori-the-adventurer-of-arland", "publisher": "NIS America", "release_date": "Sep 27 2011", "developers": ["Gust"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/4f7c64d9e4de84aeb205149eaea61ece-98.jpg", "descriptions": "Become a famous adventurer and explorer in Atelier Totori: The Adventurer of Arland."}, {"name": "The Sims: House Party", "details_link": "https://www.metacritic.com/game/pc/the-sims-house-party", "publisher": "Maxis", "release_date": "Mar 26 2001", "developers": ["Maxis"], "platforms": "PC", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/2b18ec392d80ef6310a642e481b84cc2-98.jpg", "descriptions": "The latest expansion to the the wildly popular \"The Sims\" focuses on the one of your Sims' higher, more refined needs -- the urge to throw parties."}, {"name": "Kingdom Hearts: Melody of Memory", "details_link": "https://www.metacritic.com/game/playstation-4/kingdom-hearts-melody-of-memory", "publisher": "Square Enix", "release_date": "Nov 13 2020", "developers": ["Square Enix", "indieszero"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Rhythm", "Music"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/0f4cf3f988d13cc251aeb29c8576ccdf-98.jpg", "descriptions": "Experience the music of kingdom hearts like never before. Melody of memory features 20+ characters, 140+ music tracks, and online vs multiplayer mode. Explore the music and memories from the kingdom hearts series! Play as familiar faces from the kingdom hearts series, including Disney guestExperience the music of kingdom hearts like never before. Melody of memory features 20+ characters, 140+ music tracks, and online vs multiplayer mode. Explore the music and memories from the kingdom hearts series! Play as familiar faces from the kingdom hearts series, including Disney guest characters who will appear to Lend you a hand. Enjoy a massive variety of music from both the kingdom hearts series and Disney, with a collection of over 140 songs. Dive into rhythm-action gameplay with memorable tunes in this musical journey.… Expand"}, {"name": "Phoenix Point", "details_link": "https://www.metacritic.com/game/pc/phoenix-point", "publisher": "Snapshot Games Inc.", "release_date": "Dec  3 2019", "developers": ["Snapshot Games Inc."], "platforms": ["PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 74, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/7a3a7ffe1f677ea3196a89197f24a708-98.jpg", "descriptions": "2022 – The Pandoravirus Unleashed. An unusual virus discovered in melting permafrost excites the scientific community. It has a massive genome, and only 1% of its genes match anything in existing databases. “What the hell is going on with the other genes?” asks researcher Jean-Michel Moreau.2022 – The Pandoravirus Unleashed. An unusual virus discovered in melting permafrost excites the scientific community. It has a massive genome, and only 1% of its genes match anything in existing databases. “What the hell is going on with the other genes?” asks researcher Jean-Michel Moreau. “This opens a Pandora’s box. What kinds of discoveries are going to come from studying the contents?” The seas transform in something totally alien. Then the mutagens began to invade the land via an airborne microbial mist.… Expand"}, {"name": "Ancestors Legacy", "details_link": "https://www.metacritic.com/game/playstation-4/ancestors-legacy", "publisher": "Destructive Creations", "release_date": "Aug 13 2019", "developers": ["Destructive Creations"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Strategy", "Real-Time", "General", "Command"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/28dd462f58fb1c62082131343259d9ae-98.jpg", "descriptions": "Ancestors Legacy is a squad-based real time strategy with a strong focus on tactics. Inspired by medieval European history, it brings to life four different nations and their conflicts, usually resolved by war. The game combines resource management and base building with large-scale,Ancestors Legacy is a squad-based real time strategy with a strong focus on tactics. Inspired by medieval European history, it brings to life four different nations and their conflicts, usually resolved by war. The game combines resource management and base building with large-scale, squad-based battles across vast battlefields.… Expand"}, {"name": "Crookz: The Big Heist", "details_link": "https://www.metacritic.com/game/pc/crookz-the-big-heist", "publisher": "Kalypso", "release_date": "Aug 25 2015", "developers": ["Skilltree Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "Historic"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/5c8439136ebcc1e26aeefa7c88874f03-98.jpg", "descriptions": "Crookz is a tactical strategy game set in the funky 1970’s with a slick and groovy atmosphere. Show off the art of thieving by plotting stylish heists and robberies; utilizing espionage and quick-thinking to avoid detection. Implement a successful strategy by assembling and kitting out yourCrookz is a tactical strategy game set in the funky 1970’s with a slick and groovy atmosphere. Show off the art of thieving by plotting stylish heists and robberies; utilizing espionage and quick-thinking to avoid detection. Implement a successful strategy by assembling and kitting out your team before the job and planning the best way in.… Expand"}, {"name": "Hasbro Family Game Night: Connect Four", "details_link": "https://www.metacritic.com/game/xbox-360/hasbro-family-game-night-connect-four", "publisher": "Electronic Arts", "release_date": "Mar 18 2009", "developers": ["Electronic Arts"], "platforms": "Xbox 360", "genres": ["Miscellaneous", "Board Games", "Board / Card Game"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/662928e91f612aa4206e0b79a8ee30fc-98.jpg", "descriptions": "[Xbox Live Arcade]  Join your host Mr. Potato Head as you play your favorite Hasbro games including CONNECT FOUR, BATTLESHIP, YAHTZEE, BOGGLE, SORRY! and SORRY! Sliders, as well as exciting new versions created for Xbox LIVE Arcade in Hasbro Family Game Night. Great family games: Play all[Xbox Live Arcade]  Join your host Mr. Potato Head as you play your favorite Hasbro games including CONNECT FOUR, BATTLESHIP, YAHTZEE, BOGGLE, SORRY! and SORRY! Sliders, as well as exciting new versions created for Xbox LIVE Arcade in Hasbro Family Game Night. Great family games: Play all your favorite Hasbro games that you know and love so well. Exciting new versions: And play those games like never before with exciting new variants including CONNECT 4 Power Chips, BOGGLE Portal Cubes, Reverse YAHTZEE, and BATTLESHIP Barrage! Customized game room: Choose the game room theme that's right for you. Earn new game themed trophies, furniture, and decorations to customize your game room. Party time: Build a custom Party Game by choosing your favorite games, number of players, and time you want to play. [Electronic Arts]… Expand"}, {"name": "Massive Assault Network", "details_link": "https://www.metacritic.com/game/pc/massive-assault-network", "publisher": "Wargaming.net", "release_date": "Apr 13 2004", "developers": ["Wargaming.net"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "General"], "meta_score": 74, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/8/162616e565e612450b31a3ac466c7e19-98.jpg", "descriptions": "Massive Assault Network is a hardcore online strategy game, based on the original Secret Allies political concept. You will be fighting for global domination on one of 8 distant planets against live opponents via Internet. The game is set in fascinating 3D sci-fi environment. RevolutionaryMassive Assault Network is a hardcore online strategy game, based on the original Secret Allies political concept. You will be fighting for global domination on one of 8 distant planets against live opponents via Internet. The game is set in fascinating 3D sci-fi environment. Revolutionary Dynamic Turn-Based Gameplay. Time-proven \"Secret Allies\" concept provides instant intrigue & endless replayability. Ladder, Tournaments & Clan Wars. Take part in individual and team-based competitions. Live Mentors & Friendly Online CommunityTrain with dedicated live Mentors. Use Built-in Chat to find opponents & get help from other players. Fascinating 3D Engine. State-of-the-art unit and terrain graphics revolutionary for TBS genre. Free Training with A.I. 8 Training Missions, 3 Scenarios and one planet for World Wars. Unlimited Trial Period. Play any number of World War games vs live players on beautiful \"Emerald\" planet. [Wargaming.net]… Expand"}, {"name": "Super Stardust Ultra", "details_link": "https://www.metacritic.com/game/playstation-4/super-stardust-ultra", "publisher": "SCEA", "release_date": "Feb 10 2015", "developers": ["d3t Ltd"], "platforms": "PlayStation 4", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/7251842f89fe702a55195c6ff89e0e6c-98.jpg", "descriptions": "Super Stardust Ultra features a host of new planets, visual enhancements, and includes nine game modes, including new modes and established favorites from the series and its add-on packs."}, {"name": "Gigantic", "details_link": "https://www.metacritic.com/game/xbox-one/gigantic", "publisher": "Motiga", "release_date": "Jul 20 2017", "developers": ["Motiga"], "platforms": ["PC", "Xbox One"], "genres": ["Strategy", "Real-Time", "MOBA"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/1f9635fceb17869edc4e0c7ffb2eab2f-98.jpg", "descriptions": null}, {"name": "Demon Slayer: Kimetsu no Yaiba - The Hinokami Chronicles", "details_link": "https://www.metacritic.com/game/switch/demon-slayer-kimetsu-no-yaiba---the-hinokami-chronicles", "publisher": "Sega", "release_date": "Jun 10 2022", "developers": ["CyberConnect2"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 74, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/0ac8c6201f51678327f092875251b1ec-98.jpg", "descriptions": "It is the Taisho Period in Japan. Tanjiro, a kindhearted boy who sells charcoal for a living, finds his family slaughtered by a demon. To make matters worse, his younger sister Nezuko, the sole survivor, has been transformed into a demon herself. Though devastated by this grim reality,It is the Taisho Period in Japan. Tanjiro, a kindhearted boy who sells charcoal for a living, finds his family slaughtered by a demon. To make matters worse, his younger sister Nezuko, the sole survivor, has been transformed into a demon herself. Though devastated by this grim reality, Tanjiro resolves to become a \"demon slayer\" so that he can turn his sister back into a human and kill the demon that massacred his family. A sorrowful tale of siblings in which the fates of humans and demons intertwine... begins now!\r Features:\r * Exhilarating Arena Battles Master the multitude of spectacular skills of a wide roster of characters from the anime, including Tanjiro and Nezuko , to overcome challengers in headto head battle, locally and online.\r * Moving Drama Take up the sword of Tanjiro Kamado and guide his journey to become a Demon Slayer and turn his sister Nezuko back into a human.\r * Thrilling Boss Battles Action and drama reach their peak in specially designed battles against powerful demons that will test Tanjiro's mettle.\r * Original Anime Voice Cast The original English and Japanese casts of the anime return to bring their authentic portrayals to the game.… Expand"}, {"name": "Moving Out", "details_link": "https://www.metacritic.com/game/playstation-4/moving-out", "publisher": "Team17", "release_date": "Apr 28 2020", "developers": ["SMG Studio"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Simulation", "Puzzle", "Action", "Virtual", "Career"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/04aa64ad5d938f77f371fc4e3ec56dd2-98.jpg", "descriptions": "Moving Out is a ridiculous physics-based moving simulator that brings new meaning to \"couch co-op\"!\r Are you ready for an exciting career in furniture? As a newly certified Furniture Arrangement & Relocation Technician, you'll take on moving jobs all across the busy town of Packmore.Moving Out is a ridiculous physics-based moving simulator that brings new meaning to \"couch co-op\"!\r Are you ready for an exciting career in furniture? As a newly certified Furniture Arrangement & Relocation Technician, you'll take on moving jobs all across the busy town of Packmore. Smooth Moves may not be the biggest moving company, but there's no task too dangerous or strange for this busy team of go-getters. Grow your business to brave new heights, recruit colourful customizable characters, and save your town from furniture peril!… Expand"}, {"name": "GRID", "details_link": "https://www.metacritic.com/game/pc/grid", "publisher": "Codemasters", "release_date": "Oct  8 2019", "developers": ["Codemasters"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 74, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/08180937e506fe926bec90a3ce08b9d6-98.jpg", "descriptions": "Capturing intense moment-to-moment racing action, GRID returns with an all-new experience where every race is the chance to choose your own path, create your own story and define your legacy in the motorsport world.From the creators of the hugely successful DiRT and F1 series, CodemastersCapturing intense moment-to-moment racing action, GRID returns with an all-new experience where every race is the chance to choose your own path, create your own story and define your legacy in the motorsport world.From the creators of the hugely successful DiRT and F1 series, Codemasters invites you to take your place in the GRID World Series and compete in intense wheel-to-wheel racing with the most iconic and desirable race cars -- current and classic, from GT through Touring and Muscle to Stock and Super Modifieds -- and in some of the world's most famous city streets, ovals and circuits.GRID captures every moment of the race, from the adrenaline rush of lights-out to the elation at the chequered flag -- and in-between, it's all action too. Incidents come one right after the other -- tight overtakes, bumper-to bumper scrapes and competitive collisions -- all heightened by rivalries, team-mates and a nemesis driver who will all either try to help or hinder your progress as you achieve your goal of becoming the GRID World Series champion.… Expand"}, {"name": "Jotun: Valhalla Edition", "details_link": "https://www.metacritic.com/game/switch/jotun-valhalla-edition", "publisher": "Thunder Lotus Games", "release_date": "Apr 27 2018", "developers": ["Thunder Lotus Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 74, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/2ed1f7d2408a29d8fb694468a88dea00-98.jpg", "descriptions": "In Jotun, you play Thora, a Norse warrior who has died an inglorious death and must face the challenges of Viking purgatory to prove herself to the Gods and enter Valhalla."}, {"name": "Major League Baseball 2K7", "details_link": "https://www.metacritic.com/game/playstation-3/major-league-baseball-2k7", "publisher": "2K Sports", "release_date": "Feb 26 2007", "developers": ["Kush Games"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 74, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/0/7e48bb53417ee6e3f253cecc289f14c1-98.jpg", "descriptions": "It's a whole new ballgame! Major League Baseball 2K7 redefines the pure baseball video game experience with true, Next-Gen details, all-new throwing mechanics and a revolutionary presentation system. Signature Style - Batting stances, waggles, home run celebrations, step-ins and step-outsIt's a whole new ballgame! Major League Baseball 2K7 redefines the pure baseball video game experience with true, Next-Gen details, all-new throwing mechanics and a revolutionary presentation system. Signature Style - Batting stances, waggles, home run celebrations, step-ins and step-outs bring each player to life. True Fielding – Fielder positioning, relay and cutoff A.I. has been redesigned to allow for better, more authentic Major League defensive play. Defensive alignments are now based on who is at the plate. Dynamic Throwing System - Responsive throwing mechanics coupled with unique animations for infield, outfield and situational throws brings your command of the ball to a new level. Inside Edge - Updated for the 2007 season, Inside Edge data is now tied into USER control at the plate. Playing into your pitcher's or hitter's strengths will now reward you with a boost in hitting power. [2K Sports]… Expand"}, {"name": "Trials of Mana", "details_link": "https://www.metacritic.com/game/switch/trials-of-mana", "publisher": "Square Enix", "release_date": "Apr 24 2020", "developers": ["Square Enix", "GREZZO", "Xeen"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/0e5333d86504cd74c172f85222aff95f-98.jpg", "descriptions": "When the world was shrouded in darkness, the Goddess of Mana drew forth the Sword of Mana to smite the eight Benevodons, monsters of destruction. She sealed the horrors inside the eight Mana Stones, bringing the realm back from the brink. Weakened from rebuilding the world, the GoddessWhen the world was shrouded in darkness, the Goddess of Mana drew forth the Sword of Mana to smite the eight Benevodons, monsters of destruction. She sealed the horrors inside the eight Mana Stones, bringing the realm back from the brink. Weakened from rebuilding the world, the Goddess changed herself into a tree and fell into a deep sleep for many years. However, the forces of evil soon sought to free the Benevodons to gain control of the world. They started a terrible war to further their plot and destabilize the kingdoms. Peace was at an end. Mana itself began to disappear from the world and the Mana Tree started to wither...… Expand"}, {"name": "Life is Strange: Episode 4 - Dark Room", "details_link": "https://www.metacritic.com/game/xbox-one/life-is-strange-episode-4---dark-room", "publisher": "Square Enix", "release_date": "Jul 28 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "General"], "meta_score": 74, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/c98770feb80b304dd739aae458d7bc95-98.jpg", "descriptions": "Darkroom follows the antics of series protagonist, Max, as she attempts to uncover the mystery behind the disappearance of Rachel Amber and get to the bottom of the bizarre happenings in Arcadia Bay. With the ‘End of the World’ party on the horizon, time is running out for Max to become theDarkroom follows the antics of series protagonist, Max, as she attempts to uncover the mystery behind the disappearance of Rachel Amber and get to the bottom of the bizarre happenings in Arcadia Bay. With the ‘End of the World’ party on the horizon, time is running out for Max to become the saviour of the town.… Expand"}, {"name": "King's Bounty: Warriors of the North", "details_link": "https://www.metacritic.com/game/pc/kings-bounty-warriors-of-the-north", "publisher": "1C", "release_date": "Oct 25 2012", "developers": ["Katauri Interactive", "Katuri Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 74, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/3c27937e41ca91ea902c7455c7a3652e-98.jpg", "descriptions": "Warriors of the North is the latest chapter in the cult role-playing game - adventure saga. The current tale takes place in the familiar world of Endoria featured in the earlier games, but begins in the Viking lands, which the celebrated hero Bill Gilbert never visited during his famousWarriors of the North is the latest chapter in the cult role-playing game - adventure saga. The current tale takes place in the familiar world of Endoria featured in the earlier games, but begins in the Viking lands, which the celebrated hero Bill Gilbert never visited during his famous quest in King’s Bounty: The Legend.… Expand"}, {"name": "Magic: The Gathering - Duels of the Planeswalkers 2012", "details_link": "https://www.metacritic.com/game/playstation-3/magic-the-gathering---duels-of-the-planeswalkers-2012", "publisher": "Wizards of the Coast", "release_date": "Jun 14 2011", "developers": ["Stainless Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 74, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/0b43c318afcb99c5f8179765d5268961-98.jpg", "descriptions": "Building on the success of the original Duels of the Planeswalkers, Duels of the Planeswalkers 2012 will introduce all new game modes, Planeswalker opponents, decks, puzzle challenges and other exciting new features including a new-to-digital multiplayer game mode called Archenemy whereBuilding on the success of the original Duels of the Planeswalkers, Duels of the Planeswalkers 2012 will introduce all new game modes, Planeswalker opponents, decks, puzzle challenges and other exciting new features including a new-to-digital multiplayer game mode called Archenemy where players gather up to two allies and team up against the AI.… Expand"}, {"name": "Left 4 Dead 2: The Passing", "details_link": "https://www.metacritic.com/game/xbox-360/left-4-dead-2-the-passing", "publisher": "Electronic Arts", "release_date": "Apr 22 2010", "developers": ["Valve Software"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Tactical"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/9d8793c51d816865c23b7053a0396179-98.jpg", "descriptions": "(Dowloadable Content)  Left 4 Dead 2’s \"The Passing\" brings the original Left 4 Dead Survivors down south for a meeting with the L4D2 cast, while delivering new single-player, multiplayer and co-operative gameplay."}, {"name": "Steambot Chronicles", "details_link": "https://www.metacritic.com/game/playstation-2/steambot-chronicles", "publisher": "Atlus Co.", "release_date": "May 23 2006", "developers": ["Irem"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 74, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/14cb8fa003285a5d092d91435c4a1511-98.jpg", "descriptions": "As cars became more and more common on city streets, the Trotmobile came into being. This two-legged, walking metal vehicle could be adapted to a variety of road conditions and purposes: agriculture, civil engineering, and transportation. The industrial revolution continued, increasing theAs cars became more and more common on city streets, the Trotmobile came into being. This two-legged, walking metal vehicle could be adapted to a variety of road conditions and purposes: agriculture, civil engineering, and transportation. The industrial revolution continued, increasing the Trotmobile's popularity. People placed their hopes and dreams on the backs of these wonderful machines, marching toward a better life just beyond their reach. Vanilla Beans wakes up to find himself lying on a sun-drenched beach.  How did he get there? And, who in the world is the girl standing above him? The girl soon introduces herself as Connie, and Vanilla begins the first busy day ofa grand adventure. He'll take Connie home, meet the other members of her band (the Garland Globetrotters), and explore the town of Nefroburg. At the end of this busy day, Vanilla relaxes in the town square where the Globetrotters are performing only to witness a gang of bandits overrunning the town! How things go from here is up to the player. Will Vanilla join the Garland Globetrotters?  Or, will he join the Killer Elephant gang?  The choices Vanilla makes, the Trotmobiles he builds, and the friends hekeeps are all up to gamers who take part in Steambot Chronicles. [Atlus Software]… Expand"}, {"name": "Nantucket", "details_link": "https://www.metacritic.com/game/pc/nantucket", "publisher": "Fish Eagle", "release_date": "Jan 18 2018", "developers": ["Picaresque Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/c41ee0ec97a8e7ad77cfddcd95e38ad8-98.jpg", "descriptions": "Chase after Moby Dick, and live through the Golden Age of American whaling in this seafaring strategy game. Set sail around the world, manage your ship and crew, and live Ishmael's story, the sole survivor of the Pequod, a few years after the events narrated by Herman Melville in his masterpiece."}, {"name": "Sega Rally Revo", "details_link": "https://www.metacritic.com/game/psp/sega-rally-revo", "publisher": "Sega", "release_date": "Oct  9 2007", "developers": ["Bugbear"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "Up to 4 ", "genres": ["Driving", "Racing", "Arcade", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/e48936f800d9a404c14809ac96333fe0-98.jpg", "descriptions": "(Known as \"Sega Rally\" in the UK/EU)  SEGA Rally Revo on the PSP system encapsulates everything its predecessors laid out when defining the rally genre from amazing visuals and superb handling to closely-fought competitive racing. These key components laid the development foundation for SEGA(Known as \"Sega Rally\" in the UK/EU)  SEGA Rally Revo on the PSP system encapsulates everything its predecessors laid out when defining the rally genre from amazing visuals and superb handling to closely-fought competitive racing. These key components laid the development foundation for SEGA Rally Revo on the PSP system that delivers a thrilling race against competitive AI, powered by instinctive handling system that rewards players for pushing their rally-racing skills to the limit. With the addition of multiplayer wireless and online multiplayer, there's scope for players to show off their skills against their friends, whilst the excellent PSP system screen exudes all the visual qualities expected of SEGA Rally Revo. [Sega]… Expand"}, {"name": "Snake Pass", "details_link": "https://www.metacritic.com/game/xbox-one/snake-pass", "publisher": "Sumo Digital", "release_date": "Mar 29 2017", "developers": ["Sumo Digital"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action Adventure", "Puzzle", "Action", "General"], "meta_score": 74, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/29024a464f37ee04d6a5a8b4e6ae9186-98.jpg", "descriptions": "THINK LIKE A SNAKE!\r When the tranquillity of Haven Tor is interrupted by a mysterious interloper only the unlikeliest of heroes can save the day! Meet Noodle the Snake and his hyperactive best friend, Doodle the Hummingbird, who together must re-unite the missing Keystones with theTHINK LIKE A SNAKE!\r When the tranquillity of Haven Tor is interrupted by a mysterious interloper only the unlikeliest of heroes can save the day! Meet Noodle the Snake and his hyperactive best friend, Doodle the Hummingbird, who together must re-unite the missing Keystones with the magical gates that give Haven Tor its mythical power.\r A unique, physics based puzzle platform game, Snake Pass challenges players to 'think like a snake' as they tackle precarious puzzles as only a snake can. Slither through long grass, coil around bamboo and climb out of trouble in the latest game from award winning independent studio Sumo Digital!\r Master Noodle's one-of-a-kind abilities\r -Unravel the mystery of the nefarious gatecrasher\r-Restore Haven Tor to its former glory\r-Slither into every nook and cranny in search of cunning collectibles\r-A brand-new soundtrack from fan favourite composer David Wise… Expand"}, {"name": "Saints Row: The Third Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/saints-row-the-third-remastered", "publisher": "Deep Silver", "release_date": "May 22 2020", "developers": ["Sperasoft"], "platforms": ["PC", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/5036e7dc82ff7b9319033c1a273ef820-98.jpg", "descriptions": "Experience The Full Package, Remastered. Steelport, the original city of sin, has never looked so good as it drowns in sex, drugs and guns. The Third Street Saints are at the height of power and yours to control. This is your city. These are your rules."}, {"name": "Layers of Fear", "details_link": "https://www.metacritic.com/game/playstation-4/layers-of-fear", "publisher": "Aspyr", "release_date": "Feb 16 2016", "developers": ["Bloober Team"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/e7c040df8debb29d0ea78893db75928f-98.jpg", "descriptions": "Layers of Fear is a psychedelic horror where you take control over an insane painter in his quest to finish his magnum opus."}, {"name": "Gatling Gears", "details_link": "https://www.metacritic.com/game/xbox-360/gatling-gears", "publisher": "Electronic Arts", "release_date": "May 11 2011", "developers": ["Vanguard Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Strategy", "Shooter", "General", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/d81641c8c947278c1e7f7ce651c854ad-98.jpg", "descriptions": "From the team that created the award-winning Greed Corp, comes Gatling Gears. Set within the same Mistbound universe featuring signature elements like collapsing land, walker units and warring factions, but now with twin-stick shooter controls and a new hero, Max Brawley. In this eclecticFrom the team that created the award-winning Greed Corp, comes Gatling Gears. Set within the same Mistbound universe featuring signature elements like collapsing land, walker units and warring factions, but now with twin-stick shooter controls and a new hero, Max Brawley. In this eclectic steampunk setting, players fill the air with lead as they try to defeat a monopolistic corporation that is depleting the world of its natural resources.… Expand"}, {"name": "Ghostbusters: The Video Game", "details_link": "https://www.metacritic.com/game/pc/ghostbusters-the-video-game", "publisher": "Atari", "release_date": "Jun 16 2009", "developers": ["Terminal Reality"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "General", "General"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/e6750727266548e802b258bf58b32525-98.jpg", "descriptions": "The Ghostbusters are back in an all new story penned by the original creators. With Manhattan newly overrun by ghosts and other supernatural creatures, it's up to you to take on the role of a new recruit joining the original film cast of the famous Ghostbusters team. Equipped with a varietyThe Ghostbusters are back in an all new story penned by the original creators. With Manhattan newly overrun by ghosts and other supernatural creatures, it's up to you to take on the role of a new recruit joining the original film cast of the famous Ghostbusters team. Equipped with a variety of unique weapons and gadgets, you will hunt, fight and capture a wide range of uncanny phantasms and demons in an all new funny and frightening battle to save New York City from its latest paranormal plague. To deliver a special gaming experience to the tremendous Ghostbusters’ fan base around the world, the game features the original film cast from the classic Ghostbusters films, Bill Murray, Dan Aykroyd, Harold Ramis, and Ernie Hudson, back again for the first time in more than 20 years. Supporting the ghost busting crew are the talents of Annie Potts, Brian Doyle Murray and William Atherton. [Sierra Entertainment]… Expand"}, {"name": "Tourist Trophy", "details_link": "https://www.metacritic.com/game/playstation-2/tourist-trophy", "publisher": "SCEA", "release_date": "Apr  4 2006", "developers": ["Polyphony Digital"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 74, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/51966b553f663f43742fbdf1130f4b93-98.jpg", "descriptions": "Experience the true essence of motorcycle racing in Tourist Trophy, the real riding simulator. With unrivaled physics and graphics, the developers of the best-selling \"Gran Turismo\" franchise have captured the fluid movement of man and machine, featuring perfected handling and riderExperience the true essence of motorcycle racing in Tourist Trophy, the real riding simulator. With unrivaled physics and graphics, the developers of the best-selling \"Gran Turismo\" franchise have captured the fluid movement of man and machine, featuring perfected handling and rider perspective. Ride on more than 35 courses and more than 100 sportbikes from more than a dozen manufacturers, including Honda, Kawasaki, BMW Motorrad, and Ducati. [SCEA]… Expand"}, {"name": "WWE SmackDown vs. Raw 2008", "details_link": "https://www.metacritic.com/game/playstation-3/wwe-smackdown-vs-raw-2008", "publisher": "THQ", "release_date": "Nov 13 2007", "developers": ["Yuke's"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/0142b5a3f405ed9e4881e014bd7c8a1b-98.jpg", "descriptions": "WWE SmackDown! vs. Raw 2008 lets players take the fight into their own hands with the debut of Superstar Fighting Styles. The game features eight unique styles, each having its own strategy and exclusive attributes. A brand new Struggle Submission System gives players intuitive and naturalWWE SmackDown! vs. Raw 2008 lets players take the fight into their own hands with the debut of Superstar Fighting Styles. The game features eight unique styles, each having its own strategy and exclusive attributes. A brand new Struggle Submission System gives players intuitive and natural control over their WWE Superstars by using the game's popular analog controls. Realism and strategy are at the forefront, as players now control the amount of pressure they apply to their opponents. In addition, WWE SmackDown! vs. Raw 2008 features a significant Extreme Championship Wrestling (ECW) presence, including a variety of Superstars, arenas and weapons. The game is also packed with significant updates requested by fans, including new rosters, more environmental hotspots, a combined Season and General Manager Mode experience, improved out-of-ring action, enhanced online community support and much more. [THQ]… Expand"}, {"name": "Street Fighter V", "details_link": "https://www.metacritic.com/game/pc/street-fighter-v", "publisher": "Capcom", "release_date": "Feb 16 2016", "developers": ["Capcom"], "platforms": ["PlayStation 4", "PC"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 74, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/6/df91067c4776d9bc03151f73eb8482f2-98.jpg", "descriptions": "Birdie and Charlie Nash make their return to the Street Fighter universe, where they join classic characters like Ryu, Chun-Li, Cammy, and M. Bison. Many more new and returning characters will be added to the diverse roster, offering a wide variety of fighting styles for players to chooseBirdie and Charlie Nash make their return to the Street Fighter universe, where they join classic characters like Ryu, Chun-Li, Cammy, and M. Bison. Many more new and returning characters will be added to the diverse roster, offering a wide variety of fighting styles for players to choose from. New Strategies and Battle Mechanics: Highly accessible new battle mechanics, which revolve around the V-Gauge and EX Gauge, provide a new layer of strategy and depth to the franchise that all players can enjoy. V-Trigger: Unique abilities that use the entire V-Gauge, giving players the opportunity to inflict damage when activated. V-Skill: Utility skills (such as evasion) for each character that can be activated at any time. V-Reversal: Unique counterattacks that use one stock of the V-Gauge. Critical Arts: Ultimate attacks that use the entire EX Gauge. For the first time in franchise history, the online community is unified into a single player pool, allowing for even more rivalries to be born. [Playstation.com]… Expand"}, {"name": "Pac-Man World: Re-PAC", "details_link": "https://www.metacritic.com/game/pc/pac-man-world-re-pac", "publisher": "Bandai Namco Games", "release_date": "Aug 26 2022", "developers": ["Now Production", "Bandai Namco Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/60b165909a0a5c299cb02d61dc4e91e6-98.jpg", "descriptions": "Feed Your Appetite for Adventure. In Pac-Man World Re-Pac, Pac-Man arrives home on his birthday to find the Ghosts have kidnapped Pac-Man’s family & friends and ruined his party. Pac-Man must set out to adventure through the six areas of Ghost Island to rescue his family and friends, andFeed Your Appetite for Adventure. In Pac-Man World Re-Pac, Pac-Man arrives home on his birthday to find the Ghosts have kidnapped Pac-Man’s family & friends and ruined his party. Pac-Man must set out to adventure through the six areas of Ghost Island to rescue his family and friends, and face-off against the Ghosts’ boss, Toc-Man. With polished graphics, enhanced gameplay, and updated features – Pac-Man World Re-Pac is action/platforming fun for both experienced Pac-fans and new Pac-thusiasts the world over.… Expand"}, {"name": "F1 Manager 2022", "details_link": "https://www.metacritic.com/game/playstation-5/f1-manager-2022", "publisher": "Frontier Developments", "release_date": "Aug 25 2022", "developers": ["Frontier Developments"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Simulation", "Other"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/e244dba88f314789abbbf53d164cb47b-98.jpg", "descriptions": "Make your mark on Formula 1 in the officially licensed F1 Manager 2022. Be the boss of your chosen constructor and pick from a roster of 2022 drivers and staff."}, {"name": "Midnight Fight Express", "details_link": "https://www.metacritic.com/game/playstation-4/midnight-fight-express", "publisher": "Humble Games", "release_date": "Aug 23 2022", "developers": ["Jacob Dzwinel"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/22310ca59e675ccfb332641fb408f326-98.jpg", "descriptions": "A former member of the criminal underworld is lured back into “the life” by a mysterious drone claiming they have until sunrise to prevent a citywide criminal takeover together."}, {"name": "Assassin's Creed Valhalla: Dawn of Ragnarok", "details_link": "https://www.metacritic.com/game/xbox-series-x/assassins-creed-valhalla-dawn-of-ragnarok", "publisher": "Ubisoft", "release_date": "Mar 10 2022", "developers": ["Ubisoft Sofia"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/034f74f72079d66b2f57e5a4329d555f-98.jpg", "descriptions": "In the most ambitious expansion in franchise history, Eivor must embrace their destiny as Odin, the Norse god of Battle and Wisdom. Unleash new divine powers as you embark on a desperate quest through a breathtaking world. Complete a legendary Viking saga and save your son in the face of theIn the most ambitious expansion in franchise history, Eivor must embrace their destiny as Odin, the Norse god of Battle and Wisdom. Unleash new divine powers as you embark on a desperate quest through a breathtaking world. Complete a legendary Viking saga and save your son in the face of the gods’ doom.… Expand"}, {"name": "Centipede: Recharged", "details_link": "https://www.metacritic.com/game/switch/centipede-recharged", "publisher": "Atari", "release_date": "Sep 29 2021", "developers": ["SneakyBox", "Adamvision Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Arcade"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/add2593602d287cf77d82ccbd9963c0e-98.jpg", "descriptions": "Initiate insect extermination in this widescreen glow-up of one of the greatest arcade games of all time. The rules are the same as 1981: shoot the centipedes as they descend the playing field, and contend around the shot-blocking and path-altering mushrooms they leave behind. New toInitiate insect extermination in this widescreen glow-up of one of the greatest arcade games of all time. The rules are the same as 1981: shoot the centipedes as they descend the playing field, and contend around the shot-blocking and path-altering mushrooms they leave behind. New to Centipede: Recharged are power-ups dropped by the spiders, such as explosive bullets, spread shots, and a devastating railgun. Fight for high scores in Arcade mode either solo or with a new simultaneous couch co-op feature. Tackle more than two dozen challenges that test bug-shooting prowess and introduce clever uses for the new powerups, with additional challenges exclusive to the Atari VCS. Take it to the next level with global leaderboards for the best records in the world, and earn more than 15 achievements.… Expand"}, {"name": "Lost in Random", "details_link": "https://www.metacritic.com/game/xbox-series-x/lost-in-random", "publisher": "Electronic Arts", "release_date": "Sep 10 2021", "developers": ["Zoink!"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/07cb2de562bef76d99c6f6d86a096bb2-98.jpg", "descriptions": "Play the odds in Lost in Random™, a gothic fairytale-inspired action adventure where every citizen’s fate is determined by the roll of a dice. Ruled by a wicked Queen, the kingdom of Random is divided into six shadowy realms where life is dictated by a cursed black dice. In this story, fromPlay the odds in Lost in Random™, a gothic fairytale-inspired action adventure where every citizen’s fate is determined by the roll of a dice. Ruled by a wicked Queen, the kingdom of Random is divided into six shadowy realms where life is dictated by a cursed black dice. In this story, from the award-winning Swedish game studio Zoink and penned by Eisner Award-winning Adventure Time and Marvel Comics The Unbeatable Squirrel Girl author Ryan North, you’ll join Even, a penniless girl who’s down on her luck, in a dark quest to save her beloved sister. With her companion Dicey, a small and strange living dice, Even must learn to embrace the chaos of Random, uncovering an age-old tale with a modern message. Walk Random’s mysterious cobbled streets, meet its unpredictable residents, and take on courageous quests. Engage in fearsome battles with a unique blend of tactical combat, card collection, and explosive dice gameplay. It’s time to adapt or perish, as you battle inside giant board game arenas that change with every dice throw! Learn how to tip the odds in your favor, and dive into a dark wonderland where only the brave survive.… Expand"}, {"name": "The Big Con", "details_link": "https://www.metacritic.com/game/xbox-series-x/the-big-con", "publisher": "Skybound Games", "release_date": "Aug 31 2021", "developers": ["Mighty Yell"], "platforms": ["PC", "Xbox One", "Xbox Series X"], "genres": ["Adventure", "General"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/d8396cad3ac69d351678997a227c1e45-98.jpg", "descriptions": "Hustle through the 90s in THE BIG CON, an adventure game where you're an awkward teen hustling to save her family video store from gangsters. Play as Ali, a high school junior gone AWOL from band camp to seek revenge on the loan sharks that threaten her mom's video store. (Fighting with yourHustle through the 90s in THE BIG CON, an adventure game where you're an awkward teen hustling to save her family video store from gangsters. Play as Ali, a high school junior gone AWOL from band camp to seek revenge on the loan sharks that threaten her mom's video store. (Fighting with your mom is YOUR job. No one else gets to do that.) Maybe you'll profit from the latest collectible plushie craze, and make an interesting friend or two along the way.… Expand"}, {"name": "art of rally", "details_link": "https://www.metacritic.com/game/switch/art-of-rally", "publisher": "Funselektor Labs Inc.", "release_date": "Aug 12 2021", "developers": ["Funselektor Labs Inc."], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 74, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/f8ec95ddbff96191450c7cfc952776c4-98.jpg", "descriptions": "\"To do something dangerous with style is art...\"art of rally is a stylized experience inspired by the golden era of rally from the creator of Absolute Drift.\n\nRace across the world through colorful and stylized environments in top-down view.\n\nCompete for first place in the leaderboards\"To do something dangerous with style is art...\"art of rally is a stylized experience inspired by the golden era of rally from the creator of Absolute Drift.Race across the world through colorful and stylized environments in top-down view.Compete for first place in the leaderboards with daily and weekly challenges.Will you master the art of rally?… Expand"}, {"name": "Toodee and Topdee", "details_link": "https://www.metacritic.com/game/pc/toodee-and-topdee", "publisher": "dietzribi", "release_date": "Aug  4 2021", "developers": ["dietzribi"], "platforms": ["Switch", "PC"], "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/6cb1082c36814e93f4cc082a3bb76546-98.jpg", "descriptions": "A cosmic turbulence caused the 2D Platformer and the Top-Down Puzzler dimensions to merge! Switch between Toodee and Topdee and their unique perspectives to overcome hard-as-nails challenges, solve mind-melting puzzles and defeat huge bosses. Oh, and there's a co-op mode!"}, {"name": "FIFA 21", "details_link": "https://www.metacritic.com/game/pc/fifa-21", "publisher": "Electronic Arts", "release_date": "Oct  9 2020", "developers": ["Electronic Arts"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 74, "users_score": 1.5, "image": "https://static.metacritic.com/images/products/games/2/893e538be8508b960fcef0cf048329f5-98.jpg", "descriptions": "On the street and in the stadium, FIFA 21 has more ways to play than ever before.  FIFA 21 rewards you for your creativity and control all over the pitch. Create more scoring opportunities with all-new dynamic attacking systems in the most intelligent FIFA gameplay to date. A new AgileOn the street and in the stadium, FIFA 21 has more ways to play than ever before.  FIFA 21 rewards you for your creativity and control all over the pitch. Create more scoring opportunities with all-new dynamic attacking systems in the most intelligent FIFA gameplay to date. A new Agile Dribbling system gives you the means to unleash your creativity in 1-on-1 situations. Use fast footwork, more responsive close control, and new skill moves like the ball roll fake to explode past defenders. In FIFA 21, increased positional awareness elevates footballers’ in-game intelligence to put them in the right place at the right time. See world-class forwards hold their runs in line with the last defender, creative playmakers find space to play through balls, and midfielders shut off passing lanes as players better live up to their real-world understanding of space and time on the pitch. [Electronic Arts]… Expand"}, {"name": "Neon Abyss", "details_link": "https://www.metacritic.com/game/pc/neon-abyss", "publisher": "Veewo Games", "release_date": "Jul 14 2020", "developers": ["Veewo Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/04cc9388cd7a0069cbdeeb456081dd93-98.jpg", "descriptions": "Neon Abyss is a frantic, roguelite action-platformer where you run ‘n’ gun your way into the Abyss. Featuring unlimited item synergies and a unique dungeon evolution system, each run diversifies the experience and every choice alters the ruleset."}, {"name": "Wattam", "details_link": "https://www.metacritic.com/game/pc/wattam", "publisher": "Annapurna Interactive", "release_date": "Dec 17 2019", "developers": ["Funomena"], "platforms": ["PlayStation 4", "PC"], "num_players": "Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/431c66bfb6662556e9c1458217194c4d-98.jpg", "descriptions": "The idea for this game came from when Keita was playing with his two-year old son, and wondered about what if all toys lived, and connected by themselves? It would be such a fun world to explore and play with! The word Wattam itself is actually composed of the Tamil and Japanese words forThe idea for this game came from when Keita was playing with his two-year old son, and wondered about what if all toys lived, and connected by themselves? It would be such a fun world to explore and play with! The word Wattam itself is actually composed of the Tamil and Japanese words for making a circle or making a loop. The initial prototype for this game was made by Keita and his friend Vikram, who are from these two cultures respectively, and this new word acknowledges one of the games core inspirations: making connections between different types of things.… Expand"}, {"name": "Zombie Army 4: Dead War", "details_link": "https://www.metacritic.com/game/pc/zombie-army-4-dead-war", "publisher": "Rebellion", "release_date": "Aug 27 2019", "developers": ["Rebellion"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Third-Person", "Arcade"], "meta_score": 74, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/4/5aef743aa25bfb5538a2924d8b5863bc-98.jpg", "descriptions": "Hitler’s hordes are back for more in this spine-chilling shooter from the makers of Sniper Elite 4! Abominable occult enemies, epic weapons and a harrowing new campaign for 1-4 players await in 1940s Europe, as you fight to save humankind from undead Armageddon!"}, {"name": "Bloodstained: Ritual of the Night", "details_link": "https://www.metacritic.com/game/switch/bloodstained-ritual-of-the-night", "publisher": "505 Games", "release_date": "Jun 25 2019", "developers": ["ArtPlay"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "Platformer", "Action RPG", "2D", "", "Metroidvania"], "meta_score": 74, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/b65678c51e3332c30e24c7d4e43970be-98.jpg", "descriptions": "You are Miriam, an orphan scarred by an alchemist curse which slowly crystallizes your skin. You must battle your way through a demon-filled castle summoned by Gebel, your old friend whose body has become more crystal than flesh.\r * Exploration: Bloodstained's story unfolds as you exploreYou are Miriam, an orphan scarred by an alchemist curse which slowly crystallizes your skin. You must battle your way through a demon-filled castle summoned by Gebel, your old friend whose body has become more crystal than flesh.\r * Exploration: Bloodstained's story unfolds as you explore Gebel's hellish castle; a sprawling structure that features a variety of locations. As you explore the massive castle you'll find warp gates that will allow you to travel quickly without having to backtrack too much.\r* RPG Elements: It's not an Igavania without leveling, and Bloodstained will be no exception. In addition to the classic elements everyones come to expect, enemies in Bloodstained will drop a wide variety of items, materials, and magi-crystals necessary to create the items that will get you safely through Gebels castle.\r* Crafting: As you explore, fight enemies, and complete quests you will gain experience and become more powerful, acquiring a variety of weapons along the way. Enemies will also drop materials you can use to craft new weapons and abilities using Miriam's training in alchemy.… Expand"}]