[{"name": "Final Fantasy X / X-2 HD Remaster", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-x-x-2-hd-remaster", "publisher": "Square Enix", "release_date": "May 12 2016", "developers": ["Square Enix"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/244dc33c0181ac699b8968939ffc5749-98.jpg", "descriptions": "Two of the Most Celebrated RPGs of their Generation - Now in Beautiful High Definition!\r Over 200 hours of gameplay, including the International version content never before released in North America.\r Relive the fateful journey with fully remastered HD visuals and rearranged music."}, {"name": "Battlefield 3: Back to Karkand", "details_link": "https://www.metacritic.com/game/xbox-360/battlefield-3-back-to-karkand", "publisher": "Electronic Arts", "release_date": "Dec 13 2011", "developers": ["EA DICE"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern", "Arcade"], "meta_score": 83, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/250d0f2b6817793cac67d0b99b15690a-98.jpg", "descriptions": "Battlefield 3: Back to Karkand is a massive themed expansion pack featuring four of the most loved maps from Battlefield 2, boldly reimagined for Battlefield 3 with the power and destruction of the Frostbite 2 engine. It also gives you classic weapons and vehicles from Battlefield 2, uniqueBattlefield 3: Back to Karkand is a massive themed expansion pack featuring four of the most loved maps from Battlefield 2, boldly reimagined for Battlefield 3 with the power and destruction of the Frostbite 2 engine. It also gives you classic weapons and vehicles from Battlefield 2, unique dog tags, and all-new Assignments.… Expand"}, {"name": "Bloodstained: Ritual of the Night", "details_link": "https://www.metacritic.com/game/playstation-4/bloodstained-ritual-of-the-night", "publisher": "505 Games", "release_date": "Jun 18 2019", "developers": ["ArtPlay"], "platforms": ["iPhone/iPad", "PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["2D", "Action", "Role-Playing", "Platformer", "Action RPG", "", "Metroidvania"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/5431175be3c38a293a51f75d1be58f58-98.jpg", "descriptions": "You are Miriam, an orphan scarred by an alchemist curse which slowly crystallizes your skin. You must battle your way through a demon-filled castle summoned by Gebel, your old friend whose body has become more crystal than flesh.\r * Exploration: Bloodstained's story unfolds as you exploreYou are Miriam, an orphan scarred by an alchemist curse which slowly crystallizes your skin. You must battle your way through a demon-filled castle summoned by Gebel, your old friend whose body has become more crystal than flesh.\r * Exploration: Bloodstained's story unfolds as you explore Gebel's hellish castle; a sprawling structure that features a variety of locations. As you explore the massive castle you'll find warp gates that will allow you to travel quickly without having to backtrack too much.\r* RPG Elements: It's not an Igavania without leveling, and Bloodstained will be no exception. In addition to the classic elements everyones come to expect, enemies in Bloodstained will drop a wide variety of items, materials, and magi-crystals necessary to create the items that will get you safely through Gebels castle.\r* Crafting: As you explore, fight enemies, and complete quests you will gain experience and become more powerful, acquiring a variety of weapons along the way. Enemies will also drop materials you can use to craft new weapons and abilities using Miriam's training in alchemy.… Expand"}, {"name": "N+", "details_link": "https://www.metacritic.com/game/xbox-360/n+", "publisher": "Microsoft Game Studios", "release_date": "Feb 20 2008", "developers": ["Slick Entertainment"], "platforms": ["PC", "Xbox 360"], "num_players": "4  Online", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/49739af507fd69122aca18c639692e5a-98.jpg", "descriptions": "[Xbox Live Arcade]  In a futuristic world of inadvertently homicidal robots, a daring ninja must use deft acrobatic skill and guts of steel to survive. N+ is a peerless action-puzzle platformer with more than 300 levels in which to hone your ninja reflexes, plus a built-in level editor for[Xbox Live Arcade]  In a futuristic world of inadvertently homicidal robots, a daring ninja must use deft acrobatic skill and guts of steel to survive. N+ is a peerless action-puzzle platformer with more than 300 levels in which to hone your ninja reflexes, plus a built-in level editor for when you're hungry for more. N+ also features unique, physics-based controls, stylish graphics, unlimited lives, competitive and cooperative multiplayer, plenty of gold, and several flavors of sweet, sweet action. Running, jumping, and dying in an unpleasant-yet-comical manner has never been more fun. N+ features run-and-jump gameplay with hilarious ragdoll physics. It's easy to get into, but challenging enough for the hardcore gamer. Featuring well over 300 all-new levels, the game also includes a built-in level editor for players to create their own levels. Additional level packs, including the classic N levels from the PC version, and multiplayer level packs, will be available in the future. Multiple cooperative and competitive multiplayer modes are included. Try survival, race, or co-op play. Each level can be replayed to see how fast you completed the level. Check out additional ninja costumes for both single-player and multiplayer games, and skin your dashboard the N+ way. [Metanet Software]… Expand"}, {"name": "Guild Wars 2: Path of Fire", "details_link": "https://www.metacritic.com/game/pc/guild-wars-2-path-of-fire", "publisher": "ArenaNet", "release_date": "Sep 22 2017", "developers": ["ArenaNet"], "platforms": "PC", "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/faa24da6eb7fbd8abcc0dbc770f907e6-98.jpg", "descriptions": null}, {"name": "Fallout 3: Point Lookout", "details_link": "https://www.metacritic.com/game/xbox-360/fallout-3-point-lookout", "publisher": "Bethesda Softworks", "release_date": "Jun 23 2009", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Role-Playing", "First-Person", "First-Person", "General", "Western-Style"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/df842c5bae10dabf1b38b9c63fcc8331-98.jpg", "descriptions": "(Downloadable Content)  Buy a ticket and hop onboard the Duchess Gambit, as Tobar the Ferryman takes you to the strange seaside town of Point Lookout. What secrets does the dilapidated boardwalk hold? Who lives in the sprawling mansion? Why is the Punga Fruit so important? And what horrors(Downloadable Content)  Buy a ticket and hop onboard the Duchess Gambit, as Tobar the Ferryman takes you to the strange seaside town of Point Lookout. What secrets does the dilapidated boardwalk hold? Who lives in the sprawling mansion? Why is the Punga Fruit so important? And what horrors lie in the depths of the murky swamp? Point Lookout is the most open-ended DLC yet, and allows you to explore an entirely new and expansive gameplay area any way you’d like. A completely new questline allows you uncover the town’s hidden secrets, and wield powerful new weapons like the Double-Barrel Shotgun against the swamp’s dangerous, and deformed, denizens. So venture to Point Lookout, if you dare. Just pray it’s not a one-way trip. [Bethesda Softworks]… Expand"}, {"name": "Baldur's Gate: Dark Alliance", "details_link": "https://www.metacritic.com/game/xbox/baldurs-gate-dark-alliance", "publisher": "Interplay", "release_date": "Oct 22 2002", "developers": ["Snowblind Studios"], "platforms": ["PC", "PlayStation 2", "PlayStation 4", "Switch", "Xbox One", "Xbox"], "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/f6edb68bb603de0d718153e40f4d6218-98.jpg", "descriptions": "Baldur's Gate: Dark Alliance is an action RPG with an epic tale of intrigue, explosive spell effects, and highly detailed creatures and environments.  You play a one of three customizable characters, who returns to Baldur's Gate and joins the fight against the darkness that threatens itsBaldur's Gate: Dark Alliance is an action RPG with an epic tale of intrigue, explosive spell effects, and highly detailed creatures and environments.  You play a one of three customizable characters, who returns to Baldur's Gate and joins the fight against the darkness that threatens its peace.  Take on the monsters solo or with a friend in co-op mode.  Baldur's Gate: Dark Alliance is the first game to feature the real time application of the Dungeons & Dragons 3rd Edition rules.… Expand"}, {"name": "I Expect You To Die 2: The Spy And The Liar", "details_link": "https://www.metacritic.com/game/pc/i-expect-you-to-die-2-the-spy-and-the-liar", "publisher": "Schell Games", "release_date": "Aug 24 2021", "developers": ["Schell Games"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 83, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/b8ba9bcfff79a2a723a87b5bc33437a6-98.jpg", "descriptions": "Well, Agent, it looks like the Zoraxis organisation is up to their old tricks with a new scheme for world domination. It's up to you to expose their diabolical plot and put a stop to it.\r Putting your telekinetic abilities and problem solving skills to the ultimate test, you'll once againWell, Agent, it looks like the Zoraxis organisation is up to their old tricks with a new scheme for world domination. It's up to you to expose their diabolical plot and put a stop to it.\r Putting your telekinetic abilities and problem solving skills to the ultimate test, you'll once again be risking your life to solve dastardly puzzles and decipher secret codes in all-new highly interactive environments and surroundings.\r Are you expected make it out alive? Of course not, you're expected to die!… Expand"}, {"name": "No More Heroes", "details_link": "https://www.metacritic.com/game/wii/no-more-heroes", "publisher": "Ubisoft", "release_date": "Jan 22 2008", "developers": ["Grasshopper Manufacture"], "platforms": ["PC", "Switch", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/8b67f30b8d9fcdaac1e3f641267b2e66-98.jpg", "descriptions": "No More Heroes tells the story of Travis Touchdown, an anime fan who lives in the fictional town of Santa Destroy, California. After an unexpected turn of events, Travis finds himself at the bottom of an Assassins' organization. Travis will have to prove himself worthy and defeat 10 otherNo More Heroes tells the story of Travis Touchdown, an anime fan who lives in the fictional town of Santa Destroy, California. After an unexpected turn of events, Travis finds himself at the bottom of an Assassins' organization. Travis will have to prove himself worthy and defeat 10 other bloodthirsty killers – all with deep stories of their own – to make his way to the top of the assassin's league. [Ubisoft]… Expand"}, {"name": "Fight Night Round 3", "details_link": "https://www.metacritic.com/game/xbox/fight-night-round-3", "publisher": "EA Sports", "release_date": "Feb 23 2006", "developers": ["EA Chicago"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Xbox"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/8060e569f02b046581e4720b0152f0a6-98.jpg", "descriptions": "You can build a boxer and take him into the ring in Fight Night Round 3. The game features improved graphics, which let you see in detail the effect of your punches on licensed boxers who fight in a variety of boxing styles. You can generate rivalries leading up to a fight by trash-talkingYou can build a boxer and take him into the ring in Fight Night Round 3. The game features improved graphics, which let you see in detail the effect of your punches on licensed boxers who fight in a variety of boxing styles. You can generate rivalries leading up to a fight by trash-talking and also by fighting during weigh-ins and press conferences. Fight Night Round 3 also includes ESPN footage of classic boxing rivalries. You can challenge other gamers in online multiplayer matches.… Expand"}, {"name": "Shin Megami Tensei IV", "details_link": "https://www.metacritic.com/game/3ds/shin-megami-tensei-iv", "publisher": "Atlus", "release_date": "Jul 16 2013", "developers": ["Atlus"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/62d40b153d2d4f23d8e40d9728e9c2bc-98.jpg", "descriptions": "Building on the styles of ATLUS' Persona, Devil Summoner, and Devil Survivor titles, SMTIV is the first true successor to 2004's Shin Megami Tensei: Nocturne. The story of SMTIV revolves around the Samurai, the sacred protectors of the Eastern Kingdom of Mikado. As a newly appointed Samurai,Building on the styles of ATLUS' Persona, Devil Summoner, and Devil Survivor titles, SMTIV is the first true successor to 2004's Shin Megami Tensei: Nocturne. The story of SMTIV revolves around the Samurai, the sacred protectors of the Eastern Kingdom of Mikado. As a newly appointed Samurai, players will struggle with factions that have nefarious designs on the world as they defend their home kingdom from a growing army of demons. Decisions players make throughout the course of the story will have lasting repercussions, as the fate of the world hangs in the balance.… Expand"}, {"name": "Sonic Mania", "details_link": "https://www.metacritic.com/game/xbox-one/sonic-mania", "publisher": "SegaSoft", "release_date": "Aug 15 2017", "developers": ["SegaSoft", "Sega", "PagodaWest Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/79e8421cca0c9b451d48af9c043f857a-98.jpg", "descriptions": "Experience the ultimate celebration of past and future in Sonic Mania, an all-new 2D Sonic adventure running at a crisp 60FPS with stunning HD retro-style graphics. Multiple playable characters give you the ability to go explosively fast as Sonic, soar as Tails, or power through toughExperience the ultimate celebration of past and future in Sonic Mania, an all-new 2D Sonic adventure running at a crisp 60FPS with stunning HD retro-style graphics. Multiple playable characters give you the ability to go explosively fast as Sonic, soar as Tails, or power through tough obstacles with Knuckles’ brute strength. You can re-live the Sonic of the past with an exciting new twist on classic zones while fighting against new bosses and Dr. Eggman’s evil robot army. Go head to-head with players in Competition Mode or play in Co-Op Mode with a friend.… Expand"}, {"name": "Hellblade: Senua's Sacrifice", "details_link": "https://www.metacritic.com/game/pc/hellblade-senuas-sacrifice", "publisher": "Ninja Theory", "release_date": "Aug  7 2017", "developers": ["Ninja Theory"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/3061863e56c167ceba30e9dcd54b4e96-98.jpg", "descriptions": "An independent game from Ninja Theory - makers of Heavenly Sword, Enslaved: Odyssey to the West & DmC: Devil May Cry. Hellblade: Senua's Sacrifice takes you on a journey into savage viking heartland with Senua, a Celtic warrior struggling with trauma & psychosis."}, {"name": "The Last Clockwinder", "details_link": "https://www.metacritic.com/game/playstation-5/the-last-clockwinder", "publisher": "Pontoco", "release_date": "Feb 22 2023", "developers": ["Pontoco"], "platforms": ["PC", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 83, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/e09514a01c59a8dfb5f31877ad6e109e-98.jpg", "descriptions": "You are on a mission to repair an ancient clocktower built into the trunk of a colossal tree. Inside, you find a pair of gloves that allow you to turn anything you do into a looping clockwork automaton.These clones can do everything you can do, from planting to cutting to throwing itemsYou are on a mission to repair an ancient clocktower built into the trunk of a colossal tree. Inside, you find a pair of gloves that allow you to turn anything you do into a looping clockwork automaton.These clones can do everything you can do, from planting to cutting to throwing items through the air.Create an interconnected system out of your own clones. Grow plants, harvest resources, and work together to save the clocktower!… Expand"}, {"name": "Crash Bandicoot 4: It's About Time", "details_link": "https://www.metacritic.com/game/pc/crash-bandicoot-4-its-about-time", "publisher": "Activision", "release_date": "Mar 26 2021", "developers": ["Toys for Bob"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 83, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/fa050b9081ff2de105760ac059e9f7af-98.jpg", "descriptions": "It's About Time - for a brand-wumping new Crash Bandicoot game! Crash fourward into a time shattered adventure with your favorite marsupials.Neo Cortex and N. Tropy are back at it again and launching an all-out assault on not just this universe, but the entire multiverse! Crash and CocoIt's About Time - for a brand-wumping new Crash Bandicoot game! Crash fourward into a time shattered adventure with your favorite marsupials.Neo Cortex and N. Tropy are back at it again and launching an all-out assault on not just this universe, but the entire multiverse! Crash and Coco are here to save the day by reuniting the four Quantum Masks and bending the rules of reality.New abilities? Check. More playable characters? Yep. Alternate dimensions? Obviously. Ridonkulous bosses? For sure. Same awesome sauce? You bet your sweet jorts. Wait, are they actually jorts? Not in this universe!… Expand"}, {"name": "Bayonetta & Vanquish", "details_link": "https://www.metacritic.com/game/xbox-one/bayonetta-vanquish", "publisher": "Sega", "release_date": "Feb 18 2020", "developers": ["PlatinumGames"], "platforms": ["PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 83, "users_score": 9.3, "image": "https://static.metacritic.com/images/products/games/2/0ff9aea4ff698bbc0560aaa1172f4922-98.jpg", "descriptions": "Celebrate the 10th Anniversary of two PlatinumGames cult classics with the Bayonetta & Vanquish 10th Anniversary Bundle. Bayonetta: Experience the genesis of the Bayonetta series with the cult classic, original action-adventure game. Vanquish: The hit sci-fi shooter returns. An overpopulatedCelebrate the 10th Anniversary of two PlatinumGames cult classics with the Bayonetta & Vanquish 10th Anniversary Bundle. Bayonetta: Experience the genesis of the Bayonetta series with the cult classic, original action-adventure game. Vanquish: The hit sci-fi shooter returns. An overpopulated Earth suffocating under limited resources looks to Providence, the solar-powered space colony for support. … Expand"}, {"name": "Assassin's Creed IV: Black Flag", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-iv-black-flag", "publisher": "Ubisoft", "release_date": "Nov 12 2013", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 3", "Stadia", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/06f9a4e492d9474c4ebaf23b6aa913ee-98.jpg", "descriptions": "The year is 1715. Pirates rule the waters of the Caribbean and have established a lawless Republic. Among these outlaws is a lethal young captain named Edward Kenway. His notorious exploits earn the respect of legends like Blackbeard, but draw him into an ancient war that may destroyThe year is 1715. Pirates rule the waters of the Caribbean and have established a lawless Republic. Among these outlaws is a lethal young captain named Edward Kenway. His notorious exploits earn the respect of legends like Blackbeard, but draw him into an ancient war that may destroy everything the pirates have built for themselves.… Expand"}, {"name": "Silent Storm", "details_link": "https://www.metacritic.com/game/pc/silent-storm", "publisher": "Encore Software, Inc.", "release_date": "Jan 20 2004", "developers": ["Nival Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Historic", "Historic", "Tactics"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/0c6dd516062606729fbb05f60d3fb2e2-98.jpg", "descriptions": "Silent Storm is a true 3D tactical turn-based Role-Playing-Game set against the backdrop of WWII. \rAs the conflict rages on the frontlines, you?ll be leading a small multinational squad behind enemy lines to gather information and wreak havoc on your enemies while trying to thwart aSilent Storm is a true 3D tactical turn-based Role-Playing-Game set against the backdrop of WWII. \rAs the conflict rages on the frontlines, you?ll be leading a small multinational squad behind enemy lines to gather information and wreak havoc on your enemies while trying to thwart a mysterious new rising power whose plans are even more horrific than anything the world has yet witnessed.\r Silent Storm is fully rendered in breathtaking 3D ? and includes fully destructible environments, realistic weaponry and unlimited tactical possibilities. Turn-based gaming has never looked this good! Choose your squad from over 40 operatives of 30 different nationalities, each with a unique background and mix of specialties and skills. [Encore/JoWood]… Expand"}, {"name": "Need for Speed Underground", "details_link": "https://www.metacritic.com/game/gamecube/need-for-speed-underground", "publisher": "Electronic Arts", "release_date": "Nov 17 2003", "developers": ["Electronic Arts"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/75529970ae29ba8762ff7853dd14d771-98.jpg", "descriptions": "Enter the world of urban street racing with the latest title in the hit Need for Speed series: Need for Speed Underground.  Take on today's most popular tuner cars from Mitsubishi Motors, Subaru, Toyota and many more, earning cash for car mods.  Test your skills against the computer orEnter the world of urban street racing with the latest title in the hit Need for Speed series: Need for Speed Underground.  Take on today's most popular tuner cars from Mitsubishi Motors, Subaru, Toyota and many more, earning cash for car mods.  Test your skills against the computer or online against up to 4 players.  But creating a custom street racing machine will not get you to the top; it takes a certain amount of attitude and razor sharp driving skills to compete in the tough world of urban racing.  … Expand"}, {"name": "FIFA Soccer 2004", "details_link": "https://www.metacritic.com/game/gamecube/fifa-soccer-2004", "publisher": "EA Sports", "release_date": "Nov  4 2003", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 83, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/8efabe05c447cf7bc03b63922c66d689-98.jpg", "descriptions": "FIFA Soccer kicks its game up a few notches with new installment, FIFA Soccer 2004.  This year's action features more advanced levels of player detail and responsiveness.  Play as one of the best players from 16 leagues and 350 teams, from Europe's super leagues to the Americas.  Plus, a newFIFA Soccer kicks its game up a few notches with new installment, FIFA Soccer 2004.  This year's action features more advanced levels of player detail and responsiveness.  Play as one of the best players from 16 leagues and 350 teams, from Europe's super leagues to the Americas.  Plus, a new Career Mode gives you the chance to take a team from the lower divisions, battle through ranks, sign new players, and turn them into champions.  With immersive atmospheres, total realism with the world's premier clubs, and improved gameplay, FIFA Soccer 2004 looks to reach the goals of soccer fans.… Expand"}, {"name": "Command & Conquer: Generals - Zero Hour", "details_link": "https://www.metacritic.com/game/pc/command-conquer-generals---zero-hour", "publisher": "EA Games", "release_date": "Sep 22 2003", "developers": ["EA LA"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Modern", "General", "Modern"], "meta_score": 83, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/1b73c1a9c4eca15c64099da236486f70-98.jpg", "descriptions": "Prepare to unleash the absolute latest in modern weapons technology against the world?s most powerful Generals in Command & Conquer Generals Zero Hour. In the next era of military strategy and might, you?ll need to command a more technologically advanced arsenal to defeat new, more powerfulPrepare to unleash the absolute latest in modern weapons technology against the world?s most powerful Generals in Command & Conquer Generals Zero Hour. In the next era of military strategy and might, you?ll need to command a more technologically advanced arsenal to defeat new, more powerful enemies. The first expansion pack for the critically acclaimed Command & Conquer Generals challenges players to square off against the world?s most elite commanders for battlefield domination. Even the most experienced C&C Generals veteran must learn new strategies and tactics to take full advantage of -- and learn to defend against -- the next generation of the world?s most lethal weapons. With new units, structures, and upgrades, as well as the all-new Generals Challenge Mode, Zero Hour delivers all the firepower you?ll need in your quest to become the ultimate modern warfare General. [Electronic Arts]… Expand"}, {"name": "Homeworld 2", "details_link": "https://www.metacritic.com/game/pc/homeworld-2", "publisher": "Sierra Entertainment", "release_date": "Sep 16 2003", "developers": ["Relic", "Relic Entertainment"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/4ab9a38961b56be414bbc86496a4ecb3-98.jpg", "descriptions": "Combining elements of real-time strategy and space combat, Homeworld 2 delivers an evolutionary step in gameplay and technology. Cinematic-quality graphics, stunning special effects, brilliantly rendered ships and an innovative interface combine to create an immersive 3-D experience. [Sierra]"}, {"name": "Wakeboarding Unleashed Featuring Shaun Murray", "details_link": "https://www.metacritic.com/game/playstation-2/wakeboarding-unleashed-featuring-shaun-murray", "publisher": "Activision", "release_date": "Jun 10 2003", "developers": ["Shaba Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Wakeboarding"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/e7fb7500c9c48336b10614659bbd7238-98.jpg", "descriptions": "Hang on for your life in Wakeboarding Unleashed featuring Shaun Murray as you get ripped across a lake by a high-powered speedboat and trick through dangerous terrain. Feel the rush as you crash into houseboats and catch huge air in nine exotic levels with seven world-class wakeboarders.Hang on for your life in Wakeboarding Unleashed featuring Shaun Murray as you get ripped across a lake by a high-powered speedboat and trick through dangerous terrain. Feel the rush as you crash into houseboats and catch huge air in nine exotic levels with seven world-class wakeboarders. Tired already? Then drive the boat and help your friend pull off challenging technical tricks on the most realistic looking water ever. [Activision]… Expand"}, {"name": "Phantasy Star Online Episode I & II", "details_link": "https://www.metacritic.com/game/xbox/phantasy-star-online-episode-i-ii", "publisher": "Microsoft Game Studios", "release_date": "Apr 15 2003", "developers": ["Sonic Team"], "platforms": "Xbox", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/bb1788d7f1444669d78825c9b6b3646a-98.jpg", "descriptions": "The Phantasy Star adventure that began on the PC now comes to the Xbox and Xbox Live with new gaming modes and new content. Phantasy Star Online I & II features new character classes, weapons, enemies, items, and quests. A new split-screen feature allows three of your friends to join you onThe Phantasy Star adventure that began on the PC now comes to the Xbox and Xbox Live with new gaming modes and new content. Phantasy Star Online I & II features new character classes, weapons, enemies, items, and quests. A new split-screen feature allows three of your friends to join you on your adventure, as well as in other game modes, on the same console. Episode I includes all of the content from the original PSO and PSO Version 2, while Episode II brings a new, full-length adventure.… Expand"}, {"name": "Galactic Civilizations", "details_link": "https://www.metacritic.com/game/pc/galactic-civilizations", "publisher": "Strategy First", "release_date": "Mar 26 2003", "developers": ["Stardock"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "4X"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/59880b43835576d869b24a9b73d25c3c-98.jpg", "descriptions": "Galactic Civilizations is a space-based strategy game in which the player becomes the leader of the human civilization at the dawn of the 23rd century. The galaxy has 6 major civilizations including humans and a race is on to colonize, conquer, and dominate the galaxy using whatever meansGalactic Civilizations is a space-based strategy game in which the player becomes the leader of the human civilization at the dawn of the 23rd century. The galaxy has 6 major civilizations including humans and a race is on to colonize, conquer, and dominate the galaxy using whatever means necessary. Those means include using military, technological, economic or political might to become a major power in the galaxy. Players must research new technologies, colonize and defend planets, build social improvements, build a fleet, fight wars, win elections, and gain influence in the United Planets Security council. [Strategy First]… Expand"}, {"name": "Rygar: The Legendary Adventure", "details_link": "https://www.metacritic.com/game/playstation-2/rygar-the-legendary-adventure", "publisher": "Tecmo", "release_date": "Nov 25 2002", "developers": ["Tecmo"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/416c7bc81d93bbe8e9e8786066015251-98.jpg", "descriptions": "Taking place on an Island in the Mediterranean Sea called Argus, Rygar: The Legendary Adventure, tells the tale of a noble warrior determined to save the Princess Harmonia and bring the Island of Argus back to a state of peace. [Tecmo]"}, {"name": "EverQuest: The Shadows of Luclin", "details_link": "https://www.metacritic.com/game/pc/everquest-the-shadows-of-luclin", "publisher": "Sony Online Entertainment", "release_date": "Dec  2 2001", "developers": ["Sony Online Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy"], "meta_score": 83, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/8a2490350232420c403cb237a9504add-98.jpg", "descriptions": "The satellite of Luclin has been discovered, and now Norrathians can venture to the eerie moonscape. This expansion pack is playable by characters of all levels and provides new zones, a new race and a new class, hundreds of new items, spells, and creatures to battle, in addition to newThe satellite of Luclin has been discovered, and now Norrathians can venture to the eerie moonscape. This expansion pack is playable by characters of all levels and provides new zones, a new race and a new class, hundreds of new items, spells, and creatures to battle, in addition to new character models supported by an enhanced 3D engine. [Sony Online Entertainment]… Expand"}, {"name": "The Typing of the Dead", "details_link": "https://www.metacritic.com/game/dreamcast/the-typing-of-the-dead", "publisher": "Sega", "release_date": "Jan 23 2001", "developers": ["Smilebit"], "platforms": ["PC", "Dreamcast"], "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/717de4e7f08d27ca964580ea93eb0769-98.jpg", "descriptions": "Your rapid-fire typing skills spell doom for the undead in this utterly odd, totally challenging take-off on House of the Dead 2. When you're battling zombies in a nightmare-come-true, ten trigger fingers are definitely better than two!"}, {"name": "Halo 3: ODST", "details_link": "https://www.metacritic.com/game/xbox-360/halo-3-odst", "publisher": "Microsoft Game Studios", "release_date": "Sep 22 2009", "developers": ["Bungie Software", "Bungie"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/25296d3230f5e72e8dd3d4755040b0a1-98.jpg", "descriptions": "Halo 3: ODST returns players to familiar ground on a vital, top-secret mission. The gripping story, cooperative campaign and new multiplayer content will have Halo fans \"Preparing to Drop.\" The new game brings the perspective of new characters to the Human-Covenant struggle, as it exploresHalo 3: ODST returns players to familiar ground on a vital, top-secret mission. The gripping story, cooperative campaign and new multiplayer content will have Halo fans \"Preparing to Drop.\" The new game brings the perspective of new characters to the Human-Covenant struggle, as it explores the ODST, or Orbital Drop Shock Troopers. Follow the story of the legendary ODSTs or Orbital Drop Shock Troopers as they drop into the ruined city of New Mombasa, looking for clues behind the Covenant's catastrophic attack on the city. A new hero: Prepare to drop. Known for their courage, valor and at times, insanity, Orbital Drop Shock Troopers are among the fiercest UNSC soldiers, priding themselves on being the first unit deployed into hostile situations. While not as large or supernaturally gifted as their Spartan comrades, these Hell Jumpers more than compensate with their ferocious attitudes and unwavering nerve. Multiplayer: All the traditional features of Halo 3 multiplayer will be included in the new game, including full-featured integration with the Forge map editor. [Microsoft]… Expand"}, {"name": "Ghost Trick: Phantom Detective", "details_link": "https://www.metacritic.com/game/ds/ghost-trick-phantom-detective", "publisher": "Capcom", "release_date": "Jan 11 2011", "developers": ["Capcom"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One", "DS"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 83, "users_score": 9.7, "image": "https://static.metacritic.com/images/products/games/2/2c2c5762785d776c0a4fc7d6667f49f2-98.jpg", "descriptions": "Ghost Trick is a story of mystery and intrigue that blends fun logic puzzles with the world of the supernatural, making for an entirely new and unique experience in the handheld gaming space. Part adventure game, part puzzle game, Ghost Trick's gameplay will challenge player's brains whileGhost Trick is a story of mystery and intrigue that blends fun logic puzzles with the world of the supernatural, making for an entirely new and unique experience in the handheld gaming space. Part adventure game, part puzzle game, Ghost Trick's gameplay will challenge player's brains while its distinct art elements and character designs will deliver the fun.… Expand"}, {"name": "Pure", "details_link": "https://www.metacritic.com/game/playstation-3/pure", "publisher": "Disney Interactive Studios", "release_date": "Sep 23 2008", "developers": ["Black Rock Studio"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/fe24f15293aba61bbf1bebb93db7700c-98.jpg", "descriptions": "Thrill seekers race against skilled rivals and performing gravity-defying aerial tricks in Pure, an extreme sports off-road racing video game. Featuring vertigo-inducing massive aerial jumps and spectacular airborne tricks in photo-realistic real-world locations all over the globe, PureThrill seekers race against skilled rivals and performing gravity-defying aerial tricks in Pure, an extreme sports off-road racing video game. Featuring vertigo-inducing massive aerial jumps and spectacular airborne tricks in photo-realistic real-world locations all over the globe, Pure delivers heart-pounding experiences unique to the genre. Players start by choosing among a variety of male and female character riders.  They can then either race against deft A.I. opponents or online players (up to 16-player multiplayer) in frenetic races and freestyle competitions all over the world. [Disney Interactive Studios]… Expand"}, {"name": "Crash Team Racing: Nitro-Fueled", "details_link": "https://www.metacritic.com/game/playstation-4/crash-team-racing-nitro-fueled", "publisher": "Activision", "release_date": "Jun 21 2019", "developers": ["Beenox"], "platforms": ["Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 83, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/a105f47dc742af968304e4103afbdf00-98.jpg", "descriptions": "Start your engines with the original game modes, characters, tracks, power-ups, weapons and controls. Power slide to glory in additional karts and tracks from beyond the original game. Race online with friends and Crash the competition with online leader boards."}, {"name": "Wreckfest", "details_link": "https://www.metacritic.com/game/xbox-one/wreckfest", "publisher": "THQ Nordic", "release_date": "Aug 26 2019", "developers": ["Bugbear"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Racing", "General", "Arcade", "Automobile"], "meta_score": 83, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/6dccacc67727e636ab8106a931b8b5d7-98.jpg", "descriptions": "Break the rules and take full-contact racing to the limit with Wreckfest! Expect epic crashes, neck-to-neck fights over the finish line and brand-new ways for metal to bend -- These are the once-in-a-lifetime moments that can only be achieved in Wreckfest, with its true-to-life physicsBreak the rules and take full-contact racing to the limit with Wreckfest! Expect epic crashes, neck-to-neck fights over the finish line and brand-new ways for metal to bend -- These are the once-in-a-lifetime moments that can only be achieved in Wreckfest, with its true-to-life physics simulation crafted by legendary developer Bugbear, who also brought you FlatOut 1 & 2! Burn rubber and shred metal in the ultimate driving playground! Wreckfest is jam-packed with upgrade and customization options. Whether you are preparing for your next demolition derby with reinforced bumpers, roll cages, side protectors and much more, or setting your car up for a banger race with engine performance parts like air filters, camshafts, fuel systems, etc., Wreckfest is shaping up to be the best combative motorsport game out there.Features:* Awesome Cars -- Old, banged-up, patched-together cars that simply ooze style! From old American heavy-hitters to agile Europeans and fun Asians, you won't find anything like this in other games.* Meaningful Customization -- Change not only the look of your cars but also upgrade their body armor!* Multiplayer -- Wreck your friends online and take racing to the limit while chasing for demolition dominance!* Challenge modes -- Have hilarious fun with crop harvesters, lawn mowers, school buses, three-wheelers and more!… Expand"}, {"name": "PixelJunk Monsters", "details_link": "https://www.metacritic.com/game/playstation-3/pixeljunk-monsters", "publisher": "SCEA", "release_date": "Jan 24 2008", "developers": ["Q-Games"], "platforms": ["Wii U", "PlayStation 3"], "num_players": "2  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "Fantasy", "Defense"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/bc39be73553af2ca20c63bdd492c4337-98.jpg", "descriptions": "[Downloadable Game]  Inspired by the popular and addictive \"tower defense\" genre, PixelJunk Monsters takes the simple real-time strategy concept of building, researching and base defending and presents it in a uniquely attractive style. With meticulously hand-drawn 2D art, PixelJunk Monsters[Downloadable Game]  Inspired by the popular and addictive \"tower defense\" genre, PixelJunk Monsters takes the simple real-time strategy concept of building, researching and base defending and presents it in a uniquely attractive style. With meticulously hand-drawn 2D art, PixelJunk Monsters recreates the look of a classic with crisp graphics designed for optimal viewing in Full 1080p HD. The player controls a defender-of-the-forest character in a lush 2D environment. The player's goal is to strategically defend the pathway to his homebase from an onslaught of various threatening monsters. In between waves of monster attacks, the player scrambles to reinforce his defenses by collecting gold coins and jewels from fallen enemies to finance new towers and research deadlier weapons. Eventually, the player can harness the elements throughout the 20 different stages to cast lightning storms across the forest. Gamers can enjoy PixelJunk Monsters with a friend in offline co-op mode, which requires careful strategy and communication. Additionally, PixelJunk™ Monsters will support online leaderboards for both 1p and 2p co-op. [SCEA]… Expand"}, {"name": "MLB Power Pros", "details_link": "https://www.metacritic.com/game/wii/mlb-power-pros", "publisher": "2K Sports", "release_date": "Oct  3 2007", "developers": ["Konami"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Team", "Baseball", "Arcade", "Arcade"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/49098314dc391c5f75e4f87adec56c6e-98.jpg", "descriptions": "MLB Power Pros delivers an original visual style to America’s favorite pastime. Every MLB player is represented in the \"Power Pro\" character style - a miniature toy-like figurine model. Gamers will recognize their favorite Baseball stars through comic usage of facial expressions, facialMLB Power Pros delivers an original visual style to America’s favorite pastime. Every MLB player is represented in the \"Power Pro\" character style - a miniature toy-like figurine model. Gamers will recognize their favorite Baseball stars through comic usage of facial expressions, facial hair, and hair styles. Every MLB ballpark has been faithfully replicated with their respective famous landmarks, bringing authenticity to every game. With Season Mode, players become an MLB team general manager with the goal of winning the World Series by controlling all aspects of the team including training players, purchasing better equipment, making trades, and much more. Success Mode combines traditional role-playing elements with baseball scenarios - this story-based mode puts the user in the role of a college baseball player with the goal of becoming a Major League player – gamers train the player in numerous games while dealing with real-world situations of academics, part-time jobs, and other social situations. [2K Sports/Konami]… Expand"}, {"name": "Yomawari: Lost in the Dark", "details_link": "https://www.metacritic.com/game/switch/yomawari-lost-in-the-dark", "publisher": "NIS America", "release_date": "Oct 25 2022", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/b59c77c3fd95498029f22d78aa83ccab-98.jpg", "descriptions": "To break a curse placed upon her, a young girl must venture into the haunted streets of her town at night to search for her lost memories while evadingthe twisted spirits that lurk in the darkness."}, {"name": "Resident Evil Village", "details_link": "https://www.metacritic.com/game/xbox-series-x/resident-evil-village", "publisher": "Capcom", "release_date": "May  7 2021", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 83, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/2fc4f66cee73af85147c2b16c6bfdd2a-98.jpg", "descriptions": "The next generation of survival horror rises in the form of Resident Evil Village, the eighth major entry in the Resident Evil series. With ultra-realistic graphics powered by the RE Engine, fight for survival as danger lurks around every corner. Years after the tragic events of ResidentThe next generation of survival horror rises in the form of Resident Evil Village, the eighth major entry in the Resident Evil series. With ultra-realistic graphics powered by the RE Engine, fight for survival as danger lurks around every corner. Years after the tragic events of Resident Evil 7 biohazard, Ethan Winters has started over with his wife Mia, finally living in peace and putting the past behind them. However, Chris Redfield, the legendary hero from previous Resident Evil games, suddenly disrupts their life, throwing a devastated Ethan into a new and twisted nightmare in search of answers.… Expand"}, {"name": "Forgotton Anne", "details_link": "https://www.metacritic.com/game/xbox-one/forgotton-anne", "publisher": "Square Enix", "release_date": "May 15 2018", "developers": ["Throughline Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/d78bca6e4605df23c2860376244ec34f-98.jpg", "descriptions": "Imagine a place where everything that is lost and forgotten goes; old toys, letters, single socks. The Forgotten Lands is a magical world inhabited by Forgotlings; creatures composed of mislaid objects longing to be remembered again. Forgotton Anne is a seamless cinematic adventure game withImagine a place where everything that is lost and forgotten goes; old toys, letters, single socks. The Forgotten Lands is a magical world inhabited by Forgotlings; creatures composed of mislaid objects longing to be remembered again. Forgotton Anne is a seamless cinematic adventure game with light puzzle platforming elements. You play as Anne, the enforcer who keeps order in the Forgotten Lands, as she sets out to quash a rebellion that might prevent her master, Bonku, and herself from returning to the human world... [Square Enix]… Expand"}, {"name": "Orcs Must Die!", "details_link": "https://www.metacritic.com/game/pc/orcs-must-die!", "publisher": "Robot Entertainment", "release_date": "Oct 11 2011", "developers": ["Robot Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "General", "Real-Time", "General", "Defense"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/a02761eaff932e3cd29d64829df20d7c-98.jpg", "descriptions": "With a wide variety of traps and weapons to choose from, Orcs Must Die! dares players to find the best ways to hack, launch, flatten, gibletize, and incinerate an endless army of filthy orcs and their vile allies. Orcs Must Die! features a vibrant look, addictive gameplay, and a blatantWith a wide variety of traps and weapons to choose from, Orcs Must Die! dares players to find the best ways to hack, launch, flatten, gibletize, and incinerate an endless army of filthy orcs and their vile allies. Orcs Must Die! features a vibrant look, addictive gameplay, and a blatant disregard for the welfare of orcs.… Expand"}, {"name": "Splatoon 3", "details_link": "https://www.metacritic.com/game/switch/splatoon-3", "publisher": "Nintendo", "release_date": "Sep  9 2022", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 83, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/0505d9cbd29e11f6f568dc8d7c69aedc-98.jpg", "descriptions": "Ink up the Splatlands in the next Splatoon game. Enter the Splatlands, a sun-scorched desert inhabited by battle-hardened Inklings and Octolings. Splatsville, the city of chaos, is the adrenaline-fueled heart of this dusty wasteland. Even in this desolate environment, Turf War reigns supremeInk up the Splatlands in the next Splatoon game. Enter the Splatlands, a sun-scorched desert inhabited by battle-hardened Inklings and Octolings. Splatsville, the city of chaos, is the adrenaline-fueled heart of this dusty wasteland. Even in this desolate environment, Turf War reigns supreme and battles rage in new stages located in the surrounding wilds. Dynamic new moves help these fighters dodge attacks and cover more ground, along with a new bow-shaped weapon to sling ink. \r\rInk it up with a new entry in the Splatoon series\r  Discover the Splatlands, a new sun-soaked region with trendsetting inhabitants\r  Experiment with new styles for Inklings and Octolings\r  4v4 Turf Wars* are back, with new stages, new maneuvers, and new weapons\r … Expand"}, {"name": "Tony Hawk's Underground 2", "details_link": "https://www.metacritic.com/game/playstation-2/tony-hawks-underground-2", "publisher": "Activision", "release_date": "Oct  4 2004", "developers": ["Neversoft Entertainment"], "platforms": ["PC", "PlayStation 2"], "num_players": "8  Online", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/03f7420eb36663e5a8310bea4f991ce9-98.jpg", "descriptions": "You've been chosen by Tony Hawk to take on Bam Margera as your teams go on a World Destruction Tour. It's time to go globetrotting on an insane road trip. THUG 2 grinds in with a hilarious story mode, an unprecedented level of customization, and more moves than the Skate Gods could dream of.You've been chosen by Tony Hawk to take on Bam Margera as your teams go on a World Destruction Tour. It's time to go globetrotting on an insane road trip. THUG 2 grinds in with a hilarious story mode, an unprecedented level of customization, and more moves than the Skate Gods could dream of. Grab your board, an arsenal of spray-paint... jump into the tour van and wreak havoc across the globe. World Destruction Tour: Hawk recruits YOU onto his team for a no rules, no limits world tour versus Bam Margera. You invade international cities and wreak havoc, proving yourself to the pros as you live the ultimate skateboard adventure. All New Team Play: Team Hawk versus Team Bam. Play as yourself or switch to play one of your teammates or a special guest skater – over 20 unique characters. Unparalleled Customization: Create your own logo for use in graffiti tags, skate stickers with the all new \"Create-A-Graphic\" feature. Familiar Hawk customization continues with \"Create-A-Goal,\" \"Create-A-Park\" and the revolutionary \"Face In The Game\" feature. More Player Control Than Ever Before: Tear it up with sticker slaps, projectiles, crazy vehicles, hilarious tantrums, and slow-motion Focus Control. 2 Games In 1: Team up and wreak havoc in Story Mode or switch and play 15 levels in Classic Mode. Complete your all-time favorite goals like S-K-A-T-E, Secret Tape, and High Score against a 2-minute timer.… Expand"}, {"name": "Persona Q: Shadow of the Labyrinth", "details_link": "https://www.metacritic.com/game/3ds/persona-q-shadow-of-the-labyrinth", "publisher": "Atlus", "release_date": "Nov 25 2014", "developers": ["Atlus"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Japanese-Style"], "meta_score": 83, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/4ed38c9d9bc808d867d71dc23c2f2c6a-98.jpg", "descriptions": "Persona Q is the inaugural Persona game for 3DS. The game takes the characters from Persona 3 and Persona 4, puts them into an all new adventure. The game is in the style of Etrian Odyssey, where teams of five will navigate dungeons in a first-person view.  New characters, enemies, thePersona Q is the inaugural Persona game for 3DS. The game takes the characters from Persona 3 and Persona 4, puts them into an all new adventure. The game is in the style of Etrian Odyssey, where teams of five will navigate dungeons in a first-person view.  New characters, enemies, the presence of Etrian Odyssey's F.O.Es will provide players with all new challenges.… Expand"}, {"name": "DiRT", "details_link": "https://www.metacritic.com/game/xbox-360/dirt", "publisher": "Codemasters", "release_date": "Jun 19 2007", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/72efe5e0e603dd6e1072f508761ac7a9-98.jpg", "descriptions": "(Formerly known as \"Colin McRae Rally 2007\" or \"CMR '07\")  After a two-year break for the series, Codemasters Studios' designers have created a reinvigorated McRae experience. The new Colin McRae title goes beyond the series' point-to-point rallying to deliver the most diverse selection of(Formerly known as \"Colin McRae Rally 2007\" or \"CMR '07\")  After a two-year break for the series, Codemasters Studios' designers have created a reinvigorated McRae experience. The new Colin McRae title goes beyond the series' point-to-point rallying to deliver the most diverse selection of extreme off-road competitions. Sensational gravel, mud and dirt racing events from the world over include perilous Hill Climb and collision-packed Rally Cross events. International rallying competitions are also featured, with official cars on tracks based on real roads and locations around the globe. The title also expands on beat-the-clock racing and includes events with multiple cars on track to satisfy anyone who wants to push their on-the-edge driving just that bit further. [Codemasters]… Expand"}, {"name": "Life is Strange", "details_link": "https://www.metacritic.com/game/pc/life-is-strange", "publisher": "Square Enix", "release_date": "Oct 20 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "General"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/8561fef2077febf2e45354ff52ebce75-98.jpg", "descriptions": "Life is Strange is a hand drawn work of art and every action enacts a butterfly effect - but with the power to rewind time, what would you change? And would it turn out to be a change for the better or worse?"}, {"name": "Comet Crash", "details_link": "https://www.metacritic.com/game/playstation-3/comet-crash", "publisher": "Pelfast", "release_date": "Apr  2 2009", "developers": ["Pelfast"], "platforms": "PlayStation 3", "num_players": "1-4 ", "genres": ["Strategy", "General", "General"], "meta_score": 83, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/b3e4294633ffdebf2a82d6cac0afaa8f-98.jpg", "descriptions": "[Playstation Network]  Comet Crash takes real-time strategy to a new level by blending classical tower defense gameplay with offensive counterattacks and dynamic AI. Choose among a variety of weapons to defend your territory. Use specialized units to fight off attacks. Build up massive[Playstation Network]  Comet Crash takes real-time strategy to a new level by blending classical tower defense gameplay with offensive counterattacks and dynamic AI. Choose among a variety of weapons to defend your territory. Use specialized units to fight off attacks. Build up massive armies and rush your enemies. Challenge your friends in offline Battle mode or fight your way through action packed levels in Campaign mode. [Pelfast]… Expand"}, {"name": "Kingdom Hearts III", "details_link": "https://www.metacritic.com/game/playstation-4/kingdom-hearts-iii", "publisher": "Square Enix", "release_date": "Jan 29 2019", "developers": ["Square Enix"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action RPG", "Action Adventure", "Fantasy", "Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/2fab45d77cbc7fc4e9f579e83ae6c7f5-98.jpg", "descriptions": "KINGDOM HEARTS III tells the story of the power of friendship and light vs. darkness as Sora and his friends embark on a perilous adventure. Set in a vast array of Disney and Pixar worlds, KINGDOM HEARTS follows the journey of Sora, an unknowing heir to a spectacular power. Sora is joined byKINGDOM HEARTS III tells the story of the power of friendship and light vs. darkness as Sora and his friends embark on a perilous adventure. Set in a vast array of Disney and Pixar worlds, KINGDOM HEARTS follows the journey of Sora, an unknowing heir to a spectacular power. Sora is joined by Donald Duck and Goofy to stop an evil force known as the Heartless from invading and overtaking the universe. Sora, Donald, and Goofy unite with iconic Disney-Pixar characters old and new to overcome tremendous challenges and persevere against the darkness threatening their worlds. [Square Enix]… Expand"}, {"name": "The Incredible Hulk: Ultimate Destruction", "details_link": "https://www.metacritic.com/game/playstation-2/the-incredible-hulk-ultimate-destruction", "publisher": "VU Games", "release_date": "Aug 23 2005", "developers": ["Radical Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/562c571e19b2205b0da0e7573b522a3d-98.jpg", "descriptions": "The Incredible Hulk, based on The Incredible Hulk character franchise from Marvel Enterprises, is an action/adventure game will feature the ultimate in destructible environments, an awesome Hulk-powered ability to weaponize any object and a massive free-roaming, fully interactive world.The Incredible Hulk, based on The Incredible Hulk character franchise from Marvel Enterprises, is an action/adventure game will feature the ultimate in destructible environments, an awesome Hulk-powered ability to weaponize any object and a massive free-roaming, fully interactive world. Players can jump anywhere, climb anything and smash everything -- even destroy entire buildings -- as the Hulk, the strongest hero there is! Gamers will create their own Hulk-powered weapons from anything they can rip out of the environment, unlock new moves to battle huge enemies in epic boss fights and experience deep and varied game elements by exploring free-roaming non-mission and side mission gameplay. [Vivendi Universal]… Expand"}, {"name": "Steins;Gate", "details_link": "https://www.metacritic.com/game/playstation-vita/steinsgate", "publisher": "5pb", "release_date": "Jun  5 2015", "developers": ["5pb"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Visual Novel"], "meta_score": 83, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/9/0ba804c853827a103561e796a1bf21be-98.jpg", "descriptions": "Okabe Rintaro -- aka Okarin -- is an eccentric college student who dreams of conspiracy and chaos. Adopting the persona of a mad scientist, he spends his time developing oddball gadgets with his friends in their makeshift laboratory.\r One day, they accidentally discover that one of theirOkabe Rintaro -- aka Okarin -- is an eccentric college student who dreams of conspiracy and chaos. Adopting the persona of a mad scientist, he spends his time developing oddball gadgets with his friends in their makeshift laboratory.\r One day, they accidentally discover that one of their inventions can send emails into the past. In other words, they have created a time machine.\r SERN, John Titor, the IBN 5100, the Butterfly Effect, and the 11 theories of time travel -- when chance brings these elements together in Akihabara, Japan, the fate of the world hangs in the balance.\r What will Okarin choose when he holds the future in his hands?… Expand"}, {"name": "Beyond Good & Evil HD", "details_link": "https://www.metacritic.com/game/playstation-3/beyond-good-evil-hd", "publisher": "Ubisoft", "release_date": "Jun 28 2011", "developers": ["Ubisoft"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/16f566f171e7664a0d684f40b541c37b-98.jpg", "descriptions": "Featuring epic boss fights, puzzle-solving and stealth-based games, Beyond Good & Evil broke the barriers of traditional action-adventure gameplay when it was released in 2003. The story follows Jade, and investigative reporter and martial artist, who works with a resistance agency toFeaturing epic boss fights, puzzle-solving and stealth-based games, Beyond Good & Evil broke the barriers of traditional action-adventure gameplay when it was released in 2003. The story follows Jade, and investigative reporter and martial artist, who works with a resistance agency to uncover a government conspiracy and reveal their horrific secrets. As Jade, players are tasked to solve puzzles, fight enemies, and obtain photographic evidence.… Expand"}, {"name": "Fable: The Lost Chapters", "details_link": "https://www.metacritic.com/game/pc/fable-the-lost-chapters", "publisher": "Microsoft Game Studios", "release_date": "Sep 20 2005", "developers": ["Lionhead Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/abbae9832fd80c4d86e7c1dbf7914f9c-98.jpg", "descriptions": "Fable: The Lost Chapters is fully optimized for the Windows platform complete with expanded content, greater customization, new quests and enhanced graphics. Your every action determines your character's skills, appearance and morality. Your character's life story is created from childhoodFable: The Lost Chapters is fully optimized for the Windows platform complete with expanded content, greater customization, new quests and enhanced graphics. Your every action determines your character's skills, appearance and morality. Your character's life story is created from childhood through to adulthood and on to old age. Grow from an inexperienced child into the most powerful being in the world, spoken of by all and immortalized in legend. As additional story and side quests await, choose the path of righteousness, or dedicate your life to evil, and see yourself transform into a reflection of your actions and decisions. Age leaves you wizened and battle leaves you scarred as you explore the world of Albion and the plethora of expanded and enhanced content. With experience comes advancement and physical change, whether it be expanding muscles, a keen eye and nimble form, or the buzz of magical energies around your finger tips. As you develop your alter ego, the world reacts to you and your actions. People comment on your successes and failures, your appearance, and your behavior. Fable: The Lost Chapters offers Windows gamers even more character customization choices that will impact your appearance. The denizens of Albion's many opinions are expressed through applause, mockery, trepidation, panic, and even flirtation if they feel so inclined. Each person you aid, each flower you crush, each creature you slay, will change this world forever. In Fable: The Lost Chapters, gamers decide: \"Who will I be?\" [Microsoft]… Expand"}, {"name": "Resident Evil 5", "details_link": "https://www.metacritic.com/game/xbox-360/resident-evil-5", "publisher": "Capcom", "release_date": "Mar 13 2009", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox One", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/fd4a56acad21edc2f9593f49a47c9cf9-98.jpg", "descriptions": "The biohazard threat has not ended: Just when it seemed that the menace of Resident Evil had been destroyed, along comes a new terror to send shivers down players' spines. Chris Redfield, returning Resident Evil hero, has followed the path of the evil literally around the globe. AfterThe biohazard threat has not ended: Just when it seemed that the menace of Resident Evil had been destroyed, along comes a new terror to send shivers down players' spines. Chris Redfield, returning Resident Evil hero, has followed the path of the evil literally around the globe. After joining a new organization, Chris heads to Africa where the latest bioterrorism threat is literally transforming the people and animals of the city into mindless, maddened creatures. He is joined by a new partner, Sheva Alomar, who lends her strength, intelligence and sharp-shooting skills to the mission. In order to survive, Chris and Sheva must work together to take on the challenges of discovering the truth behind this evil plot. Utilizing a revolutionary new 2-player co-op mode of gameplay, players assume control of either Chris or Sheva and experience Resident Evil in new ways. In Resident Evil 5, Capcom has players fearing the daylight as much as they have feared shadow in previous games. [Capcom]… Expand"}, {"name": "Mega Man 9", "details_link": "https://www.metacritic.com/game/wii/mega-man-9", "publisher": "Capcom", "release_date": "Sep 22 2008", "developers": ["Inti Creates"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/3e78b61496d34f5f40cae58a19bc5c95-98.jpg", "descriptions": "[WiiWare] Mega Man fans, the wait is over! The classic Blue Bomber that debuted in 1987 is back with the ninth installment in the classic series. It's a new adventure for Mega Man done in an 8-bit style-graphics, music and gameplay are all like you remember them. [Nintendo]"}, {"name": "Kena: Bridge of Spirits", "details_link": "https://www.metacritic.com/game/pc/kena-bridge-of-spirits", "publisher": "Emberlab", "release_date": "Sep 21 2021", "developers": ["Emberlab"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/92a75cf735bfd6f66c6b85a32de5d338-98.jpg", "descriptions": "Kena: Bridge of Spirits is a story-driven action adventure set in a charming world rich with exploration and fast-paced combat. Players find and grow a team of tiny spirit companions called the Rot, enhancing their abilities and creating new ways to manipulate the environment."}, {"name": "WHAT THE GOLF?", "details_link": "https://www.metacritic.com/game/pc/what-the-golf", "publisher": "Figment, Inc.", "release_date": "Sep 19 2019", "developers": ["Triband"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/45d92714c4bbf304e0cf7ac9dc4c0601-98.jpg", "descriptions": "The golf game for people who hate golf!A silly physics-based golf parody where every golf course is a new surprising type of golf, some brilliant or hilarious, others so absurd they will make you go: WHAT THE GOLF?\n\nGolf a house, a horse or car!\n\nFeatures:\n- More surprising new golfThe golf game for people who hate golf!A silly physics-based golf parody where every golf course is a new surprising type of golf, some brilliant or hilarious, others so absurd they will make you go: WHAT THE GOLF?Golf a house, a horse or car!Features:- More surprising new golf mechanics than you can imagine- Epic golf boss fights- Made by people who know nothing about golf- First (and hopefully the last) game that let you golf a horse- Will NOT make you a better golf player- Surprises!… Expand"}, {"name": "Call of Duty: Black Ops 4", "details_link": "https://www.metacritic.com/game/pc/call-of-duty-black-ops-4", "publisher": "Activision", "release_date": "Oct 12 2018", "developers": ["Treyarch"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 83, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/6/a6810c38799980980bfb0741100d4512-98.jpg", "descriptions": "Black Ops returns - in your face. Featuring gritty, grounded, fluid Multiplayer combat, a massive Zombies offering with 3 full undead adventures at launch, and Blackout, where the universe of Black Ops comes to life in one huge battle royale experience featuring the largest map in Call ofBlack Ops returns - in your face. Featuring gritty, grounded, fluid Multiplayer combat, a massive Zombies offering with 3 full undead adventures at launch, and Blackout, where the universe of Black Ops comes to life in one huge battle royale experience featuring the largest map in Call of Duty history, signature Black Ops combat, characters, locations and weapons from the entire Black Ops series. Soldier up for all-out combat – tailor made for the Black Ops community. [Treyarch]… Expand"}, {"name": "Prey: Mooncrash", "details_link": "https://www.metacritic.com/game/playstation-4/prey-mooncrash", "publisher": "Bethesda Softworks", "release_date": "Jun 11 2018", "developers": ["Arkane Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Role-Playing", "Shooter", "Action RPG", "First-Person", "Arcade"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/4535de794f77e0b13902efdec7ed785c-98.jpg", "descriptions": "Fight overwhelming odds to escape a secret TranStar moon base where the enemies you encounter, the hazards you face, the goals you complete, and the loot you collect are different each time you play. With changing environments as dangerous as they are dynamic, the Mooncrash campaign for PreyFight overwhelming odds to escape a secret TranStar moon base where the enemies you encounter, the hazards you face, the goals you complete, and the loot you collect are different each time you play. With changing environments as dangerous as they are dynamic, the Mooncrash campaign for Prey will offer a fun, infinitely replayable challenge to test even the most skilled players.Story:In Prey: Mooncrash, TranStar's secret moon base stopped transmitting shortly after the events of Prey. Now Peter, a hacker stationed aboard a spy satellite tasked with intercepting TranStar communications, must find out why. Trapped and under a ruthless contract with KASMA Corp, Peter's only hope of ever seeing his family again is uncovering the moon base's lost secrets.Features:Live. Die. Adapt. Escape!Escape TranStar's moon base before the Typhon threat takes over. A simple goal, but one with hundreds of viable solutions. In Mooncrash, players will experience an all-new, infinitely replayable, 'rogue-lite' campaign with ever-changing enemies, weapons and objectives against a constantly increasing alien threat. Survive How You Want with Who You WantUnlock multiple characters as you play, each with their own set of specialized, upgradable skills. Will you forge your path with the resourceful engineer Joan, trade that wrench in for Security Officer Bhatia and his shotgun, or will you choose the frail-but-gifted Andrius and his arsenal of psychic abilities? Prey is about choices, and those choices belong to you. Search for Secrets, Lootand a Way OffArkane Studios' talent for detail and story-rich environments comes alive in Mooncrash. As you explore the station, which is the same size and scope of four levels of the original game's Talos I station, don't forget to keep your eyes peeled for precious supplies and, of course, Mimics.New Challenges, New SolutionsThe Typhon threat has returned with familiar foes and tough new enemies, each armed with a unique set of deadly characteristics. Use the full power of the arsenal at your disposal, including popular weapons and abilities from Prey's main game, to fight for your life and make a mad dash for your escape. Prey: Typhon HunterMooncrash includes Prey: Typhon Hunter, an online multiplayer update. Typhon Hunter is a lethal game of hide-and-seek between a single survivor (Morgan Yu) and five other players who stalk, hunt, and hide in plain sight as shape-shifting Mimic aliens. Every object is a potential enemy. Will Morgan or the Mimics prevail?TranStar VR is a single player VR-only campaign included in the Typhon Hunter update. This campaign puts you in the shoes of various TranStar employees as you complete objectives and solve intricate puzzles on Talos I, just days before the events of Prey.Requires the Prey full game.… Expand"}, {"name": "Bit.Trip Presents...Runner2: Future Legend of Rhythm Alien", "details_link": "https://www.metacritic.com/game/playstation-vita/bittrip-presentsrunner2-future-legend-of-rhythm-alien", "publisher": "Gaijin Games", "release_date": "Dec 17 2013", "developers": ["Gaijin Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "PlayStation Vita"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/7ae37a9b1e03b772ae88eafaae84c41f-98.jpg", "descriptions": "Runner 2 - Future Legend of Rhythm Alien is a rhythm-music, auto-running platformer that is inspired by the Bit.Trip series originally released on Nintendo platforms."}, {"name": "Racing Gears Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/racing-gears-advance", "publisher": "Orbital Media, Inc.", "release_date": "Feb  8 2005", "developers": ["Orbital Media", "Inc."], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/84b543a8a213fa1d2031e7bfa0c2ba40-98.jpg", "descriptions": "Get ready for fast-paced racing action on your Game Boy Advance. Racing Gears Advance lets you choose from 12 officially licensed supercars from manufacturers including Dodge, Lotus, Chevy, Mitsubishi, and GM. You can equip your vehicle with upgrades that can help you maneuver throughGet ready for fast-paced racing action on your Game Boy Advance. Racing Gears Advance lets you choose from 12 officially licensed supercars from manufacturers including Dodge, Lotus, Chevy, Mitsubishi, and GM. You can equip your vehicle with upgrades that can help you maneuver through different track terrain and weather conditions. During races, you can pick up and use offensive and defensive weapons to eliminate the competition. Racing Gears Advance also features multiplayer modes supporting up to four players.… Expand"}, {"name": "Dead or Alive Ultimate", "details_link": "https://www.metacritic.com/game/xbox/dead-or-alive-ultimate", "publisher": "Tecmo", "release_date": "Oct 26 2004", "developers": ["Team Ninja"], "platforms": "Xbox", "num_players": "8  Online", "genres": ["Miscellaneous", "Compilation"], "meta_score": 83, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/2/00a53156fee81f848a99d32498290e38-98.jpg", "descriptions": "Dead or Alive Ultimate combines the original Dead or Alive with a redesigned Dead or Alive 2 and takes the series online for the first time. Both games can be played on Xbox Live, which enables you to test your fighting skills against gamers from around the world. The new Dead or Alive 2Dead or Alive Ultimate combines the original Dead or Alive with a redesigned Dead or Alive 2 and takes the series online for the first time. Both games can be played on Xbox Live, which enables you to test your fighting skills against gamers from around the world. The new Dead or Alive 2 Ultimate features episodes from the characters' pasts that reveal new details surrounding some of the most popular characters. Enhanced graphics and new stages, costumes, and fighting moves are also included in this Ultimate edition.… Expand"}, {"name": "Darkest Dungeon", "details_link": "https://www.metacritic.com/game/playstation-4/darkest-dungeon", "publisher": "Red Hook Studios", "release_date": "Sep 27 2016", "developers": ["Red Hook Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/c754a4d6553283b5fcc610fc1cf71aba-98.jpg", "descriptions": "Darkest Dungeon is a gothic roguelike RPG dungeon crawler about the psychological stresses of adventuring. You will lead a band of four heroes on a perilous side-scrolling descent, dealing with a prodigious number of threats to their bodily health, and worse, a relentless assault on theirDarkest Dungeon is a gothic roguelike RPG dungeon crawler about the psychological stresses of adventuring. You will lead a band of four heroes on a perilous side-scrolling descent, dealing with a prodigious number of threats to their bodily health, and worse, a relentless assault on their mental fortitude! Five hundred feet below the earth you will not only fight unimaginable foes, but famine, disease, and the stress of the ever-encroaching dark. Darkest Dungeon focuses on the humanity and psychological vulnerability of the heroes and asks: What emotional toll does a life of adventure take?… Expand"}, {"name": "Street Fighter X Tekken", "details_link": "https://www.metacritic.com/game/xbox-360/street-fighter-x-tekken", "publisher": "Capcom", "release_date": "Mar  6 2012", "developers": ["Capcom"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "2D", "3D"], "meta_score": 83, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/6/ee004b939b9b6c6b2eb75bc18a50998a-98.jpg", "descriptions": "Welcome to Street Fighter X Tekken, where Street Fighter and Tekken series' stalwarts Ryu, Chun-Li, Kazuya Mishima and Nina Williams headline a memorable cast of your favorite fighters in a tag battle dream match for the ages. Street Fighter X Tekken (SFXT) is a 2 vs. 2 tag team-basedWelcome to Street Fighter X Tekken, where Street Fighter and Tekken series' stalwarts Ryu, Chun-Li, Kazuya Mishima and Nina Williams headline a memorable cast of your favorite fighters in a tag battle dream match for the ages. Street Fighter X Tekken (SFXT) is a 2 vs. 2 tag team-based fighting game where players can freely tag in and out between partners. The game promises to marry the styles of both a 2D and 3D fighting game for a fresh take on the genre. Fans from each series will also be able to play with either Street Fighter's traditional 6 button layout or Tekken's 4 button layout. Players who are new to either series will be able to join in on the fun with an easy-to-understand battle system that promises excitement and countless hours of fun. [Capcom]… Expand"}, {"name": "LEGO Star Wars II: The Original Trilogy", "details_link": "https://www.metacritic.com/game/psp/lego-star-wars-ii-the-original-trilogy", "publisher": "LucasArts", "release_date": "Sep 12 2006", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PSP"], "num_players": "2 ", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/79c0c14b83642f1774fa653a77f06901-98.jpg", "descriptions": "LEGO Star Wars II takes the fun and customization ability of the LEGO play pattern and combines it with the epic story, characters and action from the revolutionary Star Wars: Episodes IV, V and VI. With a unique tongue-in-cheek take on the Original Trilogy, LEGO Star Wars II lets you buildLEGO Star Wars II takes the fun and customization ability of the LEGO play pattern and combines it with the epic story, characters and action from the revolutionary Star Wars: Episodes IV, V and VI. With a unique tongue-in-cheek take on the Original Trilogy, LEGO Star Wars II lets you build and battle your way through your favorite film moments. From Darth Vader's pursuit of Princess Leia aboard her Blockade Runner to Luke's final confrontation with Emperor Palpatine. For the first time ever, characters can get in and out of vehicles, as well as ride creatures. Because it's LEGO style, you can also mix and match the body parts of more than 50 playable characters to create one of millions of possible LEGO Star Wars heroes. And on PS2, Xbox and Windows platforms, a game save from the first LEGO Star Wars can unlock another 50-plus additional characters for Free Play mode -- that's more than 100 total characters. Other exciting additions include free-roaming vehicle levels, the ability to switch ships at will in Free Play mode, cool new character-specific attacks and maneuvers, playable mini-kit vehicles, an adaptive difficulty option and more. [LucasArts]… Expand"}, {"name": "Deus Ex: Mankind Divided", "details_link": "https://www.metacritic.com/game/pc/deus-ex-mankind-divided", "publisher": "Square Enix", "release_date": "Aug 23 2016", "developers": ["Eidos Montreal", "Nixxes Software"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 83, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/57dbc5ff064a6468d57fe5f2bc7bbb25-98.jpg", "descriptions": "The action of Deus Ex: Mankind Divided takes place in 2029, a couple of years after the events of Human Revolution and the infamous ‘Aug Incident’ in Panchaea that resulted in the deaths of millions at the hands of those who had installed augmentations. This event has caused a massive divideThe action of Deus Ex: Mankind Divided takes place in 2029, a couple of years after the events of Human Revolution and the infamous ‘Aug Incident’ in Panchaea that resulted in the deaths of millions at the hands of those who had installed augmentations. This event has caused a massive divide between those who have augmentations and those who don't. Amidst this emotional turmoil are various factions aiming to manipulate the public by twisting public opinion of augmentation to advance their own agenda and hide the truth of what really occurred.… Expand"}, {"name": "Bleed 2", "details_link": "https://www.metacritic.com/game/pc/bleed-2", "publisher": "BootdiskRevolution", "release_date": "Feb  8 2017", "developers": ["BootdiskRevolution"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Action", "Platformer", "2D"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/b8b3dc5665d90ba9c4c0ee8192646ae6-98.jpg", "descriptions": "Bleed 2 is a relentless arcade action game featuring air-dodging, bullet-reflecting, and tons of bosses."}, {"name": "Call of Duty: Black Ops II", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-black-ops-ii", "publisher": "Activision", "release_date": "Nov 13 2012", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Modern", "Modern", "Arcade"], "meta_score": 83, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/5/c6dfe08908ad87310ba60e41420737c9-98.jpg", "descriptions": "Call of Duty: Black Ops II injects players into a potential near future - a Twenty-First Century Cold War in which technology and weapons have merged to create a new generation of warfare. Black Ops 2 introduces players to a diabolical villain named Raul Menendez who hijacks the US militaryCall of Duty: Black Ops II injects players into a potential near future - a Twenty-First Century Cold War in which technology and weapons have merged to create a new generation of warfare. Black Ops 2 introduces players to a diabolical villain named Raul Menendez who hijacks the US military infrastructure to advance his own agenda. Take control of the power of near-future technology and next-gen robotics to pull the world back from the brink of annihilation.… Expand"}, {"name": "Madden NFL 11", "details_link": "https://www.metacritic.com/game/playstation-3/madden-nfl-11", "publisher": "Electronic Arts", "release_date": "Aug 10 2010", "developers": ["EA Tiburon"], "platforms": ["iPhone/iPad", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 83, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/4114299605b6f3e21155bbe0b9d46d46-98.jpg", "descriptions": "Madden NFL 11 promises to redefine the way you experience the game of football. SIMPLER: From 350 plays down to 1, the all-new GameFlow system puts you in the helmet of an NFL quarterback to execute an authentic, situational game plan, one play at a time. QUICKER: 60 minute game timesMadden NFL 11 promises to redefine the way you experience the game of football. SIMPLER: From 350 plays down to 1, the all-new GameFlow system puts you in the helmet of an NFL quarterback to execute an authentic, situational game plan, one play at a time. QUICKER: 60 minute game times reduced to as little as 30 minutes; spend more time on the field and less in the playbook. FULL games, HALF the time. DEEPER: Madden NFL 11 includes all-new 3-on-3 Online Team Play, improved animations, more intuitive controls, and Madden NFL Ultimate Team...all to the play-by-play of Gus Johnson. [Electronic Arts]… Expand"}, {"name": "Bushido Blade", "details_link": "https://www.metacritic.com/game/playstation/bushido-blade", "publisher": "SCEA", "release_date": "Sep 30 1997", "developers": ["Light Weight"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/3c94e6ba3cb8798de35cb02729aafbf0-98.jpg", "descriptions": "\"Bushido\" is the soul of Japan - an ancient honor code deeply followed by samurai warriors for centuries.\rPlunge into real world battles across vast 3D environments that you can run, slice and tear through.\rSword matches become unbelievably real where one critical blow is the\"Bushido\" is the soul of Japan - an ancient honor code deeply followed by samurai warriors for centuries.\rPlunge into real world battles across vast 3D environments that you can run, slice and tear through.\rSword matches become unbelievably real where one critical blow is the mean difference between death and victory.… Expand"}, {"name": "Judgment", "details_link": "https://www.metacritic.com/game/playstation-5/judgment", "publisher": "Sega", "release_date": "Apr 23 2021", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/213a37240cf329e1d768bd05f52a4c58-98.jpg", "descriptions": "From the makers of the acclaimed Yakuza series, Ryu Ga Gotoku Studio, Judgment is the dramatic tale of a disgraced lawyer seeking redemption in a world rife with corruption and despair. Investigate the seedy Red Light District of Kamurocho by stepping into the mind of private detectiveFrom the makers of the acclaimed Yakuza series, Ryu Ga Gotoku Studio, Judgment is the dramatic tale of a disgraced lawyer seeking redemption in a world rife with corruption and despair. Investigate the seedy Red Light District of Kamurocho by stepping into the mind of private detective Takayuki Yagami and utilize innovative investigation systems to uncover the secrets that lie deep within Kamurocho's corrupt underbelly. Experience visceral combat with two unique combat styles. Take down groups of thugs with sweeping blows in Crane Style, then switch to Tiger to overwhelm a single foe with a series of powerful strikes. Practice mixing-and-matching styles in combat in conjunction with a wide variety of skills, weapons, and powerful (and hilarious) EX Actions to unlock a whole new dimension in combat.… Expand"}, {"name": "NBA 2K10", "details_link": "https://www.metacritic.com/game/playstation-3/nba-2k10", "publisher": "2K Sports", "release_date": "Oct  6 2009", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/c593b2f3716daa0b402d09a1789d7e99-98.jpg", "descriptions": "NBA Today - All the real world matchups, news and stats are automatically streamed right into your game. No longer will your commentary and overlays be stale and out of date. NBA Today keeps everything fresh and up to date based upon what is really happening in the NBA. My Player Mode -NBA Today - All the real world matchups, news and stats are automatically streamed right into your game. No longer will your commentary and overlays be stale and out of date. NBA Today keeps everything fresh and up to date based upon what is really happening in the NBA. My Player Mode - Create the ultimate NBA player and guide his every career move. Start as an undrafted rookie in the Summer Circuit; work hard enough and you may get an invite to participate in an NBA team’s training camp, or you may end up in the D-League. The road to being an NBA star is a long and hard battle. Living Rosters - The 2K Insider and his team of NBA analysts continue to keep NBA 2K10 fresh with up-to-date team and player information, including roster and lineup moves, trades, injuries and player ratings.  Now track all of the changes through the season with interactive menus and analysis. Seamless Online Experience - Forget the past, with NBA2K10 online play is fully incorporated into every mode of the game. Now you can play the AI, challenge the friend sitting next to you or play your buddy across town anytime, from anywhere in the game. Signature Play - Signature Play pulls together all of NBA 2K’s player Signature Styles and adds in all-new Signature Tendencies and facial expressions, creating NBA 2K10 teams that play and react like their real life counterparts for an unbelievably realistic NBA experience. [2K Sports]… Expand"}, {"name": "NBA 2K7", "details_link": "https://www.metacritic.com/game/xbox/nba-2k7", "publisher": "2K Sports", "release_date": "Sep 25 2006", "developers": ["Kush Games", "Visual Concepts"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Xbox"], "num_players": "10  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/9bfcf464d33e3cda0aae9b68957fe428-98.jpg", "descriptions": "Be a Sharpshooter - The award winning technical achievement of 2K6 is new and improved. Take complete control of all of your shots with the shot stick. Run the Streets - Hit the street courts and showcase your playground game with completely all new streetball mode. Virtual Identity ProfileBe a Sharpshooter - The award winning technical achievement of 2K6 is new and improved. Take complete control of all of your shots with the shot stick. Run the Streets - Hit the street courts and showcase your playground game with completely all new streetball mode. Virtual Identity Profile - Learn the play style of your friends and foes with the V.I.P. System. The Association - Be the GM of your NBA team with the deepest Franchise Mode around.… Expand"}, {"name": "Resident Evil HD Remaster", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-hd-remaster", "publisher": "Capcom", "release_date": "Jan 20 2015", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Horror", "Action Adventure", "Survival"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/7bff495e8bf2089dec9dbdb40f355eb7-98.jpg", "descriptions": "In 1998 a special forces team was sent to investigate some bizarre murders on the outskirts of Raccoon City. Upon arrival they were attacked by a pack of blood-thirsty dogs and were forced to take cover in a nearby mansion. But the scent of death hung heavy in the air. Supplies were scarceIn 1998 a special forces team was sent to investigate some bizarre murders on the outskirts of Raccoon City. Upon arrival they were attacked by a pack of blood-thirsty dogs and were forced to take cover in a nearby mansion. But the scent of death hung heavy in the air. Supplies were scarce as they struggled to stay alive. … Expand"}, {"name": "Unreal Tournament III", "details_link": "https://www.metacritic.com/game/pc/unreal-tournament-iii", "publisher": "Epic Games", "release_date": "Nov 19 2007", "developers": ["Epic Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/52020eca8a26c79750092e5f3e8f1d91-98.jpg", "descriptions": "Players assume the role of a futuristic warrior engaged in contests of intense shooting battles against skilled opponents, controlled either by human contestants online or by A.I. These contests are fought with the most powerful sci-fi weapons and vehicles.Unparalleled graphical and physicalPlayers assume the role of a futuristic warrior engaged in contests of intense shooting battles against skilled opponents, controlled either by human contestants online or by A.I. These contests are fought with the most powerful sci-fi weapons and vehicles.Unparalleled graphical and physical realism from the latest Unreal Engine 3 technology delivers the most compelling First Person Shooter Experience to-date...online and offline. The weaponry is bigger and badder than ever. Destroy your opponent from a distance with the ever popular Link Gun or blast away at close range with the Bio Rifle. Battle against lightening fast A.I. in the deeper and richer single player tournament mode. Expanded Onslaught game type features two complete sets of high-tech vehicles, including the massive Leviathan, the terrifying Darkwalker, and a completely new way to get into the action...the Hoverboard. Fight side-by-side with or compete against new and returning characters from the UT franchise, all with enhanced abilities, extremely detailed looks and distinct personalities. Enhanced popular game types, including: Deathmatch, Team Deathmatch, Capture the Flag, and Instagib CTF and more. Unreal Tournament 2007 provides seamless loading on servers in addition to improved matchmaking for more evenly matched competitors. Bundled with the award-winning Unreal Engine 3 Toolset. Build your own levels, gametypes, and more, or download the latest mods from the massive Unreal community. [Midway]… Expand"}, {"name": "This War of Mine", "details_link": "https://www.metacritic.com/game/pc/this-war-of-mine", "publisher": "11 bit studios", "release_date": "Nov 14 2014", "developers": ["11 bit studios"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Miscellaneous", "Action Adventure", "Real-Time", "Survival", "Board / Card Game", "General"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/4af2c5c29b937793b447756158728786-98.jpg", "descriptions": "In This War of Mine, the focus is shifted away from military operations portrayed in most games. Instead, it is a dark survival game where players control a gaggle of civilians attempting to stay alive in a besieged city. During the day snipers outside stop you from leaving your refuge,In This War of Mine, the focus is shifted away from military operations portrayed in most games. Instead, it is a dark survival game where players control a gaggle of civilians attempting to stay alive in a besieged city. During the day snipers outside stop you from leaving your refuge, offering players time to craft, trade, upgrade their shelter, feed and cure their people. At night they must scavenge nearby areas in search for food, medicines, weapons and other useful items.… Expand"}, {"name": "Strange Horticulture", "details_link": "https://www.metacritic.com/game/pc/strange-horticulture", "publisher": "Iceberg Interactive", "release_date": "Jan 21 2022", "developers": ["Bad Viking"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 83, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/c4334b26c77da982d9269a510bb1bf1c-98.jpg", "descriptions": "Welcome to Undermere, a quaint town surrounded by hag-infested forests and rugged mountains. You are the Horticulturist, owner of local plant store Strange Horticulture. As a cast of colorful customers come by your shop, you are quickly thrust into an occult mystery stretching back hundredsWelcome to Undermere, a quaint town surrounded by hag-infested forests and rugged mountains. You are the Horticulturist, owner of local plant store Strange Horticulture. As a cast of colorful customers come by your shop, you are quickly thrust into an occult mystery stretching back hundreds of years.Strange Horticulture is an occult puzzle game in which you play as the proprietor of a local plant store. Find and identify new plants, pet your cat, speak to a coven, or join a cult. Use your collection of powerful plants to influence the story and unravel Undermere's dark mysteries.… Expand"}, {"name": "Devil Daggers", "details_link": "https://www.metacritic.com/game/pc/devil-daggers", "publisher": "Sorath", "release_date": "Feb 18 2016", "developers": ["Sorath"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 83, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/9b40af3a3a0f9a2d86cd70cd5e6a645c-98.jpg", "descriptions": "Devil Daggers is a fast-paced shooter that places you in an abyssal arena to face endless legions of demons. Armed with versatile magic daggers and a fluid movment system, fight to survive as long as you can."}, {"name": "Puyo Puyo Tetris", "details_link": "https://www.metacritic.com/game/playstation-4/puyo-puyo-tetris", "publisher": "Sega", "release_date": "Apr 25 2017", "developers": ["Sega", "Sonic Team"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Puzzle", "Stacking"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/569d33b9c10c80479662ebc2b8d97c05-98.jpg", "descriptions": "Two puzzle game juggernauts collide as Tetris, one of the largest-selling and recognized brands in gaming history, and Puyo Puyo from SEGA have combined to create a fun-to-play, fast-paced, competitive party game like no other! The game has tons of different styles of gameplay  from theTwo puzzle game juggernauts collide as Tetris, one of the largest-selling and recognized brands in gaming history, and Puyo Puyo from SEGA have combined to create a fun-to-play, fast-paced, competitive party game like no other! The game has tons of different styles of gameplay  from the single-player Adventure and Challenge modes to the ferocious competition of the up-to-four player Arcade modes. There's plenty of Tetris/Puyo variety, even an in-game Shop where players can unlock new characters, new skins for Puyos and Tetriminos, new backgrounds and more.\r Features:\r *    Adventure  Single-player mode offers ten unique acts, each with ten stages featuring different characters from the Puyo Puyo and Tetris universes. Each stage contains unique challenges players will need to overcome in order to win and move on!\r*    Multiplayer Arcade  For up to four local players, Multiplayer Arcade offers a wealth of variety that will bring out players' competitive nature!\r*    Online  Players can try their puzzle skills on a global scale by playing any of the multiplayer modes with up to four players online, in Puzzle League or Free Play modes.\r*    Solo Arcade  Play any of the Multiplayer Arcade modes against the CPU in Battle or Endurance matches, or try the single-player Challenges!… Expand"}, {"name": "Dark Souls II: Crown of the Old Iron King", "details_link": "https://www.metacritic.com/game/playstation-3/dark-souls-ii-crown-of-the-old-iron-king", "publisher": "Namco Bandai Games", "release_date": "Aug 26 2014", "developers": ["From Software"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/bd06a6fabe27308f9f41bb2080581c04-98.jpg", "descriptions": "Crown of the Old Iron King features an entirely different world within the Dark Souls II universe where players will venture into a massive tower swamped by black mist where flames, smoke and sorcery sadistically lurk."}, {"name": "NBA Ballers", "details_link": "https://www.metacritic.com/game/playstation-2/nba-ballers", "publisher": "Midway", "release_date": "Apr  5 2004", "developers": ["Midway"], "platforms": "PlayStation 2", "num_players": "1-3 ", "genres": ["Sports", "Traditional", "Basketball", "Arcade"], "meta_score": 83, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/ab50330235430bbb1add2462c545e0c8-98.jpg", "descriptions": "NBA Ballers is the exclusive one-on-one basketball videogame highlighting the \"bling-bling\" lifestyle of NBA Superstars; chromed-out cars, ice, ladies, tatts and jets all hinge on the killer cross-over. NBA Ballers also features NBA Legends dropping dimes and dunking in your grill toNBA Ballers is the exclusive one-on-one basketball videogame highlighting the \"bling-bling\" lifestyle of NBA Superstars; chromed-out cars, ice, ladies, tatts and jets all hinge on the killer cross-over. NBA Ballers also features NBA Legends dropping dimes and dunking in your grill to determine who is the greatest baller of all time. 60+ NBA Players: Including Kobe Bryant, Vince Carter, Allen Iverson, Kevin Garnett, Shaquille O?Neal, Yao Ming, Steve Francis, Chris Webber, Gary Payton, Latrell Sprewell, and more! 24 NBA Legends: Including Rick Barry, Larry Bird, Wilt Chamberlain, Clyde Drexler, Julius Irving, Magic Johnson, Bill Russell, Jerry West, James Worthy, and more! [Midway]… Expand"}, {"name": "Genma Onimusha", "details_link": "https://www.metacritic.com/game/xbox/genma-onimusha", "publisher": "Capcom", "release_date": "Jan 28 2002", "developers": ["Capcom"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/93c84ed37cea41a357b76429d2b9f315-98.jpg", "descriptions": "In a hillside castle surrounded by the chaos of war, strange disappearances are occurring and the noble Princess Yuki fears for her life. One lone swordsman, Samanosuke heeds the princess's call for help and rushes to her side, only to find she has mysteriously vanished. Outside the fortressIn a hillside castle surrounded by the chaos of war, strange disappearances are occurring and the noble Princess Yuki fears for her life. One lone swordsman, Samanosuke heeds the princess's call for help and rushes to her side, only to find she has mysteriously vanished. Outside the fortress walls, enemy troops attack the attack the castle and now Samanosuke must stand by his vow to avenge the princess and defeat a legion of demon warriors.… Expand"}, {"name": "Space Station Silicon Valley", "details_link": "https://www.metacritic.com/game/nintendo-64/space-station-silicon-valley", "publisher": "Take-Two Interactive", "release_date": "Oct 21 1998", "developers": ["DMA Design"], "platforms": "Nintendo 64", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/84f37b9a5b53733cf7fe5ecd7f1dbc5a-98.jpg", "descriptions": "Silicon Valley was intended to be the most technologically advanced amusement park civilization has ever known. Shortly after take-off, it disappeared. Now, in the year 3000, it's back and on a collision course with Earth! It's up to you to conquer the 30 levels in four incredibly lavishSilicon Valley was intended to be the most technologically advanced amusement park civilization has ever known. Shortly after take-off, it disappeared. Now, in the year 3000, it's back and on a collision course with Earth! It's up to you to conquer the 30 levels in four incredibly lavish environments, take control of the totally original, wacky and - at times - life threatening characters and unlock the mysteries of the Valley. It's all great fun but remember, the fate of the world is in your hands!… Expand"}, {"name": "Persona 4 Arena", "details_link": "https://www.metacritic.com/game/xbox-360/persona-4-arena", "publisher": "Atlus", "release_date": "Aug  7 2012", "developers": ["Arc System Works"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 83, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/8/3e66d448431ba9302a2d854ba6af662a-98.jpg", "descriptions": "Persona 4 Arena uses hand-drawn, high definition 2D anime-style fighters and colorful, over-the-top special effects to bring to life a roster of fighters from Persona 3 and Persona 4."}, {"name": "Two Point Campus", "details_link": "https://www.metacritic.com/game/pc/two-point-campus", "publisher": "Sega", "release_date": "Aug  9 2022", "developers": ["Two Point Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/765a61eba9a589277af9a861d97df2aa-98.jpg", "descriptions": "Build the university of your dreams with Two Point Campus, the sim with a twist from the makers of Two Point Hospital. Build, hire staff and run an academic institution packed with wild courses. Rather than typical academic fare, students in Two Point County enjoy a range of wild andBuild the university of your dreams with Two Point Campus, the sim with a twist from the makers of Two Point Hospital. Build, hire staff and run an academic institution packed with wild courses. Rather than typical academic fare, students in Two Point County enjoy a range of wild and wonderful courses: from Knight School (hey, we all have to learn jousting at some point in our lives), to the salivatory Gastronomy, where your students will build mouth-watering concoctions like giant pizzas and enormous pies.\r Get to know your students, explore their individual personalities, wants and needs. Keep them happy with clubs, societies, gigs. Surround them with friends, help them develop relationships, furnish them with pastoral care and ensure they have the right amount of joie de vivre to develop into incredible individuals who will do the legacy of your university proud.… Expand"}, {"name": "The Elder Scrolls Online: Summerset", "details_link": "https://www.metacritic.com/game/pc/the-elder-scrolls-online-summerset", "publisher": "Bethesda Softworks", "release_date": "May 21 2018", "developers": ["ZeniMax Media"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 83, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/3e7503df4d111914db11e7d99fbc1d08-98.jpg", "descriptions": "The Elder Scrolls Online: Summerset is the next Chapter of ZeniMax Online Studios' award-winning online RPG, The Elder Scrolls Online (ESO). This new adventure in the ESO saga will send adventurers and their friends to the Summerset Isle, to visit and explore the ancestral home of the highThe Elder Scrolls Online: Summerset is the next Chapter of ZeniMax Online Studios' award-winning online RPG, The Elder Scrolls Online (ESO). This new adventure in the ESO saga will send adventurers and their friends to the Summerset Isle, to visit and explore the ancestral home of the high elves for the first time since 1994's The Elder Scrolls: Arena. Players will also be able to explore the island of Artaeum, home to the mysterious Psijic Order, a group of sages that predate the Mages Guild. Tamriel's fate hangs in the balance and the heroes of ESO are called upon to save the world once more. This year's Chapter introduces an enormous and stunning new zone unlike any other, a fresh skill line with new magical powers to master, an expanded crafting system to forge powerful gear, and the continuation of the epic and award-winning ESO story. With more than 30 hours of new story content to experience, The Elder Scrolls Online: Summerset expands The Elder Scrolls Online in exciting and innovative ways, offering incredible adventures for both ESO veterans and those new to the game.… Expand"}, {"name": "The Blackwell Epiphany", "details_link": "https://www.metacritic.com/game/pc/the-blackwell-epiphany", "publisher": "Wadjet Eye Games", "release_date": "Apr 24 2014", "developers": ["Wadjet Eye Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "General", "Adventure", "Point-and-Click"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/c072a75e178c07847e9238f0f040f6e4-98.jpg", "descriptions": "A dead man’s soul cries out against the force of a ferocious blizzard. He cries for help. He cries for answers. Then he screams as he is torn apart like damp tissue paper. This wasn’t the first time, and it won’t be the last. The police are powerless to stop it, so the duty falls to the onlyA dead man’s soul cries out against the force of a ferocious blizzard. He cries for help. He cries for answers. Then he screams as he is torn apart like damp tissue paper. This wasn’t the first time, and it won’t be the last. The police are powerless to stop it, so the duty falls to the only ones who can. What force could be so powerful – and so malevolent – that it would destroy the very core of a life in order to get what it wants? Rosa Blackwell and Joey Mallone mean to find out, even if it means risking themselves in the process. … Expand"}, {"name": "The Lord of the Rings Online: Siege of Mirkwood", "details_link": "https://www.metacritic.com/game/pc/the-lord-of-the-rings-online-siege-of-mirkwood", "publisher": "Turbine Inc.", "release_date": "Dec  1 2009", "developers": ["Turbine Inc."], "platforms": "PC", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/3b8f4a27ccfe98fa2a875dcd2f70d078-98.jpg", "descriptions": "The Epic Conclusion to Volume II: Mines of Moria -  Under the command of Celeborn and Galadriel, players fight through vast armies of Orcs alongside the Elves of Lórien in a battle that will take them to Dol Guldur, the fortress of the Ringwraiths.  This update includes Book 9 and theThe Epic Conclusion to Volume II: Mines of Moria -  Under the command of Celeborn and Galadriel, players fight through vast armies of Orcs alongside the Elves of Lórien in a battle that will take them to Dol Guldur, the fortress of the Ringwraiths.  This update includes Book 9 and the Epilogue to the sweeping epic tale begun with the award-winning Mines of Moria expansion. Increased Level Cap - Players are able advance their characters up to level 65, gaining access to new traits, virtues, skills and class quests. Answer the Call of War! - Jump into the heat of battle with the new Skirmishes feature.  Skirmishes offer endless action in repeatable, randomized instances where players can create and lead customizable soldiers into battle, training them to greater skill as they earn victories against the forces of shadow.  Answer the call of war wherever violence erupts with the new \"World Join\" function that lets players and their fellowships band together to fight in various locations throughout Middle-earth. Take up Arms! Infiltrate the dark jails, deadly arenas and savage stables of Dol Guldur, the fortress of the Ringwraiths, and strike a blow against Sauron’s forces in new 3 and 6-player instances.  Call upon your fellows to adventure into the most deadly 12-player raid yet and face the ultimate challenge - the Nazgûl Lord! Major Gameplay Enhancements - Turbine continues to improve the award-winning experience of LOTRO with major improvements to the combat and Legendary Items systems.  Players will experience improved responsiveness when in the heat of battle.  Players will also be able to create and craft their own customized Second and Third Age Legendary Items from raw materials and grow their weapons’ power to level 60.  Achieve new Legacies, new titles, and a fourth Runic slot that will make Legendary Items even more unique and powerful. [Turbine]… Expand"}, {"name": "Sine Mora", "details_link": "https://www.metacritic.com/game/xbox-360/sine-mora", "publisher": "Microsoft Game Studios", "release_date": "Mar 21 2012", "developers": ["Digital Reality", "Grasshopper Manufacture"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/ca31e630b555eadaf2874b6c8ee43a0d-98.jpg", "descriptions": "SINE MORA is a horizontal shoot'em up that provides a unique take on challenge, where time is the ultimate factor. Mixing classic shooter sensibilities with contemporary presentation, SINE MORA is a shmup that offers a Story Mode that weaves an over-the-top tale and an Arcade Mode thatSINE MORA is a horizontal shoot'em up that provides a unique take on challenge, where time is the ultimate factor. Mixing classic shooter sensibilities with contemporary presentation, SINE MORA is a shmup that offers a Story Mode that weaves an over-the-top tale and an Arcade Mode that provides deep, satisfying gameplay to challenge fans of the genre. With many ways to manipulate time, SINE MORA features over 60 weapon combinations to complete each beatifully-crafted stage that form fits to the player's skills with scaling difficulty. Soundtrack composed by Akira Yamaoka and featuring boss designs by Mahiro Maeda. [Microsoft]… Expand"}, {"name": "One Finger Death Punch 2", "details_link": "https://www.metacritic.com/game/pc/one-finger-death-punch-2", "publisher": "Silver Dollar Games", "release_date": "Apr 15 2019", "developers": ["Silver Dollar Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Fighting", "2D"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/494047e19518defb0f2b11a426a088b5-98.jpg", "descriptions": "The world's fastest brawler is back. Experience cinematic kung-fu in the most epic stickman fighter ever made. Staying true to the original, you play with only two buttons. Every press matters, do not button mash!"}, {"name": "Retro City Rampage DX", "details_link": "https://www.metacritic.com/game/3ds/retro-city-rampage-dx", "publisher": "Vblank Entertainment Inc.", "release_date": "Feb  6 2014", "developers": ["Vblank Entertainment Inc."], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox 360", "3DS"], "genres": ["Action Adventure", "Adventure", "Modern", "3D", "Open-World", "Third-Person", "Modern"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/dd61f2778f626ff26d26dbfd6f0c444d-98.jpg", "descriptions": "A parody of the open-world action genre, Retro City Rampage takes modern game mechanics and mashes them into an authentic 8-bit experience. It's one half fast paced arcade game, the other half a hilarious story mode! It's all the driving and shooting you'd expect and a whole lot more! WithA parody of the open-world action genre, Retro City Rampage takes modern game mechanics and mashes them into an authentic 8-bit experience. It's one half fast paced arcade game, the other half a hilarious story mode! It's all the driving and shooting you'd expect and a whole lot more! With missions that twist pages straight from classic game experiences, you get to re-live and rewrite history in a way only a modern anti-hero could! When it comes to enemies, weapons are only the beginning! Put on your boots and jump on their heads! Toss 'em around to knock the rest down! Become truly unstoppable with awesome power-ups! Through its world, characters and missions, Retro City Rampage lampoons the entire 8-bit era from its games to the TV, movies and pop culture!… Expand"}, {"name": "Out of the Park Baseball 10", "details_link": "https://www.metacritic.com/game/pc/out-of-the-park-baseball-10", "publisher": "Out Of The Park Developments", "release_date": "Jun  2 2009", "developers": ["Out Of The Park Developments"], "platforms": "PC", "genres": ["Sports", "Traditional", "Baseball", "Management"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/0b41b47bdc234fb8ca5b3e11b505d41c-98.jpg", "descriptions": "Out of the Park Baseball 10 (\"OOTP 10\"), the latest in the award-winning series, is the most immersive, realistic, and customizable baseball management simulation game on the market today. OOTP 10 provides what fantasy baseballers truly desire - the ability to control every aspect of aOut of the Park Baseball 10 (\"OOTP 10\"), the latest in the award-winning series, is the most immersive, realistic, and customizable baseball management simulation game on the market today. OOTP 10 provides what fantasy baseballers truly desire - the ability to control every aspect of a baseball team. With online or solo play, real Major League rosters, historical simulations, and purely fictional leagues, OOTP 10 has all of the bases covered! [Out of the Park Developments]… Expand"}, {"name": "Need for Speed: Shift", "details_link": "https://www.metacritic.com/game/xbox-360/need-for-speed-shift", "publisher": "EA Games", "release_date": "Sep 15 2009", "developers": ["Slightly Mad Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 83, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/a24fe2b1891d01a33eae4196de2e3693-98.jpg", "descriptions": "Need for Speed SHIFT brings a true driver's experience to some of the world's most iconic racing tracks, including the storied Brand's Hatch in the UK. The game also features the largest roster of high-performance cars in Need for Speed history including race cars such as the Pagani Zonda F,Need for Speed SHIFT brings a true driver's experience to some of the world's most iconic racing tracks, including the storied Brand's Hatch in the UK. The game also features the largest roster of high-performance cars in Need for Speed history including race cars such as the Pagani Zonda F, Porsche 911 GT2 and Lotus Elise. Players are thrust into the loud, intense, and athletic experience of racing a car from the driver's perspective through the combination of perception based G-forces, the hyper reality of the cockpit view, and the all-new brutally disorienting crash dynamic. Need for Speed SHIFT features an accurate, accessible physics-based driving model that allows you to feel every impact, every change of track surface and every last bit of grip as you push yourself to the edge. [Electronic Arts]… Expand"}, {"name": "Colin McRae Rally 2005", "details_link": "https://www.metacritic.com/game/xbox/colin-mcrae-rally-2005", "publisher": "Codemasters", "release_date": "Sep 28 2004", "developers": ["Codemasters"], "platforms": ["PC", "Xbox"], "num_players": "8  Online", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/0ebfbf6e15f755f9c852d11cd36cba84-98.jpg", "descriptions": "Colin McRae Rally 2005 offers more than 300 stages, enhanced vehicles, and the chance to race against the very best in rally racing. At the heart of the game is the all-new Career Challenge, which takes you through a full professional rally career as you drive a diverse selection of rallyColin McRae Rally 2005 offers more than 300 stages, enhanced vehicles, and the chance to race against the very best in rally racing. At the heart of the game is the all-new Career Challenge, which takes you through a full professional rally career as you drive a diverse selection of rally cars. Through the game's 23 events, you can drive cars including 4-wheel drive, 2-wheel drive, 4-wheel Classics, Super 2-wheel, Rear Wheel, Distinctive and 4x4 classics. Each rally event provides different challenges through a series of Cups, SuperCups, Shields, and Championships. … Expand"}, {"name": "Crash Bandicoot 4: It's About Time", "details_link": "https://www.metacritic.com/game/xbox-one/crash-bandicoot-4-its-about-time", "publisher": "Activision", "release_date": "Oct  2 2020", "developers": ["Toys for Bob"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/7e5db2d319715754ab05c123a12e4668-98.jpg", "descriptions": "The devious villains Neo Cortex and Dr. N. Tropy have finally escaped their interdimensional prison, leaving an evil scientist sized hole in the universe. Now they’ve got their eyes set on not only simply conquering this dimension, but ALL dimensions, and it’s up to Crash and Coco to saveThe devious villains Neo Cortex and Dr. N. Tropy have finally escaped their interdimensional prison, leaving an evil scientist sized hole in the universe. Now they’ve got their eyes set on not only simply conquering this dimension, but ALL dimensions, and it’s up to Crash and Coco to save the day. N. Sanity Beach is where Crash’s adventure first started, and where it begins in Crash 4. But there have definitely been changes since players first saw N. Sanity Beach all those years ago, and throughout Crash 4 you’ll notice changes to gameplay and even the art style. … Expand"}, {"name": "Tomb Raider: Anniversary", "details_link": "https://www.metacritic.com/game/pc/tomb-raider-anniversary", "publisher": "Eidos Interactive", "release_date": "Jun  5 2007", "developers": ["Nixxes Software"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Linear"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/9c11387964ac5e6a86cac43205ba1f12-98.jpg", "descriptions": "Inspired by the first Tomb Raider videogame, originally released in 1996, Lara Croft Tomb Raider: Anniversary is a totally new 2006 adventure for Lara, faithfully preserving the elements which made the original Tomb Raider such a classic. Using an enhanced \"Tomb Raider Legend\" game engine,Inspired by the first Tomb Raider videogame, originally released in 1996, Lara Croft Tomb Raider: Anniversary is a totally new 2006 adventure for Lara, faithfully preserving the elements which made the original Tomb Raider such a classic. Using an enhanced \"Tomb Raider Legend\" game engine, the graphics, technology and physics bring Lara's adventure and pursuit of a mystical artefact known only as the Scion up to today’s technology standards and offer gamers a completely new gameplay experience. The puzzles are now more in depth and incorporate environmental interaction and physics driven solutions. The level design and flow of gameplay are inspired by the original videogame making Lara Croft Tomb Raider: Anniversary a brand new experience in gaming, while still invoking the nostalgia of the first adventure in Tomb Raiding. [Eidos Interactive]… Expand"}, {"name": "Need for Speed: Most Wanted (2005)", "details_link": "https://www.metacritic.com/game/xbox-360/need-for-speed-most-wanted-2005", "publisher": "Electronic Arts", "release_date": "Nov 16 2005", "developers": ["EA Canada"], "platforms": ["PC", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/3020a1f7fffcb17bee900ccec533a6d6-98.jpg", "descriptions": "Combining the thrill of illicit street racing and tuner customization with the intensity of strategic police pursuits that rivals any Hollywood-style chase scene, Need for Speed Most Wanted challenges players to become the most notorious and elusive street racer. Players instantly feel theCombining the thrill of illicit street racing and tuner customization with the intensity of strategic police pursuits that rivals any Hollywood-style chase scene, Need for Speed Most Wanted challenges players to become the most notorious and elusive street racer. Players instantly feel the thrill of the ride as they hit the streets in an open world environment where drivers can tune their cars to compete against any class of vehicles or use their wits to out-fox the law to satisfy their need for speed. Need for Speed Most Wanted delivers a unique, fast-paced and gripping ride in the racing genre as players build up their Rap Sheet and street cred to move their way up the Black List to become the most wanted racer on the streets. Players go head-to-head with the top drivers on the scene as well as strategically evade more than half dozen cops at any one time. Also included are a dynamic open world, new gameplay and customization as well as tuners, supercars, muscles and sports cars. [Electronic Arts]… Expand"}, {"name": "Bangai-O Spirits", "details_link": "https://www.metacritic.com/game/ds/bangai-o-spirits", "publisher": "D3Publisher", "release_date": "Aug 12 2008", "developers": ["Treasure"], "platforms": "DS", "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/2543276e71a225bfd6f46c0d0e9f2ca0-98.jpg", "descriptions": "Bangai-O Spirits provides gamers with addictive shooter gameplay, punishing supermoves and a sensory overload of fireworks onscreen, with strategic and tactical elements and TREASURE’s quirky design style. The game also offers co-op, competitive multiplayer for 1-4 players via localBangai-O Spirits provides gamers with addictive shooter gameplay, punishing supermoves and a sensory overload of fireworks onscreen, with strategic and tactical elements and TREASURE’s quirky design style. The game also offers co-op, competitive multiplayer for 1-4 players via local wireless, a powerful level editor tool which allows players to edit in-game levels or create new ones from scratch, and the revolutionary new ability to transfer data among DS systems through sound data transfer technology known as Sound Load. Never before utilized for DS systems, the Sound Load technology in Bangai-O Spirits allows players to transfer level data among DS handheld systems via the use of sound and the DS microphone. This technology works by taking the level data and turning it into a sound file which is output through the host DS speaker. This data is then interpreted through the microphone of the recipient DS, and the level transfer is complete. It is also possible to upload and circulate sound files of level data from Bangai-O Spirits online via the Internet, or to save files to a recording device like a PC or jump drive for transport and distribution, allowing gamers to catalog, share and compare levels online easily with gamers all over the world! Widening the range of play and interaction even further, gamers can also deliver high score and gameplay footage as transferable sound files by using Sound Load. [D3Publisher of America]… Expand"}, {"name": "The Forest (2014)", "details_link": "https://www.metacritic.com/game/pc/the-forest-2014", "publisher": "SKS Games", "release_date": "Apr 30 2018", "developers": ["SKS Games", "Endnight Studios"], "platforms": ["PlayStation 4", "PC"], "num_players": "2 ", "genres": ["Horror", "Horror", "Action Adventure", "Survival"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/498bf8f5f424378ddd7b642f67d36b66-98.jpg", "descriptions": "As the lone survivor of a passenger jet crash, you find yourself in a mysterious forest battling to stay alive against a society of cannibalistic mutants. Build, explore, survive in this terrifying first person survival horror simulator."}, {"name": "Tekken Tag Tournament 2: Wii U Edition", "details_link": "https://www.metacritic.com/game/wii-u/tekken-tag-tournament-2-wii-u-edition", "publisher": "Namco Bandai Games", "release_date": "Nov 18 2012", "developers": ["Namco Bandai Games"], "platforms": ["PlayStation 3", "Xbox 360", "Wii U"], "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/3d2783d7c385ba322b451d8a64472e0a-98.jpg", "descriptions": "For the first time on any Nintendo console - Tekken Tag Tournament 2 promises to deliver completely updated features and the most comprehensive Tekken experience to date. Play with the largest Tekken roster ever, in all new stages, utilizing fully re-engineered multiplayer functionality forFor the first time on any Nintendo console - Tekken Tag Tournament 2 promises to deliver completely updated features and the most comprehensive Tekken experience to date. Play with the largest Tekken roster ever, in all new stages, utilizing fully re-engineered multiplayer functionality for optimum online matches. Enjoy exclusive Wii U features including special battle modes and exclusive costumes. Play like a pro with easy shortcuts on the Gamepad.… Expand"}, {"name": "Call of Duty: Modern Warfare Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-modern-warfare-remastered", "publisher": "Activision", "release_date": "Nov  4 2016", "developers": ["Infinity Ward"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 18 ", "genres": ["Arcade", "Action", "Shooter", "First-Person", "Tactical"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/3ac1af95da2ec907a72d135dad819765-98.jpg", "descriptions": "Call of Duty: Modern Warfare is back, remastered in true high-definition, featuring improved textures, physically based rendering, high-dynamic range lighting and much more. Relive one of the most iconic campaigns in history, as you are transported around the globe, including fan favoriteCall of Duty: Modern Warfare is back, remastered in true high-definition, featuring improved textures, physically based rendering, high-dynamic range lighting and much more. Relive one of the most iconic campaigns in history, as you are transported around the globe, including fan favorite missions \"All Ghillied Up,\" \"Mile High Club,\" and \"Crew Expendable.\" You'll suit up as unforgettable characters Sgt. John \"Soap\" MacTavish, Capt. John Price and more, as you battle a rogue enemy group across global hot spots from Eastern Europe and rural Russia, all the way to the Middle East. Through an engaging narrative full of twists and turns, call on sophisticated technology and superior firepower as you coordinate land and air strikes on a battlefield where speed and accuracy are essential to victory.  Additionally, team up with your friends in the online mode that redefined Call of Duty by introducing kill streaks, XP, Prestige and more in customizable, classic multiplayer modes.… Expand"}, {"name": "Need for Speed: Shift", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-shift", "publisher": "EA Games", "release_date": "Sep 15 2009", "developers": ["Slightly Mad Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 83, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/f2341bccd2542efd50084192876057bd-98.jpg", "descriptions": "Need for Speed SHIFT brings a true driver's experience to some of the world's most iconic racing tracks, including the storied Brand's Hatch in the UK. The game also features the largest roster of high-performance cars in Need for Speed history including race cars such as the Pagani Zonda F,Need for Speed SHIFT brings a true driver's experience to some of the world's most iconic racing tracks, including the storied Brand's Hatch in the UK. The game also features the largest roster of high-performance cars in Need for Speed history including race cars such as the Pagani Zonda F, Porsche 911 GT2 and Lotus Elise. Players are thrust into the loud, intense, and athletic experience of racing a car from the driver's perspective through the combination of perception based G-forces, the hyper reality of the cockpit view, and the all-new brutally disorienting crash dynamic. Need for Speed SHIFT features an accurate, accessible physics-based driving model that allows you to feel every impact, every change of track surface and every last bit of grip as you push yourself to the edge. [Electronic Arts]… Expand"}, {"name": "MLB The Show 20", "details_link": "https://www.metacritic.com/game/playstation-4/mlb-the-show-20", "publisher": "SCEE", "release_date": "Mar 13 2020", "developers": ["SCEA San Diego Studios"], "platforms": "PlayStation 4", "num_players": "Online Multiplayer", "genres": ["Sports", "Team", "Baseball", "Sim"], "meta_score": 83, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/d84d93fa6982b4419fd0357c03a45882-98.jpg", "descriptions": "Run the table and rake in rewards with brand new mode “Showdown”. A new experience and updates throughout DD make Diamond Dynasty the best version yet."}]