[{"name": "Cannon Spike", "details_link": "https://www.metacritic.com/game/dreamcast/cannon-spike", "publisher": "Capcom", "release_date": "Nov 14 2000", "developers": ["Psikyo"], "platforms": "Dreamcast", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 73, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/520aee3a5c578f4c237b3a4b1a43c40a-98.jpg", "descriptions": "Far into the future, a rogue group of terrorist robots wreak havoc on the world and it's citizens. The Anti Robot Squad Special Forces has been created to overthrow these radical robots. With an arsenal of weapons and high-powered Motor Boots, you must lead a courageous legion of sevenFar into the future, a rogue group of terrorist robots wreak havoc on the world and it's citizens. The Anti Robot Squad Special Forces has been created to overthrow these radical robots. With an arsenal of weapons and high-powered Motor Boots, you must lead a courageous legion of seven members through multiple levels of robotic terror, huge bosses and other evils. Prepare yourself for the ultimate in speed, strategy and firepower.… Expand"}, {"name": "Blair Witch Volume I: Rustin Parr", "details_link": "https://www.metacritic.com/game/pc/blair-witch-volume-i-rustin-parr", "publisher": "Gathering", "release_date": "Oct  4 2000", "developers": ["Terminal Reality"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/3e78c4eaebfe7d8166954bc01e1765c4-98.jpg", "descriptions": "This first of three Blair Witch adventures pits Spookhouse agent Doc Holliday against the demons that drove hermit Rustin Parr to brutally torture and murder seven children. Along the way, she will have to interact with horror-stricken townspeople and investigate ancient Native AmericanThis first of three Blair Witch adventures pits Spookhouse agent Doc Holliday against the demons that drove hermit Rustin Parr to brutally torture and murder seven children. Along the way, she will have to interact with horror-stricken townspeople and investigate ancient Native American legends and rituals.  [Gathering of Developers]… Expand"}, {"name": "LEGO Pirates of the Caribbean: The Video Game", "details_link": "https://www.metacritic.com/game/xbox-360/lego-pirates-of-the-caribbean-the-video-game", "publisher": "Disney Interactive Studios", "release_date": "May 10 2011", "developers": ["Traveller's Tales"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/0d7152c34efc311dafe155805d10eb7d-98.jpg", "descriptions": "LEGO Pirates of the Caribbean: The Video Game will be based in the world of the globally successful film franchise, incorporating storylines, locations and characters from the first three films (\"Pirates of the Caribbean: The Curse of the Black Pearl,\" \"Pirates of theLEGO Pirates of the Caribbean: The Video Game will be based in the world of the globally successful film franchise, incorporating storylines, locations and characters from the first three films (\"Pirates of the Caribbean: The Curse of the Black Pearl,\" \"Pirates of the Caribbean: Dead Man's Chest\" and \"Pirates of the Caribbean: At World's End\") as well as the upcoming fourth film, \"Pirates of the Caribbean: On Stranger Tides.\" … Expand"}, {"name": "Call of Duty: Vanguard", "details_link": "https://www.metacritic.com/game/playstation-5/call-of-duty-vanguard", "publisher": "Activision", "release_date": "Nov  4 2021", "developers": ["Sledgehammer Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 73, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/4/68d614de8caec0050c2ae002305cd24a-98.jpg", "descriptions": "This is WWII combat like never before. Witness the origins of Special Forces as you play a pivotal role and change the face of history, forming Task Force One in a gripping Campaign across four major theaters of war. Become an original Special Forces Operator in an online Multiplayer rich inThis is WWII combat like never before. Witness the origins of Special Forces as you play a pivotal role and change the face of history, forming Task Force One in a gripping Campaign across four major theaters of war. Become an original Special Forces Operator in an online Multiplayer rich in innovation with 20 maps available at launch. Prepare for a franchise-first, universe-expanding Zombies crossover. Immerse yourself in a fully integrated Call of Duty®: Warzone™ experience featuring a new and massive map. This is the most connected Call of Duty ever, all powered by the next generation Call of Duty® engine introduced in Modern Warfare.… Expand"}, {"name": "Strong Bad's Cool Game for Attractive People Episode 1: Homestar Ruiner", "details_link": "https://www.metacritic.com/game/pc/strong-bads-cool-game-for-attractive-people-episode-1-homestar-ruiner", "publisher": "Telltale Games", "release_date": "Aug 11 2008", "developers": ["Telltale Games"], "platforms": ["PlayStation 3", "PC"], "num_players": "1 Player", "genres": ["Miscellaneous", "Adventure", "General", "Compilation"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/be95404a50faf9d5a61f3d26d2823443-98.jpg", "descriptions": "When Strong Bad's plans to beat the snot out of Homestar backfire, he ends up with an unwanted houseguest cramping his style. Now he needs to get life back to normal, by any means possible. [TellTale Games]"}, {"name": "Outriders", "details_link": "https://www.metacritic.com/game/playstation-5/outriders", "publisher": "Square Enix", "release_date": "Apr  1 2021", "developers": ["People Can Fly"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 73, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/7feae3e81c808ee5b4469ff8e4c33f9b-98.jpg", "descriptions": "Outriders is a 1-3 player co-op RPG shooter set in an original, dark and desperate sci-fi universe. As mankind bleeds out in the trenches of Enoch, you'll create your own Outrider and embark on a journey across the hostile planet. With rich storytelling spanning a diverse world, you'll leaveOutriders is a 1-3 player co-op RPG shooter set in an original, dark and desperate sci-fi universe. As mankind bleeds out in the trenches of Enoch, you'll create your own Outrider and embark on a journey across the hostile planet. With rich storytelling spanning a diverse world, you'll leave behind the slums and shanty towns of the First City and traverse forests, mountains and desert in the pursuit of a mysterious signal. Combining intense gunplay with violent powers and an arsenal of increasingly twisted weaponry and gear-sets, Outriders offers countless hours of gameplay from one of the finest shooter developers in the industry People Can Fly.… Expand"}, {"name": "Crysis Remastered Trilogy", "details_link": "https://www.metacritic.com/game/playstation-4/crysis-remastered-trilogy", "publisher": "Crytek", "release_date": "Oct 15 2021", "developers": ["Crytek"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/b74ef256dec1266fb3680350f5049095-98.jpg", "descriptions": "The classic first person shooter from Crytek is back with the action packed gameplay, sandbox world, and thrilling epic battles you loved the first time around. Crysis Remastered Trilogy includes each of the single player campaigns from the legendary first person shooters Crysis, Crysis 2,The classic first person shooter from Crytek is back with the action packed gameplay, sandbox world, and thrilling epic battles you loved the first time around. Crysis Remastered Trilogy includes each of the single player campaigns from the legendary first person shooters Crysis, Crysis 2, and Crysis 3, optimized for today's hardware. Relive the adventure in this great value all in one bundle.Features:* Crysis Remastered: What begins as a simple rescue mission becomes the battleground of a new war as alien invaders swarm over a chain of Lingshan islands. Playing as super soldier Nomad, you are armed with a powerful Nanosuit equipped with Speed, Strength, Armor, and Cloaking abilities. Use avast arsenal of modular weaponry and adapt your tactics and gear to dominate enemies in an enormous sandbox world.* Crysis 2 Remastered: Aliens have returned to a world ravaged by climate disasters. As the invaders lay waste to New York and begin an assault that threatens the total annihilation of humankind, only you have the technology to lead the fightback. Equipped with the upgraded Nanosuit 2.0, customize your suit and weapons in real time and unlock powerful new abilities in the battle for humanity's survival.* Crysis 3 Remastered: Returning to the fight as super soldier Prophet, the search for the alien Alpha Ceph continues, but now you must also expose the truth behind the C.E.L.L. corporation, which has turned New York City into a sprawling urban rainforest sheltered by a giant nanodome. Fight through seven distinct districts and decimate your opponents in a blaze of brute force using the Nanosuit's superior technology, or use stealth to achieve your goals and become humanity's silent savior. Equipped with your powerful and deadly new Predator Bow, there's no wrong way to save the world.… Expand"}, {"name": "Titanfall: Expedition", "details_link": "https://www.metacritic.com/game/xbox-one/titanfall-expedition", "publisher": "Electronic Arts", "release_date": "May 15 2014", "developers": ["Respawn Entertainment"], "platforms": ["PC", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 73, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/6/0305bec3ca6b9a895a4db1d4b73ea5b1-98.jpg", "descriptions": "Titanfall: Expedition introduces three new maps to the Frontier – Runoff, Swampland and War Games."}, {"name": "RACE On", "details_link": "https://www.metacritic.com/game/pc/race-on", "publisher": "Viva Media", "release_date": "Oct  5 2009", "developers": ["SimBin"], "platforms": "PC", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/605a6ca655b703628c5f824f4e40eadf-98.jpg", "descriptions": "This is a race of skill, endurance, and a little something called guts! Race On combines the excitement of the World Touring Car Championship (WTCC), Formula and US Muscle Cars all in one of the most realistic simulations ever created. From bug splats to precise shift points, we've heldThis is a race of skill, endurance, and a little something called guts! Race On combines the excitement of the World Touring Car Championship (WTCC), Formula and US Muscle Cars all in one of the most realistic simulations ever created. From bug splats to precise shift points, we've held nothing back. Flash some American muscle and discover firsthand why Cadillac’s CTS-V makes lesser cars whimper. Conquer three continents of opponents and take your victory lap in the U.S. of A. Don't miss the complete FIA WTCC ’08 season (one of the most exciting touring car seasons in history) recreated in brilliant detail. [Viva Media]… Expand"}, {"name": "Life is Strange 2: Episode 2 - Rules", "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-2-episode-2---rules", "publisher": "Square Enix", "release_date": "Jan 24 2019", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 73, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/352c2a073f7b651368bc00c9c687ef72-98.jpg", "descriptions": "The two brothers continue their journey into the winter months & struggle against the cold. As Daniel gradually falls ill, Sean decides they must make their way to their distant grandparent’s house to recover. During their stay, they encounter next-door neighbor Chris, a young boy whoThe two brothers continue their journey into the winter months & struggle against the cold. As Daniel gradually falls ill, Sean decides they must make their way to their distant grandparent’s house to recover. During their stay, they encounter next-door neighbor Chris, a young boy who believes he is a superhero by the name of Captain Spirit.… Expand"}, {"name": "Lumines Plus", "details_link": "https://www.metacritic.com/game/playstation-2/lumines-plus", "publisher": "Disney Interactive Studios", "release_date": "Feb 27 2007", "developers": ["Opus"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/1360662071b9804b3fc242682ddfc39d-98.jpg", "descriptions": "Lumines Plus is a pulsing new version of the original PSP system game for the PlayStation 2 computer entertainment system.  Lumines Plus includes new skins and a two-player battle mode. [BVG]"}, {"name": "Vasara Collection", "details_link": "https://www.metacritic.com/game/xbox-one/vasara-collection", "publisher": "QUByte Interactive", "release_date": "Aug 14 2019", "developers": ["QUByte Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/7a9f5dedd48c59aa33f420c794709cda-98.jpg", "descriptions": "Japanese arcade shoot’em ups Vasara and Vasara 2 come to Xbox One in a single package. It’s sci-fi meets history in these arcade classics which take place in an alternate timeline Feudal Japan where technologically, advanced weaponry, and sci-fi equipment are a reality and heroes use flyingJapanese arcade shoot’em ups Vasara and Vasara 2 come to Xbox One in a single package. It’s sci-fi meets history in these arcade classics which take place in an alternate timeline Feudal Japan where technologically, advanced weaponry, and sci-fi equipment are a reality and heroes use flying motorcycles with amazing firepower and fierce melee weapons to destroy their enemies.… Expand"}, {"name": "Sega Genesis Classics", "details_link": "https://www.metacritic.com/game/xbox-one/sega-genesis-classics", "publisher": "Sega", "release_date": "May 29 2018", "developers": ["Various", "D3T Limited"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/013c934ac0fd0a6e5425267d0771d0a8-98.jpg", "descriptions": "[Also known as SEGA Mega Drive Classics] SEGA's collection of Mega Drive & Genesis classics comes to a new generation of consoles - and players. Over 50 titles across all genres from all-time classics like Sonic and Streets of Rage 2 to deep RPGs like the Phantasy Star series; arcade action,[Also known as SEGA Mega Drive Classics] SEGA's collection of Mega Drive & Genesis classics comes to a new generation of consoles - and players. Over 50 titles across all genres from all-time classics like Sonic and Streets of Rage 2 to deep RPGs like the Phantasy Star series; arcade action, shooters, beat 'em ups, puzzlers, old favourites and hidden gems. New features bring modern convenience to the classics. Save your game at any time, rewind those slip-ups, or customise your controls. Earn bragging rights with online multiplayer and achievements. The largest collection of retro classics on console in one package.… Expand"}, {"name": "Batman: The Telltale Series - Episode 4: Guardian of Gotham", "details_link": "https://www.metacritic.com/game/pc/batman-the-telltale-series---episode-4-guardian-of-gotham", "publisher": "Telltale Games", "release_date": "Nov 22 2016", "developers": ["Telltale Games"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/f811a54ca1b6d83002366f118082743c-98.jpg", "descriptions": "Enter the fractured psyche of Bruce Wayne and discover the powerful and far-reaching consequences of your choices as the Dark Knight. The fate of Bruce Wayne, his dark persona, Batman, and Gotham hang in the balance."}, {"name": "God Eater 2: Rage Burst", "details_link": "https://www.metacritic.com/game/pc/god-eater-2-rage-burst", "publisher": "Bandai Namco Games", "release_date": "Aug 29 2016", "developers": ["Shift", "QLOC"], "platforms": ["PlayStation 4", "PlayStation Vita", "PC"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/32aaffd35c65afe31e588c101f6d95b5-98.jpg", "descriptions": "3 years following the events of GOD EATER: Resurrection, a mysterious red rain sparks a fatal pandemic called the Black Plague. With no established cure, this scourge has a mortality rate of 100% once infected. Members of the Special Unit \"Blood\", an Affiliate of the Fenrir Organization, are3 years following the events of GOD EATER: Resurrection, a mysterious red rain sparks a fatal pandemic called the Black Plague. With no established cure, this scourge has a mortality rate of 100% once infected. Members of the Special Unit \"Blood\", an Affiliate of the Fenrir Organization, are sent to assist and investigate. Assume control of their newest recruit as you master incredible weaponry, challenge enormous monsters, and cooperate with an iconic cast of characters fighting for humanity in GOD EATER 2: Rage Burst. … Expand"}, {"name": "Punch Club", "details_link": "https://www.metacritic.com/game/pc/punch-club", "publisher": "tinyBuild", "release_date": "Jan  8 2016", "developers": ["Lazy Bear Games"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Simulation", "Virtual", "Individual", "Combat", "Career", "Boxing / Martial Arts"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/b187ab3ebbd26447eb03d1d1b98495aa-98.jpg", "descriptions": "Train hard, fight crocodiles and find love. Earn your place in the Punch Club ranks, and discover who brutally murdered your father, in this choose your own adventure boxing management tycoon."}, {"name": "Pure Hold 'Em", "details_link": "https://www.metacritic.com/game/playstation-4/pure-hold-em", "publisher": "VooFoo Studios", "release_date": "Aug 18 2015", "developers": ["VooFoo Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Miscellaneous", "Gambling"], "meta_score": 73, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/1/b1cdf95618f99e2a8e49385f00e456ea-98.jpg", "descriptions": "Pure Hold’em has full online multiplayer support. You can create a tournament with up to 8 of your friends, or join an open table with other players looking for a quick poker fix. [VooFoo]"}, {"name": "Guilty Gear Isuka", "details_link": "https://www.metacritic.com/game/playstation-2/guilty-gear-isuka", "publisher": "Sammy Studios", "release_date": "Nov  2 2004", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/f558e3c1599a91e20750fd693903cbda-98.jpg", "descriptions": "It's not evolution, it's revolution! Guilty Gear Isuka brings revolutionary upgrades to the acclaimed series with 4-player simultaneous play, deep customization and all-new game modes. New characters and arenas and returning trademarks such as precision fight system, hi-res animation and aIt's not evolution, it's revolution! Guilty Gear Isuka brings revolutionary upgrades to the acclaimed series with 4-player simultaneous play, deep customization and all-new game modes. New characters and arenas and returning trademarks such as precision fight system, hi-res animation and a colorful cast firmly establish Guilty Gear Isuka as the heir to the title of premiere 2D fighter. Features 4 player simultaneous fighting, combo upgrading and entirely new modes of play make this the deepest Guilty Gear ever; All new fight arenas, and three new characters totaling an amazing 23 fighters in all; Side-scrolling Boost mode offers an exciting new single-player action game experience; Blindingly fast play with precise control, an arsenal of killer combos and the ability to play as teams will make masters out of men; Amazing character design and premise from renowned artist Daisuke Ishiwatari \rKiller new soundtrack heavily influenced by rock-and-roll and heavy metal. [Sammy Studios]… Expand"}, {"name": "Pandora's Tower", "details_link": "https://www.metacritic.com/game/wii/pandoras-tower", "publisher": "XSEED Games", "release_date": "Apr 16 2013", "developers": ["Ganbarion"], "platforms": "Wii", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 73, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/714b83c2c4b093774a143ec1bef0d05d-98.jpg", "descriptions": "The victim of a cruel curse, Elena endures a horrific transformation into a grotesque beast. Determined to find a way to cure her, Aeron assumes the Oraclos Chain and plunges into the Thirteen Towers, where truly terrifying monsters await him. The words of their companion Mavda offer themThe victim of a cruel curse, Elena endures a horrific transformation into a grotesque beast. Determined to find a way to cure her, Aeron assumes the Oraclos Chain and plunges into the Thirteen Towers, where truly terrifying monsters await him. The words of their companion Mavda offer them their only hope: within the Thirteen Towers reside the masters, and by consuming their flesh, Elena may escape the curse. This is the tale of the bond between Aeron and Elena, and the promise they make to each other to defeat the curse and be together once again. [Nintendo UK]\r… Expand"}, {"name": "Gun Showdown", "details_link": "https://www.metacritic.com/game/psp/gun-showdown", "publisher": "Activision", "release_date": "Oct 10 2006", "developers": ["Rebellion", "Neversoft Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PSP"], "num_players": "Up to 6 ", "genres": ["Action Adventure", "Historic", "General", "Historic", "Open-World"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/bc5d5744da29a3a5c486801a71c3f916-98.jpg", "descriptions": "GUN Showdown puts players in the role of Colton White, a vengeful gunslinger making his way through the untamed West of the late-1800s where the lines between good and evil are blurred and greed, lust and brutality were a way of life.  The game features all of the action contained in theGUN Showdown puts players in the role of Colton White, a vengeful gunslinger making his way through the untamed West of the late-1800s where the lines between good and evil are blurred and greed, lust and brutality were a way of life.  The game features all of the action contained in the console versions, as well as all-new side missions, quick-play modes, multiplayer modes and gameplay features that are unique to the PSP system. [Activision]… Expand"}, {"name": "Farming Simulator 19", "details_link": "https://www.metacritic.com/game/pc/farming-simulator-19", "publisher": "Focus Home Interactive", "release_date": "Nov 19 2018", "developers": ["Giants Software"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 73, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/cc57e297424891df41b3e76c008bd564-98.jpg", "descriptions": "The multimillion-selling franchise takes a giant leap forward for 2018 -- the ultimate farming simulation returns this year with a complete overhaul of the graphics engine, offering the most striking and immersive visuals and effects, along with the deepest and most complete farmingThe multimillion-selling franchise takes a giant leap forward for 2018 -- the ultimate farming simulation returns this year with a complete overhaul of the graphics engine, offering the most striking and immersive visuals and effects, along with the deepest and most complete farming experience ever!Farming Simulator 19 takes the biggest step forward yet with the franchise's most extensive vehicle roster ever! You'll take control of vehicles and machines faithfully recreated from all the leading brands in the industry, including for the first time John Deere, the largest agriculture machinery company in the world, Case IH, New Holland, Challenger, Fendt, Massey Ferguson, Valtra, Krone, Deutz-Fahr and many more.Farming Simulator 19 will feature new American and European environments in which to develop and expand your farm and will introduce many exciting new farming activities, including new machinery and crops with cotton and oat! Tend to your livestock of pigs, cows, sheep, and chickens -- or ride your horse for the first time, letting you explore in a brand-new way the vast land around your farm.… Expand"}, {"name": "Eternal Threads", "details_link": "https://www.metacritic.com/game/pc/eternal-threads", "publisher": "Cosmonaut Studios", "release_date": "May 19 2022", "developers": ["Cosmonaut Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 73, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/9/46678537b71ef35232265a8a6e7c1472-98.jpg", "descriptions": "Eternal Threads is a single-player, first-person story-driven puzzle game of time manipulation, choice and consequence."}, {"name": "Nowhere Prophet", "details_link": "https://www.metacritic.com/game/pc/nowhere-prophet", "publisher": "Sharkbomb Studios", "release_date": "Jul 19 2019", "developers": ["Sharkbomb Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 73, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/9610246c69e57c57ea69f9799e383007-98.jpg", "descriptions": "Prepare your decks and go on a pilgrimage through the wasteland. Nowhere Prophet is a unique single-player card game. Travel across randomly generated maps and lead your followers in deep tactical combat. Discover new cards and build your deck as you explore this strange, broken world."}, {"name": "Call of Duty: WWII - The War Machine", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-wwii---the-war-machine", "publisher": "Activision", "release_date": "Apr 10 2018", "developers": ["Sledgehammer Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 1.7, "image": "https://static.metacritic.com/images/products/games/7/c059a65ac1aca1e56f323d991c6a2b3c-98.jpg", "descriptions": "Tensions escalate in DLC Pack 2 for Call of Duty: WWII -- The War Machine. Join the Allies and stop the powerful Axis advance in three new Multiplayer maps that illustrate the might and global reach of the Nazi War Machine. Strike back and take part in the Allied invasion of Sicily inTensions escalate in DLC Pack 2 for Call of Duty: WWII -- The War Machine. Join the Allies and stop the powerful Axis advance in three new Multiplayer maps that illustrate the might and global reach of the Nazi War Machine. Strike back and take part in the Allied invasion of Sicily in Operation Husky, the all new objective-based War Mode mission. Plus, experience the latest Nazi Zombies chapter: The Shadowed Throne. [Activision]… Expand"}, {"name": "Apocalipsis", "details_link": "https://www.metacritic.com/game/pc/apocalipsis", "publisher": "PlayWay", "release_date": "Mar  1 2018", "developers": ["Punch Punk Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/cc8f4d826f67ba6df7bc141f5e6645a2-98.jpg", "descriptions": "Apocalipsis is a point-and-click adventure game, in the vain of Samorost and Machinarium, where all puzzles have a hidden meaning. With a unique artstyle inspired by 15th century engravings it tells a story about heartbreak, redemption and, quite literally, the end of the world."}, {"name": "SingStar Queen", "details_link": "https://www.metacritic.com/game/playstation-2/singstar-queen", "publisher": "SCEA", "release_date": "Aug  4 2009", "developers": ["SCEE London Studio"], "platforms": ["PlayStation 3", "PlayStation 2"], "num_players": "1-8 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/36cbcc5b265479313c0bdc5f952c4905-98.jpg", "descriptions": "Featuring 20 of the British group's greatest hits, such as Bohemian Rhapsody, Don't Stop Me Now and Who Wants To Live Forever, SingStar Queen helps you realise your rock and roll fantasies. And with all the classic SingStar multiplayer modes, it's the perfect way for you and your friends toFeaturing 20 of the British group's greatest hits, such as Bohemian Rhapsody, Don't Stop Me Now and Who Wants To Live Forever, SingStar Queen helps you realise your rock and roll fantasies. And with all the classic SingStar multiplayer modes, it's the perfect way for you and your friends to keep the neighbours awake at your next party. Record your performances using the EyeToy USB Camera and watch them later. Share the fun with friends in multiplayer for up to eight people. [SCEE]… Expand"}, {"name": "No Longer Home", "details_link": "https://www.metacritic.com/game/pc/no-longer-home", "publisher": "Humble Grove", "release_date": "Jul 30 2021", "developers": ["Humble Grove"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/a3f8211c6bc2566b88f0231c7bf48110-98.jpg", "descriptions": "No Longer Home is a game about letting go of the life you've built due to circumstances beyond your control. Immerse yourself in the lives of Bo and Ao and learn about their dreams, frustrations and fears. Welcome the magic of the everyday and somewhat extraordinary."}, {"name": "Livelock", "details_link": "https://www.metacritic.com/game/pc/livelock", "publisher": "Perfect World Entertainment", "release_date": "Aug 30 2016", "developers": ["Tuque Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/122b4d87e0c95fffcd01fc783aef1e5d-98.jpg", "descriptions": "Livelock is a co-operative top-down shooter through which you play solo or with up to 2 allies to break the cycle of infinite war between machines. As one of the remaining Capital Intellects, your role is to unlock Eden and revive humanity."}, {"name": "Outlast: Whistleblower", "details_link": "https://www.metacritic.com/game/pc/outlast-whistleblower", "publisher": "Red Barrels", "release_date": "May  6 2014", "platforms": ["PlayStation 4", "PC"], "genres": ["Action Adventure", "Horror", "Survival"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/3668f423022af86f9b2e83d4cd02cbe2-98.jpg", "descriptions": "As Waylon Park, the whistleblower who emailed Miles Upshur, youâ€™ll witness psycho killers and asylum security face off as all hell truly breaks loose. Survive, and you may just have a chance to expose the terrible secrets at the heart of Mount Massive and unmask the true face of theAs Waylon Park, the whistleblower who emailed Miles Upshur, youâ€™ll witness psycho killers and asylum security face off as all hell truly breaks loose. Survive, and you may just have a chance to expose the terrible secrets at the heart of Mount Massive and unmask the true face of the Murkoff Corporation for all the world to see.… Expand"}, {"name": "The SpongeBob SquarePants Movie", "details_link": "https://www.metacritic.com/game/gamecube/the-spongebob-squarepants-movie", "publisher": "THQ", "release_date": "Oct 27 2004", "developers": ["Heavy Iron Studios"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/f4856bc908584d749699f6e76c464115-98.jpg", "descriptions": "Someone has stolen King Neptune's crown, and Mr. Krabs is the main suspect. Despite having been passed over for a promotion by Mr. Krabs, SpongeBob and his faithful (but dimwitted) friend Patrick volunteer to make the perilous journey to Shell City to retrieve the crown and save Mr. Krabs'Someone has stolen King Neptune's crown, and Mr. Krabs is the main suspect. Despite having been passed over for a promotion by Mr. Krabs, SpongeBob and his faithful (but dimwitted) friend Patrick volunteer to make the perilous journey to Shell City to retrieve the crown and save Mr. Krabs' life. Play as SpongeBob or Patrick as they interact with characters from the movie, earn \"manliness\" points to gain power-ups, and explore vast environments in the \"Patty Wagon.\" … Expand"}, {"name": "The Sims: Castaway Stories", "details_link": "https://www.metacritic.com/game/pc/the-sims-castaway-stories", "publisher": "EA Games", "release_date": "Jan 29 2008", "developers": ["Maxis"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/6b573822097839eee8d30e27fefea804-98.jpg", "descriptions": "This time your Sims have washed up on a tropical island! Help them make a new life in an unexplored paradise in this easy-to-play, laptop-friendly version of The Sims. The Sims Castaway Stories features two great ways to play. In the new and engaging directed Story mode, explore the island,This time your Sims have washed up on a tropical island! Help them make a new life in an unexplored paradise in this easy-to-play, laptop-friendly version of The Sims. The Sims Castaway Stories features two great ways to play. In the new and engaging directed Story mode, explore the island, build a shelter, learn to find food, and make your Sims' lives as fun and comfortable as possible. You even unlock rewards along the way as you achieve set goals. In open-ended Classic mode, you create your Sims and determine how they'll evolve on their new island home. In an environment where anything-or anyone-can wash up on the beach, you decide how their stories unfold. [Electronic Arts]… Expand"}, {"name": "XIII", "details_link": "https://www.metacritic.com/game/playstation-2/xiii", "publisher": "Ubisoft", "release_date": "Nov 18 2003", "developers": ["Ubisoft Paris"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 73, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/afb81216c017b5de2b9b2a982f5394e9-98.jpg", "descriptions": "The President of the United States of America has been assassinated. You wake up on a desolate strip of New England beach. The near-fatal impact of a bullet has left your head pounding, and your memory erased. What's more, the number \"XIII\" has been mysteriously tattooed on your chest, whileThe President of the United States of America has been assassinated. You wake up on a desolate strip of New England beach. The near-fatal impact of a bullet has left your head pounding, and your memory erased. What's more, the number \"XIII\" has been mysteriously tattooed on your chest, while your pocket holds a key to a New York City bank box. Head swimming in amnesia, you struggle to your feet only to encounter more assailants intent on finishing the job. To your shock, you handle the hitmen with the killing skills of a professional - before heading to the bank in search of any shred of information about your lost identity and your involvement in the President's murder. What lies ahead is a deadly quest not only into your shadowy past, but America's darkest corridors of power. [Ubi Soft]… Expand"}, {"name": "Cossacks II: Napoleonic Wars", "details_link": "https://www.metacritic.com/game/pc/cossacks-ii-napoleonic-wars", "publisher": "cdv Software", "release_date": "Apr 27 2005", "developers": ["GSC Game World"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "Historic", "Command"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/38fe1b30e4d1407f744536dd769ee7b2-98.jpg", "descriptions": "Napoleonic period brought \"civilized\" warfare, fighting in combat formations into being. The very principle is put into practice in Cossacks II gameplay. Generally speaking, formations play a decisive role on the battlefields whereas individual units are mostly ineffective. Players are givenNapoleonic period brought \"civilized\" warfare, fighting in combat formations into being. The very principle is put into practice in Cossacks II gameplay. Generally speaking, formations play a decisive role on the battlefields whereas individual units are mostly ineffective. Players are given a chance to lead their armies to victory through the pandemonium of epic battles with up to 64,000 units on the map, which is virtually the scale of real combats. What is more, ability to zoom in and soar upwards to get a bird's-eye view of the battle makes Cossacks II the most spectacular game on the Napoleonic era. [CDV Software]… Expand"}, {"name": "NES Remix 2", "details_link": "https://www.metacritic.com/game/wii-u/nes-remix-2", "publisher": "Nintendo", "release_date": "Apr 25 2014", "developers": ["indieszero"], "platforms": "Wii U", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "Party / Minigame"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/d7b1b5c3e627626b19ff1b37d72ded0b-98.jpg", "descriptions": "This second installment of the mashup of classic Nintendo games features challenges from later NES games like Super Mario Bros. 3, Kirbyâ€™s Adventure and Metroid. Just like NES Remix, the sequel includes stages from the original games with new challenges, as well as modified stages thatThis second installment of the mashup of classic Nintendo games features challenges from later NES games like Super Mario Bros. 3, Kirbyâ€™s Adventure and Metroid. Just like NES Remix, the sequel includes stages from the original games with new challenges, as well as modified stages that introduce new elements.… Expand"}, {"name": "The Political Machine 2008", "details_link": "https://www.metacritic.com/game/pc/the-political-machine-2008", "publisher": "Stardock", "release_date": "Jun 24 2008", "developers": ["Stardock"], "platforms": "PC", "num_players": "2  Online", "genres": ["Strategy", "General", "General"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/94b083ad8316cc074082e5d59c469fd0-98.jpg", "descriptions": "The Political Machine is a strategy game that takes the real world mechanics of political campaigning and uses it to create an award-winning strategy game.  Raise money, hire spin-doctors, win the endorsements of important groups, go on TV interviews, take out ads, fight off smear merchantsThe Political Machine is a strategy game that takes the real world mechanics of political campaigning and uses it to create an award-winning strategy game.  Raise money, hire spin-doctors, win the endorsements of important groups, go on TV interviews, take out ads, fight off smear merchants and much more in your quest to win the 270 electoral votes you need to get into the white house. [Stardock]… Expand"}, {"name": "Viewtiful Joe: Double Trouble!", "details_link": "https://www.metacritic.com/game/ds/viewtiful-joe-double-trouble!", "publisher": "Capcom", "release_date": "Nov 18 2005", "developers": ["Clover Studio"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/191ff518130c394cb9c4dd0e6375607c-98.jpg", "descriptions": "In Viewtiful Joe: Double Trouble an action-movie hero's work is never done! During an on-location shoot of Captain Blue's latest movie, a new sinister group literally steals the show and it’s up to our not-so-average Joe to reclaim it. Using the Nintendo DS dual screens, gamers help JoeIn Viewtiful Joe: Double Trouble an action-movie hero's work is never done! During an on-location shoot of Captain Blue's latest movie, a new sinister group literally steals the show and it’s up to our not-so-average Joe to reclaim it. Using the Nintendo DS dual screens, gamers help Joe split the screen wide open to solve mind-boggling puzzles and perform his devastating moves in this side-scrolling action title. Plus the ‘Joe Camera’ let’s you pull the upper screen down to literally give Joe a helping hand. To help with all this chaos is Joe's quarrelsome little sister, Jasmine, who joins in on the action this time around. Innovative use of the Nintendo DS Dual Screens - Make use of the handheld's dual-screens and touch-sensitive panel to help Joe solve puzzles and progress through the game. [Capcom]… Expand"}, {"name": "Urban Chaos: Riot Response", "details_link": "https://www.metacritic.com/game/playstation-2/urban-chaos-riot-response", "publisher": "Eidos Interactive", "release_date": "Jun 13 2006", "developers": ["Rocksteady Studios"], "platforms": "PlayStation 2", "num_players": "8  Online", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 73, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/ab9c3c14c12ceb86136c9bf2eecc5d5f-98.jpg", "descriptions": "Set in the not too distant future, Urban Chaos: Riot Response follows a year in the life of Nick Mason, returning from military service to find his home city ravaged by gang warfare. He is quickly enlisted into the ranks of the newly formed G18 Counter Gang Division; an elite enforcementSet in the not too distant future, Urban Chaos: Riot Response follows a year in the life of Nick Mason, returning from military service to find his home city ravaged by gang warfare. He is quickly enlisted into the ranks of the newly formed G18 Counter Gang Division; an elite enforcement unit granted special emergency powers over all other public services and tasked with securing the city and its citizens at any cost. With direct control over Paramedics, Police and the Fire Department, you must work together to save lives, property and your city. An innovative, voice activated control system issues orders to offer protection and tactical guidance in the fight for survival. [SCi Games]… Expand"}, {"name": "Resident Evil Village: Winters' Expansion", "details_link": "https://www.metacritic.com/game/playstation-5/resident-evil-village-winters-expansion", "publisher": "Capcom", "release_date": "Oct 28 2022", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Action Adventure", "Survival"], "meta_score": 73, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/2/392b07367d995364fb66183708beecca-98.jpg", "descriptions": "The first piece of content is the Third-Person Mode. This will allow you to play the main story mode in a third-person perspective. This new viewpoint will let you see Ethan as he faces off against his enemies. Next is The Mercenaries Additional Orders. The arcade-like action shootingThe first piece of content is the Third-Person Mode. This will allow you to play the main story mode in a third-person perspective. This new viewpoint will let you see Ethan as he faces off against his enemies. Next is The Mercenaries Additional Orders. The arcade-like action shooting experience returns with additional stages and new playable characters such as a fully prepared Chris Redfield, Karl Heisenberg, who wields a giant hammer and possesses the ability to control magnetic forces, and Alcina Dimitrescu who is over nine-feet tall. And Finally, Shadows of Rose. Players saw Rose as a baby in the main story of Resident Evil Village. This DLC will show her story of survival 16 years after the original campaign. [Capcom]… Expand"}, {"name": "Death end re;Quest", "details_link": "https://www.metacritic.com/game/switch/death-end-request", "publisher": "Idea Factory", "release_date": "Apr 27 2021", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 73, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/d704bfc971170c610a635885660b68f6-98.jpg", "descriptions": "Arata Mizunashi, a video game programmer, receives a notification from an email sent to him by Shina Ninomiya, a colleague of his who went missing nearly one year ago. Together, they worked to create World's Odyssey (W.O.D.), an immersive virtual landscape powered by breathtaking,Arata Mizunashi, a video game programmer, receives a notification from an email sent to him by Shina Ninomiya, a colleague of his who went missing nearly one year ago. Together, they worked to create World's Odyssey (W.O.D.), an immersive virtual landscape powered by breathtaking, state-of-the-art technology. That is, until Shina's sudden disappearance put a swift halt to production. Arata discovers the startling revelation that Shina Ninomiya was stuck inside of \"W.O.D.\" the whole time. When Arata delves hurriedly back into the lines of code haunting his forsaken project, he realizes that his game is now ravaged by an infestation of bugs, and that Shina is its only active player.Arata soon learns that a nefarious force prevents him from extracting Shina out of the game. Her only way out? She must complete the game to unlock the perfect ending -- an outcome with a success rate of 1%. On their journey, they encounter a slew of NPC characters that blur perceptions of humanity and A.I.-technology, setting into a motion a thrilling narrative that calls into question the differences between the virtual world and ours.Little do they know what horrors await them on both sides of the screen...… Expand"}, {"name": "Onimusha: Warlords", "details_link": "https://www.metacritic.com/game/playstation-4/onimusha-warlords", "publisher": "Capcom", "release_date": "Jan 15 2019", "developers": ["Capcom", "NeoBards Entertainment"], "platforms": ["PC", "PlayStation 2", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 73, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/cc87f706aec694aaaad3708f65604a6e-98.jpg", "descriptions": "As power-hungry warlords battle one another for control of feudal Japan, a young princess is kidnapped. Now, one lone swordsman, Samanosuke, boldly volunteers to rescue and avenge her. An entire legion of demon warriors stands between you and the princess, so you'll need all your weapons andAs power-hungry warlords battle one another for control of feudal Japan, a young princess is kidnapped. Now, one lone swordsman, Samanosuke, boldly volunteers to rescue and avenge her. An entire legion of demon warriors stands between you and the princess, so you'll need all your weapons and magic to break through. The world of Onimusha: Warlords comes alive with waterfalls, wind effects, insects, and weather, but in order to triumph, you must stay focused on your mission.… Expand"}, {"name": "Naruto Shippuden: Ultimate Ninja Storm 3 Full Burst", "details_link": "https://www.metacritic.com/game/playstation-3/naruto-shippuden-ultimate-ninja-storm-3-full-burst", "publisher": "Namco Bandai Games America", "release_date": "Oct 22 2013", "developers": ["CyberConnect2", "Namco Bandai Games"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/c8a31fdfccf4c5876ccf0712d61d462e-98.jpg", "descriptions": "Naruto Shippuden: Ultimate Ninja Storm 3 Full Burst features many new enhancements and additional content, including the anticipated chapter where Sasuke and Itachi take on Kabuto in a nail-biting confrontation."}, {"name": "Ys: The Oath in Felghana", "details_link": "https://www.metacritic.com/game/pc/ys-the-oath-in-felghana", "publisher": "XSEED Games", "release_date": "Mar 19 2012", "developers": ["Falcom"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/224117637a7a667902d86a7717d1f234-98.jpg", "descriptions": "Developer Falcom is working on the next installment in the Ys series, entitled Ys: The Oath in Felghana."}, {"name": "KUNAI", "details_link": "https://www.metacritic.com/game/switch/kunai", "publisher": "The Arcade Crew", "release_date": "Feb  6 2020", "developers": ["TurtleBlaze"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "2D"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/79ccddc851c2c0c6d4e8d96512340436-98.jpg", "descriptions": "A traumatic event has shaken the balance of the world. Human life has been almost wiped out by the evil A.I. Lemonkus. Robots roam free across the earth. You take control of Tabby, a killer robot infused with the soul of an ancient warrior. A NINJA METROIDVANIA. Start out with nothing,A traumatic event has shaken the balance of the world. Human life has been almost wiped out by the evil A.I. Lemonkus. Robots roam free across the earth. You take control of Tabby, a killer robot infused with the soul of an ancient warrior. A NINJA METROIDVANIA. Start out with nothing, progress and increase in strength by killing enemy robots to unlock abilities, weapons and ninja tricks. Explore a world filled with secrets, hidden passages and mysterious characters. KUNAI is all about movement and agility. Use your ninja mobility to reach places where no normal robot could ever go.… Expand"}, {"name": "Lumo", "details_link": "https://www.metacritic.com/game/playstation-4/lumo", "publisher": "Rising Star Games", "release_date": "May 24 2016", "developers": ["Triple Eh? Ltd"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Adventure", "General", "Platformer", "3D"], "meta_score": 73, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/9fce8ae43ce1a38f66e45a7b8608b47b-98.jpg", "descriptions": "As a contemporary take on the long-lost isometric platform genre, Lumo can be enjoyed by anyone looking for an absorbing, challenging and rewarding adventure. But for those who lived through the golden age of videogames – the 80s and early 90s – or know about the games and culture from thatAs a contemporary take on the long-lost isometric platform genre, Lumo can be enjoyed by anyone looking for an absorbing, challenging and rewarding adventure. But for those who lived through the golden age of videogames – the 80s and early 90s – or know about the games and culture from that time, layer upon layer of nods, winks and touches to those times help build upon the experience. [Playstation.com]… Expand"}, {"name": "Sega 3D Classics Collection", "details_link": "https://www.metacritic.com/game/3ds/sega-3d-classics-collection", "publisher": "Sega", "release_date": "Apr 26 2016", "developers": ["M2"], "platforms": "3DS", "genres": ["Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/c1566637bb71bd0873f12c95a1aac657-98.jpg", "descriptions": "A collection of 9 classic SEGA games in one package. From the arcades straight to your Nintendo 3DS, experience the classics that defined the genres in gameplay. The games are:\r-Power Drift\r-Puyo Puyo 2\r\n-Maze Walker\r\n-Fantasy Zone II: The Tears of Opa-Opa\r\n-Fantazy Zone II W\r\n-Sonic TheA collection of 9 classic SEGA games in one package. From the arcades straight to your Nintendo 3DS, experience the classics that defined the genres in gameplay. The games are:\r-Power Drift\r-Puyo Puyo 2\r-Maze Walker\r-Fantasy Zone II: The Tears of Opa-Opa\r-Fantazy Zone II W\r-Sonic The Hedgehog\r-Thunder Blade\r-Galaxy Force II\r-Altered Beast… Expand"}, {"name": "Savage Moon", "details_link": "https://www.metacritic.com/game/playstation-3/savage-moon", "publisher": "SCEA", "release_date": "Jan 29 2009", "developers": ["FluffyLogic"], "platforms": "PlayStation 3", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "Defense"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/27a4fc9d7710a46654bd5903ccef5bd9-98.jpg", "descriptions": "[Playstation Network]  This action-packed tower defense strategy game takes you to distant planets where you must defend mining facilities from relentless Insectocyte monsters. Build towers in strategic locations in order to fend off wave after wave of increasingly tough attackers. Then use[Playstation Network]  This action-packed tower defense strategy game takes you to distant planets where you must defend mining facilities from relentless Insectocyte monsters. Build towers in strategic locations in order to fend off wave after wave of increasingly tough attackers. Then use funds from kills and mining to build, upgrade, or research new weapons and technologies to strengthen your defenses. It will take equal parts skill and strategy to survive in Savage Moon. [SCEA]… Expand"}, {"name": "Naruto Shippuden: Ultimate Ninja Storm Revolution", "details_link": "https://www.metacritic.com/game/playstation-3/naruto-shippuden-ultimate-ninja-storm-revolution", "publisher": "Bandai Namco Games", "release_date": "Sep 16 2014", "developers": ["CyberConnect2"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/5024c0c3e61080fa68f8a0d0256f72e9-98.jpg", "descriptions": "Naruto Shippuden: Ultimate Ninja Storm Revolution is a 3D ninja fighting action with a roster reaching 100 playable characters that spans the entire Naruto and Naruto Shippuden anime arcs."}, {"name": "Sonic Heroes", "details_link": "https://www.metacritic.com/game/xbox/sonic-heroes", "publisher": "Sega", "release_date": "Jan 27 2004", "developers": ["Sonic Team"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 73, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/0b13bd65cde85623a65ef886907735c4-98.jpg", "descriptions": "Sonic Heroes brings the Sonic series to the PS2 and Xbox for the first time.  Dr.  Eggman is causing havoc again and it's up to you to maneuver a team of three Sonic characters through massive levels.  All 12 characters--divided into Team Sonic, Team Dark, Team Rose and Team Chaotix--haveSonic Heroes brings the Sonic series to the PS2 and Xbox for the first time.  Dr.  Eggman is causing havoc again and it's up to you to maneuver a team of three Sonic characters through massive levels.  All 12 characters--divided into Team Sonic, Team Dark, Team Rose and Team Chaotix--have their own unique strengths, so choose your teams wisely.  Find the best combination to complete missions full of enemies, puzzles, and huge environments.  No matter what team you choose, the only direction is forward and the only way to get there is fast.… Expand"}, {"name": "R-Type Final 2", "details_link": "https://www.metacritic.com/game/playstation-4/r-type-final-2", "publisher": "NIS America", "release_date": "Apr 30 2021", "developers": ["Granzella Inc."], "platforms": ["PC", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 73, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/68edb314a3ebcdc5477db771c9295618-98.jpg", "descriptions": "Wave Cannon attacks by trans-dimensional fighters equipped with firepower equivalent of that of a battleship. This game is thoroughly focused on expressions of how enemies are destroyed. The feeling of exhilaration in the destructions is thoroughly pursued."}, {"name": "Ultimate Mortal Kombat", "details_link": "https://www.metacritic.com/game/ds/ultimate-mortal-kombat", "publisher": "Midway", "release_date": "Nov 12 2007", "developers": ["Other Ocean Interactive"], "platforms": "DS", "num_players": "2  Online", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 73, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/006a276a9148056c8e2820f68610d130-98.jpg", "descriptions": "Ultimate Mortal Kombat combines the visceral thrills of the classic \"Ultimate Mortal Kombat 3\" and the addictive puzzle action of the Puzzle Kombat component of Midway’s best-selling \"Mortal Kombat: Deception\" in a single DS-friendly package. With new record-keeping capability, and NintendoUltimate Mortal Kombat combines the visceral thrills of the classic \"Ultimate Mortal Kombat 3\" and the addictive puzzle action of the Puzzle Kombat component of Midway’s best-selling \"Mortal Kombat: Deception\" in a single DS-friendly package. With new record-keeping capability, and Nintendo Wi-Fi Connection multiplayer, players can take UMK anywhere for fighting action on the go. [Midway]… Expand"}, {"name": "FIFA Soccer", "details_link": "https://www.metacritic.com/game/psp/fifa-soccer", "publisher": "Electronic Arts", "release_date": "Apr 25 2005", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/bba214eb8617ff355c2bfaea0ebf8d08-98.jpg", "descriptions": "Get on the Pitch and Go: Including Head-to-Head play featuring Friendly and Home and Away modes, plus Challenges mode, Season, Mid-Season Scenario, and Custom Season modes, Tournaments, and Custom Tournaments. Mid-Season Scenario Mode: Throw yourself in the middle of the action as you playGet on the Pitch and Go: Including Head-to-Head play featuring Friendly and Home and Away modes, plus Challenges mode, Season, Mid-Season Scenario, and Custom Season modes, Tournaments, and Custom Tournaments. Mid-Season Scenario Mode: Throw yourself in the middle of the action as you play out the rest of the 04/05 season with current real-time team standings. Challenges Mode: Master key game scenarios in the newly designed Challenges mode. Wireless Head-to-Head Gameplay: Play one-on-one against a friend in any game mode. EA Pocket Trax: This new feature designed for PSP allows you to listen and watch music content via this built-in player. [Electronic Arts]… Expand"}, {"name": "Cricket 19", "details_link": "https://www.metacritic.com/game/playstation-4/cricket-19", "publisher": "Big Ant Studios", "release_date": "May 29 2019", "developers": ["Big Ant Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Sports", "Team", "Cricket"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/d841b9aee0a398978850303936b581cb-98.jpg", "descriptions": "Lead your team to international glory with Cricket 19. The truly global cricket simulation from Big Ant Studios, the leading name in authentic, realistic cricket action, Cricket 19 allows you to take control of your team, from club through national level, and lead them to T20, ODI, or TestLead your team to international glory with Cricket 19. The truly global cricket simulation from Big Ant Studios, the leading name in authentic, realistic cricket action, Cricket 19 allows you to take control of your team, from club through national level, and lead them to T20, ODI, or Test Match glory.… Expand"}, {"name": "Crash of the Titans", "details_link": "https://www.metacritic.com/game/ds/crash-of-the-titans", "publisher": "Sierra Entertainment", "release_date": "Oct 25 2007", "developers": ["Amaze Entertainment"], "platforms": ["PlayStation 2", "Xbox 360", "DS"], "num_players": "2  Online", "genres": ["Action", "Platformer", "General", "3D"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/d4d96cc074bf153b6cdf6fd20c64d921-98.jpg", "descriptions": "In Crash of the Titans, players fight a nefarious plot hatched by Crash's arch nemeses Neo and Nina Cortex to mutate the local creatures into titanic abominations. Using Crash's legendary mix of outrageous antics and daredevil bravado, players \"hijack\" enemies to take control of their actionIn Crash of the Titans, players fight a nefarious plot hatched by Crash's arch nemeses Neo and Nina Cortex to mutate the local creatures into titanic abominations. Using Crash's legendary mix of outrageous antics and daredevil bravado, players \"hijack\" enemies to take control of their action and use their fearsome powers against all manner of enemies. \"Jack to Attack!\" – Control, play and battle as 15 enemies, including titanic creatures such as Scorporilla, Ratcicle, Magamadon and Shellephant. While in control of a monster players can throw toxic stink bombs, call lightning down from the sky, fire lasers beams from their eyes or even impale enemies with a massive scorpion tail - use all of the creatures' special abilities to defeat Neo and Nina Cortex. Crash now has a powerful acrobatic fighting system that includes punches and flying kicks, multiple attacks and special counter moves. Players can power-up skills to unlock new attacks and blazing combos. Crash can now interact with his world in totally new ways. Players can wall-run, swing from ropes and flip off springboards – Crash can even toss Aku Aku on the ground to surf, skate, grind and shred. At any point in the game, a second player can join in the fun and play as Carbon-Crash to help unleash total chaos. In a totally innovative twist to co-op action gaming, Crash can even jack Carbon-Crash (or vice versa) for some hysterical Crash \"jacked\"-Crash mayhem. [Sierra Entertainment]… Expand"}, {"name": "GRID Legends", "details_link": "https://www.metacritic.com/game/xbox-series-x/grid-legends", "publisher": "Electronic Arts", "release_date": "Feb 25 2022", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 22 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 73, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/b1426cdbbe0c8fa651473cf3118bfa26-98.jpg", "descriptions": "GRID Legends is for the racing thrill-seekers, delivering thrilling wheel-to-wheel motorsport and edge of your seat action around the globe. Create your dream motorsport events, hop into live multiplayer races, be part of the drama in an immersive virtual production story, and embrace theGRID Legends is for the racing thrill-seekers, delivering thrilling wheel-to-wheel motorsport and edge of your seat action around the globe. Create your dream motorsport events, hop into live multiplayer races, be part of the drama in an immersive virtual production story, and embrace the sensation of spectacular action racing. Jostle for position. Drive legendary cars to their limits. Feel the rush of incredible speed. Push your Nemesis on the track. Defeat your friends again and again... and don't let them ever forget it!\r Play together with up to 21 friends in the most social and connected GRID ever, including cross-platform play, and cause havoc on the track. Make racing memories with a stunning variety of cars, new city locations such as London and Moscow, exciting event types, and create on-track enemies. Use the Race Creator to design adrenaline-fueled races to tear up with your friends, with event types like Elimination, electrifying Boost races, and the return of Drift. Want to race hypercars against huge trucks? Go for it! Be part of the spectacle of motorsport with our dramatic virtual production story Driven to Glory, or dive into our largest ever Career, featuring hundreds of exhilarating events.… Expand"}, {"name": "Mad Max", "details_link": "https://www.metacritic.com/game/pc/mad-max", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep  1 2015", "developers": ["Avalanche Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General", "Open-World"], "meta_score": 73, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/dfd3dd0d9866d69ab8a413797c7ca89a-98.jpg", "descriptions": "Mad Max places players in the role of a lone warrior who must embark on a journey to reclaim his stolen interceptor from a deadly gang of marauders."}, {"name": "Regalia: Of Men and Monarchs", "details_link": "https://www.metacritic.com/game/pc/regalia-of-men-and-monarchs", "publisher": "Pixelated Milk", "release_date": "May 18 2017", "developers": ["Pixelated Milk"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "Japanese-Style", "Tactics"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/ac58832712523e373970cd1bb5ef3e09-98.jpg", "descriptions": "Regalia: Of Men And Monarchs is a tactical RPG set in a cheerful fantasy world full of weirdness and wonder. Assemble your party, go adventuring, manage your kingdom, make new friends, and defeat your opponents in challenging turn-based combat."}, {"name": "Mount & Blade II: Bannerlord", "details_link": "https://www.metacritic.com/game/xbox-series-x/mount-blade-ii-bannerlord", "publisher": "Koch Media", "release_date": "Oct 25 2022", "developers": ["Taleworlds Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 64 ", "genres": ["Role-Playing", "Western-Style"], "meta_score": 73, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/48efbaa4b6ff087a62b66106f9e8650d-98.jpg", "descriptions": "The horns sound, the ravens gather. An empire is torn by civil war. Beyond its borders, new kingdoms rise. Gird on your sword, don your armour, summon your followers and ride forth to win glory on the battlefields of Calradia. Establish your hegemony and create a new world out of the ashesThe horns sound, the ravens gather. An empire is torn by civil war. Beyond its borders, new kingdoms rise. Gird on your sword, don your armour, summon your followers and ride forth to win glory on the battlefields of Calradia. Establish your hegemony and create a new world out of the ashes of the old.Mount & Blade II: Bannerlord is the eagerly awaited sequel to the acclaimed medieval combat simulator and role-playing game Mount & Blade: Warband. Set 200 years before, it expands both the detailed fighting system and the world of Calradia. Bombard mountain fastnesses with siege engines, establish secret criminal empires in the back alleys of cities, or charge into the thick of chaotic battles in your quest for power.… Expand"}, {"name": "Medieval Dynasty", "details_link": "https://www.metacritic.com/game/pc/medieval-dynasty", "publisher": "Toplitz Productions", "release_date": "Sep 23 2021", "developers": ["Render Cube"], "platforms": ["PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/85a20daec53332129898e996f38adf8e-98.jpg", "descriptions": "Discover the wide-open world of the Middle Ages with all its dangers and mysteries! Hunt and cultivate your land, build your home and expand your village into a flourishing medieval town. Rule and care for your people and secure your place in history by founding your own dynasty."}, {"name": "Lightmatter", "details_link": "https://www.metacritic.com/game/pc/lightmatter", "publisher": "Aspyr", "release_date": "Jan 15 2020", "developers": ["Tunnel Vision Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Puzzle", "Action", "3D", "First-Person"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/cd59fb0d1f9fb05c19b8a025b46cc208-98.jpg", "descriptions": "Lightmatter is the atmospheric, first-person puzzle game inside a mysterious experimental facility where the shadows will kill you. Watch your movements closely through the sprawling tunnels and rooms or be swallowed into the vast darkness. The game tells a sci-fi story about a maniacLightmatter is the atmospheric, first-person puzzle game inside a mysterious experimental facility where the shadows will kill you. Watch your movements closely through the sprawling tunnels and rooms or be swallowed into the vast darkness. The game tells a sci-fi story about a maniac inventor who has created the ultimate power source called Lightmatter. Players must explore the facility in an attempt to discover the hidden plot, while facing challenging puzzles that require mastering different light sources to survive.… Expand"}, {"name": "Pang Adventures", "details_link": "https://www.metacritic.com/game/switch/pang-adventures", "publisher": "DotEmu", "release_date": "Jan  3 2019", "developers": ["DotEmu"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/6c05c55b379cf72b4761a480a65531e4-98.jpg", "descriptions": "The Pang series is a beloved collection of arcade video games from the early 90s. Guide two brothers on a quest around the world to save humankind from a massive alien invasion! Use your wits and skills to overcome the attack balls pouring from the skies and rescue the world’s cities andThe Pang series is a beloved collection of arcade video games from the early 90s. Guide two brothers on a quest around the world to save humankind from a massive alien invasion! Use your wits and skills to overcome the attack balls pouring from the skies and rescue the world’s cities and landmarks from impending annihilation!… Expand"}, {"name": "LEGO Harry Potter Collection", "details_link": "https://www.metacritic.com/game/xbox-one/lego-harry-potter-collection", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 30 2018", "developers": ["Warner Bros. Interactive Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/a61501f88f18598e7f4e91fe30a0bc1e-98.jpg", "descriptions": "The LEGO Harry Potter Collection brings LEGO Harry Potter: Years 1-4 and LEGO Harry Potter: Years 5-7 to the PlayStation4 computer entertainment system for the first time with both top-selling videogames remastered on one disc! This compilation unites the creative prowess of LEGO and theThe LEGO Harry Potter Collection brings LEGO Harry Potter: Years 1-4 and LEGO Harry Potter: Years 5-7 to the PlayStation4 computer entertainment system for the first time with both top-selling videogames remastered on one disc! This compilation unites the creative prowess of LEGO and the expansive world of Harry Potter, with an exciting journey full of spell-casting, potion-making, puzzle-solving, lessons, dueling and much more for players of all ages to enjoy. Gamers can experience the entire LEGO Harry Potter adventure featuring content from seven books and eight films, with enhanced graphics, environments, lighting and visual effects, along with two downloadable content (DLC) packs. Sure to delight fans of J.K. Rowling's ever-expanding Wizarding World, the LEGO Harry Potter Collection serves as a perfect gift for those eagerly anticipating the upcoming film, Fantastic Beasts and Where to Find Them, a prequel to the Harry Potter film series.… Expand"}, {"name": "Shio", "details_link": "https://www.metacritic.com/game/playstation-4/shio", "publisher": "Coconut Island Games", "release_date": "May 22 2018", "developers": ["Coconut Island Games"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/4/1deb61bc5d682b5f4c8ab48a5e7e65d1-98.jpg", "descriptions": "Shio isn’t your typical platformer. Floating lanterns aren’t just decorations – their purpose is to help you explore the world of Shio. Jumping from lantern to lantern should be easy, no? Wrong. You’ll need to harness the best of your wits and dexterity to navigate through this world."}, {"name": "Titan Souls", "details_link": "https://www.metacritic.com/game/playstation-4/titan-souls", "publisher": "Devolver Digital", "release_date": "Apr 14 2015", "developers": ["Acid Nerve"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "genres": ["Action", "Action Adventure", "General"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/e63d5cb2865007898cb79908024f19c0-98.jpg", "descriptions": "Between our world and the world beyond lie the Titan Souls, the spiritual source and sum of all living things. Now scattered among the fallout and guarded by the idle titans tasked with their care, a singular hero armed with a solitary arrow is once more bringing together shards of the TitanBetween our world and the world beyond lie the Titan Souls, the spiritual source and sum of all living things. Now scattered among the fallout and guarded by the idle titans tasked with their care, a singular hero armed with a solitary arrow is once more bringing together shards of the Titan Soul in a mission for truth and power.… Expand"}, {"name": "Kirby and the Rainbow Curse", "details_link": "https://www.metacritic.com/game/wii-u/kirby-and-the-rainbow-curse", "publisher": "Nintendo", "release_date": "Feb 20 2015", "developers": ["HAL Labs"], "platforms": "Wii U", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/d0a439f673b6f0adbf4624ba24227ded-98.jpg", "descriptions": "(Also known as \"Kirby and the Rainbow Paintbrush\" in the UK/EU.) Do you have the magic touch? Then guide Kirby as he sets off on grand adventures in a hand-sculpted clay world. Draw lines on the touch screen of the Wii U GamePad controller to create rainbow-colored clay ropes to move Kirby(Also known as \"Kirby and the Rainbow Paintbrush\" in the UK/EU.) Do you have the magic touch? Then guide Kirby as he sets off on grand adventures in a hand-sculpted clay world. Draw lines on the touch screen of the Wii U GamePad controller to create rainbow-colored clay ropes to move Kirby around freely, or tap him to attack enemies or blast through obstacles. Transformations include a submarine, rocket and tank. In underwater levels, Kirby dons a swim mask. If his power level gets too low, a clay bandage appears on his head.… Expand"}, {"name": "Chariot", "details_link": "https://www.metacritic.com/game/xbox-one/chariot", "publisher": "Frima Studio", "release_date": "Oct  1 2014", "developers": ["Frima Studio"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/610f124fc35816cbefa84de69c2eb00c-98.jpg", "descriptions": "Chariot is a humoristic physics-based couch co-op platformer in which a brave princess and her suitor carry a funeral wagon through ancient caves,  fending-off swarms of looters while amassing riches, to bury the King's remains in a worthy gold-filled tomb. If only that dead King wouldChariot is a humoristic physics-based couch co-op platformer in which a brave princess and her suitor carry a funeral wagon through ancient caves,  fending-off swarms of looters while amassing riches, to bury the King's remains in a worthy gold-filled tomb. If only that dead King would keep quiet...The Chariotâ€™s large wheels and long tethers allow the heroes to reach higher ground, swing across chasms and perform all sorts of impressive maneuvers. Extract riches from the very walls of the caves in multiple environments, and make your way to the exit by avoiding envious looters or by beating them back as they attempt to steal your hard-earned loot! With skill-testing coordination mechanics and thrilling physics-based stunts required, Chariot will definitely please couch coop enthusiasts as teamwork and cooperation unlocks new possibilities.… Expand"}, {"name": "Escape Plan", "details_link": "https://www.metacritic.com/game/playstation-4/escape-plan", "publisher": "SCEA", "release_date": "Dec  3 2013", "developers": ["Fun Bits"], "platforms": ["PlayStation Vita", "PlayStation 4"], "genres": ["Miscellaneous", "Puzzle", "Action", "General", "Puzzle", "General"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/519aa63f80da3c2edefc64a0bc737985-98.jpg", "descriptions": "Dice with death  and win  in this slapstick tale of survival.\r Guide Lil and Laarg to safety using unique touch controls to survive a perilous labyrinth of puzzles and booby traps.\r\nHelp these two hapless heroes by tapping the rear touch pad, blowing into the microphone and much more toDice with death  and win  in this slapstick tale of survival.\r Guide Lil and Laarg to safety using unique touch controls to survive a perilous labyrinth of puzzles and booby traps.\rHelp these two hapless heroes by tapping the rear touch pad, blowing into the microphone and much more to confuse enemies.\rBreathe a sigh of relief as they scrape through to freedom  and giggle when they come to a deliciously messy end.… Expand"}, {"name": "Prism: Light the Way", "details_link": "https://www.metacritic.com/game/ds/prism-light-the-way", "publisher": "Eidos Interactive", "release_date": "Oct 17 2007", "developers": ["Game Sauce"], "platforms": ["iPhone/iPad", "DS"], "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/b79d50c647cc0b6c1962fa45ef2a426b-98.jpg", "descriptions": "The Truly Brilliant Puzzle Game. Color the light, split the light, bounce and bend the light to create the one illuminating pattern that solves all. Solve 120 unique puzzles increasing in complexity and difficulty. Infinite Puzzle mode serves up and endless stream of fresh challenges.The Truly Brilliant Puzzle Game. Color the light, split the light, bounce and bend the light to create the one illuminating pattern that solves all. Solve 120 unique puzzles increasing in complexity and difficulty. Infinite Puzzle mode serves up and endless stream of fresh challenges. Beautifully addicting. [Eidos Interactive]… Expand"}, {"name": "The Sims 2", "details_link": "https://www.metacritic.com/game/gamecube/the-sims-2", "publisher": "Electronic Arts", "release_date": "Oct 24 2005", "developers": ["Maxis"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/497939f49f069605ed024bd8958c2763-98.jpg", "descriptions": "In The Sims 2, you can control your Sims over an entire lifetime for the first time. With the addition of genetics, the game lets your Sims pass their DNA down through generations. Every life choice you make has a relevant and dramatic effect on the lifetime of your Sim. Now it's up to youIn The Sims 2, you can control your Sims over an entire lifetime for the first time. With the addition of genetics, the game lets your Sims pass their DNA down through generations. Every life choice you make has a relevant and dramatic effect on the lifetime of your Sim. Now it's up to you to take your Sims from the cradle to the grave, while fulfilling their dreams and pushing them to extremes.… Expand"}, {"name": "Persona 3: Dancing in Moonlight", "details_link": "https://www.metacritic.com/game/playstation-4/persona-3-dancing-in-moonlight", "publisher": "Atlus", "release_date": "Dec  4 2018", "developers": ["Atlus"], "platforms": ["PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 73, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/1674c5871892c67a92df1a6db4216854-98.jpg", "descriptions": "Choose from several difficulty levels and dance alongside the members of SEES in a customizable rhythm game experience. Characters can tear up the dance floor with a partner by performing well during a song and entering “Fever” mode; try out some of your favorite character combinations."}, {"name": "Space Run", "details_link": "https://www.metacritic.com/game/pc/space-run", "publisher": "Focus Home Interactive", "release_date": "Jun 13 2014", "developers": ["Passtech Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Sci-Fi", "General", "Defense"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/4a8d089b7d5faf91ac670d684266dab8-98.jpg", "descriptions": "Space Run is a real-time spaceship construction strategy game. Space Run takes the well-known Tower Defense-style gameplay and twists it, challenging you to manage and protect a spaceship and its cargo against the hazards of deep space."}, {"name": "Century: Age of Ashes", "details_link": "https://www.metacritic.com/game/pc/century-age-of-ashes", "publisher": "Playwing", "release_date": "Dec  2 2021", "developers": ["Playwing"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 12 ", "genres": ["Simulation", "Flight", "Combat"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/6ebc8cb0cce516ccb18144037f49af22-98.jpg", "descriptions": "Century: Age of Ashes, the multiplayer dragon battle game is now available for free! Customize your dragon, dive into the arena and compete to become a legendary Dragoneer. Burn your enemies and rule the skies!Compete in intense online games ranging from 3v3 to 6v6 and discover theCentury: Age of Ashes, the multiplayer dragon battle game is now available for free! Customize your dragon, dive into the arena and compete to become a legendary Dragoneer. Burn your enemies and rule the skies!Compete in intense online games ranging from 3v3 to 6v6 and discover the fast-paced gameplay of Century : Age of Ashes! Dive into the arena alone or with friends and fight for your survival! Three varied game modes await you: Carnage, Spoils of War and Gates of Fire.Experience different play styles with 3 unique classes, each with their own abilities! Shield and disorient as the Windguard, track and destroy as the Marauder, or stealth and trap as the Phantom. How will you choose your path to victory?… Expand"}, {"name": "Need for Speed ProStreet", "details_link": "https://www.metacritic.com/game/playstation-3/need-for-speed-prostreet", "publisher": "EA Games", "release_date": "Nov 13 2007", "developers": ["EA Black Box"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/efefbea58b147695d9f6b108f523537a-98.jpg", "descriptions": "Need for Speed ProStreet accelerates street racing culture by providing the ultimate stage for the pursuit of street racing supremacy. It is a game about building the ultimate performance-tuned battle machine, taking it to multi-disciplinary showdowns all over the world and pitting yourNeed for Speed ProStreet accelerates street racing culture by providing the ultimate stage for the pursuit of street racing supremacy. It is a game about building the ultimate performance-tuned battle machine, taking it to multi-disciplinary showdowns all over the world and pitting your skills and reputation against the very best street racers. Need for Speed ProStreet boasts impeccable precision and impressively detailed photo-realistic graphics, effectively transporting you to the center of the action. It pushes the Autosculpt technology to a new level, allowing you to directly impact your car's performance for the first time as well as personalize its appearance. Need for Speed ProStreet is a true taste of raw adrenaline and racing with consequences. Every dent, every scratch and every crumpled body panel is a battle scar, proof of your commitment and competitive mettle. With an aggressive and skilled AI system, you become immersed in an unmatched believable race experience. Add in a revolutionary online mode that will redefine the meaning of competitive social play, and Need for Speed ProStreet is the ultimate formula for an emotionally charged street racing showdown. [Electronic Arts]… Expand"}, {"name": "Xeodrifter", "details_link": "https://www.metacritic.com/game/3ds/xeodrifter", "publisher": "Renegade Kid", "release_date": "Dec 11 2014", "developers": ["Renegade Kid"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "3DS"], "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/e917bf23bbc37790a80eee5e5e6a32f6-98.jpg", "descriptions": "Drifting through the stars.\r Xeodrifter is the story of an interstellar drifter traveling the stars on a simple mission of exploration. We join our nomad as he embarks on the investigation of a small cluster of four planets in the omega sector, after a collision with a rogue asteroidDrifting through the stars.\r Xeodrifter is the story of an interstellar drifter traveling the stars on a simple mission of exploration. We join our nomad as he embarks on the investigation of a small cluster of four planets in the omega sector, after a collision with a rogue asteroid damaged his warp core.\r Blast your way through alien landscapes, seek out valuable secrets, and defeat ancient guardians to unlock powers from a legendary supreme culture in this exciting journey of mystery and adventure.… Expand"}, {"name": "Alan Wake's American Nightmare", "details_link": "https://www.metacritic.com/game/pc/alan-wakes-american-nightmare", "publisher": "Remedy Entertainment", "release_date": "May 22 2012", "developers": ["Remedy Entertainment"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern", "Linear"], "meta_score": 73, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/2cc11e308caf194bfb8bf36421e21a3a-98.jpg", "descriptions": "The main story mode in Alan Wake's American Nightmare is part of the 'Night Springs' TV show fiction and offers an exaggerated pulp action adventure where the horrors of reality have the all too easy habit of coming true. Alan Wake finds himself stuck in an altered reality filled withThe main story mode in Alan Wake's American Nightmare is part of the 'Night Springs' TV show fiction and offers an exaggerated pulp action adventure where the horrors of reality have the all too easy habit of coming true. Alan Wake finds himself stuck in an altered reality filled with dangerous shadows; he must leap into action and pursue his evil doppelganger, Mr. Scratch, across the Arizona mesa towards the town of Night Springs. Scratch, a supernatural serial killer, has his evil plans set on Wake's wife, Alice. Wake must learn to control reality itself and unravel the secret to Mr. Scratch's demise while using the power of light to put an end to the darkness.… Expand"}, {"name": "Dead to Rights", "details_link": "https://www.metacritic.com/game/xbox/dead-to-rights", "publisher": "Namco", "release_date": "Aug 19 2002", "developers": ["Namco"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/86cea2e49a0fc272ae482fad766784f2-98.jpg", "descriptions": "Meet Jack Slate, a cop framed for murder and facing execution.  Slate escapes from Iron Point Maximum-Security Penitentiary to bring down the criminals that framed.  In Dead to Rights, you play the role of Slate, as he fights through the hard streets and corrupt enemies of Grant City.  ThereMeet Jack Slate, a cop framed for murder and facing execution.  Slate escapes from Iron Point Maximum-Security Penitentiary to bring down the criminals that framed.  In Dead to Rights, you play the role of Slate, as he fights through the hard streets and corrupt enemies of Grant City.  There are plenty of ways go about bringing the conspirators to justice--Jack can perform disarm moves, shoot different weapons, pick locks, fight hand-to-hand, and play minigames such as arm wrestling, bench press, and dancing.  In this gritty, crime-noir inspired epic, you're always on the run.… Expand"}, {"name": "Weird West", "details_link": "https://www.metacritic.com/game/playstation-4/weird-west", "publisher": "Devolver Digital", "release_date": "Mar 31 2022", "developers": ["Wolfeye Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/2dde4f436067a6d01fb917c31b3e6824-98.jpg", "descriptions": "Survive and unveil the mysteries of the Weird West through the intertwined destinies of its unusual heroes in an immersive sim from the co-creators of Dishonored and Prey. Discover a dark fantasy reimagining of the Wild West where lawmen and gunslingers share the frontier with fantasticalSurvive and unveil the mysteries of the Weird West through the intertwined destinies of its unusual heroes in an immersive sim from the co-creators of Dishonored and Prey. Discover a dark fantasy reimagining of the Wild West where lawmen and gunslingers share the frontier with fantastical creatures. Journey through the origin stories of a group of atypical heroes, written into legend by the decisions you make in an unforgiving land. Each journey is unique and tailored to the actions taken - a series of high stakes stories where everything counts and the world reacts to the choices you make. Form a posse or venture forth alone into an otherworldly confines of the Weird West and make each legend your own.… Expand"}, {"name": "LocoRoco Midnight Carnival", "details_link": "https://www.metacritic.com/game/psp/locoroco-midnight-carnival", "publisher": "SCEA", "release_date": "Oct 29 2009", "developers": ["SCE Japan Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "PSP"], "genres": ["Action", "Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Platformer", "General", "2D"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/4f97151ebe12ca434dc13a2b9a255d73-98.jpg", "descriptions": "[Playstation Network]  The mischievous Bui Bui has prepared brand new and super challenging stages filled with gimmicks ready for you to roll and bounce through in this brand new and exclusive to PlayStation Network installment in the fun, fast and super addictive LocoRoco series. Welcome to[Playstation Network]  The mischievous Bui Bui has prepared brand new and super challenging stages filled with gimmicks ready for you to roll and bounce through in this brand new and exclusive to PlayStation Network installment in the fun, fast and super addictive LocoRoco series. Welcome to the LocoRoco Midnight Carnival! Featuring super hard night time stages focusing on speed and temp and filled with lethal traps, will you be able to clear them or will you give up? It all depends on you. The key to surviving these perilous new stages is the brand new High Bounce, which lets you leap over barriers, climb up walls and speed up sliding LocoRoco. [Sony UK]… Expand"}, {"name": "Puzzle & Dragons Z + Puzzle & Dragons: Super Mario Bros. Edition", "details_link": "https://www.metacritic.com/game/3ds/puzzle-dragons-z-+-puzzle-dragons-super-mario-bros-edition", "publisher": "Nintendo", "release_date": "May 22 2015", "developers": ["GungHo"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/834efd63dd49d90e9a6e7afd8d67a231-98.jpg", "descriptions": "Two puzzling RPG adventures await you. Rescue Princess Peach from Bowser or defeat the evil group Paradox by battling enemies with the awesome power of orbs. Drag and match orbs, or chain together combos to deal massive blows to your enemies. Then bolster your forces with hundreds of uniqueTwo puzzling RPG adventures await you. Rescue Princess Peach from Bowser or defeat the evil group Paradox by battling enemies with the awesome power of orbs. Drag and match orbs, or chain together combos to deal massive blows to your enemies. Then bolster your forces with hundreds of unique monsters in this two-in-one game pack.\r In Puzzle & Dragons Super Mario Bros. Edition, you get to travel to different worlds as you assemble a team of Mushroom Kingdom baddies, like Goombas or Koopa Troopas, and recruit much-loved Mario characters, including Toad and Yoshi! Or in Puzzle & Dragons Z, battle the 5 powerful sky dragons to rebuild the world and customize your team with a plethora of different monsters. Allies gained in both games have the chance to evolve into more advanced forms and learn powerful new skills.… Expand"}, {"name": "Romancing SaGa: Minstrel Song Remastered", "details_link": "https://www.metacritic.com/game/playstation-5/romancing-saga-minstrel-song-remastered", "publisher": "Square Enix", "release_date": "Dec  1 2022", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 73, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/8/e8668c8d06320a444316007265bb4ea6-98.jpg", "descriptions": "In the long, long ago of 1992, Square Enix released the fantastic Romancing SaGa on the Super Famicon in Japan. The fourth 'SaGa' game, it revolutionized the series with its non-linear structure and innovative mechanics.13 years later, a remake was released for the PlayStation 2 in JapanIn the long, long ago of 1992, Square Enix released the fantastic Romancing SaGa on the Super Famicon in Japan. The fourth 'SaGa' game, it revolutionized the series with its non-linear structure and innovative mechanics.13 years later, a remake was released for the PlayStation 2 in Japan as \"Romancing SaGa: Minstrel Song\" and later in North America as \"Romancing Saga\". This new version of the game was faithful to the original but featured impressive 3D visuals and some welcome features that made the adventure more approachable for new players.Now, 17 years after that, it's back again - and it's bigger and better than ever.The game now features remastered HD graphics, new quality of life features that make it easier and more convenient to play, and you can even expect some new elements too!… Expand"}, {"name": "Paper Sorcerer", "details_link": "https://www.metacritic.com/game/pc/paper-sorcerer", "publisher": "Ultra Runaway Games", "release_date": "Nov  2 2013", "developers": ["Ultra Runaway Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "General"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/2192bb75a0387165f5d978331163e9ab-98.jpg", "descriptions": "Paper Sorcerer is a first-person turn-based RPG with adventure game elements inspired by Wizardry, Dungeons and Dragons, and Shadowgate."}, {"name": "Dungeon Hearts", "details_link": "https://www.metacritic.com/game/pc/dungeon-hearts", "publisher": "Devolver Digital", "release_date": "Mar 28 2013", "developers": ["Cube Roots"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/af2179bea494bed18b8e7cb0788536e7-98.jpg", "descriptions": "Dungeon Hearts could best be described as a blend of the ever-escalating pace of Canabalt, the puzzle/action hybrid style of Puzzle Quest, and the nostalgia of old-school Japanese RPG's such as Final Fantasy and Dragon Warrior. A brave party of adventurers dashes quickly from battle toDungeon Hearts could best be described as a blend of the ever-escalating pace of Canabalt, the puzzle/action hybrid style of Puzzle Quest, and the nostalgia of old-school Japanese RPG's such as Final Fantasy and Dragon Warrior. A brave party of adventurers dashes quickly from battle to battle, using a match-3 puzzle system to defeat their opponents. Mastering the balance between offense and defense is key. Between each battle, the player must quickly level up the warriors, as each encounter is more difficult than the last. As the party wades through wave after wave of enemies, they must adapt to the twists and turns thrown at them as the gameplay evolves. If they can survive long enough, they may encounter the Dark One himself!… Expand"}, {"name": "Driftmoon", "details_link": "https://www.metacritic.com/game/pc/driftmoon", "publisher": "Instant Kingdom", "release_date": "Oct  2 2012", "developers": ["Instant Kingdom"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/c1cc139e88280b357bce02a1d84693d6-98.jpg", "descriptions": "Driftmoon is an adventure RPG that is a cross between an adventure game and an RPG."}, {"name": "Buffy the Vampire Slayer: Chaos Bleeds", "details_link": "https://www.metacritic.com/game/xbox/buffy-the-vampire-slayer-chaos-bleeds", "publisher": "Sierra Entertainment", "release_date": "Aug 27 2003", "developers": ["Eurocom Entertainment Software"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/199808579771a69628c23bd30d70c407-98.jpg", "descriptions": "Buffy the Vampire Slayer: Chaos Bleeds lets you play as six characters from the TV show--Buffy, Faith, Willow, Xander, Spike, and a friend from the past. Use each character's unique abilities to defeat an ancient evil that threatens to destroy them and their world. Set in both familiar andBuffy the Vampire Slayer: Chaos Bleeds lets you play as six characters from the TV show--Buffy, Faith, Willow, Xander, Spike, and a friend from the past. Use each character's unique abilities to defeat an ancient evil that threatens to destroy them and their world. Set in both familiar and new locations, the game challenges you to overcome a variety of challenges. Chaos Bleeds also features several multiplayer modes, including Domination, Last Man Standing, Bunny Catcher, and Slayer Challenge.… Expand"}, {"name": "Dead to Rights", "details_link": "https://www.metacritic.com/game/playstation-2/dead-to-rights", "publisher": "Namco", "release_date": "Nov 18 2002", "developers": ["Namco"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 73, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/2ff031ea10b0a3e5ade2d6ba189752df-98.jpg", "descriptions": "A cop framed for murder and facing execution, makes a daring escape and seeks revenge on those who killed his father and set him up. What he discovers sends him on a downward spiral into a labyrinth of corruption, betrayal and crime. Meet Jack Slate. [Namco]"}, {"name": "Driver 2 Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/driver-2-advance", "publisher": "Atari", "release_date": "Oct 22 2002", "developers": ["Sennari Interactive"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Driving", "Mission-based"], "meta_score": 73, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/9b7c8dfa28fb302d8bdf33a47c8f20d9-98.jpg", "descriptions": "Get behind the wheel and back on the streets as Tanner, the world's fastest undercover driver. An international gang war has erupted, and you are caught in the crossfire. Experience all new urban chaos as you dodge U.S. and Brazilian gangsters."}, {"name": "Super Bust-A-Move 2", "details_link": "https://www.metacritic.com/game/playstation-2/super-bust-a-move-2", "publisher": "Ubisoft", "release_date": "Sep 24 2002", "developers": ["Taito Corporation"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Matching"], "meta_score": 73, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/9ac07b51fbdd39b2f6a65d332edb307e-98.jpg", "descriptions": "Check it ? the sequel to everybody?s favorite bubble-bustin? puzzle game is back with a new edit mode! Build your own puzzles from scratch, then challenge your friends to bust their way out."}, {"name": "NFL Blitz 20-03", "details_link": "https://www.metacritic.com/game/playstation-2/nfl-blitz-20-03", "publisher": "Midway", "release_date": "Aug 12 2002", "developers": ["Point of View"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 73, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/9270c6c28d1a44fabfb0b2d5758de449-98.jpg", "descriptions": "NFL Blitz is the only dedicated adrenaline-style football videogame franchise - providing bigger hits and wilder plays than any other football game. NFL Blitz 20-03 showcases intense 8-on-8 gameplay coupled with NFL strategy that challenges gamers to pick up the skills needed for the \"bigNFL Blitz is the only dedicated adrenaline-style football videogame franchise - providing bigger hits and wilder plays than any other football game. NFL Blitz 20-03 showcases intense 8-on-8 gameplay coupled with NFL strategy that challenges gamers to pick up the skills needed for the \"big time.\" Like a football highlight reel, NFL Blitz 20-03 allows gamers to execute adrenaline-style, over-the-top moves such as bulldozing and stiff-arming, outrageous dives and control over strong-armed, precision-passing quarterbacks who throw darts, bullets and bombs. [Midway] … Expand"}, {"name": "Warrior Kings", "details_link": "https://www.metacritic.com/game/pc/warrior-kings", "publisher": "Microids", "release_date": "Apr 13 2002", "developers": ["Black Cactus"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/38a14055115a2e7a9a43afb48f645e76-98.jpg", "descriptions": "Set in a fantastical medieval world where small Kingdoms struggle for supremacy in a chaotic land of knights, and demons, you are the ruler of a new kingdom, born from the ashes of a once mighty realm. To resurrect this realm to its former glory you must forge order out of chaos by unitingSet in a fantastical medieval world where small Kingdoms struggle for supremacy in a chaotic land of knights, and demons, you are the ruler of a new kingdom, born from the ashes of a once mighty realm. To resurrect this realm to its former glory you must forge order out of chaos by uniting the fragmented lands into a single, mighty empire under the rule of one warrior king - you. [Microids]… Expand"}, {"name": "Smash Court Tennis Pro Tournament", "details_link": "https://www.metacritic.com/game/playstation-2/smash-court-tennis-pro-tournament", "publisher": "Namco", "release_date": "Mar 20 2002", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Tennis"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/c7c9291a46be4af7e83b9fd89a4cd7ed-98.jpg", "descriptions": "Participate in four of the most prestigious tennis tournaments (Wimbledon, the U.S. Open, the Australian Open, and the \"Tournoi de Paris\") as one of the top-ranked players in the world, including Andre Agassi, Pete Sampras, Patrick Rafter, Yevgeny Kafelnikov, Martina Hingis, LindsayParticipate in four of the most prestigious tennis tournaments (Wimbledon, the U.S. Open, the Australian Open, and the \"Tournoi de Paris\") as one of the top-ranked players in the world, including Andre Agassi, Pete Sampras, Patrick Rafter, Yevgeny Kafelnikov, Martina Hingis, Lindsay Davenport, Monica Seles and Anna Kournikova.… Expand"}, {"name": "Lady Sia", "details_link": "https://www.metacritic.com/game/game-boy-advance/lady-sia", "publisher": "TDK Mediactive", "release_date": "Oct 15 2001", "developers": ["RFX Interactive"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/a2e7f91395dcfe807448f3d135c03717-98.jpg", "descriptions": "Join Lady Sia, bold defender of a world invaded by a race of ruthless beastmen. Help her use her sword and her wits in an intense battle across land, sea and air to free her people. Acquire the magic of the elements to defeat the giant T'Soa bosses, and invoke Sia's shapeshifting power in aJoin Lady Sia, bold defender of a world invaded by a race of ruthless beastmen. Help her use her sword and her wits in an intense battle across land, sea and air to free her people. Acquire the magic of the elements to defeat the giant T'Soa bosses, and invoke Sia's shapeshifting power in a final showdown against an unforgiving foe!… Expand"}, {"name": "Dave Mirra Freestyle BMX", "details_link": "https://www.metacritic.com/game/dreamcast/dave-mirra-freestyle-bmx", "publisher": "Acclaim", "release_date": "Nov 20 2000", "developers": ["Z-Axis", "Ltd."], "platforms": ["PC", "Dreamcast"], "genres": ["Sports", "Alternative", "Biking"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/a4a24bc4bb36f2d9b105bef6f334ae94-98.jpg", "descriptions": "Dial in to progressive freestyle BMX with 10-Time WorlD ChamPion Dave Mirra!\r*Ride as 10 top pros: Mirra, Nyquist, Ramsdell, Laird, McMurray, Harkin, Garcia, Butler, Kagy and Tim Mirra.\r*Innovative trick modifier lets you create your own riding style with more than 1,300 tricks!\r\n*Spin,Dial in to progressive freestyle BMX with 10-Time WorlD ChamPion Dave Mirra!\r*Ride as 10 top pros: Mirra, Nyquist, Ramsdell, Laird, McMurray, Harkin, Garcia, Butler, Kagy and Tim Mirra.\r*Innovative trick modifier lets you create your own riding style with more than 1,300 tricks!\r*Spin, grind ans stall your way through 12 free-roaming vert, dirt and street levels.\r*10 different multi-player games including Sickest Trick and Gnarliest Crash.\r*Killer soundtrack: Sublime, Cypress Hill, Rancid, Social Distortion, Deftones, Pennywise, Dropkick Murphys, 59 Times the Pain, Primer 55 and Swingin' Utters.… Expand"}, {"name": "Body Harvest", "details_link": "https://www.metacritic.com/game/nintendo-64/body-harvest", "publisher": "Midway", "release_date": "Sep 30 1998", "developers": ["DMA Design"], "platforms": "Nintendo 64", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 73, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/8f7053cf7b76d2f85bbe6b1ae8ef03c9-98.jpg", "descriptions": "Earth is dead. Mankind annihilated. Hunted to extinction by a century of alien attacks. One last, desperate chance remains - CHANGE HISTORY. Someone must travel back in time and attack the alien predators before they complete their hideous invasion. Genetically enhanced marine, Adam Drake,Earth is dead. Mankind annihilated. Hunted to extinction by a century of alien attacks. One last, desperate chance remains - CHANGE HISTORY. Someone must travel back in time and attack the alien predators before they complete their hideous invasion. Genetically enhanced marine, Adam Drake, must make the trip into the far reaches of Earth's history. His goal - stop the alien body harvest... Travel with Adam Drake through 5 incredible levels of action-packed adventure, spanning more than a century of Earth history!… Expand"}, {"name": "LEGO Pirates of the Caribbean: The Video Game", "details_link": "https://www.metacritic.com/game/playstation-3/lego-pirates-of-the-caribbean-the-video-game", "publisher": "Disney Interactive Studios", "release_date": "May 10 2011", "developers": ["Traveller's Tales"], "platforms": ["3DS", "PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/b841f35a503abbf9fd1026531667b83d-98.jpg", "descriptions": "LEGO Pirates of the Caribbean: The Video Game will be based in the world of the globally successful film franchise, incorporating storylines, locations and characters from the first three films (\"Pirates of the Caribbean: The Curse of the Black Pearl,\" \"Pirates of theLEGO Pirates of the Caribbean: The Video Game will be based in the world of the globally successful film franchise, incorporating storylines, locations and characters from the first three films (\"Pirates of the Caribbean: The Curse of the Black Pearl,\" \"Pirates of the Caribbean: Dead Man's Chest\" and \"Pirates of the Caribbean: At World's End\") as well as the upcoming fourth film, \"Pirates of the Caribbean: On Stranger Tides.\" … Expand"}, {"name": "Deus Ex: Human Revolution - The Missing Link", "details_link": "https://www.metacritic.com/game/pc/deus-ex-human-revolution---the-missing-link", "publisher": "Square Enix", "release_date": "Oct 18 2011", "developers": ["Eidos Montreal"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/4461ce37393a047bc20fb907165be8c1-98.jpg", "descriptions": "The DEUS EX: HUMAN REVOLUTION conspiracy grows deeper in The Missing Link. During lead character Adam Jensen’s quest for the truth in DEUS EX: HUMAN REVOLUTION, he mysteriously vanishes for three days. Where was he? What did he find out? The Missing Link reveals it all."}, {"name": "King's Bounty: Dark Side", "details_link": "https://www.metacritic.com/game/pc/kings-bounty-dark-side", "publisher": "1C", "release_date": "May 16 2014", "developers": ["1C-Softclub"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "Fantasy"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/153481ce932d7989b29001271d1eca1f-98.jpg", "descriptions": "Time has come to join the dark side. Take a trip to the other side of Teana, to the part of the world that has yet remained unseen to the royal bounty hunters."}, {"name": "NBA Baller Beats", "details_link": "https://www.metacritic.com/game/xbox-360/nba-baller-beats", "publisher": "Majesco Games", "release_date": "Sep 11 2012", "developers": ["HB Studios Multimedia"], "platforms": "Xbox 360", "genres": ["Action", "Sports", "Traditional", "Rhythm", "Team", "Baseball", "Music", "Arcade", "Arcade"], "meta_score": 73, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/d0f6a3f86b0f129d661da58d7d079a5e-98.jpg", "descriptions": "NBA Baller Beats is the 1st motion-based sports video game that requires you to actively play using a real basketball. The music guides you as you attempt to perform like a professional and practice your ball-handling skills while building the stamina you’ll need for the hardcourt – allNBA Baller Beats is the 1st motion-based sports video game that requires you to actively play using a real basketball. The music guides you as you attempt to perform like a professional and practice your ball-handling skills while building the stamina you’ll need for the hardcourt – all while having the fun of playing a video game. … Expand"}, {"name": "Fritz 9: Play Chess", "details_link": "https://www.metacritic.com/game/pc/fritz-9-play-chess", "publisher": "Viva Media", "release_date": "Dec 15 2005", "developers": ["ChessBase"], "platforms": "PC", "num_players": "2  Online", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 73, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/c9c8a730a86b0ed647eff0e70876ef63-98.jpg", "descriptions": "Deep in the shrouds of history we find the world's first chess machine, the legendary Chess Turk. Built by a Baron for a Queen, the automaton was half human, half robot. Napoleon Bonaparte battled against it, Benjamin Franklin bowed to its brilliant play, and Edgar Allan Poe tried to dissectDeep in the shrouds of history we find the world's first chess machine, the legendary Chess Turk. Built by a Baron for a Queen, the automaton was half human, half robot. Napoleon Bonaparte battled against it, Benjamin Franklin bowed to its brilliant play, and Edgar Allan Poe tried to dissect it with his analytical mind, torn between fear and fascination. Now you can relive history and play the dreaded Turk yourself - in perfect 3D animation, 235 years after the empress Maria Theresia had the ancestor of all chess computer programs let built. Experience the fascination of the chess duel \"Man vs. Machine\" in a unique combination from past and present: the Turk & Fritz Chess 9. Face up to the duel. As did World Champion Vladimir Kramnik and Garry Kasparov, who, followed by millions of chess fans, played for mankind against FRITZ. [Excalibur]… Expand"}, {"name": "South of the Circle", "details_link": "https://www.metacritic.com/game/playstation-5/south-of-the-circle", "publisher": "11 bit studios", "release_date": "Aug  3 2022", "developers": ["State of Play Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/9413d0ce9c9d1be61b21e57a253ce306-98.jpg", "descriptions": "Antarctica, 1964.A crashed aircraft, tail to the sky.\n\nCambridge academic Peter stumbles from the wreckage in search of help, fighting the cold. As his attempts to escape the ice grow more desperate, the lines between his past and present begin to blur.\n\nA love story between colleaguesAntarctica, 1964.A crashed aircraft, tail to the sky.Cambridge academic Peter stumbles from the wreckage in search of help, fighting the cold. As his attempts to escape the ice grow more desperate, the lines between his past and present begin to blur.A love story between colleagues Peter and Clara, set against the backdrop of the Cold War, South of the Circle is a narrative adventure game about memory, survival, and the consequences of not dealing with the past.… Expand"}, {"name": "Life is Strange 2: Episode 3 - Wastelands", "details_link": "https://www.metacritic.com/game/xbox-one/life-is-strange-2-episode-3---wastelands", "publisher": "Square Enix", "release_date": "May  9 2019", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/316c0120ae2a8e1ece4c478f8cff0e6c-98.jpg", "descriptions": "Sean and Daniel Diaz’s journey to Mexico continues in Episode 3, a few months after the events in Episode 2 and the boys’ escape from Beaver Creek. The brothers experience life on the fringes of society, as they befriend a close-knit community of drifters and runaways, and become embroiledSean and Daniel Diaz’s journey to Mexico continues in Episode 3, a few months after the events in Episode 2 and the boys’ escape from Beaver Creek. The brothers experience life on the fringes of society, as they befriend a close-knit community of drifters and runaways, and become embroiled in the illegal cannabis trade among the towering redwood forests of California. Sean and Daniel’s resolve is put to the test once again, as new relationships create friction between them and they both learn much about who they are as individuals. Uncertain about their once united purpose, can they stay together, or will their journey together end here?… Expand"}, {"name": "Mom Hid My Game!", "details_link": "https://www.metacritic.com/game/switch/mom-hid-my-game!", "publisher": "Kemco", "release_date": "Dec 21 2017", "developers": ["Hap"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/6493ddbbdf5194461c36eda1ecb99c22-98.jpg", "descriptions": "It's gone! My game is lost! Take back to hunting for consoles hidden by Mom!Let's find the game console Mom hid!Is it inside the chest or on the shelf? Could it be under the sofa, too?Where is it!?Find the 'game' in each level using various items!An easy-going and funny escape game awaits!"}]