[{"name": "Steel Division: Normandy 44", "details_link": "https://www.metacritic.com/game/pc/steel-division-normandy-44", "publisher": "Paradox Interactive", "release_date": "May 23 2017", "developers": ["Eugen Systems"], "platforms": "PC", "num_players": "Up to 20 ", "genres": ["Strategy", "Real-Time", "General", "Tactics"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/c257908d277a57286d444f786fb2c65b-98.jpg", "descriptions": "Steel Division: Normandy is a tactical real-time strategy (RTS) game that pits players against AI enemies in a single-player campaign -- or against several opponents in massive 10-on-10 multiplayer battles."}, {"name": "Hearts of Iron IV", "details_link": "https://www.metacritic.com/game/pc/hearts-of-iron-iv", "publisher": "Paradox Interactive", "release_date": "Jun  6 2016", "developers": ["Paradox Development Studio"], "platforms": "PC", "genres": ["Historic", "Strategy", "Real-Time", "General"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/aee0c6f167cecc97d1d2c8b486c48d31-98.jpg", "descriptions": "Hearts of Iron IV challenges players to face the brutal conflict of World War II in a multifaceted grand strategy game, where history can be fully relived or rewritten from the perspective of a global superpower attempting to change the world, or a small nation simply trying to survive."}, {"name": "Nintendogs: Dachshund & Friends", "details_link": "https://www.metacritic.com/game/ds/nintendogs-dachshund-friends", "publisher": "Nintendo", "release_date": "Aug 22 2005", "developers": ["Nintendo"], "platforms": "DS", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual Life", "Virtual", "Pet"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/1b61567b186d8d935dfb1fecfd4c4b17-98.jpg", "descriptions": "Players care for and train their puppy by petting it, walking it and buying it supplies to play with. As a puppy competes in obedience and agility trials, owners can win money to purchase other puppy breeds. The pups will vary in gender, coloration and personality. Players purchase one ofPlayers care for and train their puppy by petting it, walking it and buying it supplies to play with. As a puppy competes in obedience and agility trials, owners can win money to purchase other puppy breeds. The pups will vary in gender, coloration and personality. Players purchase one of several breeds available at the beginning, then start spending time with their pup. They throw flying discs and balls to improve the pup’s agility, bathe it when it gets dirty and use their own personal voice commands to train the dog to do tricks. If players train it well enough, they will excel in obedience and agility trials and disc competitions, which will earn money that they can use to buy other supplies and puppy breeds. When players earn enough cash, they can buy even more puppies to live with their original pup. Players can socialize their pups by walking them around the town, where they will meet neighborhood dogs, and maybe even find new toys. Trips to the park and gym offer valuable training time to prepare for agility trials and disc competitions. Over time, the pup's stamina will increase so players can explore farther and farther. Players also can interact wirelessly with their friends' Nintendogs – they can set their DS to bark whenever another puppy is within wireless range. [Nintendo]… Expand"}, {"name": "Crisis Core: Final Fantasy VII Reunion", "details_link": "https://www.metacritic.com/game/xbox-series-x/crisis-core-final-fantasy-vii-reunion", "publisher": "Square Enix", "release_date": "Dec 13 2022", "developers": ["Square Enix", "TOSE"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/6d4f4823296e5b3c61e1ca07e4631ce4-98.jpg", "descriptions": "CRISIS CORE -FINAL FANTASY VII- REUNION is a full remaster of the PlayStation Portable exclusive CRISIS CORE -FINAL FANTASY VII-, which originally launched back in 2007.CRISIS CORE -FINAL FANTASY VII- REUNION is a true remaster that follows the original's narrative: Zack Fair's mission toCRISIS CORE -FINAL FANTASY VII- REUNION is a full remaster of the PlayStation Portable exclusive CRISIS CORE -FINAL FANTASY VII-, which originally launched back in 2007.CRISIS CORE -FINAL FANTASY VII- REUNION is a true remaster that follows the original's narrative: Zack Fair's mission to find the missing SOLDIER Genesis Rhapsodos. It features multiple improvements from the original game - for example, the graphics have been converted to HD, with all the 3D models, from the characters to everything else, being fully refreshed. What's more the dialogue is now fully voice-acted, and there's a new arrangement for the soundtrack!… Expand"}, {"name": "Tales From Off-Peak City Vol. 1", "details_link": "https://www.metacritic.com/game/pc/tales-from-off-peak-city-vol-1", "publisher": "Cosmo D Studios", "release_date": "May 15 2020", "developers": ["Cosmo D Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "First-Person"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/c53923f3753a68fc88974421547c1362-98.jpg", "descriptions": "On the corner of July Avenue and Yam Street, all is not what it seems. What role will you play in a city's fate?"}, {"name": "Dynasty Warriors 8: Xtreme Legends - Definitive Edition", "details_link": "https://www.metacritic.com/game/switch/dynasty-warriors-8-xtreme-legends---definitive-edition", "publisher": "Koei Tecmo Games", "release_date": "Dec 27 2018", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 83, "users_score": 9.2, "image": "https://static.metacritic.com/images/products/games/7/d5180b4572f7205dd8be6ba83e52392e-98.jpg", "descriptions": "'Dynasty Warriors 8: Xtreme Legends' introduces entirely new levels of fun to the refreshing gameplay vanquishing swarms of enemies with mighty warriors found in 'Dynasty Warrors 8.' In story mode, where you can immerse yourself in the vivid tales of the Romance of the Three Kingdoms, it is'Dynasty Warriors 8: Xtreme Legends' introduces entirely new levels of fun to the refreshing gameplay vanquishing swarms of enemies with mighty warriors found in 'Dynasty Warrors 8.' In story mode, where you can immerse yourself in the vivid tales of the Romance of the Three Kingdoms, it is now possible to play as the mighty warrior 'Lu Bu,' and embark on a journey that depicts his way of life. Additionally, many new hypothetical scenarios to existing Romance of the Three Kingdoms battles have been added, as well as new playable characters, weapons types, growth/speedrun elements, and more! What's more, a revamped Ambition Mode and completely new Challenge Mode offer whole new ways to enjoy the 'Dynasty Warriors 8' universe.… Expand"}, {"name": "Skylanders Swap Force", "details_link": "https://www.metacritic.com/game/xbox-360/skylanders-swap-force", "publisher": "Activision", "release_date": "Oct 13 2013", "developers": ["Vicarious Visions"], "platforms": ["3DS", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox One", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 83, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/128d9f97b65dc8fe6701311c7ce59ed1-98.jpg", "descriptions": "In Skylanders SWAP Force, Portal Masters embark on an adventure in the mysterious Cloudbreak Islands, where a magical volcano gives the heroes the power to swap halves, turning them into a special team known as the SWAP Force. By reassembling this team, Portal Masters must send back Kaos andIn Skylanders SWAP Force, Portal Masters embark on an adventure in the mysterious Cloudbreak Islands, where a magical volcano gives the heroes the power to swap halves, turning them into a special team known as the SWAP Force. By reassembling this team, Portal Masters must send back Kaos and his evil plan to Cloudbreak in order to save Skylands.… Expand"}, {"name": "Yoku's Island Express", "details_link": "https://www.metacritic.com/game/xbox-one/yokus-island-express", "publisher": "Villa Gorilla", "release_date": "May 29 2018", "developers": ["Villa Gorilla"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Pinball"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/9fedebe45fd9352a794de1ee0550d9b8-98.jpg", "descriptions": "Yoku’s Island Express is an open world/metroidvania-style pinball adventure, Seamlessly blending platform navigation with pinball mechanics across a large open world."}, {"name": "Dark Souls II: Crown of the Sunken King", "details_link": "https://www.metacritic.com/game/playstation-3/dark-souls-ii-crown-of-the-sunken-king", "publisher": "Bandai Namco Games", "release_date": "Jul 22 2014", "developers": ["Namco Bandai Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/1c5daca1808e99ee095ed943d91015b0-98.jpg", "descriptions": "Embark on a journey to reclaim a crown that Drangleic's King Vendrick once owned. This perilous quest will lead you through an entirely different world within the Dark Souls II universe, where stepped pyramids span a vast underground cavern. It is said that one of the ancient crowns layEmbark on a journey to reclaim a crown that Drangleic's King Vendrick once owned. This perilous quest will lead you through an entirely different world within the Dark Souls II universe, where stepped pyramids span a vast underground cavern. It is said that one of the ancient crowns lay buried deep within these dark caverns; but surely such a valued item cannot sit unguarded. Explore in search of a crown that holds the strength of lords from times long past.… Expand"}, {"name": "Europa Universalis III", "details_link": "https://www.metacritic.com/game/pc/europa-universalis-iii", "publisher": "Paradox Interactive", "release_date": "Jan 23 2007", "developers": ["Paradox Development Studio"], "platforms": "PC", "num_players": "32  Online", "genres": ["Strategy", "General", "General"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/4d494d1c377878e74975e5c97a1be088-98.jpg", "descriptions": "Players can enjoy over 300 years of gameplay by starting at ANY date between 1453 and 1789. Nation building is flexible: decide your own form of government, the structure of your society, trade politics and much more. The great people and personalities of the past are on hand to support you.Players can enjoy over 300 years of gameplay by starting at ANY date between 1453 and 1789. Nation building is flexible: decide your own form of government, the structure of your society, trade politics and much more. The great people and personalities of the past are on hand to support you. Take history in your hands and call personalities like Sir Isaac Newton, Wolfgang Amadeus Mozart or René Descartes to your court. A lush topographic map in full 3D allows for a rich and complete world view, and contains more than 1700 provinces and sea zones. Lead any one of more than 250 countries that originally existed during the game’s extensive time span. Have more than a thousand historical leaders and over 4000 historical Monarchs at your disposal. Manage more than 100 individual unit troops to secure as much power as possible. Co-operative multiplayer mode allows several players to work together to control a single nation. Customize your game: Europa Universalis III gives you the chance to customize and mod practically anything your heart may desire. [Paradox]… Expand"}, {"name": "FIFA 19", "details_link": "https://www.metacritic.com/game/xbox-one/fifa-19", "publisher": "Electronic Arts", "release_date": "Sep 25 2018", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 83, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/9/0e0cc057965903483a5bafcb2962b12e-98.jpg", "descriptions": "EA Sports FIFA 19 delivers a champion-caliber experience on and off the pitch. Introducing the prestigious UEFA Champions League, offering authentic in-match atmospheres, featuring gameplay updates including elevated on-pitch personality and a striking overhaul, and providing new andEA Sports FIFA 19 delivers a champion-caliber experience on and off the pitch. Introducing the prestigious UEFA Champions League, offering authentic in-match atmospheres, featuring gameplay updates including elevated on-pitch personality and a striking overhaul, and providing new and unrivaled ways to play. Champions Rise in FIFA 19.\r Features:\r * UEFA Champions League coming to FIFA 19 -- There's no higher level in club football than the UEFA Champions League. Dreams are achieved and legends are made in this historic tournament that showcases the best clubs in the world. FIFA 19 for the PlayStation 4, Xbox One, PC and Nintendo Switch is infused with the UEFA Champions League, thanks to official match presentation, a variety of tournament experiences that includes the Europa League and Super Cup, and an all-new commentary team in Derek Rae and Lee Dixon.\r * Brand new modes -- Experience the all-new standalone UEFA Champions League mode to play the famous tournament from the group stage to the final at the The Wanda Metropolitano Stadium in Madrid. Discover deep integration of the massive club competition in both Kick Off and Career Mode. Build your dream squad with live UEFA Champions League and Europa League content updates in FIFA 19 Ultimate Team. No matter where or how you play FIFA 19, you can experience the greatest club football competition in the world.… Expand"}, {"name": "Rhythm Heaven Megamix", "details_link": "https://www.metacritic.com/game/3ds/rhythm-heaven-megamix", "publisher": "Nintendo", "release_date": "Jun 15 2016", "developers": ["Nintendo"], "platforms": "3DS", "genres": ["Action", "Rhythm", "Music"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/0a0c5f3f6855ccd32b80664d9aec7666-98.jpg", "descriptions": "(Also known as \"Rhythm Paradise Megamix\") Test your rhythm by chopping wood, sticking speeding viruses with forks and playing badminton while flying an airplane, all in time to catchy tunes in this deceptively challenging rhythm game. The accessible controls and catchy music, combined with(Also known as \"Rhythm Paradise Megamix\") Test your rhythm by chopping wood, sticking speeding viruses with forks and playing badminton while flying an airplane, all in time to catchy tunes in this deceptively challenging rhythm game. The accessible controls and catchy music, combined with the new visual feedback system, make this a great entry in the Rhythm Heaven series. Can you match the beat and reach Rhythm Heaven?\r FEATURES:\r -Features updated rhythm games from the Game Boy Advance, Wii and Nintendo DS Rhythm Heaven games.\r-A combo of new rhythm games, fan-favorites, and U.S. debuts make this the ultimate Rhythm Heaven game\r  Rhythm Heaven Megamix includes more than 70 rhythm games, the most in the series.\r-Some Rhythm Heaven rhythm games found only in Japan make their North American debut with new music.\r-Soundtrack created with help from legendary Japanese music producer, Tsunku♂.\r-Encounter others with the StreetPass feature for a chance to match their punching robot's skills in a 1-on-1 battle.\r-Play with up to four players simultaneously and take on special multiplayer rhythm games to earn Flow Balls (additional systems and games required for multiplayer mode; sold separately).\r-Purchase additional rhythm games by spending Flow Balls.… Expand"}, {"name": "Duskers", "details_link": "https://www.metacritic.com/game/pc/duskers", "publisher": "Misfits Attic", "release_date": "May 18 2016", "developers": ["Misfits Attic"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 83, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/85d4321a6c9fe1f76a8ec16af92b9a73-98.jpg", "descriptions": "Pilot drones into derelict spaceships to find the means to survive and piece together how the universe became a giant graveyard."}, {"name": "F1 2011", "details_link": "https://www.metacritic.com/game/pc/f1-2011", "publisher": "Codemasters", "release_date": "Sep 19 2011", "developers": ["Codemasters"], "platforms": ["3DS", "PlayStation 3", "PlayStation Vita", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 83, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/7a215ddd210f3ef99ee1713e9258eed2-98.jpg", "descriptions": "In F1 2011 players will be challenged to ‘Be the driver, live the life, go compete,’ with wide-ranging technical and gameplay advancements on and off track and vastly extended competitive and co-operative multiplayer components.  F1 2011 will feature all of the official teams, drivers andIn F1 2011 players will be challenged to ‘Be the driver, live the life, go compete,’ with wide-ranging technical and gameplay advancements on and off track and vastly extended competitive and co-operative multiplayer components.  F1 2011 will feature all of the official teams, drivers and circuits from the highly anticipated 2011 FIA FORMULA ONE WORLD CHAMPIONSHIP, including the current FIA FORMULA ONE Drivers’ World Champion Sebastian Vettel.  The 2011 season also sees the debut of the 2011 FORMULA 1 GRAND PRIX OF INDIA at Delhi’s Jaypee International Race Circuit and the return of the iconic Nürburgring to the calendar. … Expand"}, {"name": "Severed", "details_link": "https://www.metacritic.com/game/wii-u/severed", "publisher": "DrinkBox Studios", "release_date": "Sep 22 2016", "developers": ["DrinkBox Studios"], "platforms": ["3DS", "iPhone/iPad", "PlayStation Vita", "Switch", "Wii U"], "genres": ["Action Adventure", "General"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/d95140662e3a4395ca8371d977b9b4e1-98.jpg", "descriptions": "Severed follows the saga of a distraught warrior, who is lost in a fantastical world, as she knits together pieces of her story from both the past and the future. As the heroine, players will embark on a journey through a surreal, nonlinear world by using a gesture-based combat mechanic toSevered follows the saga of a distraught warrior, who is lost in a fantastical world, as she knits together pieces of her story from both the past and the future. As the heroine, players will embark on a journey through a surreal, nonlinear world by using a gesture-based combat mechanic to defeat enemies in this first-person adventure. During their journey, players will unlock new abilities, discover secrets of the land, and grow in power as they master both offensive and defensive techniques.… Expand"}, {"name": "Prince of Persia: Warrior Within", "details_link": "https://www.metacritic.com/game/pc/prince-of-persia-warrior-within", "publisher": "Ubisoft", "release_date": "Nov 30 2004", "developers": ["Ubisoft Montreal"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "Fantasy", "Linear"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/53c045708779b402d5447b87a924fe5a-98.jpg", "descriptions": "The Prince has to embark upon a path of both carnage and mystery to defy his preordained death. His journey leads to the infernal core of a cursed island stronghold harboring mankind's greatest fears. Only through grim resolve, bitter defiance and the mastery of deadly new combat arts canThe Prince has to embark upon a path of both carnage and mystery to defy his preordained death. His journey leads to the infernal core of a cursed island stronghold harboring mankind's greatest fears. Only through grim resolve, bitter defiance and the mastery of deadly new combat arts can the Prince rise to a new level of warriorship - and emerge from this ultimate trial with his life. In order to accomplish his mission, the Prince benefits from a brand new free-form fighting system that allows gamers to channel his anger as they wage battle without boundaries. Each game fan will find his or her own unique fighting style as they manipulate their environment and control the Ravages of Time. You can dig into an arsenal of weapons that, when used in combination, create advanced arm attacks that verge on fatal artistry! Prince of Persia: Warrior Within promises that game fans will fight harder, and play longer, emerging from the experience as deadly-capable skilled masters of their own unique combat art form. [Ubisoft]… Expand"}, {"name": "Door Kickers", "details_link": "https://www.metacritic.com/game/pc/door-kickers", "publisher": "KillHouse Games", "release_date": "Oct 20 2014", "developers": ["KillHouse Games"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "Online Multiplayer", "genres": ["Modern", "Modern", "Strategy", "Real-Time", "General", "Tactics"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/00ffa31b6b78ccd58b3df36296490adb-98.jpg", "descriptions": "Door Kickers is a realtime strategy game that puts you in charge of a SWAT team and lets you command them during a tactical intervention."}, {"name": "Infernax", "details_link": "https://www.metacritic.com/game/playstation-4/infernax", "publisher": "The Arcade Crew", "release_date": "Feb 14 2022", "developers": ["Berzerk Studio"], "platforms": ["PC", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "Metroidvania"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/ebbe2c92633187d484f69946eecb9be3-98.jpg", "descriptions": "Infernax is the adventures of a great knight who returns to his homeland only to find it plagued with unholy magic. Uncover the mysteries of the curse and face the consequences of your actions."}, {"name": "Counter-Strike: Global Offensive", "details_link": "https://www.metacritic.com/game/pc/counter-strike-global-offensive", "publisher": "Valve Software", "release_date": "Aug 21 2012", "developers": ["Valve Software", "Hidden Path Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern"], "meta_score": 83, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/c25c8c7ddbc9eaf2b566795753c29be8-98.jpg", "descriptions": "Counter-Strike: Global Offensive features new maps, characters, and weapons and\rdelivers updated versions of the classic CS content."}, {"name": "Resident Evil 7: biohazard", "details_link": "https://www.metacritic.com/game/pc/resident-evil-7-biohazard", "publisher": "Capcom", "release_date": "Jan 23 2017", "developers": ["Capcom"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/60622e34f7a82fa43b6efa08537a3c35-98.jpg", "descriptions": "Fear and isolation seep through the walls of an abandoned southern farmhouse. \"7\" marks a new beginning for survival horror with the Isolated View of the visceral new first-person perspective. Powered by the RE Engine, horror reaches incredible heights of immersion as players enter aFear and isolation seep through the walls of an abandoned southern farmhouse. \"7\" marks a new beginning for survival horror with the Isolated View of the visceral new first-person perspective. Powered by the RE Engine, horror reaches incredible heights of immersion as players enter a terrifyingly new world of fear as they fight to survive.… Expand"}, {"name": "Owlboy", "details_link": "https://www.metacritic.com/game/xbox-one/owlboy", "publisher": "Soedesco", "release_date": "Apr 10 2018", "developers": ["BlitWorks"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 83, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/96f1e9bf9d0e841bceeccc489e77dda3-98.jpg", "descriptions": "Owlboy is a vertical platform adventure set in the sky, where the islands of the world have been spread apart after a great calamity. You play as Otus, among the last of the Owls, a renowned race that has produced many of the world's great wonders"}, {"name": "OlliOlli2: XL Edition", "details_link": "https://www.metacritic.com/game/xbox-one/olliolli2-xl-edition", "publisher": "Team17", "release_date": "May 24 2016", "developers": ["roll7"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One"], "genres": ["Sports", "Individual", "Skate / Skateboard"], "meta_score": 83, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/600ab41185a5b47c68cbf2917f4a4886-98.jpg", "descriptions": "OlliOlli2: Welcome to Olliwood plucks the iconic skater from the street and dropping him squarely in the middle of the Big Screen’s most bodacious cinematic locations."}, {"name": "Frequency", "details_link": "https://www.metacritic.com/game/playstation-2/frequency", "publisher": "SCEA", "release_date": "Nov 19 2001", "developers": ["Harmonix Music Systems"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/bf325026bf7ac5692c718807fae9d02f-98.jpg", "descriptions": "Utilizing songs from major artists, players mix and remix songs through each of eight different instrument types. If remixed correctly, players can freestyle to create their own music. With 6 unique game modes, top hits from major bands, stunning 3D graphics, and video sequences of yourUtilizing songs from major artists, players mix and remix songs through each of eight different instrument types. If remixed correctly, players can freestyle to create their own music. With 6 unique game modes, top hits from major bands, stunning 3D graphics, and video sequences of your favorite bands, FREQUENCY stays in tune with \"the most immersive musical gameplay experience ever.\" [SCEA]… Expand"}, {"name": "The Last Campfire", "details_link": "https://www.metacritic.com/game/switch/the-last-campfire", "publisher": "Hello Games", "release_date": "Aug 27 2020", "developers": ["Hello Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/795926e15f58893ac437da8e4d31d65c-98.jpg", "descriptions": "DISCOVER A PURPOSEThe Last Campfire is an adventure, a story of a lost ember trapped in a puzzling place, searching for meaning and a way home.\n\nON A JOURNEY\nTravel deeper into the lands beyond the dark forest and overcome the adversities before you.\n\nUNCOVER A WORLD\nDiscover beautifulDISCOVER A PURPOSEThe Last Campfire is an adventure, a story of a lost ember trapped in a puzzling place, searching for meaning and a way home.ON A JOURNEYTravel deeper into the lands beyond the dark forest and overcome the adversities before you.UNCOVER A WORLDDiscover beautiful wilderness filled with lost folk, strange creatures and mysterious ruins.LIGHT THE LAST CAMPFIREFind hope and carry it with you on your Journey to light The Last Campfire.FROM A SMALL STUDIOA unique tale from Hello Games and the creative minds behind LostWinds.… Expand"}, {"name": "Call of Duty: World at War", "details_link": "https://www.metacritic.com/game/wii/call-of-duty-world-at-war", "publisher": "Activision", "release_date": "Nov 10 2008", "developers": ["Exakt"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "8  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/0fbecc48c1f49f6a04af3e719c1b4236-98.jpg", "descriptions": "Utilizing the Call of Duty 4: Modern Warfare engine, Call of Duty: World at War throws out the rulebook of war to transform WWII combat through a new enemy, new tactics and an uncensored experience of the climatic battles that gripped a generation. As U.S. Marines and Russian soldiers,Utilizing the Call of Duty 4: Modern Warfare engine, Call of Duty: World at War throws out the rulebook of war to transform WWII combat through a new enemy, new tactics and an uncensored experience of the climatic battles that gripped a generation. As U.S. Marines and Russian soldiers, players employ new features like cooperative gameplay, and weapons such as the flamethrower in the most chaotic and cinematically intense experience to date. Call of Duty: World at War introduces co-operative play, bringing fresh meaning to the \"No One Fights Alone\" mantra with up to four-players online for Xbox 360, PS3 and PC, or two-player local split-screen on consoles. Nintendo Wii will also support a unique co-op mode for two players. For the first time ever players can experience harrowing single-player missions together for greater camaraderie and tactical execution.  The co-op campaign allows players to rank up and unlock perks in competitive multiplayer by completing challenges and earning experience points, adding continuous re-playability and team-based gameplay. Whether playing competitively or cooperatively – if players are online with Call of Duty: World at War – they always gain experience points. Based on a player’s experience rank and rank of the player's friends, Call of Duty: World at War scales dynamically to provide a deeper level of challenge. [Activision]… Expand"}, {"name": "Iconoclasts", "details_link": "https://www.metacritic.com/game/playstation-4/iconoclasts", "publisher": "Bifrost Entertainment", "release_date": "Jan 23 2018", "developers": ["Joakim Sandberg", "Konjak"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "", "Metroidvania"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/04434607724c3c11f3783a2975f532ac-98.jpg", "descriptions": "Join renegade mechanic Robin and uncover the secrets of a dying planet. Explore a big world filled with intricate puzzles, interesting characters and menacing bosses in a beautiful platform adventure that tells a personal story about faith, purpose and the challenge of helping people."}, {"name": "Flipping Death", "details_link": "https://www.metacritic.com/game/switch/flipping-death", "publisher": "Rising Star Games", "release_date": "Aug  7 2018", "developers": ["Zoink!"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/705738ed943d28cdfc91f23e781647b3-98.jpg", "descriptions": "Welcome to Flatwood Peaks, a small whimsical town with a problem -- Death is on vacation. Play as Penny and help trapped ghosts with your trusted scythe. Flip the entire world around to solve puzzles on both the living and the dead side and slowly uncover the mystery surrounding your own demise."}, {"name": "Warhammer: Vermintide 2", "details_link": "https://www.metacritic.com/game/xbox-one/warhammer-vermintide-2", "publisher": "Fatshark AB", "release_date": "Jul 11 2018", "developers": ["Fatshark AB", "Fatshark"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 83, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/ed92f6645ad3f5d68ea3aa3c929d11ac-98.jpg", "descriptions": "The sequel to Warhammer: End Times - Vermintide. Fight together with your friends against the forces of Chaos and Skaven in this epic 4-player co-op game set in the Warhammer Fantasy Battles world. Vermintide 2 expands the intense first-person combat with a brand-new enemy faction, 15 newThe sequel to Warhammer: End Times - Vermintide. Fight together with your friends against the forces of Chaos and Skaven in this epic 4-player co-op game set in the Warhammer Fantasy Battles world. Vermintide 2 expands the intense first-person combat with a brand-new enemy faction, 15 new career paths, talent trees, new weapons, an improved loot system, and more.… Expand"}, {"name": "MLB 07: The Show", "details_link": "https://www.metacritic.com/game/playstation-2/mlb-07-the-show", "publisher": "SCEA", "release_date": "Feb 26 2007", "developers": ["SCEA"], "platforms": ["PlayStation 3", "PlayStation 2"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/25076f08c381a2c300770c03e01723e5-98.jpg", "descriptions": "The innovative Road to The Show mode enables fans to play solely as a custom-created rookie on both offense and defense while attempting to rise through the ranks and make a starting line-up in the Big Leagues. Adding to its already robust online feature set, the MLB franchise now includesThe innovative Road to The Show mode enables fans to play solely as a custom-created rookie on both offense and defense while attempting to rise through the ranks and make a starting line-up in the Big Leagues. Adding to its already robust online feature set, the MLB franchise now includes Online League Play, which gives gamers the ability to set up leagues with up to 30 teams, complete statistical tracking, point benefits and full customization, while the My Sliders feature allows users to create their perfect game settings and upload them to the MLB 07 The Show server for others to try out. [SCEA]… Expand"}, {"name": "Strong Bad's Cool Game for Attractive People Episode 5: 8-Bit Is Enough", "details_link": "https://www.metacritic.com/game/wii/strong-bads-cool-game-for-attractive-people-episode-5-8-bit-is-enough", "publisher": "Telltale Games", "release_date": "Dec 15 2008", "developers": ["Telltale Games"], "platforms": ["PC", "Wii"], "genres": ["Miscellaneous", "Adventure", "General", "Compilation"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/153ba14f5aaa033f34e7531b87240e33-98.jpg", "descriptions": "[WiiWare]  Trogdor, the beefy-armed dragon of legend, has shaken free from his video game and is running through the countryside, \"burninating\" everything in sight. With a dragon on the loose and 8-bit classics leaking into the real world, it's all fun and games until the proud land of[WiiWare]  Trogdor, the beefy-armed dragon of legend, has shaken free from his video game and is running through the countryside, \"burninating\" everything in sight. With a dragon on the loose and 8-bit classics leaking into the real world, it's all fun and games until the proud land of Strong Badia falls to Trogdor's fiery wrath. Now Strong Bad must take back the night by sending this scorching menace back into his arcade cabinet once and for all. Just one problem: Does anybody know how to kill a dragon? [TellTale Games]… Expand"}, {"name": "Worms W.M.D", "details_link": "https://www.metacritic.com/game/switch/worms-wmd", "publisher": "Team17", "release_date": "Nov 23 2017", "developers": ["Team17"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 6 ", "genres": ["Strategy", "Turn-Based", "Artillery"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/36b69aeaf046ba6cd1bfc7abc8ec6cc0-98.jpg", "descriptions": "The worms are back in their most destructive game yet. With a gorgeous, hand-drawn 2D look, brand new weapons, the introduction of crafting, vehicles and buildings plus the return of some much-loved classic weapons and gameplay, Worms W.M.D is the best worms experience ever.\r Work your wayThe worms are back in their most destructive game yet. With a gorgeous, hand-drawn 2D look, brand new weapons, the introduction of crafting, vehicles and buildings plus the return of some much-loved classic weapons and gameplay, Worms W.M.D is the best worms experience ever.\r Work your way through 30 campaign levels of increasing difficulty using the huge arsenal of new and classic weapons at your disposal. Use new vehicles to cause chaos amongst the enemy ranks and use buildings to gain the tactical advantage as you try to dominate the battlefield!\r Take on up to five opponents in hilarious all-out tactical worm warfare with up to eight worms each, either in local or online multiplayer, including ranked play. Flatten your opponents with the Concrete Donkey. Turn them into chunks of worm meat with the Holy Hand Grenade. Rain down hell from above in helicopters or pound them into oblivion with the tank. With 80 weapons and utilities at your fingertips, this is Worms at its chaotic best!… Expand"}, {"name": "Theatrhythm Final Fantasy: Curtain Call", "details_link": "https://www.metacritic.com/game/3ds/theatrhythm-final-fantasy-curtain-call", "publisher": "Square Enix", "release_date": "Sep 16 2014", "developers": ["indieszero"], "platforms": "3DS", "num_players": "2 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/1f3171b5f287fbeb991bd6f336569ae9-98.jpg", "descriptions": "THEATRHYTHM FINAL FANTASY CURTAIN CALL expands on the original in every way with new gameplay modes, 221 songs, and over 60 playable characters. Featuring music that spans the full breadth of the storied FINAL FANTASY franchise, players tap along to the memorable beats and harmonies as theTHEATRHYTHM FINAL FANTASY CURTAIN CALL expands on the original in every way with new gameplay modes, 221 songs, and over 60 playable characters. Featuring music that spans the full breadth of the storied FINAL FANTASY franchise, players tap along to the memorable beats and harmonies as the adorable, stylized characters battle and quest through their worlds.… Expand"}, {"name": "Boktai: The Sun Is in Your Hand", "details_link": "https://www.metacritic.com/game/game-boy-advance/boktai-the-sun-is-in-your-hand", "publisher": "Konami", "release_date": "Sep 16 2003", "developers": ["KCEJ"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/f19d5a187b8e75bac3f6e839bd05ea77-98.jpg", "descriptions": "Boktai: The Sun Is in Your Hand is the first Game Boy Advance game that uses sunlight to influence gameplay. In the game, you'll follow the adventures of Django, a young vampire hunter on a quest to rid the world of evil. As Django, you must overcome traps, defeat enemies, and fight throughBoktai: The Sun Is in Your Hand is the first Game Boy Advance game that uses sunlight to influence gameplay. In the game, you'll follow the adventures of Django, a young vampire hunter on a quest to rid the world of evil. As Django, you must overcome traps, defeat enemies, and fight through the deepest parts of dungeons. Watch out for the amount of sunlight--Django is stronger by day, while the vampires are stronger by night. The game features a solar sensor on the cartridge and a real-time clock system.… Expand"}, {"name": "Harvest Moon: Magical Melody", "details_link": "https://www.metacritic.com/game/gamecube/harvest-moon-magical-melody", "publisher": "Natsume", "release_date": "Mar 28 2006", "developers": ["Marvelous"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Strategy", "Breeding/Constructing"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/717b45db508b2df254ad85293fcac4c2-98.jpg", "descriptions": "Harvest Moon: Magical Melody features plenty of crops, a variety of animals to care for, tons of festivals to participate in and loads of events to create a fun and entertaining game play experience. Play as either a boy or girl: Each gender has 10 potential spouses. Compete against a rivalHarvest Moon: Magical Melody features plenty of crops, a variety of animals to care for, tons of festivals to participate in and loads of events to create a fun and entertaining game play experience. Play as either a boy or girl: Each gender has 10 potential spouses. Compete against a rival farmer; Your productivity will be judged on a daily basis against that of your rival's...you will also compete against your rival in the festivals. Cultivate a wide variety of crops and trees. Raise cows, sheep, horses and chickens. Harvest Moon: Magical Melody offers 4-player minigames. Purchase different plots of land and expand your farm by building various extensions. The Harvest Goddess has turned to stone and the Harvest Sprites need your help to bring her back. You need to collect Musical Notes throughout the game in hopes of restoring her to her former self. There are 100 Musical Notes in the game and to collect the notes you must do a variety of different tasks, such as shipping a certain number of items, winning a festival or making friends with the wild animals found around your farm. Only by collecting a certain number of notes will the Harvest Goddess come back.… Expand"}, {"name": "Resident Evil Village", "details_link": "https://www.metacritic.com/game/pc/resident-evil-village", "publisher": "Capcom", "release_date": "May  7 2021", "developers": ["Capcom"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 83, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/ec49aff7922e85647be6a0529c4a92f6-98.jpg", "descriptions": "The next generation of survival horror rises in the form of Resident Evil Village, the eighth major entry in the Resident Evil series. With ultra-realistic graphics powered by the RE Engine, fight for survival as danger lurks around every corner. Years after the tragic events of ResidentThe next generation of survival horror rises in the form of Resident Evil Village, the eighth major entry in the Resident Evil series. With ultra-realistic graphics powered by the RE Engine, fight for survival as danger lurks around every corner. Years after the tragic events of Resident Evil 7 biohazard, Ethan Winters has started over with his wife Mia, finally living in peace and putting the past behind them. However, Chris Redfield, the legendary hero from previous Resident Evil games, suddenly disrupts their life, throwing a devastated Ethan into a new and twisted nightmare in search of answers.… Expand"}, {"name": "Pokemon Platinum Version", "details_link": "https://www.metacritic.com/game/ds/pokemon-platinum-version", "publisher": "Nintendo", "release_date": "Mar 22 2009", "developers": ["Game Freak"], "platforms": "DS", "num_players": "2 ", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Trainer"], "meta_score": 83, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/9/ce43a72e4fb80c8b2dce35c8b12c3c9a-98.jpg", "descriptions": "As the story unfolds, players encounter the mysterious new Distortion World, an area unlike any seen in a Pokemon video game before. The Battle Frontier area (first introduced in Pokemon Emerald) has been added to Sinnoh, containing five new Battle Facilities for Trainers to challenge, eachAs the story unfolds, players encounter the mysterious new Distortion World, an area unlike any seen in a Pokemon video game before. The Battle Frontier area (first introduced in Pokemon Emerald) has been added to Sinnoh, containing five new Battle Facilities for Trainers to challenge, each with its own special rules. Players can explore the new Wi-Fi Plaza a virtual Pokemon amusement park filled with activities, including three new mini-games where up to 4 players can compete at once.… Expand"}, {"name": "Assassin's Creed Odyssey", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-odyssey", "publisher": "Ubisoft", "release_date": "Oct  2 2018", "developers": ["Ubisoft", "Ubisoft Quebec"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 83, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/8ad9fdc78d4aef8e0d4a069a2dfe33e0-98.jpg", "descriptions": "Write your own epic odyssey and become a legendary Spartan hero. Forge your destiny in a world on the brink of tearing itself apart. Influence how history unfolds in an ever-changing world shaped by your choices. Features: * LEGENDARY SPARTAN HERO - Embark on your journey from outcast toWrite your own epic odyssey and become a legendary Spartan hero. Forge your destiny in a world on the brink of tearing itself apart. Influence how history unfolds in an ever-changing world shaped by your choices. Features: * LEGENDARY SPARTAN HERO - Embark on your journey from outcast to legendary Spartan hero.\r* ANCIENT GREECE AWAITS - Explore an entire country full of unexpected encounters in untamed environments and bustling ancient cities.\r* CHOOSE YOUR PATH - Your choices shape the world around you. Play in a living world that constantly reacts to your every decision.\r* FIGHT EPIC BATTLES - Charge into epic clashes between Sparta and Athens in battles pitting 150v150 soldiers against each other.\r* SAIL THE AEGEAN SEA - Recruit crewmembers and customize your ship as you explore and battle your way on the open seas.… Expand"}, {"name": "Donkey Kong Country: Tropical Freeze", "details_link": "https://www.metacritic.com/game/wii-u/donkey-kong-country-tropical-freeze", "publisher": "Nintendo", "release_date": "Feb 21 2014", "developers": ["Retro Studios"], "platforms": ["Switch", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Platformer", "2D", "Action", "Platformer", "2D"], "meta_score": 83, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/2/3765f231acba3b9146347763226a61f2-98.jpg", "descriptions": "Donkey Kong Country: Tropical Freeze has players help Donkey Kong and his friends get back their home from Vikings. Swing, swim, leap, and barrel-blast your way through tons of eye-popping levels to save DK Island from a permanent freeze."}, {"name": "Valkyria Chronicles II", "details_link": "https://www.metacritic.com/game/psp/valkyria-chronicles-ii", "publisher": "Sega", "release_date": "Aug 30 2010", "developers": ["Sega"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Action RPG", "Turn-Based", "Historic", "Historic", "Tactics"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/10a357f79912a317d960e4c4421ebf33-98.jpg", "descriptions": "The story of Valkyria Chronicles 2 takes place two years after the conclusion of the original game. A group of young Gallian Military Academy cadets find themselves plunged into a bitter civil war when the newly formed Gallian Revolutionary Army stages a coup. As the epic drama unfolds inThe story of Valkyria Chronicles 2 takes place two years after the conclusion of the original game. A group of young Gallian Military Academy cadets find themselves plunged into a bitter civil war when the newly formed Gallian Revolutionary Army stages a coup. As the epic drama unfolds in the game, players experience stories of friendship, love and growing pains during a time of war and revolution. [Sega]… Expand"}, {"name": "No Man's Sky", "details_link": "https://www.metacritic.com/game/switch/no-mans-sky", "publisher": "Bandai Namco Games", "release_date": "Oct  7 2022", "developers": ["Hello Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/6dcb986909d0b0e5046f12f96c37f86a-98.jpg", "descriptions": "Inspired by the adventure and imagination that we love from classic science-fiction, No Man's Sky presents you with a galaxy to explore, filled with unique planets and lifeforms, and constant danger and action. In No Man's Sky, every star is the light of a distant sun, each orbited byInspired by the adventure and imagination that we love from classic science-fiction, No Man's Sky presents you with a galaxy to explore, filled with unique planets and lifeforms, and constant danger and action. In No Man's Sky, every star is the light of a distant sun, each orbited by planets filled with life, and you can go to any of them you choose. Fly smoothly from deep space to planetary surfaces, with no loading screens, and no limits. In this infinite procedurally generated universe, you'll discover places and creatures that no other players have seen before - and perhaps never will again.\r Embark on an epic voyage\rAt the centre of the galaxy lies a irresistible pulse which draws you on a journey towards it to learn the true nature of the cosmos. But, facing hostile creatures and fierce pirates, you'll know that death comes at a cost, and survival will be down to the choices you make over how you upgrade your ship, your weapon and suit.\r Find your own destiny\rYour voyage through No Man's Sky is up to you. Will you be a fighter, preying on the weak and taking their riches, or taking out pirates for their bounties? Power is yours if you upgrade your ship for speed and weaponry.\rOr a trader? Find rich resources on forgotten worlds and exploit them for the highest prices. Invest in more cargo space and you'll reap huge rewards.\rOr perhaps an explorer? Go beyond the known frontier and discover places and things that no one has ever seen before. Upgrade your engines to jump ever farther, and strengthen your suit for survival in toxic environments that would kill the unwary.\r Share your journey\rThe galaxy is a living, breathing place. Trade convoys travel between stars, factions vie for territory, pirates hunt the unwary, and the police are ever watching. Every other player lives in the same galaxy, and you can choose to share your discoveries with them on a map that spans known space. Perhaps you will see the results of their actions as well as your own...… Expand"}, {"name": "Crusader Kings III: The Royal Court", "details_link": "https://www.metacritic.com/game/pc/crusader-kings-iii-the-royal-court", "publisher": "Paradox Interactive", "release_date": "Feb  8 2022", "developers": ["Paradox Interactive"], "platforms": ["PlayStation 5", "Xbox Series X", "PC"], "genres": ["Strategy", "Real-Time", "General"], "meta_score": 83, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/725340ab6462502480e37e796436ab7d-98.jpg", "descriptions": "There is but one true center for power and prestige: a ruler's court. Step into your own fully immersive throne room with Crusader Kings: Royal Court, and get ready to impress vassals and courtiers with your splendor and treasure on display. Watch visitors pay respect or family membersThere is but one true center for power and prestige: a ruler's court. Step into your own fully immersive throne room with Crusader Kings: Royal Court, and get ready to impress vassals and courtiers with your splendor and treasure on display. Watch visitors pay respect or family members squabble as you pass judgment in royal audiences, establishing the vital link between your people and your realm.In Crusader Kings: Royal Court, you can commission great works of art from inspired craftspeople. Impress your rivals with the grandeur of your court, or awe them with your noble house's heirlooms and relics. An enhanced Culture system lets you guide your people to novel cultural understandings as they merge or splinter off, embrace their heritage, learn languages, or acquire new traditions.… Expand"}, {"name": "Crown Trick", "details_link": "https://www.metacritic.com/game/pc/crown-trick", "publisher": "NExT Studios", "release_date": "Oct 16 2020", "developers": ["NExT Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Roguelike"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/494303566e72c2587eee64e1c4c02de9-98.jpg", "descriptions": "Enter a labyrinth that moves as you move, where mastering the elements is key to defeating enemies and uncovering the mysteries of this underground world. With a new experience awaiting every time you enter the dungeon, let the power bestowed by the crown guide you in this challenging adventure."}, {"name": "Code:Realize - Guardian of Rebirth", "details_link": "https://www.metacritic.com/game/switch/coderealize---guardian-of-rebirth", "publisher": "Aksys Games", "release_date": "Feb  6 2020", "developers": ["Otomate"], "platforms": ["PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 83, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/56ed281e6b955391c75cb718e61c4702-98.jpg", "descriptions": "This all happened many, many years ago.\rThe girl searched. Grass withered.\rThe girl searched even harder. Flowers were the next to die.\r\nEven so, the girl continued her search. Eventually, the whole land rotted.\r\nThe girl was a monster -- a lonely monster.\r\n\r\nThis all happened many, manyThis all happened many, many years ago.\rThe girl searched. Grass withered.\rThe girl searched even harder. Flowers were the next to die.\rEven so, the girl continued her search. Eventually, the whole land rotted.\rThe girl was a monster -- a lonely monster.\r This all happened many, many years ago.\r The poisonous girl who destroyed nature and man alike only sought one thing -- love.… Expand"}, {"name": "Reventure", "details_link": "https://www.metacritic.com/game/switch/reventure", "publisher": "Pixelatto", "release_date": "Oct  8 2019", "developers": ["Pixelatto"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "2D"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/124f2dce6f38e5c5c40c410faedb7787-98.jpg", "descriptions": "- One hundred different endings.\r Choose your path, every decision leads to a new ending.\r\n\r\nWill you find the real one? Is there such a thing?\r\n\r\nOnly one way to know...\r\n\r\n- Lots of \"Aha!\" moments.\r\n\r\nThe world doesn't change with each new game, you- One hundred different endings.\r Choose your path, every decision leads to a new ending.\r Will you find the real one? Is there such a thing?\r Only one way to know...\r - Lots of \"Aha!\" moments.\r The world doesn't change with each new game, you do.\r Well, actually it DOES change, but that's a secret for you to find out.… Expand"}, {"name": "VA-11 Hall-A: Cyberpunk Bartender Action", "details_link": "https://www.metacritic.com/game/playstation-4/va-11-hall-a-cyberpunk-bartender-action", "publisher": "Ysbryd Games", "release_date": "May  2 2019", "developers": ["Sukeban Games"], "platforms": ["PC", "PlayStation Vita", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/b50e965248bdc81099123526eb91b0df-98.jpg", "descriptions": "Assume the role of a bartender at VA-11 Hall-A, affectionately nicknamed ‘Valhalla.’ Although it is just a small bar in downtown Glitch City, it attracts the most fascinating people this side of dystopia. Keep your clients lubricated and you will be made privy to the most interesting stories."}, {"name": "F1 2018", "details_link": "https://www.metacritic.com/game/pc/f1-2018", "publisher": "Codemasters", "release_date": "Aug 23 2018", "developers": ["Codemasters"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/1af453f1827618e1f7f048ae94814fde-98.jpg", "descriptions": "MAKE HEADLINES in F1® 2018. F1 2018 is the official videogame of the 2018 FIA FORMULA ONE WORLD CHAMPIONSHIP™. The new game immerses players into the world of Formula 1® more than ever before."}, {"name": "Batman: The Telltale Series - Episode 2: Children of Arkham", "details_link": "https://www.metacritic.com/game/xbox-one/batman-the-telltale-series---episode-2-children-of-arkham", "publisher": "Telltale Games", "release_date": "Sep 20 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 83, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/71e6598bd416691ca7387ca00a5312e1-98.jpg", "descriptions": "With Gotham City's first family mired in corruption, and an old friend now a dangerous adversary, the life of the Dark Knight is turned upside down. What was Thomas Wayne entangled in, and why was he killed? Determined to learn the truth about his father, Bruce sets out to question thoseWith Gotham City's first family mired in corruption, and an old friend now a dangerous adversary, the life of the Dark Knight is turned upside down. What was Thomas Wayne entangled in, and why was he killed? Determined to learn the truth about his father, Bruce sets out to question those involved in Gotham's criminal past. But which mask will he wear - The billionaire, or the bat? Huge decisions will forever change the Batman and the lives of those around him, as he meets the Children of Arkham.… Expand"}, {"name": "ZEN Pinball 2: The Walking Dead", "details_link": "https://www.metacritic.com/game/playstation-4/zen-pinball-2-the-walking-dead", "publisher": "Zen Studios", "release_date": "Aug 26 2014", "developers": ["Zen Studios"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Wii U", "PlayStation 4"], "genres": ["Action", "Miscellaneous", "Parlor", "Pinball"], "meta_score": 83, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/9a603415b1f8f930a3506da46416cb50-98.jpg", "descriptions": "The Walking Dead Pinball table playfield is a tour of the most iconic locations from the game, including the St. John’s Dairy Farm, Travelier Motel, Bell Tower, Train & Level Crossing, RV and more. Original lines and award winning voice actors from the game, including Dave Fennoy and MelissaThe Walking Dead Pinball table playfield is a tour of the most iconic locations from the game, including the St. John’s Dairy Farm, Travelier Motel, Bell Tower, Train & Level Crossing, RV and more. Original lines and award winning voice actors from the game, including Dave Fennoy and Melissa Hutchison.… Expand"}, {"name": "BlazBlue: Continuum Shift Extend", "details_link": "https://www.metacritic.com/game/playstation-vita/blazblue-continuum-shift-extend", "publisher": "Aksys Games", "release_date": "Feb 14 2012", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation Vita"], "num_players": "Up to 6 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/29f50ebe399b02df19a6e154b4a3e184-98.jpg", "descriptions": "BlazBlue: Continuum Shift EXTEND makes a return with the devious all new playable character Relius Clover, new story scenarios, new gameplay modes, and competitively balanced action. Enhanced Story Mode: Relive and rediscover the events that took place in BlazBlue: Calamity Trigger orBlazBlue: Continuum Shift EXTEND makes a return with the devious all new playable character Relius Clover, new story scenarios, new gameplay modes, and competitively balanced action. Enhanced Story Mode: Relive and rediscover the events that took place in BlazBlue: Calamity Trigger or venture forth into one of four all new story scenarios. New and Revised Game Modes to Explore: Take on the strongest of foes in Unlimited Mars Mode, dungeoneer your way to the bottom of Abyss Mode, or refine your skills in the improved Challenge Mode. Fully Revised Combat System: All characters new and old have been thoroughly rebalanced and armed with all new strategies and combos to take your game to the top. Improved Online Multiplayer: Battle it out in BlazBlue’s acclaimed online mode with all new online multiplayer features, such as online team battles. [Sony]\r… Expand"}, {"name": "Odin Sphere", "details_link": "https://www.metacritic.com/game/playstation-2/odin-sphere", "publisher": "Atlus Co.", "release_date": "May 22 2007", "developers": ["Vanilla Ware"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/ca49ba3063c6959a90bd72dafedcad83-98.jpg", "descriptions": "The nations of Erion had always held an uneasy peace, as the various kings and queens watched each other for any signs of weakness. When the country of Valentine is obliterated by the power of an ancient artifact, it sparks a bloody war between the fairies of Ringford and the warriors ofThe nations of Erion had always held an uneasy peace, as the various kings and queens watched each other for any signs of weakness. When the country of Valentine is obliterated by the power of an ancient artifact, it sparks a bloody war between the fairies of Ringford and the warriors of Ragnanival. Little do they know that they are acting out an almost-forgotten prophecy: one that, if fulfilled, will lead to the destruction of the entire world. Take control of the warrior princess Gwendolyn, daughter of Odin, and follow the threads of an intricately woven story as you uncover the truth behind the prophecy – and how to bring it to an end. Five playable characters in all; each one's fate is intertwined with the others'. A robust cooking and alchemy system that can be used to create powerful attack and recovery items. [Atlus Software]… Expand"}, {"name": "Tony Hawk's Underground 2 Remix", "details_link": "https://www.metacritic.com/game/psp/tony-hawks-underground-2-remix", "publisher": "Activision", "release_date": "Mar 23 2005", "developers": ["Shaba Games"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/ddb74d75cae65b214c86e6cbe596894f-98.jpg", "descriptions": "Tony Hawk's Underground 2 Remix takes players on an all new skating blitzkrieg where they embark on the ultimate road trip from Tony Hawk's Underground 2 in addition to wreaking havoc in four never-before-seen city-levels - Las Vegas, Atlanta, Kyoto and Santa Cruz -- that feature originalTony Hawk's Underground 2 Remix takes players on an all new skating blitzkrieg where they embark on the ultimate road trip from Tony Hawk's Underground 2 in addition to wreaking havoc in four never-before-seen city-levels - Las Vegas, Atlanta, Kyoto and Santa Cruz -- that feature original goals, level changing events and unlockable characters. For the first time, players can live the Tony Hawk console gaming experience on a handheld device as they join either Tony Hawk or Bam Margera on a World Destruction Tour where they nail insane tricks with lightning speed or slow motion focus control, pull off mischievous pranks, and conquer sick terrain through 13 single-player levels, or face off against up to three friends in 10 wireless multiplayer games. Players can import their picture onto the PSP via any memory stick and map their face to create their own personalized game character in an instant. [Activision]… Expand"}, {"name": "Maximo vs Army of Zin", "details_link": "https://www.metacritic.com/game/playstation-2/maximo-vs-army-of-zin", "publisher": "Capcom", "release_date": "Jan 20 2004", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/62368a58338ec4367dd42c6d18cc8fff-98.jpg", "descriptions": "Hero Maximo Is Back And This Time It's War! Maximo has defeated a host of ghosts and gone for the glory, but nothing can prepare him for...The Army of Zin! Dormant for centuries, this legion of mechanized mayhem has returned to unleash their undead clockwork fury! The action has never beenHero Maximo Is Back And This Time It's War! Maximo has defeated a host of ghosts and gone for the glory, but nothing can prepare him for...The Army of Zin! Dormant for centuries, this legion of mechanized mayhem has returned to unleash their undead clockwork fury! The action has never been more furious as Maximo, aided by his dark pal Grim, strikes back with new powerful combo attacks and even more daring moves! From the top of the Crystal Mountains to the depths of the Dead Sea, Maximo must defend the innocent and make new alliances as he seeks to unlock the mystery of the Zin! Don't forget to pack a spare pair of boxers! [Capcom]… Expand"}, {"name": "Metal Arms: Glitch in the System", "details_link": "https://www.metacritic.com/game/gamecube/metal-arms-glitch-in-the-system", "publisher": "VU Games", "release_date": "Nov 18 2003", "developers": ["Swingin' Ape"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/7c83704474489d928b9f4ec41c397e73-98.jpg", "descriptions": "Blast your way to victory as Glitch, the gun-slinging, half-ton menacing bot of Droid City.  Found as scrap metal, but transformed into destructive machinery, Glitch is determined to free his people from the evil clutches of General Corrosive and his maniacal army of Mil bots.  As youBlast your way to victory as Glitch, the gun-slinging, half-ton menacing bot of Droid City.  Found as scrap metal, but transformed into destructive machinery, Glitch is determined to free his people from the evil clutches of General Corrosive and his maniacal army of Mil bots.  As you venture through 40 missions, you'll find 17 deadly weapons, a variety of vehicles, and enemy bots that you can control.  Annihilate the General's sinister plan to dominate the world and salvage the robot race.… Expand"}, {"name": "ESPN College Hoops", "details_link": "https://www.metacritic.com/game/playstation-2/espn-college-hoops", "publisher": "Sega", "release_date": "Nov 13 2003", "developers": ["Visual Concepts"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/66c993e8fee194a2e4d7eaea0d57f8af-98.jpg", "descriptions": "ESPN Presentation - Step into every college game with a mind-blowing presentation ­ listen to Jay Bilas and Mike Patrick behind the booth as well as see detailed overlays that deliver nothing less than perfection! Enhanced Legacy Mode - Create your own dynasty from the ground up, customizingESPN Presentation - Step into every college game with a mind-blowing presentation ­ listen to Jay Bilas and Mike Patrick behind the booth as well as see detailed overlays that deliver nothing less than perfection! Enhanced Legacy Mode - Create your own dynasty from the ground up, customizing everything from the arena to team schedules. Use assistant coaches to recruit year-round or suffer losing that prized JuCo prospect! Authentic College Atmosphere - The only realistically replicated college environment with more than 100 mascots and fight songs, team specific chants and dozens of cutscenes that capture net cutting in the tournament, crazed fans and blaring bands sending every college moment into a frenzy! [Sega]… Expand"}, {"name": "High Heat Major League Baseball 2004", "details_link": "https://www.metacritic.com/game/playstation-2/high-heat-major-league-baseball-2004", "publisher": "3DO", "release_date": "Feb 20 2003", "developers": ["3DO"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/2f92dea52cdfc0781e148b460bf9af35-98.jpg", "descriptions": "New features for this year include a brand-new graphics engine, all-new motion-captured player animations, and Franchise Mode containing comprehensive player contracts, financial and free agent systems and realistic player management features. They've even tripled the number of pitch typesNew features for this year include a brand-new graphics engine, all-new motion-captured player animations, and Franchise Mode containing comprehensive player contracts, financial and free agent systems and realistic player management features. They've even tripled the number of pitch types from detailed scouting reports and input from Curt Schilling, himself! [3DO]… Expand"}, {"name": "MechWarrior 4: Mercenaries", "details_link": "https://www.metacritic.com/game/pc/mechwarrior-4-mercenaries", "publisher": "Microsoft Game Studios", "release_date": "Nov  7 2002", "developers": ["FASA Studio"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Mech", "Combat"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/85094d9a0ef7e149dd2684851df2a5d4-98.jpg", "descriptions": "Control 100 ton 'Mechs while leading up to eight hired guns into the heat of battle in the quest for the all-mighty C-Bill in this latest standalone installment of the critically acclaimed MechWarrior action-simulator franchise. And this time around, honor doesn't even enter into theControl 100 ton 'Mechs while leading up to eight hired guns into the heat of battle in the quest for the all-mighty C-Bill in this latest standalone installment of the critically acclaimed MechWarrior action-simulator franchise. And this time around, honor doesn't even enter into the equation - it's all about the money. Get your fledgling mercenary company sponsored by some of most notable and notorious mercenary groups in BattleTech history and battle your way through the Inner Sphere in more than 40 new missions as you doggedly pursue more lucrative C-Bill payoffs. With more than 35 'Mechs, new weapons, and new electronic packages available for purchase, chances are you'll need every C-Bill you earn. In MechWarrior 4: Mercenaries, being a hero doesn't pay, being a mercenary does - very well. [Microsoft]… Expand"}, {"name": "F1 2001", "details_link": "https://www.metacritic.com/game/playstation-2/f1-2001", "publisher": "Electronic Arts", "release_date": "Oct  1 2001", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Formula One"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/15c70a701e12860ee7ca6913924b6666-98.jpg", "descriptions": "Engage in high stakes racing from Monaco to Monza and take on the most intelligent and daring racers to hit the Formula One circuit. Includes All the drivers, tracks and teams from the official FIA 2001 Formula OneWorld Championship.  [EA Sports]"}, {"name": "Breath of Fire IV", "details_link": "https://www.metacritic.com/game/playstation/breath-of-fire-iv", "publisher": "Capcom", "release_date": "Nov 28 2000", "developers": ["Capcom"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/1af5f6dd04bd956a3a8737c187431af4-98.jpg", "descriptions": "After centuries of war, the two lands bordering an impenetrable swampland have finally reached an armistice. Mysteriously, the noble Princess Elena disappears somewhere near the war-ravaged front lines. Distraught, her sister Nina goes in search of the Princess alone and on her journey,After centuries of war, the two lands bordering an impenetrable swampland have finally reached an armistice. Mysteriously, the noble Princess Elena disappears somewhere near the war-ravaged front lines. Distraught, her sister Nina goes in search of the Princess alone and on her journey, meets a mysterious young warrior named Ryu. Their destinies soon entwine. The next chapter in the epic tale of magic and mystery now unfolds. The fate of what lies ahead rests in your control.… Expand"}, {"name": "Metal Gear Solid", "details_link": "https://www.metacritic.com/game/pc/metal-gear-solid", "publisher": "Microsoft Game Studios", "release_date": "Sep 24 2000", "developers": ["Digital Dialect"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 83, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/3895a9ff061c662b58a0143cd34fcb9d-98.jpg", "descriptions": "You are snake, a government agent on a mission to regain control of a secret nuclear weapons base from terrorist hands.\r Now the international best-selling Playstation game comes to the PC with better graphic, added features and new game play modes! Unlike anything you've played before,You are snake, a government agent on a mission to regain control of a secret nuclear weapons base from terrorist hands.\r Now the international best-selling Playstation game comes to the PC with better graphic, added features and new game play modes! Unlike anything you've played before, Metal Gear Solid introduces a new genre of gaming where ninja-like stealth and a cool head are your best weapons for survival.… Expand"}, {"name": "Mario Kart 64", "details_link": "https://www.metacritic.com/game/nintendo-64/mario-kart-64", "publisher": "Nintendo", "release_date": "Feb 10 1997", "developers": ["Nintendo"], "platforms": "Nintendo 64", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/ca31ea3c3d54970c8e19a10f16824683-98.jpg", "descriptions": "Three... Two... One... GO! The signal light changes and you drop the pedal to the metal. Take on up to three friends in the split-screen VS games, or race solo in the Mario GP. Tell your friends to bring it on in the highly competitive Battle mode. Advanced features allow you to race withThree... Two... One... GO! The signal light changes and you drop the pedal to the metal. Take on up to three friends in the split-screen VS games, or race solo in the Mario GP. Tell your friends to bring it on in the highly competitive Battle mode. Advanced features allow you to race with your \"Ghost\". The driving data from your best run appears as a transparent character on the screen. No longer must you simply race against the clock - you can actually race against yourself!… Expand"}, {"name": "Invisible, Inc.", "details_link": "https://www.metacritic.com/game/pc/invisible-inc", "publisher": "Klei Entertainment", "release_date": "May 12 2015", "developers": ["Klei Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/3ee799b60588c4e6a2c99ea40a5f9f6b-98.jpg", "descriptions": "Invisible, Inc. is a mercenary espionage agency operating in the latter years of the 21st century. Infiltrate procedurally generated corporate facilities in tense, turn-based missions where every move could be your last. Find profit in chaos as you guide your team around the world in searchInvisible, Inc. is a mercenary espionage agency operating in the latter years of the 21st century. Infiltrate procedurally generated corporate facilities in tense, turn-based missions where every move could be your last. Find profit in chaos as you guide your team around the world in search of lucrative contracts. … Expand"}, {"name": "WarioWare D.I.Y.", "details_link": "https://www.metacritic.com/game/ds/warioware-diy", "publisher": "Nintendo", "release_date": "Mar 28 2010", "developers": ["Intelligent Systems"], "platforms": "DS", "genres": ["Miscellaneous", "General", "General"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/0501ce3a4561568d430e8a8ab4e20a40-98.jpg", "descriptions": "The WarioWare: D.I.Y. game lets players create the same kind of microgames that are the hallmark of the WarioWare series. Players design every aspect of their creations, including graphics, animation, music and rules. Do It Yourself! Take on the role of game designer and create your ownThe WarioWare: D.I.Y. game lets players create the same kind of microgames that are the hallmark of the WarioWare series. Players design every aspect of their creations, including graphics, animation, music and rules. Do It Yourself! Take on the role of game designer and create your own microgames by crafting everything from artwork, animations, music and action instructions. WarioWare: D.I.Y. comes with more than 90 pre-made games to play, but players who have access to a broadband Internet connection can wirelessly download a virtually endless supply of user-generated games, or upload their own creations to share with the world. When creating games, players can utilize a library of pre-made graphics and sound samples, borrow elements from other microgames on their system, or start from scratch. [Nintendo]… Expand"}, {"name": "Wipeout Pulse", "details_link": "https://www.metacritic.com/game/psp/wipeout-pulse", "publisher": "SCEA", "release_date": "Feb 12 2008", "developers": ["Studio Liverpool"], "platforms": "PSP", "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Futuristic", "Futuristic"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/0f80c777e1c38890d77c16e361db505a-98.jpg", "descriptions": "As is tradition with the series, gamers trench race at high speeds in futuristic vehicles outfitted with  weapons. New to the franchise with Pulse is a mag-strip, a part of the track that locks the vehicles onto the track, allowing them to race through loops, 90-degree-angled parts of theAs is tradition with the series, gamers trench race at high speeds in futuristic vehicles outfitted with  weapons. New to the franchise with Pulse is a mag-strip, a part of the track that locks the vehicles onto the track, allowing them to race through loops, 90-degree-angled parts of the track, and steep drops.  The game features seven different modes, wireless support, 24 new tracks, and eight teams (including one called EG-X). Downloadable content is available immediately upon release. The game's soundtrack features tracks from Stanton Warriors, Loco Dice, and Mason, but players can opt to play their own MP3 files from a memory stick.… Expand"}, {"name": "SOMA", "details_link": "https://www.metacritic.com/game/xbox-one/soma", "publisher": "Frictional Games", "release_date": "Dec  1 2017", "developers": ["Frictional Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/dd27220d66e6743daf2ee0665795c009-98.jpg", "descriptions": "Strange occurrences are disrupting the routines of the PATHOS-2 research facility. The radio is silent. Behavioral anomalies of the machines are increasingly dangerous, if not... malevolent. The facility is devolving into chaos. No weapons, and the only escape is practically unthinkable.Strange occurrences are disrupting the routines of the PATHOS-2 research facility. The radio is silent. Behavioral anomalies of the machines are increasingly dangerous, if not... malevolent. The facility is devolving into chaos. No weapons, and the only escape is practically unthinkable.\r From Frictional Games, creators of the groundbreaking Amnesia and Penumbra series, SOMA is an aberrant tale of scientific inquiry and survival; an entropic exploration of synapse and circuit that wades through the delusions of human consciousness.… Expand"}, {"name": "Dark Souls II: Crown of the Ivory King", "details_link": "https://www.metacritic.com/game/pc/dark-souls-ii-crown-of-the-ivory-king", "publisher": "Bandai Namco Games", "release_date": "Sep 29 2014", "developers": ["Namco Bandai Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/568a3cbd700ad87f9d94e3ba6e64180c-98.jpg", "descriptions": "The 3rd of three large-scale DLC additions to the Dark Souls II game includes new stages, maps, boss characters, weapons and armor. In this third DLC, players find themselves in a world shining bright with the glow of treacherous ice."}, {"name": "Defense Grid: The Awakening", "details_link": "https://www.metacritic.com/game/xbox-360/defense-grid-the-awakening", "publisher": "Hidden Path Entertainment", "release_date": "Sep  2 2009", "developers": ["Hidden Path Entertainment"], "platforms": ["PC", "Xbox 360"], "genres": ["Strategy", "Real-Time", "General", "Sci-Fi", "Defense"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/19152bed991805e78ba274cd3589fb36-98.jpg", "descriptions": "[Xbox Live Arcade]  Strategically place your towers on the map to prevent alien enemies from stealing your power cores. Play for just fifteen minutes or several hours! This award-winning game includes 10 hours of story play with 20 unique maps in the Awakening campaign, four bonus[Xbox Live Arcade]  Strategically place your towers on the map to prevent alien enemies from stealing your power cores. Play for just fifteen minutes or several hours! This award-winning game includes 10 hours of story play with 20 unique maps in the Awakening campaign, four bonus Borderlands maps, a wide variety of tower and enemy types, an interactive soundtrack, plus over 100 unlockable challenge modes adding dozens of hours of additional fun. Protect the Cores. [Hidden Path]… Expand"}, {"name": "Sega Genesis Collection", "details_link": "https://www.metacritic.com/game/psp/sega-genesis-collection", "publisher": "Sega", "release_date": "Nov 16 2006", "developers": ["Sega"], "platforms": ["PlayStation 2", "PSP"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/a5a646f3a72e0533855701809db14bf0-98.jpg", "descriptions": "(Known as \"Sega Mega Drive Collection\" in the UK/EU)  SEGA Genesis Collection features over 30 titles including, Altered Beast, Sonic The Hedgehog, Shinobi III, Phantasy Star, and the original SEGA Genesis version of Golden Axe. SEGA Genesis Collection also features numerous unlockable items(Known as \"Sega Mega Drive Collection\" in the UK/EU)  SEGA Genesis Collection features over 30 titles including, Altered Beast, Sonic The Hedgehog, Shinobi III, Phantasy Star, and the original SEGA Genesis version of Golden Axe. SEGA Genesis Collection also features numerous unlockable items that delve into the soul of the Genesis including interviews with the original developers that created the games featured in the collection, a museum area with interesting facts about the games, a hint area to help gamers complete their favorite SEGA Genesis games, and SEGA arcade games from the Genesis era. [Sega]… Expand"}, {"name": "Atelier Mysterious Trilogy Deluxe Pack", "details_link": "https://www.metacritic.com/game/switch/atelier-mysterious-trilogy-deluxe-pack", "publisher": "Koei Tecmo Games", "release_date": "Apr 22 2021", "developers": ["Gust"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 82, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/e63a535309ac4702b3a31a0fbf7f15bc-98.jpg", "descriptions": "Atelier Sophie DX - Atelier Firis DX - Atelier Lydie & Suelle DX - with brand new content and various DLCs. The definitive edition fo the Atlier \"Myserious\" series is now available."}, {"name": "Gears of War: Ultimate Edition", "details_link": "https://www.metacritic.com/game/xbox-one/gears-of-war-ultimate-edition", "publisher": "Microsoft Game Studios", "release_date": "Aug 25 2015", "developers": ["Splash Damage", "The Coalition"], "platforms": ["PC", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/c1178a704d8d1a80ba824b68d704e671-98.jpg", "descriptions": "The shooter has been remastered in 1080P and modernized for Xbox One, and is augmented with new content including five campaign chapters never released on Xbox."}, {"name": "Islets", "details_link": "https://www.metacritic.com/game/switch/islets", "publisher": "Armor Games", "release_date": "Aug 24 2022", "developers": ["Kyle Thompson"], "platforms": ["PC", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Metroidvania"], "meta_score": 82, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/b6bfcb9d255d619949c7918060e9ba13-98.jpg", "descriptions": "Iko is an aspiring yet hopeful warrior exploring the land and sky to reunite a series of floating islands. With his rickety airship, he must travel from island to island in order to reignite each one's magnetic core while fighting off the many adversaries standing in his way.Islets is aIko is an aspiring yet hopeful warrior exploring the land and sky to reunite a series of floating islands. With his rickety airship, he must travel from island to island in order to reignite each one's magnetic core while fighting off the many adversaries standing in his way.Islets is a surprisingly wholesome metroidvania about making connections with the people around you. By reuniting the islands and befriending a cast of charming characters, the world expands and reveals new parts of each area for Iko to explore. Scour every nook and cranny in order to collect the many upgrades hidden around this world and face its numerous hidden challenges!There's also a tour guide to show you around, but you should be careful. The guy's got some really weird vibes...… Expand"}, {"name": "Stray", "details_link": "https://www.metacritic.com/game/pc/stray", "publisher": "Annapurna Interactive", "release_date": "Jul 19 2022", "developers": ["BlueTwelve Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/30ca6c9a831f967e8e9771a42e135f92-98.jpg", "descriptions": "Lost, alone and separated from family, a stray cat must untangle an ancient mystery to escape a long-forgotten cybercity and find the way home. Stray is a third-person cat adventure game set amidst the detailed neon-lit alleys of a decaying cybercity and the murky environments of its seedyLost, alone and separated from family, a stray cat must untangle an ancient mystery to escape a long-forgotten cybercity and find the way home. Stray is a third-person cat adventure game set amidst the detailed neon-lit alleys of a decaying cybercity and the murky environments of its seedy underbelly.  See the world through the eyes of a stray and interact with the environment in playful ways. Stray is developed by BlueTwelve Studio, a small team from south of France mostly made of cats and a handful of humans.\r… Expand"}, {"name": "Tomb Raider: Legend", "details_link": "https://www.metacritic.com/game/xbox/tomb-raider-legend", "publisher": "Eidos Interactive", "release_date": "Apr 11 2006", "developers": ["Crystal Dynamics"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 82, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/3520fd212fcca974c2e23c7e6b0bb1d0-98.jpg", "descriptions": "Tomb Raider: Legend revives the athletic, intelligent and entertaining adventurer who won the hearts and minds of gamers worldwide. Lara comes alive with intricately animated expressions, moves and abilities. An arsenal of modern equipment, such as a magnetic grappling device, binoculars,Tomb Raider: Legend revives the athletic, intelligent and entertaining adventurer who won the hearts and minds of gamers worldwide. Lara comes alive with intricately animated expressions, moves and abilities. An arsenal of modern equipment, such as a magnetic grappling device, binoculars, frag grenades, personal lighting device and communications equipment, allows gamers to experience tomb raiding as never before. Eidos and Crystal Dynamics shaped Lara's look and movements to be an inherent extension of her skills, motivation and personality. Lara's character model features natural structure, realistic textures, detailed facial features, reactive eyes and fluid motion, all of which make her part of a living environment. New character animations and controls allow her to move through stunning environments with grace and precision, while an understanding of the game's original appeal reinvigorates the fundamental explore-and-solve adventure experience.… Expand"}, {"name": "Tom Clancy's Rainbow Six Vegas 2", "details_link": "https://www.metacritic.com/game/xbox-360/tom-clancys-rainbow-six-vegas-2", "publisher": "Ubisoft", "release_date": "Mar 18 2008", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/d968441e573e1b39af6659bcf918cf8f-98.jpg", "descriptions": "Tom Clancy's Rainbow Six Vegas 2 is your last chance to rescue America's sexiest city from an escalating terrorist siege that will force you into heart-pounding action from beginning to end. Sin City is back and bigger than before. Explore all new Vegas hot spots as the environment changesTom Clancy's Rainbow Six Vegas 2 is your last chance to rescue America's sexiest city from an escalating terrorist siege that will force you into heart-pounding action from beginning to end. Sin City is back and bigger than before. Explore all new Vegas hot spots as the environment changes from dusk to bright daylight to dawn, creating a visual experience that is as challenging as it is breathtaking. The multiplayer mode in Tom Clancy's Rainbow Six Vegas has been upgraded to include 11 new, smaller maps that force more intense face-offs, 2 new adversarial modes, more rewards, and easier access to matches using the improved and intuitive matchmaking system. Create your own identity that stays the same in both single player and multiplayer modes and progresses as you do. Reap the benefits of your single player rewards in multiplayer and vice versa. Turn single player mode into co-op mode at any time, just by jumping into the game. Now your friend can jump into your single player game and help you without any change to the story. Single player maps and storyline were created with co-op in mind, which means every map has multiple entry points and the story is the same. AI is more challenging than ever. Now, the terrorists are equipped with thermal vision, night vision, and shields – not to mention a multitude of varying reactions – all of which are guaranteed to give you a new playing experience every time you go into battle. As you progress within the game, you'll only be able to outsmart your enemies by taking advantage of intel opportunities, such as thermal scanning, and tactical strategies, such as leapfrogging. Take down the terrorists more effectively using 11 new weapons. New camouflage, clothing and gear allow you to take customization to the next level. [Ubisoft]… Expand"}, {"name": "Red Faction: Guerrilla", "details_link": "https://www.metacritic.com/game/pc/red-faction-guerrilla", "publisher": "THQ", "release_date": "Sep 15 2009", "developers": ["Volition Inc.", "Reactor Zero"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/a037070710726b8b38fa99f09377d117-98.jpg", "descriptions": "Red Faction: Guerrilla is a 3rd person, open-world action shooter set on Mars, 50 years after the events of the original Red Faction. Players assume the role of an insurgent fighter with the newly re-established Red Faction movement as they battle for liberation from the oppressive EarthRed Faction: Guerrilla is a 3rd person, open-world action shooter set on Mars, 50 years after the events of the original Red Faction. Players assume the role of an insurgent fighter with the newly re-established Red Faction movement as they battle for liberation from the oppressive Earth Defense Force. Throughout their fight for freedom, players carve their own path, wreaking havoc across the vast, open-world environment of Mars, from the desolate mining outpost of Parker to the gleaming EDF capital city of Eos. Utilizing improvised weapons, explosives and re-purposed mining equipment and vehicles, Red Faction: Guerrilla allows players to tear through fully destructible environments in an unforgiving Martian landscape swarming with EDF forces, Red Faction resistance fighters, and the downtrodden settlers caught in the cross-fire. Red Faction: Guerrilla also features a robust multiplayer component, including several modes focused on destruction-based gameplay. [THQ]… Expand"}, {"name": "X-Men Legends II: Rise of Apocalypse", "details_link": "https://www.metacritic.com/game/playstation-2/x-men-legends-ii-rise-of-apocalypse", "publisher": "Activision", "release_date": "Sep 20 2005", "developers": ["Raven Software"], "platforms": ["PC", "PlayStation 2"], "num_players": "4  Online", "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/36f1798ac71b77d9c72e562570314329-98.jpg", "descriptions": "X-Men Legends II: Rise of Apocalypse introduces the epic storyline of an uneasy alliance between the X-Men and the hated Brotherhood in a fight to reclaim Earth from Apocalypse's grasp. Gameplay enhancements include more than double the superpowers and customization capabilities, the debutX-Men Legends II: Rise of Apocalypse introduces the epic storyline of an uneasy alliance between the X-Men and the hated Brotherhood in a fight to reclaim Earth from Apocalypse's grasp. Gameplay enhancements include more than double the superpowers and customization capabilities, the debut of several new playable characters, over 100 diverse types of enemies, and a breathtaking range of exotic and real-world environments—from the Madri Temple to Egypt. [Activision]… Expand"}, {"name": "Yoku's Island Express", "details_link": "https://www.metacritic.com/game/switch/yokus-island-express", "publisher": "Villa Gorilla", "release_date": "May 29 2018", "developers": ["Villa Gorilla"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Pinball"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/7fe5a9d01cce34448df71b3567f30f58-98.jpg", "descriptions": "Yoku’s Island Express is an open world/metroidvania-style pinball adventure, Seamlessly blending platform navigation with pinball mechanics across a large open world."}, {"name": "Command & Conquer Remastered Collection", "details_link": "https://www.metacritic.com/game/pc/command-conquer-remastered-collection", "publisher": "Electronic Arts", "release_date": "Jun  5 2020", "developers": ["Petroglyph"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 82, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/a228feb6fdfb5971088a8f11bd8eb4bb-98.jpg", "descriptions": "Command & Conquer and Red Alert are both remastered in 4K by the former Westwood Studios team members. Includes all 3 expansions, rebuilt multiplayer, a modernized UI, Map Editor, bonus footage gallery, and over 7 hours of remastered music."}, {"name": "Freedom Finger", "details_link": "https://www.metacritic.com/game/playstation-4/freedom-finger", "publisher": "Wide Right Interactive", "release_date": "Mar 24 2020", "developers": ["Wide Right Interactive"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/ccb1c4025b78abae18bbc765229f2ac6-98.jpg", "descriptions": "Freedom Finger is a music driven, side-scrolling shooter that sends you blasting through 40 levels of crazy cartoon action. Whether you want to chill and enjoy the story or crank the difficulty for a butt-blasting ridiculous challenge, we’ve got you covered."}, {"name": "The Book of Unwritten Tales", "details_link": "https://www.metacritic.com/game/pc/the-book-of-unwritten-tales", "publisher": "The Adventure Company", "release_date": "Oct 28 2011", "developers": ["KING Art"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/ac469b6ca14a446269d197b8080feb10-98.jpg", "descriptions": "In a world torn by war, the aged gremlin archaeologist Mortimer McGuffin harbours the dark secret of a powerful artifact. Whoever calls this artifact their own will determine the fate of the world. While the Army of Shadows sends out its best and most devious agents to discover the secret,In a world torn by war, the aged gremlin archaeologist Mortimer McGuffin harbours the dark secret of a powerful artifact. Whoever calls this artifact their own will determine the fate of the world. While the Army of Shadows sends out its best and most devious agents to discover the secret, the Alliance's three heroes find themselves involuntarily drawn into the crisis. Enjoy a turbulent and humorous Point & Click adventure in an RPG world! Take Wilbur, Nate and Ivo on their treasure hunt, face bizarre characters and magical fantasy environments, and solve challenging puzzles that will tease your brain cells. [HMH Interactive]… Expand"}, {"name": "Ys: Memories of Celceta", "details_link": "https://www.metacritic.com/game/playstation-vita/ys-memories-of-celceta", "publisher": "XSEED Games", "release_date": "Nov 26 2013", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 82, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/f1794f2e4b31d433694a4c960f492bda-98.jpg", "descriptions": "Ys: Memories of Celceta has players revisit the land and characters of the Japanese cult favorite Ys IV. This re-envisioning of the fourth installment in the Ys series takes a new approach, changing and framing the story of Ys IV within an all-new tale of conspiracy, deception and mystery."}, {"name": "Shadows Over Loathing", "details_link": "https://www.metacritic.com/game/pc/shadows-over-loathing", "publisher": "Asymmetric Publications", "release_date": "Nov 11 2022", "developers": ["Asymmetric Publications"], "platforms": "PC", "genres": ["Adventure", "Point-and-Click"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/21ab72dd98dcc192db7e45097149ee18-98.jpg", "descriptions": "Shadows over Loathing — a slapstick-figure comedy adventure-RPG full of mobsters, monsters, and mysteries."}, {"name": "Laser League", "details_link": "https://www.metacritic.com/game/playstation-4/laser-league", "publisher": "505 Games", "release_date": "May 10 2018", "developers": ["roll7"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Sports", "Team", "Futuristic"], "meta_score": 82, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/0200d15db46dfa6aba71bf348c78f520-98.jpg", "descriptions": "Blink and you are dead! LASER LEAGUE is the new last-word in high-speed, future-sports team action. Battle against the opposition for control of nodes that bathe the arena in deadly light. Evade rival coloured beams, and fry your opponents with speed, strength and strategy."}, {"name": "Super Hydorah", "details_link": "https://www.metacritic.com/game/xbox-one/super-hydorah", "publisher": "Abylight", "release_date": "Sep 20 2017", "developers": ["Locomalito"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 82, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/17d5a802be25dfc005e585737c8931cd-98.jpg", "descriptions": "Super Hydorah is a nonlinear horizontal shoot em up designed to offer a challenging and memorable experience, sublimating the wisdom and richness of traditional shmup classics. The game has direct action, nostalgic art and a wide variety of unique spatial content and situations. It is hoursSuper Hydorah is a nonlinear horizontal shoot em up designed to offer a challenging and memorable experience, sublimating the wisdom and richness of traditional shmup classics. The game has direct action, nostalgic art and a wide variety of unique spatial content and situations. It is hours of intense fun, alone or with your friends, to face the menace of the Meroptians aboard the Delta Lance.… Expand"}, {"name": "BioShock 2: Minerva's Den", "details_link": "https://www.metacritic.com/game/xbox-360/bioshock-2-minervas-den", "publisher": "2K Games", "release_date": "Aug 31 2010", "developers": ["2K Marin"], "platforms": ["PC", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 82, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/1/c103d990a20d2f1928eae0a17ee646c2-98.jpg", "descriptions": "Minerva's Den is an all-new single-player focused downloadable game add-on for BioShock 2 that introduces new characters, locations and mystery to the world of Rapture."}, {"name": "Street Fighter V: Champion Edition", "details_link": "https://www.metacritic.com/game/playstation-4/street-fighter-v-champion-edition", "publisher": "Capcom", "release_date": "Feb 14 2020", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 82, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/d97dd18e24eee0a86e4dae2645664ff2-98.jpg", "descriptions": "Rule the ring with Street Fighter V: Champion Edition, the most robust version of the acclaimed fighting game! This new version includes all content (excluding Fighting Chance costumes, brand collaboration costumes and Capcom Pro Tour DLC) from both the original release and Street Fighter V:Rule the ring with Street Fighter V: Champion Edition, the most robust version of the acclaimed fighting game! This new version includes all content (excluding Fighting Chance costumes, brand collaboration costumes and Capcom Pro Tour DLC) from both the original release and Street Fighter V: Arcade Edition. Champion Edition adds each character, stage and other content that released after Arcade Edition and with the release of this new version. In total: 40 characters, 34 stages, over 200 costumes all action-packed into one knockout edition! READY? FIGHT!All game mode additions and balance updates are free for owners of any Street Fighter V version. Additionally, all DLC characters remain earnable completely free of charge through completing various in-game challenges and receiving earned in-game currency, called Fight Money. For those who can't wait, in-game content can be obtained instantly using real money. Certain additional content can only be acquired using Fight Money, which can be earned through normal gameplay.V-SKILLS I AND IIThe addition of V-Skill II provides more options and depth to the combat system.ONLINE MATCHESBattle against other players online in Casual and Ranked matches.EXTRA BATTLE CHALLENGESComplete optional, time-exclusive challenges for a chance to win rewards.CINEMATIC STORYFollow the cast through \"A Shadow Falls,\" a feature-length adventure that spans the globe.… Expand"}, {"name": "Sayonara Wild Hearts", "details_link": "https://www.metacritic.com/game/playstation-4/sayonara-wild-hearts", "publisher": "Annapurna Interactive", "release_date": "Sep 19 2019", "developers": ["Simogo"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 82, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/4be667e8512495d730d9b34274ac3196-98.jpg", "descriptions": "Sayonara Wild Hearts is a dreamy arcade game about riding motorcycles, skateboarding, dance battling, shooting lasers, wielding swords, and breaking hearts at 200 mph. As the heart of a young woman breaks, the balance of the universe is disturbed. A diamond butterfly appears in her dreamsSayonara Wild Hearts is a dreamy arcade game about riding motorcycles, skateboarding, dance battling, shooting lasers, wielding swords, and breaking hearts at 200 mph. As the heart of a young woman breaks, the balance of the universe is disturbed. A diamond butterfly appears in her dreams and leads her through a highway in the sky, where she finds her other self: the masked biker called The Fool. Journey through a custom-written pop soundtrack, chase scores, and set out to find the harmony of the universe, hidden away in the hearts of Little Death and her star-crossed allies: Dancing Devils, Howling Moons, Stereo Lovers and Hermit 64.… Expand"}, {"name": "KORG DS-10 Synthesizer", "details_link": "https://www.metacritic.com/game/ds/korg-ds-10-synthesizer", "publisher": "XSEED Games", "release_date": "Nov  4 2008", "developers": ["AQ Interactive"], "platforms": "DS", "genres": ["Miscellaneous", "Music Maker", "Music Maker", "Application"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/e36cb984e935d1c9b699a282d831e1ed-98.jpg", "descriptions": "Designed after the famous KORG MS-10 music synthesizer, KORG DS-10 is a music-creation program for professional and aspiring musicians alike.  The sound sources in the KORG DS-10 come from KORG, one of the world’s top musical instrument producers, and no effort was spared in the replicationDesigned after the famous KORG MS-10 music synthesizer, KORG DS-10 is a music-creation program for professional and aspiring musicians alike.  The sound sources in the KORG DS-10 come from KORG, one of the world’s top musical instrument producers, and no effort was spared in the replication of creating high-quality sounds. The Nintendo DS’s touch-screen controls are utilized to the fullest to provide an authentic feel and operability across a dual-screen layout that is unsurpassed in portable music creation.  A 6-track/16-step sequencer enables precise control and provides a wide range of musical possibilities, and up to eight units can be linked via wireless connection to play together or to exchange sounds and songs. [XSEED]… Expand"}, {"name": "No More Heroes", "details_link": "https://www.metacritic.com/game/switch/no-more-heroes", "publisher": "XSEED Games", "release_date": "Oct 28 2020", "developers": ["Engine Software", "Grasshopper Manufacture"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/5f5fcd96259e5c2139e78af373f6d211-98.jpg", "descriptions": "No More Heroes tells the story of Travis Touchdown, an anime fan who lives in the fictional town of Santa Destroy, California. After an unexpected turn of events, Travis finds himself at the bottom of an Assassins' organization. Travis will have to prove himself worthy and defeat 10 otherNo More Heroes tells the story of Travis Touchdown, an anime fan who lives in the fictional town of Santa Destroy, California. After an unexpected turn of events, Travis finds himself at the bottom of an Assassins' organization. Travis will have to prove himself worthy and defeat 10 other bloodthirsty killers - all with deep stories of their own - to make his way to the top of the assassins league.… Expand"}, {"name": "Super Robot Taisen: Original Generation 2", "details_link": "https://www.metacritic.com/game/game-boy-advance/super-robot-taisen-original-generation-2", "publisher": "Atlus Co.", "release_date": "Nov 14 2006", "developers": ["Banpresto"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Sci-Fi"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/d5cb651ab46f4b52028884959b508315-98.jpg", "descriptions": "The follow-up to the original Game Boy Advance release features a new system under which the game determines difficulty by your battle clearances under a variety of conditions."}, {"name": "Watch Dogs 2", "details_link": "https://www.metacritic.com/game/playstation-4/watch-dogs-2", "publisher": "Ubisoft", "release_date": "Nov 15 2016", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/a2c2c7ecccdd327a7c9084b57a7e752b-98.jpg", "descriptions": "Check out the birthplace of the tech revolution as Marcus Holloway, a brilliant young hacker who has fallen victim to ctOS 2.0's predictive algorithms and accused of a crime he did not commit. In Marcus' mission to shut down ctOS 2.0 for good, hacking is his ultimate weapon.  Players notCheck out the birthplace of the tech revolution as Marcus Holloway, a brilliant young hacker who has fallen victim to ctOS 2.0's predictive algorithms and accused of a crime he did not commit. In Marcus' mission to shut down ctOS 2.0 for good, hacking is his ultimate weapon.  Players not only can hack into the San Francisco Bay Area's infrastructure, but also into every person and any connected device they possess to trigger unpredictable chains of events in this vast open world. … Expand"}, {"name": "Hand of Fate 2", "details_link": "https://www.metacritic.com/game/playstation-4/hand-of-fate-2", "publisher": "Defiant Development", "release_date": "Nov  7 2017", "developers": ["Defiant Development"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/42952dfbfea20c45c0e6690920e1ddf1-98.jpg", "descriptions": "Hand of Fate 2 is a dungeon crawler set in a world of dark fantasy. Master a living board game where every stage of the adventure is drawn from a deck of legendary encounters chosen by you."}, {"name": "TOCA Race Driver 3", "details_link": "https://www.metacritic.com/game/playstation-2/toca-race-driver-3", "publisher": "Codemasters", "release_date": "Feb 22 2006", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 2"], "num_players": "8  Online", "genres": ["Driving", "General"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/c67d41703fc05573672b34f7d3ef7875-98.jpg", "descriptions": "(Also known as \"ToCA Race Driver 2006\") TOCA Race Driver 3 takes the variety of motorsport experiences available in \"Race Driver 2\" and expanding on it even further, so no matter what your taste in racing, you'll find something to suit you. Featuring the British GT championship, series(Also known as \"ToCA Race Driver 2006\") TOCA Race Driver 3 takes the variety of motorsport experiences available in \"Race Driver 2\" and expanding on it even further, so no matter what your taste in racing, you'll find something to suit you. Featuring the British GT championship, series stalwarts the DTM and Aussie V8 Supercars, Sprint Cars, Rallying, and open wheel racing all the way from karts to the BMW Williams Grand Prix Cars, and much more TOCA Race Driver 2006 has something for everyone. Race on tracks from all over the world, take the story-driven \"world tour\" mode if you want to get straight to where the action is, or for the people wanting the nuts and bolts, take the \"Pro Career\" mode and work you way up the ladder in different disciplines of motorsport, aiming for the pinnacle of your chosen field. [Codemasters]… Expand"}, {"name": "Dance Central", "details_link": "https://www.metacritic.com/game/xbox-360/dance-central", "publisher": "MTV Games", "release_date": "Nov  4 2010", "developers": ["Harmonix Music Systems"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/e9bcd29c42d23a21a575ed8df40ebd88-98.jpg", "descriptions": "Dance Central uses the Xbox 360's motion-sensing accessory Kinect to guide you through a variety of dance moves and pop songs."}, {"name": "FIFA 16", "details_link": "https://www.metacritic.com/game/playstation-4/fifa-16", "publisher": "EA Sports", "release_date": "Sep 22 2015", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 82, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/4f399dbae4ed1d0a6dc2ab79bd534295-98.jpg", "descriptions": "FIFA 16 gives you the tools to stop your opponent with confidence. Move with greater freedom as a defender - rely on your team to defend as a unit, and your back line to track menacing runs to create balance between attacking and defending."}, {"name": "F1 2011", "details_link": "https://www.metacritic.com/game/playstation-3/f1-2011", "publisher": "Codemasters", "release_date": "Sep 20 2011", "developers": ["Codemasters"], "platforms": ["3DS", "PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 82, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/cd7ce8e75dd4e279afdc4e5a6f4d0b19-98.jpg", "descriptions": "In F1 2011 players will be challenged to ‘Be the driver, live the life, go compete,’ with wide-ranging technical and gameplay advancements on and off track and vastly extended competitive and co-operative multiplayer components.  F1 2011 will feature all of the official teams, drivers andIn F1 2011 players will be challenged to ‘Be the driver, live the life, go compete,’ with wide-ranging technical and gameplay advancements on and off track and vastly extended competitive and co-operative multiplayer components.  F1 2011 will feature all of the official teams, drivers and circuits from the highly anticipated 2011 FIA FORMULA ONE WORLD CHAMPIONSHIP, including the current FIA FORMULA ONE Drivers’ World Champion Sebastian Vettel.  The 2011 season also sees the debut of the 2011 FORMULA 1 GRAND PRIX OF INDIA at Delhi’s Jaypee International Race Circuit and the return of the iconic Nürburgring to the calendar. … Expand"}, {"name": "Capitalism II", "details_link": "https://www.metacritic.com/game/pc/capitalism-ii", "publisher": "Ubisoft", "release_date": "Dec 16 2001", "developers": ["Enlight Software"], "platforms": "PC", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 82, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/a013775ec39ee0127104ea323cd1a67f-98.jpg", "descriptions": "Create and control the business empire of your dreams. This in-depth strategy game covers almost every aspect of business that could be encountered in the real world. Use marketing, manufacturing, purchasing, importing, retailing and more to become a corporate CEO. Capitalism?II features 2Create and control the business empire of your dreams. This in-depth strategy game covers almost every aspect of business that could be encountered in the real world. Use marketing, manufacturing, purchasing, importing, retailing and more to become a corporate CEO. Capitalism?II features 2 new campaigns ? The Capitalist Campaign and the Entrepreneur Campaign ? plus an in-depth tutorial to make the most complex business strategy a breeze to learn. [Ubi Soft]… Expand"}, {"name": "Rally Trophy", "details_link": "https://www.metacritic.com/game/pc/rally-trophy", "publisher": "JoWooD Entertainment AG", "release_date": "Nov 20 2001", "developers": ["Bugbear"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 82, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/f8856dad989e2328eaf81e322e0faf6a-98.jpg", "descriptions": "The first ?historic\" rally simulation. The game includes 12 classic racecars such as the Ford Cortina, the Fiat 600 Abarth and the Morris Mini Cooper, all of which have been modelled in great detail and extremely realistically. [JoWood Productions]"}, {"name": "GT Advance Championship Racing", "details_link": "https://www.metacritic.com/game/game-boy-advance/gt-advance-championship-racing", "publisher": "THQ", "release_date": "Jun  8 2001", "developers": ["MTO"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/9973c3dc84a5c7b22bb3104b538a5325-98.jpg", "descriptions": "Install your car kits, head to the track, start your engines and get ready to challenge the most competitive racers on the circuit! Choose from over 45 authentic cars and race for championship gold on an amazing 32 different tracks. Upgrade your car's performance using 9 categories ofInstall your car kits, head to the track, start your engines and get ready to challenge the most competitive racers on the circuit! Choose from over 45 authentic cars and race for championship gold on an amazing 32 different tracks. Upgrade your car's performance using 9 categories of upgradeable parts including the engine, suspension, aerodynamics and more.… Expand"}, {"name": "Ridge Racer 64", "details_link": "https://www.metacritic.com/game/nintendo-64/ridge-racer-64", "publisher": "Nintendo", "release_date": "Feb 14 2000", "developers": ["Nintendo"], "platforms": "Nintendo 64", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/a74fafc279d7b3431c2fe1897a897dd0-98.jpg", "descriptions": "Race into action with RR64! It's got all the fast-paced arcade action you've come to expect from the Ridge Racer name, plus extra features you've never seen before! Race with up to four players simultaneously on the same screen. Compete on never-before-seen tracks and witness amazing specialRace into action with RR64! It's got all the fast-paced arcade action you've come to expect from the Ridge Racer name, plus extra features you've never seen before! Race with up to four players simultaneously on the same screen. Compete on never-before-seen tracks and witness amazing special effects. You've never seen a Ridge Racer like this! Choose from 25 cars and race on 9 different courses.… Expand"}, {"name": "Pokemon Alpha Sapphire", "details_link": "https://www.metacritic.com/game/3ds/pokemon-alpha-sapphire", "publisher": "Nintendo", "release_date": "Nov 21 2014", "developers": ["Game Freak"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Console-style RPG", "Japanese-Style", "Trainer"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/0d61b89ebaf8a59f486f16d1a98ece80-98.jpg", "descriptions": "Pokemon players first enjoyed Pokemon Ruby Version and Pokemon Sapphire Version when it launched in 2003 for the Game Boy Advance. Now, a whole new generation of Pokemon fans will experience the storyline that unfolds in Pokemon Omega Ruby and Pokemon Alpha Sapphire."}]