[{"name": "Tony Hawk's Pro Skater 4", "details_link": "https://www.metacritic.com/game/pc/tony-hawks-pro-skater-4", "publisher": "Aspyr", "release_date": "Aug 14 2003", "developers": ["Beenox"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-8 ", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 88, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/eac6ea1cffa9304a4e51c1591f657ea5-98.jpg", "descriptions": "Drop into the ultimate skating challenge with Tony Hawk's Pro Skater 4. Players take on the role of legendary skateboarder Tony Hawk and 13 other athletes as they skate through enormous free roaming levels, choose from 190 progressively harder goals and build their skills to perform 14 ofDrop into the ultimate skating challenge with Tony Hawk's Pro Skater 4. Players take on the role of legendary skateboarder Tony Hawk and 13 other athletes as they skate through enormous free roaming levels, choose from 190 progressively harder goals and build their skills to perform 14 of the greatest skateboarding stunts of all time. Tony Hawk's Pro Skater 4 delivers the deepest and most challenging gameplay experience in the Tony Hawk's Pro Skater series. The game's enhanced career mode allows players to earn respect and the chance to take on all new pro goals by conquering a skater-specific Pro Challenge based on each skater's personal history. [Aspyr]… Expand"}, {"name": "Night in the Woods", "details_link": "https://www.metacritic.com/game/pc/night-in-the-woods", "publisher": "Finji", "release_date": "Feb 21 2017", "developers": ["Infinite Fall"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "Adventure", "General"], "meta_score": 88, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/e738ef6f9d5f96b4c3923262d10ea3f4-98.jpg", "descriptions": "Night In The Woods is a 2D story-focused adventure/exploration game with many extracurricular activities to enjoy, characters to meet, and secrets to discover. Run, jump and use astral projection to explore the many sides of town of Possum Springs and the surrounding environs. Waste timeNight In The Woods is a 2D story-focused adventure/exploration game with many extracurricular activities to enjoy, characters to meet, and secrets to discover. Run, jump and use astral projection to explore the many sides of town of Possum Springs and the surrounding environs. Waste time around town with your crew of loser friends. Gain abilities that grant passage to new areas. Discover the secrets of a large cast of characters and the town itself. Experience a big crazy world and the remarkable events unfolding there. Play bass. Break stuff.… Expand"}, {"name": "Ori and the Blind Forest", "details_link": "https://www.metacritic.com/game/pc/ori-and-the-blind-forest", "publisher": "Microsoft Game Studios", "release_date": "Mar 11 2015", "developers": ["Moon Studios"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 88, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/042b97f7480369c287e1f59f0f60fc5b-98.jpg", "descriptions": "Ori and the Blind Forest is a bit of a genremix – It’s a ‘Metroidvania‘, but with a stronger platforming focus and light RPG elements, all set within an atmospheric world."}, {"name": "Need for Speed: Hot Pursuit", "details_link": "https://www.metacritic.com/game/xbox-360/need-for-speed-hot-pursuit", "publisher": "Electronic Arts", "release_date": "Nov 16 2010", "developers": ["Criterion Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 88, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/147aae6ac077222a67046d9399a51615-98.jpg", "descriptions": "Need for Speed Hot Pursuit players will experience the thrill of the chase and the rush of the escape as they play through full careers as both a cop and a racer – solo or connected. The blistering speeds, brutal busts and heart-stopping getaways are all connected via Need for Speed Autolog.Need for Speed Hot Pursuit players will experience the thrill of the chase and the rush of the escape as they play through full careers as both a cop and a racer – solo or connected. The blistering speeds, brutal busts and heart-stopping getaways are all connected via Need for Speed Autolog. This network not only connects friends for epic head-to head pursuits and races, but also enables players to compare performances and stats, thereby setting the stage for the ultimate in friendly competition.… Expand"}, {"name": "Pistol Whip", "details_link": "https://www.metacritic.com/game/playstation-4/pistol-whip", "publisher": "Cloudhead Games", "release_date": "Jul 30 2020", "developers": ["Cloudhead Games"], "platforms": ["PC", "PlayStation 5", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 88, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/4bfabdfe73117cf5d4a10e5702190156-98.jpg", "descriptions": "Pistol Whip is an unstoppable action-rhythm FPS. Journey through a cinematic bullet hell powered by a breakneck soundtrack to become the ultimate action hero legend."}, {"name": "Ridge Racer", "details_link": "https://www.metacritic.com/game/psp/ridge-racer", "publisher": "Namco", "release_date": "Mar 22 2005", "developers": ["Namco"], "platforms": "PSP", "num_players": "1-8 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 88, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/7a686fe52f885ad29a306c5390fa4c60-98.jpg", "descriptions": "(Also known as \"Ridge Racers\")  Featuring the best loved race courses from arcade classic Rave Racer and the entire Ridge Racer series, 24 circuits of breakneck speed and exhilaration stand between you and racing glory. Beat the clock in Time Attack Mode or test your racing skills against up(Also known as \"Ridge Racers\")  Featuring the best loved race courses from arcade classic Rave Racer and the entire Ridge Racer series, 24 circuits of breakneck speed and exhilaration stand between you and racing glory. Beat the clock in Time Attack Mode or test your racing skills against up to 8 players in WiFi compatible Wireless Battle Mode. Features reworked and enhanced car design, complete with trademark Ridge Racer series drift handling. Drive in style and rise through the ranks to unlock hidden bonuses in World Tour Mode. Featuring 24 breathtaking courses, the most in any Ridge Racer game, including old favourites Seaside Route 765, Crimsonrock Pass and Greenpeak Highlands. [Namco]… Expand"}, {"name": "Forza Horizon 4", "details_link": "https://www.metacritic.com/game/pc/forza-horizon-4", "publisher": "Microsoft Game Studios", "release_date": "Sep 28 2018", "developers": ["Playground Games"], "platforms": ["Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 88, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/491f1da322b7cc97663cfb59e2a8a124-98.jpg", "descriptions": "For the first time in the racing and driving genre, experience dynamic seasons in a shared open-world. Explore beautiful scenery, collect over 450 cars, and become a Horizon Superstar in historic Britain."}, {"name": "F1 2021", "details_link": "https://www.metacritic.com/game/xbox-series-x/f1-2021", "publisher": "Electronic Arts", "release_date": "Jul 13 2021", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 88, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/0c1d034fc0586099980bfdf412eac17c-98.jpg", "descriptions": "Every story has a beginning in F1® 2021, the official videogame of the 2021 FIA FORMULA ONE WORLD CHAMPIONSHIP™. Enjoy the stunning new features of F1® 2021, including the thrilling story experience ‘Braking Point’, two-player Career, and get even closer to the grid with ‘Real-Season Start’.Every story has a beginning in F1® 2021, the official videogame of the 2021 FIA FORMULA ONE WORLD CHAMPIONSHIP™. Enjoy the stunning new features of F1® 2021, including the thrilling story experience ‘Braking Point’, two-player Career, and get even closer to the grid with ‘Real-Season Start’."}, {"name": "Fight Night Round 2", "details_link": "https://www.metacritic.com/game/playstation-2/fight-night-round-2", "publisher": "EA Sports", "release_date": "Feb 28 2005", "developers": ["EA Sports"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 88, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/bd1cbb9611c9ffa54bbd679101ea7fce-98.jpg", "descriptions": "Fight Night Round 2 continues to deliver innovative gameplay via the analog Total Punch Control mechanic, allowing gamers to throw multiple punches, block, bob and weave with complete precision and control. Packing in more fearsome punches, players can now dominate the ring with the all-newFight Night Round 2 continues to deliver innovative gameplay via the analog Total Punch Control mechanic, allowing gamers to throw multiple punches, block, bob and weave with complete precision and control. Packing in more fearsome punches, players can now dominate the ring with the all-new EA SPORTS Haymaker allowing gamers to knock down their opponents with one devastating blow by adding extra power to each punch. Every hit counts in the game with powerful punches inflicting dynamic injuries on opponents, and thus reducing a fighter's ability to defend himself. Players also manage the boxers inside and out of the ring. Utilizing the new EA SPORTS Cutman, gamers can minimize damage on their fighters by helping them heal critical wounds between rounds. The game includes a new and unique create-a-player option, deep training and career mode, as well as online play for the PlayStation 2 and Xbox consoles. [Electronic Arts]… Expand"}, {"name": "Nex Machina: Death Machine", "details_link": "https://www.metacritic.com/game/playstation-4/nex-machina-death-machine", "publisher": "Sony Interactive Entertainment", "release_date": "Jun 20 2017", "developers": ["Housemarque"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 88, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/37d399b8c81e1e63acddea5c0c61104f-98.jpg", "descriptions": "From the collaboration between Housemarque (Resogun, Alienation, Matterfall), and Robotron and Smash TV legendary creator Eugene Jarvis comes Nex Machina, an explosive arcade experience created with competition in mind. Can you survive the mechanical onslaught of hundreds of evil robotsFrom the collaboration between Housemarque (Resogun, Alienation, Matterfall), and Robotron and Smash TV legendary creator Eugene Jarvis comes Nex Machina, an explosive arcade experience created with competition in mind. Can you survive the mechanical onslaught of hundreds of evil robots trying to obliterate any threat? Can you stop them from harvesting oblivious humans? In the vein of cult classics such Resogun and Robotron, Nex Machina is the ultimate top-down voxel shooter where everything can be blown up to pieces. Enter \"the zone\", become one with the game and pull off the most incredible feats. Packed with opportunities to create your own playstyle, face tough challenges and engage in a ruthlessly competitive environment, Nex Machina is what arcade games deserve to be in the 21th century. [Playstation.com]\r… Expand"}, {"name": "Nioh", "details_link": "https://www.metacritic.com/game/playstation-4/nioh", "publisher": "Koei Tecmo Games", "release_date": "Feb  7 2017", "developers": ["Team Ninja"], "platforms": "PlayStation 4", "num_players": "2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 88, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/d57991d86d5a92a97b73f955a883b9d5-98.jpg", "descriptions": "Take up your sword and travel to Japans blood-bathed Sengoku period  an era ravaged by warring states and dark, malevolent forces  and cut a violent path through the land as the masterless samurai, William. Cross blades in brutal hand-to-hand combat, wielding swords, axes, spears and evenTake up your sword and travel to Japans blood-bathed Sengoku period  an era ravaged by warring states and dark, malevolent forces  and cut a violent path through the land as the masterless samurai, William. Cross blades in brutal hand-to-hand combat, wielding swords, axes, spears and even war hammers against foes both human and demon. Endure the vicious encounters and learn from your mistakes: each death will bring you resurrection and each resurrection a greater resolve to overcome your foes.… Expand"}, {"name": "Animal Crossing: New Leaf", "details_link": "https://www.metacritic.com/game/3ds/animal-crossing-new-leaf", "publisher": "Nintendo", "release_date": "Jun  9 2013", "developers": ["Nintendo"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 88, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/946ca4ded8904597643dca54ff7ec7c0-98.jpg", "descriptions": "There are no points or levels, just a myriad of sights and sounds, places and activities...all ready to explore. Spend your time passing new ordinances—or going fishing. Hang out at a coffee shop or visit a tropical island. It's up to you. Your game is what you make of it—and personalizingThere are no points or levels, just a myriad of sights and sounds, places and activities...all ready to explore. Spend your time passing new ordinances—or going fishing. Hang out at a coffee shop or visit a tropical island. It's up to you. Your game is what you make of it—and personalizing your world is part of the fun. Create cool patterns for clothing or furniture, build new structures in your town, design gardens and museum displays, and so much more. Time passes in the world of Animal Crossing just as it does in real life. Celebrate holidays and see the seasons change. Meet new visitors or get gifts from your neighbors.… Expand"}, {"name": "Diablo II", "details_link": "https://www.metacritic.com/game/pc/diablo-ii", "publisher": "Blizzard Entertainment", "release_date": "Jun 28 2000", "developers": ["Blizzard North"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 88, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/1d7db04abd1981ab59dd2facf5733ca8-98.jpg", "descriptions": "In Diablo II, return to a world of dark fantasy. As one of five distinct character types, explore the world of Diablo II -- journey across distant lands, fight new villains, discover new treasures, and uncover ancient mysteries, all in the quest to stop the Lord Of Terror, once and for all.In Diablo II, return to a world of dark fantasy. As one of five distinct character types, explore the world of Diablo II -- journey across distant lands, fight new villains, discover new treasures, and uncover ancient mysteries, all in the quest to stop the Lord Of Terror, once and for all.  [Blizzard Entertainment]… Expand"}, {"name": "Rez Infinite", "details_link": "https://www.metacritic.com/game/playstation-5/rez-infinite", "publisher": "Enhance Games", "release_date": "Feb 22 2023", "developers": ["Enhance Games", "Resonair"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Rail"], "meta_score": 88, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/8d633a00aa0e8e6de44cfc69896efe0f-98.jpg", "descriptions": "Experience 360 degrees of mind-blowing synesthesia as you blast through waves of enemies and giant transforming bosses, with colors and sounds that sync and blend to the beat of Rez's legendary techno soundtrack."}, {"name": "Mortal Kombat 11 Ultimate", "details_link": "https://www.metacritic.com/game/playstation-5/mortal-kombat-11-ultimate", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 17 2020", "developers": ["NetherRealm Studios"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 88, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/288055089131e6daa4ffb4ed4eac72a7-98.jpg", "descriptions": "Experience 2 robust and critically acclaimed story campaigns from Mk11 & Mk11: aftermath. Play as the complete 37-character roster including newly added fighters mileena, RaiN & rambo. Thousands of Skins & weapons & Gear for an unprecedented level of Fighter customization. Includes allExperience 2 robust and critically acclaimed story campaigns from Mk11 & Mk11: aftermath. Play as the complete 37-character roster including newly added fighters mileena, RaiN & rambo. Thousands of Skins & weapons & Gear for an unprecedented level of Fighter customization. Includes all previous guest fighters such as Terminator Joker spawn & robocop. Every mode included.… Expand"}, {"name": "Kentucky Route Zero: TV Edition", "details_link": "https://www.metacritic.com/game/playstation-4/kentucky-route-zero-tv-edition", "publisher": "Annapurna Interactive", "release_date": "Jan 28 2020", "developers": ["Cardboard Computer"], "platforms": ["Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 88, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/031aad8a91349c3ff632184bfe5b05dd-98.jpg", "descriptions": "KENTUCKY ROUTE ZERO is a magical realist adventure game about a secret highway running through the caves beneath Kentucky, and the mysterious folks who travel it. At twilight in Kentucky, as bird songs give way to the choir of frogs and insects, familiar roads become strange, and it's easyKENTUCKY ROUTE ZERO is a magical realist adventure game about a secret highway running through the caves beneath Kentucky, and the mysterious folks who travel it. At twilight in Kentucky, as bird songs give way to the choir of frogs and insects, familiar roads become strange, and it's easy to get lost. Those who are already lost may find their way to a secret highway winding through underground caves. The people who live and work along this highway are themselves a little strange at first, but soon seem familiar: the aging driver making the last delivery for a doomed antique shop; the young woman who fixes obsolete TVs surrounded by ghosts; the child and his giant eagle companion; the robot musicians; the invisible power company lurking everywhere, and the threadbare communities who struggle against its grip.… Expand"}, {"name": "Hellblade: Senua's Sacrifice", "details_link": "https://www.metacritic.com/game/xbox-one/hellblade-senuas-sacrifice", "publisher": "Ninja Theory", "release_date": "Apr 11 2018", "developers": ["Ninja Theory"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 88, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/0728fad0f426fc8eb7dc9752a105a0b8-98.jpg", "descriptions": "An independent game from Ninja Theory - makers of Heavenly Sword, Enslaved: Odyssey to the West & DmC: Devil May Cry. Hellblade: Senua's Sacrifice takes you on a journey into savage viking heartland with Senua, a Celtic warrior struggling with trauma & psychosis."}, {"name": "The Walking Dead: Episode 5 - No Time Left", "details_link": "https://www.metacritic.com/game/playstation-3/the-walking-dead-episode-5---no-time-left", "publisher": "Telltale Games", "release_date": "Nov 20 2012", "developers": ["Telltale Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Miscellaneous", "Adventure", "General", "Compilation", "Point-and-Click"], "meta_score": 88, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/63a6d8940fe90e2ece41d31c70870ce7-98.jpg", "descriptions": "The final episode of a five-part \"season\" set in Robert Kirkman’s zombie apocalypse."}, {"name": "NBA 2K13", "details_link": "https://www.metacritic.com/game/xbox-360/nba-2k13", "publisher": "2K Sports", "release_date": "Oct  2 2012", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Wii U", "Xbox 360"], "num_players": "Up to 10 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 88, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/240f6ce73091ba1f9a259eef37e21400-98.jpg", "descriptions": "USA Basketball – Finally answer the question: Who would win a head-to-head duel between the 1992 Dream Team and the 2012 squad?  MyCAREER Mode – Build your MyPLAYER by giving him signature skills, and acquire your very own custom animations using Virtual Currency (VC). Includes all-new GMUSA Basketball – Finally answer the question: Who would win a head-to-head duel between the 1992 Dream Team and the 2012 squad?  MyCAREER Mode – Build your MyPLAYER by giving him signature skills, and acquire your very own custom animations using Virtual Currency (VC). Includes all-new GM sit-down feature, new endorsement paths, improved in-game AI, and all-new swag including casual clothing, equipment, custom shoes and much more. NBA 2K “MyTEAM” – Collect players, uniforms, arenas and boosts to put together your own team. Track the talent marketplace that fluctuates based on real-life performance, and then take your team online to play against other players’ MyTEAMS in a new tiered matchmaking system.  The Control Stick: For the first time ever, all dribble moves have been mapped to the right analog stick, as well as shooting, passing, and post moves. String together devastating crossovers and clutch shots for maximum control and effectiveness. Dynamic Shot Generator: Shots are now dynamically created on the fly, with all-new collision physics created in real-time. Signature Skills: Each player has unique abilities that can alter the course of a game.  Players are modeled to impact the game in their own unique way, from Derrick Rose as a “Floor General” to Kevin Durant being “The Closer.”  Learn to use each player’s unique ability and change the game on your terms. Revamped Passing System: Improved fast break passing gives players more control. Fire a bounce pass to a cutting teammate or go “Lob City” in transition.  Kinect Ready - Act as your team’s floor general by calling out plays and strategies using NBA 2K13’s voice recognition on Kinect. Shoe Creator - One of the most flexible interfaces ever allow the user to customize up to 45 shoe components and layers from the ground up. Create original shoes from all the major shoe brands and deck your player out with his own signature creation. Classic Teams – The best teams in NBA history are back, and can now be taken online. Challenge your friends with squads such as the ’96 Bulls and ’65 Celtics.  … Expand"}, {"name": "The Witcher 2: Assassins of Kings", "details_link": "https://www.metacritic.com/game/pc/the-witcher-2-assassins-of-kings", "publisher": "Atari", "release_date": "May 17 2011", "developers": ["CD Projekt Red Studio"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 88, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/2dc07b7e5051d69e3bb1b8f0179d978d-98.jpg", "descriptions": "The Witcher 2 is the sequel to developer CD Projekt's mature-themed fantasy role-playing game based on the works of author Andrzej Sapkowski."}, {"name": "Tiger Woods PGA Tour 2005", "details_link": "https://www.metacritic.com/game/gamecube/tiger-woods-pga-tour-2005", "publisher": "EA Sports", "release_date": "Sep 20 2004", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Sim"], "meta_score": 88, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/3766b184445068e0c56352ae5916c6f9-98.jpg", "descriptions": "Challenge professional golfer Tiger Woods to challenging matches in Tiger Woods PGA Tour 2005. This time, you can modify course dynamics and add longer trees, tighter fairways, undulations to greens, deeper bunkers, and more. The game's EA Sports Game Face features nonproportional boneChallenge professional golfer Tiger Woods to challenging matches in Tiger Woods PGA Tour 2005. This time, you can modify course dynamics and add longer trees, tighter fairways, undulations to greens, deeper bunkers, and more. The game's EA Sports Game Face features nonproportional bone scaling and texture blending to provide more realistic looks. After creating your own golfer and making a name for yourself, unlock the chance to tee off against some of golf's greatest legends, including Arnold Palmer, Jack Nicklaus, and Ben Hogan.… Expand"}, {"name": "SSX Tricky", "details_link": "https://www.metacritic.com/game/xbox/ssx-tricky", "publisher": "EA Sports Big", "release_date": "Dec 10 2001", "developers": ["EA Sports Big"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 88, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/635695d633e009442657e545ffdb1e6e-98.jpg", "descriptions": "SSX Tricky launches you into a world of monster air, intense tracks, and death-defying tricks. Six all-new competitors plus six riders from the original SSX make up the circuit. Compete in the World Circuit, go head-to-head in the Showoff versions of nine courses on the World Circuit, orSSX Tricky launches you into a world of monster air, intense tracks, and death-defying tricks. Six all-new competitors plus six riders from the original SSX make up the circuit. Compete in the World Circuit, go head-to-head in the Showoff versions of nine courses on the World Circuit, or just practice in Free Ride. With all-new Garibaldi and Valdez courses, you'll have plenty of huge cliff drops to catch big air and pull off Uber tricks.… Expand"}, {"name": "Oddworld: Abe's Exoddus", "details_link": "https://www.metacritic.com/game/playstation/oddworld-abes-exoddus", "publisher": "GT Interactive", "release_date": "Oct 31 1998", "developers": ["Oddworld Inhabitants"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "PlayStation"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 88, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/579c7ecfca26586847d19bbbeb8939af-98.jpg", "descriptions": "If you hated the first one, it's likely because of the lack of save points, so you should definitely consider giving this series another try."}, {"name": "Plants vs. Zombies", "details_link": "https://www.metacritic.com/game/pc/plants-vs-zombies", "publisher": "PopCap", "release_date": "May  5 2009", "developers": ["PopCap"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy", "Defense"], "meta_score": 87, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/bc9f5a7522056e89f4852002657531d1-98.jpg", "descriptions": "Zombies are invading your home, and the only defense is your arsenal of plants! Armed with an alien nursery-worth of zombie-zapping plants like peashooters and cherry bombs, you'll need to think fast and plant faster to stop dozens of types of zombies dead in their tracks. Obstacles like aZombies are invading your home, and the only defense is your arsenal of plants! Armed with an alien nursery-worth of zombie-zapping plants like peashooters and cherry bombs, you'll need to think fast and plant faster to stop dozens of types of zombies dead in their tracks. Obstacles like a setting sun, creeping fog and a swimming pool add to the challenge, and with five game modes to dig into, the fun never dies! [Steam]… Expand"}, {"name": "Rocksmith 2014 Edition", "details_link": "https://www.metacritic.com/game/xbox-360/rocksmith-2014-edition", "publisher": "Ubisoft", "release_date": "Oct 22 2013", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox One", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 87, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/83cd7164522a766f0d75f4f6645e8032-98.jpg", "descriptions": "Rocksmith 2014 Edition lets players plug in any electric guitar or bass directly into your system and begin learning guitar with the Rocksmith Method."}, {"name": "Burnout Paradise", "details_link": "https://www.metacritic.com/game/playstation-3/burnout-paradise", "publisher": "Electronic Arts", "release_date": "Jan 22 2008", "developers": ["Criterion Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/9fee350619f5e2b482e4c7a42037e214-98.jpg", "descriptions": "Burnout Paradise proves that crashing is awesome! Next generation technology has enabled an unprecedented level of crash deformation allowing you to experience the most explosive pile-ups in the series’ history. Now the development team can realize their original vision for the BurnoutBurnout Paradise proves that crashing is awesome! Next generation technology has enabled an unprecedented level of crash deformation allowing you to experience the most explosive pile-ups in the series’ history. Now the development team can realize their original vision for the Burnout franchise: an open world environment where you can do anything, anywhere, anytime. Feel the adrenaline course through your veins as you take to the road for the first time in Paradise City, where the action is all around you. Explore the city, discover events, and look for the best opportunities to crash, jump and pull signature takedowns. In Burnout Paradise you're given the keys to the city, but it's up to you to earn the keys to the meanest and most dangerous cars on the street, and earn your Burnout license. [Electronic Arts]… Expand"}, {"name": "Guacamelee! Super Turbo Championship Edition", "details_link": "https://www.metacritic.com/game/playstation-4/guacamelee!-super-turbo-championship-edition", "publisher": "DrinkBox Studios", "release_date": "Jul  1 2014", "developers": ["DrinkBox Studios"], "platforms": ["PC", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 87, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/1ee61d2c25e273f79e45dec39abbe10c-98.jpg", "descriptions": "Guacamelee! is a Metroid-vania style action-platformer set in a magical Mexican inspired world. The game draws its inspiration from traditional Mexican culture and folklore, and features many interesting and unique characters. Guacamelee builds upon the classic open-world Metroid-vania styleGuacamelee! is a Metroid-vania style action-platformer set in a magical Mexican inspired world. The game draws its inspiration from traditional Mexican culture and folklore, and features many interesting and unique characters. Guacamelee builds upon the classic open-world Metroid-vania style of games, by adding a strong melee combat component, a new dimension switching mechanic, and cooperative same-screen multiplayer for the entire story. The game also blurs the boundaries between combat and platforming by making many of the moves useful and necessary for both of these.… Expand"}, {"name": "DOOM 3", "details_link": "https://www.metacritic.com/game/pc/doom-3", "publisher": "Activision", "release_date": "Aug  3 2004", "developers": ["id Software"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 87, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/d3b8e7a37d2982a5ce0bec2c334a0df9-98.jpg", "descriptions": "id Software's terrifying battle with the forces of Hell. A massive demonic invasion has overwhelmed the Union Aerospace Corporations’ (UAC) Mars Research Facility leaving only chaos and horror in its wake. As one of only a few survivors, you struggle with shock and fear as you fightid Software's terrifying battle with the forces of Hell. A massive demonic invasion has overwhelmed the Union Aerospace Corporations’ (UAC) Mars Research Facility leaving only chaos and horror in its wake. As one of only a few survivors, you struggle with shock and fear as you fight your way to Hell and back, in an epic clash against pure evil. Built on id’s revolutionary new 3D graphics engine, DOOM 3 draws you into the most frightening and gripping 3D gaming experience ever created.… Expand"}, {"name": "Subnautica", "details_link": "https://www.metacritic.com/game/pc/subnautica", "publisher": "Unknown Worlds Entertainment", "release_date": "Jan 23 2018", "developers": ["Unknown Worlds Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Sandbox"], "meta_score": 87, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/ae6f907bbe492cc8045d13df857cc588-98.jpg", "descriptions": "Descend into the depths of an alien underwater world filled with resources, creatures, wonder and threats. Craft equipment and submarines to explore lush coral reefs, volcanoes, cave systems, and more - All while attempting to survive."}, {"name": "Death's Door", "details_link": "https://www.metacritic.com/game/xbox-one/deaths-door", "publisher": "Devolver Digital", "release_date": "Jul 20 2021", "developers": ["Acid Nerve"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 87, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/bdf5b16f3946e4dcd4a7a9e948968437-98.jpg", "descriptions": "Reaping souls of the dead and punching a clock might get monotonous but it's honest work for a Crow. The job gets lively when your assigned soul is stolen and you must track down a desperate thief to a realm untouched by death - where creatures grow far past their expiry and overflow withReaping souls of the dead and punching a clock might get monotonous but it's honest work for a Crow. The job gets lively when your assigned soul is stolen and you must track down a desperate thief to a realm untouched by death - where creatures grow far past their expiry and overflow with greed and power. Talon Sharp Combat:  Utilise melee weapons, arrows and magic to overcome a fantastic array of beasts and demigods. Mistakes are punished and victory is rewarded. Gain an edge by customising your character stats and mastering the abilities and upgrades you obtain.\r A Beautifully Bleak World: Venture beyond the Doors and explore a land full of twisted inhabitants and countless secrets, bringing hope to the weird and wonderful characters you’ll meet along the way.\r A Dark Mystery to Unravel: Track down and defeat colossal tyrants with stories and motivations of their own. Experience a somber yet darkly comedic tale, uncovering the truths behind the flow of souls, the role of the Crows and the origin of the Doors.… Expand"}, {"name": "Frostpunk: Console Edition", "details_link": "https://www.metacritic.com/game/playstation-4/frostpunk-console-edition", "publisher": "11 bit studios", "release_date": "Oct 11 2019", "developers": ["11 bit studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Action Adventure", "Management", "Survival", "Government"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/7002b2d5bf1d74ccc93bedfacc20e048-98.jpg", "descriptions": "In a completely frozen world, people develop steam-powered technology to oppose the overwhelming cold. Society in its current form becomes ineffective and it has to change in order to survive."}, {"name": "GRID", "details_link": "https://www.metacritic.com/game/playstation-3/grid", "publisher": "Codemasters", "release_date": "Jun  3 2008", "developers": ["Codemasters"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 87, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/b9c8aa7e181008d4b2bcdf875017e752-98.jpg", "descriptions": "(Also known as \"Race Dirver: GRID\")   GRID takes players to dramatic and beautifully realized race locations over three continents to compete in a variety of racing events. Packed with the most powerful race cars - new and classic, circuit and drift - players compete to conquer the most(Also known as \"Race Dirver: GRID\")   GRID takes players to dramatic and beautifully realized race locations over three continents to compete in a variety of racing events. Packed with the most powerful race cars - new and classic, circuit and drift - players compete to conquer the most prestigious official race tracks and championships then beyond to compete in challenging city-based competitions, and then on through to road events and urban street races. The drama, the rivalries, the aggression and the crashes; this is not a game about collecting cars or spending all of your time in the front-end tuning suspension settings or designing liveries. Codemasters wants to make racing exciting again. Gamers compete on Europe's greatest official race tracks in prestige Marques including Aston Martin, Koenigsegg and Pagani. Iconic cities across the U.S, including San Francisco, Washington DC and Detroit - each with their own atmosphere and events - play host to diverse street races, where high-performance V8 muscle cars set the pace in aggressive, closely fought pack competitions. And in the Far East, Japanese racing culture sets the tone where night races, including Drift racing, takes drivers through neon illuminated cities and to outlying mountain roads. There's also the opportunity to compete in races that operate on the fringes of legality in the back streets and industrial areas of Yokohama. [Codemasters]… Expand"}, {"name": "Stardew Valley", "details_link": "https://www.metacritic.com/game/switch/stardew-valley", "publisher": "Chucklefish", "release_date": "Oct  5 2017", "developers": ["ConcernedApe"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 87, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/3d1e353be21da06e88354dd89ce41fe6-98.jpg", "descriptions": "You've inherited your grandfather's old farm plot in Stardew Valley. Armed with hand-me-down tools and a few coins, you set out to begin your new life. Can you learn to live off the land and turn these overgrown fields into a thriving home? It won't be easy. Ever since Joja Corporation cameYou've inherited your grandfather's old farm plot in Stardew Valley. Armed with hand-me-down tools and a few coins, you set out to begin your new life. Can you learn to live off the land and turn these overgrown fields into a thriving home? It won't be easy. Ever since Joja Corporation came to town, the old ways of life have all but disappeared. The community center, once the town's most vibrant hub of activity, now lies in shambles. But the valley seems full of opportunity. With a little dedication, you might just be the one to restore Stardew Valley to greatness.… Expand"}, {"name": "Devil May Cry 5", "details_link": "https://www.metacritic.com/game/xbox-one/devil-may-cry-5", "publisher": "Capcom", "release_date": "Mar  8 2019", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 3 ", "genres": ["Action Adventure", "General"], "meta_score": 87, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/b8caf80845e2c635ce3054a241021f1a-98.jpg", "descriptions": "A brand-new entry in the over-the-top action series comes complete with its signature blend of high-octane stylized action and otherworldly and original characters the series is known for. Years have passed since the legions of hell have set foot in this world, but now a new demonic invasionA brand-new entry in the over-the-top action series comes complete with its signature blend of high-octane stylized action and otherworldly and original characters the series is known for. Years have passed since the legions of hell have set foot in this world, but now a new demonic invasion has begun, and humanity’s last hope will rest in the hands of three lone demon hunters, each offering a radically different play style. United by fate and a thirst for vengeance, these demon hunters will have to face their demons if they hope to survive. [Xbox.com]… Expand"}, {"name": "Super Meat Boy", "details_link": "https://www.metacritic.com/game/pc/super-meat-boy", "publisher": "Team Meat", "release_date": "Nov 30 2010", "developers": ["Team Meat"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/0ba67e6eedf3f67dd5554d5fcdcae4b4-98.jpg", "descriptions": "Super Meat Boy is a tough as nails platformer where you play as an animated cube of meat who's trying to save his girlfriend (who happens to be made of bandages) from an evil fetus in a jar wearing a tux.\r Our meaty hero will leap from walls, over seas of buzz saws, through crumbling cavesSuper Meat Boy is a tough as nails platformer where you play as an animated cube of meat who's trying to save his girlfriend (who happens to be made of bandages) from an evil fetus in a jar wearing a tux.\r Our meaty hero will leap from walls, over seas of buzz saws, through crumbling caves and pools of old needles. Sacrificing his own well being to save his damsel in distress. Super Meat Boy brings the old school difficulty of classic NES titles like Mega Man 2, Ghost and Goblins and Super Mario Bros. 2 (The Japanese one) and stream lines them down to the essential no BS straight forward twitch reflex platforming.\r Ramping up in difficulty from hard to soul crushing SMB will drag Meat boy though haunted hospitals, salt factories and even hell itself. And if 300+ single player levels weren't enough SMB also throws in epic boss fights, a level editor and tons of unlock able secrets, warp zones and hidden characters.… Expand"}, {"name": "Middle-earth: Shadow of Mordor", "details_link": "https://www.metacritic.com/game/xbox-one/middle-earth-shadow-of-mordor", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 30 2014", "developers": ["Monolith Productions"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "Fantasy", "Open-World"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/366dc928fc0878ce3a40a126ebb0cf13-98.jpg", "descriptions": "Fight your way through Mordor and reveal the truth of the spirit that compels you, discover the origins of the Rings of Power, build your legend and ultimately confront the evil of Sauron in this new story of Middle-earth."}, {"name": "Halo 4", "details_link": "https://www.metacritic.com/game/xbox-360/halo-4", "publisher": "Microsoft Game Studios", "release_date": "Nov  6 2012", "developers": ["343 Industries"], "platforms": ["PC", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Shooter", "Sci-Fi", "Sci-Fi", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 87, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/c5e04c6982b536e3e80abedb736dd0e8-98.jpg", "descriptions": "Master Chief re-emerges to battle an ancient evil force determined to wreak vengeance and annihilation. Shipwrecked on a mysterious world, faced with new enemies and deadly technology, the universe won't ever be the same. Enlist aboard the Infinity to experience Halo's original multiplayerMaster Chief re-emerges to battle an ancient evil force determined to wreak vengeance and annihilation. Shipwrecked on a mysterious world, faced with new enemies and deadly technology, the universe won't ever be the same. Enlist aboard the Infinity to experience Halo's original multiplayer (with up to three cohorts) and Spartan Ops - innovative episodic fiction-based co-op missions. Go Beyond the Story: Halo 4's Infinity Multiplayer features an expanded suite of multiplayer modes, weapons, vehicles, armor abilities, a new loadout and Spartan IV player progression system.… Expand"}, {"name": "Return to Monkey Island", "details_link": "https://www.metacritic.com/game/xbox-series-x/return-to-monkey-island", "publisher": "Devolver Digital", "release_date": "Nov  8 2022", "developers": ["Terrible Toybox"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/e4d2869bddbd367a49e2ebeaf0d18b7b-98.jpg", "descriptions": "It's been many years since Guybrush Threepwood was last locked in a battle of wits with his nemesis, the zombie pirate LeChuck. His true love, Elaine Marley, has turned her focus away from governing and Guybrush himself is adrift and unfulfilled, having never found the Secret of MonkeyIt's been many years since Guybrush Threepwood was last locked in a battle of wits with his nemesis, the zombie pirate LeChuck. His true love, Elaine Marley, has turned her focus away from governing and Guybrush himself is adrift and unfulfilled, having never found the Secret of Monkey Island. Hip, young pirate leaders led by Captain Madison have shuffled the old guard from power, Melee Island has taken a turn for the worse, and famed businessman Stan has been imprisoned for 'marketing-related crimes'.Banter with old friends and new faces on familiar islands now under dangerous new leadership. Then, take to the high seas and explore the new and unknown as you work your way out of tough predicaments. Clever puzzles, bizarre situations, and devastating ripostes are all that stand between Guybrush and glory.… Expand"}, {"name": "Football Manager 2010", "details_link": "https://www.metacritic.com/game/pc/football-manager-2010", "publisher": "Sega", "release_date": "Nov  3 2009", "developers": ["Sports Interactive"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Management", "Management"], "meta_score": 87, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/4/f39eb6e794d8fd261480043c4a995d0e-98.jpg", "descriptions": "Improved Match Engine - improved AI, over 100 new animations in 3D mode, new stadiums and crowds, improved pitch degradations and better lighting make for the most immersive pitch-side experience ever. Match Analysis - a match analysis tool that shows you where shots, passes, crosses,Improved Match Engine - improved AI, over 100 new animations in 3D mode, new stadiums and crowds, improved pitch degradations and better lighting make for the most immersive pitch-side experience ever. Match Analysis - a match analysis tool that shows you where shots, passes, crosses, headers, tackles, fouls and interceptions have been made on the field for both teams. See this analysis both live in game, and post match, allowing you to pinpoint the weaknesses and strengths of both your team and your opponents. New User Interface - a completely new vibrant look and feel to the game, plus a navigational overhaul. The side menu is replaced by an intuitive tab system, based on extensive consumer feedback and usability studies, which allows you to access all areas of FM 2010 quickly and easily. Tactical Overhaul - a new tactics module makes it much easier to make your team play as you want them to. There are thousands of possible pre-set options and touchline \"shout\" instructions for making instant changes to your teams playing style. Don't worry; the old system is still there for people who love their sliders. News Center - a subscription based newspaper. Get the news about the football world around you that you want, and not the news you don't want. New Data Editor - including a brand new Competition Editor allowing you to add competitions and extra levels for leagues currently in the game, and add completely new competitions and leagues all via a very simple to use editor. Plus, the new editor allows you to keep your game up to date more easily than ever before. [Sega]… Expand"}, {"name": "Final Fantasy XIV: Stormblood", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-xiv-stormblood", "publisher": "Square Enix", "release_date": "Jun 20 2017", "developers": ["Square Enix"], "platforms": ["PlayStation 4", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 87, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/9/8e47f5aaf2711a3c47105cc183f16197-98.jpg", "descriptions": "Dive into the next chapter of the Final Fantasy XIV Online with its next expansion pack - Stormblood. Explore vast, new lands, including Ala Mhigo, and challenge new Primal threats across Eorzea as you embark on hundreds of new quests as the Warrior of Light. \r\rFEATURES\r\r\n* Level capDive into the next chapter of the Final Fantasy XIV Online with its next expansion pack - Stormblood. Explore vast, new lands, including Ala Mhigo, and challenge new Primal threats across Eorzea as you embark on hundreds of new quests as the Warrior of Light. \r\rFEATURES\r * Level cap increased from 60 -> 70\r* New jobs, including red mage\r* New exploration with swimming and diving\r* New areas to explore\r* A new primal  Lakshmi\r* New dungeons\r* New High-level Raid The Bend of Time  Omega\r* New alliance raid Return to Ivalice\r* The Forbidden Land of Eureka\r* New gear and crafting recipes\r* A fourth residential district\r* Expanded item inventory and changes to the battle system… Expand"}, {"name": "Bloodborne: The Old Hunters", "details_link": "https://www.metacritic.com/game/playstation-4/bloodborne-the-old-hunters", "publisher": "SCEA", "release_date": "Nov 24 2015", "developers": ["From Software"], "platforms": "PlayStation 4", "genres": ["Role-Playing", "Action RPG"], "meta_score": 87, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/7/6937f77cb624399df1b7a97cbb407ece-98.jpg", "descriptions": "Set in a nightmare world where hunters from the past are trapped forever, explore brand new stages full of dangers, rewards, and deadly beasts to overcome. You’ll find multiple new outfits and weapons to add to your arsenal as well as additional magic to wield and add more variety to yourSet in a nightmare world where hunters from the past are trapped forever, explore brand new stages full of dangers, rewards, and deadly beasts to overcome. You’ll find multiple new outfits and weapons to add to your arsenal as well as additional magic to wield and add more variety to your combat strategy. [SCEJ]… Expand"}, {"name": "Hitman 3", "details_link": "https://www.metacritic.com/game/pc/hitman-3", "publisher": "Io Interactive", "release_date": "Jan 20 2021", "developers": ["Io Interactive"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 87, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/2aaefb253faa91ff86fc5ae0bb0b47ee-98.jpg", "descriptions": "Death Awaits \r\rHITMAN 3 is the dramatic conclusion to the World of Assassination trilogy and takes players around the world on a globetrotting adventure to sprawling sandbox locations. Agent 47 returns as a ruthless professional for the most important contracts of his entire career.Death Awaits \r\rHITMAN 3 is the dramatic conclusion to the World of Assassination trilogy and takes players around the world on a globetrotting adventure to sprawling sandbox locations. Agent 47 returns as a ruthless professional for the most important contracts of his entire career.\r Supported by his Agency handler, Diana Burnwood, 47 joins forces with his long-lost friend Lucas Grey. Their ultimate mission is to eliminate the partners of Providence, but they are forced to adapt as their hunt intensifies. When the dust settles, 47 and the world he inhabits will never be the same again. \r\rTop of the World\rEvery mission location in HITMAN 3 is meticulously detailed and packed full of creative opportunities. Players will have unrivalled freedom to complete their objectives and the game world will react to everything they do. \r\rA Platform of Assassination\rThe World of Assassination trilogy is fully realised with HITMAN 3 as the ultimate place to play all three games. Players of previous HITMAN games will be pleased to know that it will be possible to 'import' locations that they own from the previous two HITMAN games into HITMAN 3, essentially putting all 20+ locations from the entire trilogy in one place.\r Playing the entire trilogy from beginning to end, from within HITMAN 3, also means that the progression systems in HITMAN 3 work across all locations. You can unlock an item in Dubai and take it with you to Paris, for example. HITMAN 2 players will have the option to carry over their hard-earned unlocks and progression into HITMAN 3.… Expand"}, {"name": "XCOM 2", "details_link": "https://www.metacritic.com/game/playstation-4/xcom-2", "publisher": "2K Games", "release_date": "Sep 27 2016", "developers": ["Firaxis Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 87, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/e47c254b6e8be1269a80857ae8ff41ac-98.jpg", "descriptions": "Earth has changed. Twenty years have passed since world leaders offered an unconditional surrender to alien forces. XCOM, the planet’s last line of defense, was left decimated and scattered. Now, in XCOM 2, the aliens rule Earth, building shining cities that promise a brilliant future forEarth has changed. Twenty years have passed since world leaders offered an unconditional surrender to alien forces. XCOM, the planet’s last line of defense, was left decimated and scattered. Now, in XCOM 2, the aliens rule Earth, building shining cities that promise a brilliant future for humanity on the surface, while concealing a sinister agenda and eliminating all who dissent from their new order. Only those who live at the edges of the world have a margin of freedom. Here, a force gathers once again to stand up for humanity. Always on the run, and facing impossible odds, the remnant XCOM forces must find a way to ignite a global resistance, and eliminate the alien threat once and for all.… Expand"}, {"name": "Super Street Fighter II Turbo HD Remix", "details_link": "https://www.metacritic.com/game/playstation-3/super-street-fighter-ii-turbo-hd-remix", "publisher": "SCEA", "release_date": "Nov 25 2008", "developers": ["Backbone Entertainment", "Backbone Emeryville"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "8  Online", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 87, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/722a76be6d61edddfd83f2bbee66fbed-98.jpg", "descriptions": "[Downloadable Game]  One of the most popular games of the early '90s is reborn! Super Street Fighter II Turbo HD Remix, originally developed by Capcom for the arcade, makes its downloadable debut on the Xbox LIVE Arcade and PLAYSTATION Network. Capcom stays true to the foundation of the[Downloadable Game]  One of the most popular games of the early '90s is reborn! Super Street Fighter II Turbo HD Remix, originally developed by Capcom for the arcade, makes its downloadable debut on the Xbox LIVE Arcade and PLAYSTATION Network. Capcom stays true to the foundation of the popular game by utilizing the original game code, while creating a fresh upgraded experience with new artwork and high resolution 1080p graphics. All of the art has been completely redrawn and created by UDON Comics, which currently publishes the official Street Fighter comic and is responsible for the new contemporary look of the Street Fighter franchise. Features all eighteen of the original Super Street Fighter II Turbo characters including Ryu, Guile, M. Bison and Akuma. One to two player head-to-head play either offline or online. Single player vs. CPU. Player vs. player over the same console. Player vs. player online. Training mode helps fighters hone their skills. Numerous online features: In-game voice chatting between players; Matchmaking flexibility through multiple options; Personal and friends statistics tracking; Worldwide rankings and leaderboards. [Capcom]… Expand"}, {"name": "Injustice 2", "details_link": "https://www.metacritic.com/game/playstation-4/injustice-2", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "May 16 2017", "developers": ["NetherRealm Studios"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/db6a7c7456f92e684bf8885b6defe7d0-98.jpg", "descriptions": "Every battle defines you. Power up and build the ultimate version of your favorite DC legends in INJUSTICE 2. With a massive selection of DC Super Heroes and Super-Villains, INJUSTICE 2 allows you to equip every iconic character with unique and powerful gear earned throughout the game.Every battle defines you. Power up and build the ultimate version of your favorite DC legends in INJUSTICE 2. With a massive selection of DC Super Heroes and Super-Villains, INJUSTICE 2 allows you to equip every iconic character with unique and powerful gear earned throughout the game. Experience an unprecedented level of control over how your favorite characters look, how they fight, and how they develop across a huge variety of game modes. This is your super Hero. Your Journey. Your Injustice.… Expand"}, {"name": "Ghost of Tsushima: Director's Cut", "details_link": "https://www.metacritic.com/game/playstation-5/ghost-of-tsushima-directors-cut", "publisher": "SCEE", "release_date": "Aug 20 2021", "developers": ["Sucker Punch"], "platforms": ["PlayStation 4", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 87, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/db0384bd9e420751b7e0a06861a114c0-98.jpg", "descriptions": "Ghost of Tsushima Director's Cut includes: Ghost of Tsushima full game; Iki Island expansion: New story, mini-games, enemy types and more*; Legends online co-op mode; Downloadable content: Digital mini art book, Director's commentary, One Technique Point, Charm of Hachiman's Favor, Hero ofGhost of Tsushima Director's Cut includes: Ghost of Tsushima full game; Iki Island expansion: New story, mini-games, enemy types and more*; Legends online co-op mode; Downloadable content: Digital mini art book, Director's commentary, One Technique Point, Charm of Hachiman's Favor, Hero of Tsushima Skin Set. PS5 Features: Dynamic 4K resolution targeting 60fps (requires compatible 4K TV or display). DualSense™ wireless controller haptic feedback and adaptive trigger resistance. 3D Audio (with analog or USB stereo headphones). Lip sync for Japanese voiceover. Ability to transfer PS4 saved progress to PS5 game.\r… Expand"}, {"name": "SOCOM II: U.S. Navy SEALs", "details_link": "https://www.metacritic.com/game/playstation-2/socom-ii-us-navy-seals", "publisher": "SCEA", "release_date": "Nov  4 2003", "developers": ["Zipper Interactive"], "platforms": "PlayStation 2", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Modern"], "meta_score": 87, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/da6ef757a0c109be0ca1f817c6a89945-98.jpg", "descriptions": "In online mode via broadband gameplay, up to 16 players (eight per team) can create their own SEAL character profiles and join the fight to take down hostile forces in 22 different online missions (12 new SOCOM II online missions and ten updated, enhanced SOCOM online missions) with fiveIn online mode via broadband gameplay, up to 16 players (eight per team) can create their own SEAL character profiles and join the fight to take down hostile forces in 22 different online missions (12 new SOCOM II online missions and ten updated, enhanced SOCOM online missions) with five different mission types including new Escort and Breach missions. Using a SOCOM-compatible headset, enhanced online communication enables team members to more easily communicate either in-game or in the game lobby while viewing the new ?who?s talking? display and use sub-channels for offensive and defensive gameplay strategy. Players can also use a friends? list to easily find their friends online and vie for the top position on the player and clan rankings board.… Expand"}, {"name": "The Witness", "details_link": "https://www.metacritic.com/game/playstation-4/the-witness", "publisher": "Thekla, Inc", "release_date": "Jan 26 2016", "developers": ["Thekla", "Inc"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "genres": ["Miscellaneous", "General", "General", "Puzzle", "Puzzle", "Adventure", "3D", "First-Person"], "meta_score": 87, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/f218526e8cf0179eda1d9ee7dc38ec10-98.jpg", "descriptions": "You awaken, alone, on a strange island full of puzzles that challenge and surprise you. You can't remember who you are, and you don't remember how you came to be here, but there's one thing you can do: explore the island in hope of discovering clues, regaining your memory, and somehowYou awaken, alone, on a strange island full of puzzles that challenge and surprise you. You can't remember who you are, and you don't remember how you came to be here, but there's one thing you can do: explore the island in hope of discovering clues, regaining your memory, and somehow finding your way home. The Witness is a single-player game in an open world with dozens of locations to explore and over 500 puzzles to solve. This game respects you as an intelligent player and it treats your time as precious. There's no filler; each of those puzzles brings its own new idea into the mix.… Expand"}, {"name": "DOOM", "details_link": "https://www.metacritic.com/game/xbox-one/doom", "publisher": "Bethesda Softworks", "release_date": "May 13 2016", "developers": ["id Software"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Sci-Fi", "Action", "Shooter", "First-Person", "Third-Person", "Arcade"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/6f10b9a6a37276f25667077fefc251b0-98.jpg", "descriptions": "There is no taking cover or stopping to regenerate health in campaign mode as you beat back Hell’s raging demon hordes. Combine your arsenal of futuristic and iconic guns, upgrades, movement and an advanced melee system to knock-down, slash, stomp, crush, and blow apart demons in creativeThere is no taking cover or stopping to regenerate health in campaign mode as you beat back Hell’s raging demon hordes. Combine your arsenal of futuristic and iconic guns, upgrades, movement and an advanced melee system to knock-down, slash, stomp, crush, and blow apart demons in creative and violent ways. In multiplayer, dominate your opponents in DOOM’s signature, fast-paced arena-style combat. In both classic and all-new game modes, annihilate your enemies utilizing your personal blend of skill, powerful weapons, vertical movement, and unique power-ups that allow you to play as a demon. DOOM SnapMap is an easy-to-use game and level editor that allows for limitless gameplay experiences on every platform. Anyone can snap together and customize maps, add pre-defined or custom gameplay, and edit game logic to create new modes. Instantly play your creation or make it available to players around the world. [ID/Bethesda]… Expand"}, {"name": "BlazBlue: Calamity Trigger", "details_link": "https://www.metacritic.com/game/playstation-3/blazblue-calamity-trigger", "publisher": "Aksys Games", "release_date": "Jun 30 2009", "developers": ["Arc System Works"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/a9c6948a20bf6b63d526f66868235a4f-98.jpg", "descriptions": "In the 13th hierarchical city, Kagutsuchi, the Librarium regulates the amazing power of Armagus, a fusion of magic and technology. Currently they are after a wanted criminal named Ragna The Bloodedge, also known as Death, who wants to destroy the Librarium. Due to Ragna possessing a powerfulIn the 13th hierarchical city, Kagutsuchi, the Librarium regulates the amazing power of Armagus, a fusion of magic and technology. Currently they are after a wanted criminal named Ragna The Bloodedge, also known as Death, who wants to destroy the Librarium. Due to Ragna possessing a powerful form of Armagus known as the Azure Grimoire, people far and wide are after not only his bounty, but his grimoire as well. This is where our story begins.\rBlazBlue Key Features: The first hi-res 2D fighter from the creators of the Guilty Gear series! Experience the beauty of high-resoluti on, hand-drawn sprites on 3D backgrounds, all in glorious high-definition. Online Battle Action. Get ready to take the action online and battle the best players from all over the world! Console Exclusive Modes. BlazBlue features the following console-only modes: Arcade, Vs, Practice, and a completely fleshed-out Story Mode that tells the tales of each character. Over 10 unique combatants to choose from! Choose a character that represents your own fighting style, like the lightning-fast Taokaka or the wickedly powerful Tager. Drive your way to victory! Use the unique \"Drive Attacks\" specific to each character to decimate your opponent. Depending on the character, control the elements like wind and ice, or even absorb the life force from your opponents. A plethora of offensive and defensive options at your disposal! Take advantage of Barriers, Counter Assaults, Rapid Cancels, and Distortion Drives to turn the tide of battle! [Akys Games]… Expand"}, {"name": "Rallisport Challenge 2", "details_link": "https://www.metacritic.com/game/xbox/rallisport-challenge-2", "publisher": "Microsoft Game Studios", "release_date": "May  4 2004", "developers": ["Digital Illusions"], "platforms": "Xbox", "num_players": "1-16 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 87, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/28e34a8f32feebad29952bddc60bf720-98.jpg", "descriptions": "After spending more than a year in the garage, RalliSport Challenge 2 emerges with more cars and tracks, new race modes, and online multiplay through Xbox Live. You can choose from more than 40 rally cars and race on different tracks from Australia, the frozen Nordic, and the PacificAfter spending more than a year in the garage, RalliSport Challenge 2 emerges with more cars and tracks, new race modes, and online multiplay through Xbox Live. You can choose from more than 40 rally cars and race on different tracks from Australia, the frozen Nordic, and the Pacific Northwest. As you test your skills in five different rally sports, you'll experience variable weather conditions, broken windows and missing hoods, and realistic physics.… Expand"}, {"name": "Immortality", "details_link": "https://www.metacritic.com/game/pc/immortality", "publisher": "Half Mermaid", "release_date": "Aug 30 2022", "developers": ["Sam Barlow"], "platforms": ["iPhone/iPad", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 87, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/2e8beb99f1eacbe57df85f9ccacbd3e8-98.jpg", "descriptions": "Marissa Marcel was a film star. She made three movies. But none of the movies was ever released. And Marissa Marcel disappeared. An interactive trilogy from Sam Barlow, creator of Her Story."}, {"name": "Inscryption", "details_link": "https://www.metacritic.com/game/switch/inscryption", "publisher": "Devolver Digital", "release_date": "Dec  1 2022", "developers": ["Daniel Mullins Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/1fc94b9f893aafd649af54e98cc2d38d-98.jpg", "descriptions": "From the creator of Pony Island and The Hex comes the latest mind melting, self-destructing love letter to video games. Inscryption is an inky black card-based odyssey that blends the deckbuilding roguelike, escape-room style puzzles, and psychological horror into a blood-laced smoothie.From the creator of Pony Island and The Hex comes the latest mind melting, self-destructing love letter to video games. Inscryption is an inky black card-based odyssey that blends the deckbuilding roguelike, escape-room style puzzles, and psychological horror into a blood-laced smoothie. Darker still are the secrets inscrybed upon the cards...In Inscryption you will...Acquire a deck of woodland creature cards by draft, surgery, and self mutilation.Unlock the secrets lurking behind the walls of Leshy's cabin.Embark on an unexpected and deeply disturbing odyssey.… Expand"}, {"name": "Quake Remastered", "details_link": "https://www.metacritic.com/game/switch/quake-remastered", "publisher": "Bethesda Softworks", "release_date": "Aug 19 2021", "developers": ["id Software", "MachineGames"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/badab692abe03ff769817088528c2150-98.jpg", "descriptions": "The remastered version of Quake is here."}, {"name": "Dead Cells", "details_link": "https://www.metacritic.com/game/playstation-4/dead-cells", "publisher": "Motion Twin", "release_date": "Aug  7 2018", "developers": ["Motion Twin"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/2f089f7c9f32e527125846736fa9783d-98.jpg", "descriptions": "Dead Cells puts you in control of a failed alchemic experiment trying to figure out what's happening on a sprawling, ever-changing and seemingly cursed Island. Tough but fair combat, responsive controls, challenging foes, permadeath and of course, the emergency panic roll to get you out ofDead Cells puts you in control of a failed alchemic experiment trying to figure out what's happening on a sprawling, ever-changing and seemingly cursed Island. Tough but fair combat, responsive controls, challenging foes, permadeath and of course, the emergency panic roll to get you out of trouble, make for a demanding, visceral and cathartic action game.Experience a roguevania, mixing an interconnected world, branching paths and unlockable skills with the constant adrenaline-pumping threat of permadeath. No checkpoints. You either vanquish the final boss in one go, or you try again. However, you keep some of your progress for successive runs; new paths you've unlocked, access to new levels, mutations, abilities and weapons.Speaking of weapons, Dead Cells features a plethora of ways to slay your enemies. A large variety of swords, bows and of course spells, but also whips, grenades and turrets, each one with its own unique twist. Plus, mutations and scrolls allow you to build and customize your character differently with each and every run.At the end of the day though, it's your skills as a player that matter most! Roguelites are about constantly sharpening your skills, until what was an insurmountable obstacle becomes a walk in the park. Patience, you'll get better! ... eventually.FEATURES:* Roguevania: The progressive exploration of an interconnected world, with the replayability of a rogue-lite and the adrenaline pumping threat of permadeath.* 2D Souls-lite Action: Tough but fair combat, the iconic dodge roll, more than 90 weapons and spells with unique gameplay... The unforgiving action wed to the absence of any kind of safety net makes for an adrenalin pumping ride each and every run.* Nonlinear Progression: Sewers, Ossuary or Ramparts? Once unlocked, special permanent abilities allow you to access new paths to reach your objective. Opt for the path that suits your current build, your play style, or just your mood.* Exploration: Secret rooms, hidden passages, charming landscapes. Take a moment to stroll the towers and breath in that fresh sea mist infused air.… Expand"}, {"name": "Battlefield 1", "details_link": "https://www.metacritic.com/game/xbox-one/battlefield-1", "publisher": "Electronic Arts", "release_date": "Oct 18 2016", "developers": ["EA DICE"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 64 ", "genres": ["Action", "General", "Shooter", "First-Person", "Tactical"], "meta_score": 87, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/a266966a3f5f45a8da3ce0bfb6b06c22-98.jpg", "descriptions": "Intuitive destruction and dynamic weather ensure that no battle is ever the same. For even more gameplay possibilities, carve a path through walls and buildings, take down your enemies in creative ways, and leave your mark on the terrain around you through intuitive destruction. Through yourIntuitive destruction and dynamic weather ensure that no battle is ever the same. For even more gameplay possibilities, carve a path through walls and buildings, take down your enemies in creative ways, and leave your mark on the terrain around you through intuitive destruction. Through your actions, the pristine world around you change into a battle-scarred landscape, changing the world forever. With dynamic weather you will need to adapt your tactics to weather changes as the elements play a part in the battle. Playing the same map on a bright day, in heavy fog, or rain will impact what you see and hear, forcing you to adapt your play style on an ever-changing battlefield. Operations introduces a new way to play multiplayer. In Battlefield 1 you play a series of interconnected battles across multiple fronts. Play a sequence of battles where your actions have consequences beyond a single match, as you try to conquer territory or push back your attackers. At those times when you feel all is lost, call in the Behemoths - the largest fully player-controlled vehicles ever seen in Battlefield. Roam the battlefield and rain fire on your enemy to break their defenses. All-out war never felt so epic. Take control of the Armored Train, Air Ship, or the Battleship to dominate the battlefield across land, air, and sea. [Electronic Arts]… Expand"}, {"name": "The Nioh Collection", "details_link": "https://www.metacritic.com/game/playstation-5/the-nioh-collection", "publisher": "SCEE", "release_date": "Feb  5 2021", "developers": ["Team Ninja"], "platforms": ["PlayStation 4", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 87, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/0eb530ee536c99241f85419ea8eda217-98.jpg", "descriptions": "Celebrate the franchise's 4-year anniversary with remastered editions of both games featuring 4K and up to 120FPS support. \r\rFor everyone that recently purchased the PlayStation 5 console, you will be able to experience the complete Nioh 2 adventure in Nioh 2 Remastered The CompleteCelebrate the franchise's 4-year anniversary with remastered editions of both games featuring 4K and up to 120FPS support. \r\rFor everyone that recently purchased the PlayStation 5 console, you will be able to experience the complete Nioh 2 adventure in Nioh 2 Remastered The Complete Edition, along with a remastered version of the first entry in the series: Nioh Remastered The Complete Edition. If you would like all of this content in one convenient place, we have the perfect title for all of your Nioh needs. Get ready to relive the entire series with all DLC included for both titles in The Nioh Collection for PlayStation 5. \r\rAll of the titles available on PlayStation 5 will support 4K resolution for crystal clear visuals, up to 120 FPS gameplay for silky smooth combat, ultra-fast load times and the ability to transfer your data from the PS4 versions to pick up your journey right where you left off.… Expand"}, {"name": "Sid Meier's Civilization VI", "details_link": "https://www.metacritic.com/game/playstation-4/sid-meiers-civilization-vi", "publisher": "2K Games", "release_date": "Nov 22 2019", "developers": ["Aspyr"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 87, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/77690f29c2bebd383547c672f32c5560-98.jpg", "descriptions": "Civilization VI offers new ways to interact with your world, expand your empire across the map, advance your culture, and compete against historys greatest leaders to build a civilization that will stand the test of time."}, {"name": "Midnight Club 3: DUB Edition Remix", "details_link": "https://www.metacritic.com/game/xbox/midnight-club-3-dub-edition-remix", "publisher": "Rockstar Games", "release_date": "Mar 13 2006", "developers": ["Rockstar San Diego"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "8  Online", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 87, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/59758ded86b94243af5bc044516eb453-98.jpg", "descriptions": "The Midnight Club is back and bigger than ever. Take on street racing's toughest competitors as you tear through the living city sprawls of Detroit, San Diego, Atlanta and now Tokyo at breakneck speeds. Personalize the huge assortments of all new additional rides with the latest rims, kitsThe Midnight Club is back and bigger than ever. Take on street racing's toughest competitors as you tear through the living city sprawls of Detroit, San Diego, Atlanta and now Tokyo at breakneck speeds. Personalize the huge assortments of all new additional rides with the latest rims, kits and upgrades hot off the street. Midnight Club 3: DUB Edition Remix is the definitive urban racing experience, giving you the ultimate freedom to choose your own route to the finish line.… Expand"}, {"name": "Final Fantasy VII Remake", "details_link": "https://www.metacritic.com/game/playstation-4/final-fantasy-vii-remake", "publisher": "Square Enix", "release_date": "Apr 10 2020", "developers": ["Square Enix"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Japanese-Style", "Role-Playing", "Action RPG"], "meta_score": 87, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/40531eb3a9013197e4bf63dbfb866719-98.jpg", "descriptions": "Long ago, we looked upon a foreboding sky. The memory of the star that threatened all burns eternal in our hearts. In its wake came an age of silence. Yet with each fond remembrance, we knew those encountered were not forgotten, that some day we would see them again. Perhaps it was no moreLong ago, we looked upon a foreboding sky. The memory of the star that threatened all burns eternal in our hearts. In its wake came an age of silence. Yet with each fond remembrance, we knew those encountered were not forgotten, that some day we would see them again. Perhaps it was no more than wishful thinking. But after the long calm, there are the beginnings of a stir. The reunion at hand may bring joy, it may bring fear, but let us embrace whatever it brings. For they are coming back. At last the promise has been made.… Expand"}, {"name": "Dark Souls III", "details_link": "https://www.metacritic.com/game/xbox-one/dark-souls-iii", "publisher": "Bandai Namco Games", "release_date": "Apr 12 2016", "developers": ["From Software"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 87, "users_score": 9.1, "image": "https://static.metacritic.com/images/products/games/3/1c85bae45b1d549c2c22ae0780106bc5-98.jpg", "descriptions": "Developed by Japanese developer FromSoftware, DARK SOULS III is the latest chapter in the DARK SOULS series with its trademark sword and sorcery combat and rewarding action RPG gameplay. Players travel across a wide variety of locations in an interconnected world of unrelenting challenge andDeveloped by Japanese developer FromSoftware, DARK SOULS III is the latest chapter in the DARK SOULS series with its trademark sword and sorcery combat and rewarding action RPG gameplay. Players travel across a wide variety of locations in an interconnected world of unrelenting challenge and deep RPG gameplay as they search for a way to survive the coming apocalypse.… Expand"}, {"name": "Monkey Island 2 Special Edition: LeChuck's Revenge", "details_link": "https://www.metacritic.com/game/playstation-3/monkey-island-2-special-edition-lechucks-revenge", "publisher": "LucasArts", "release_date": "Jul  6 2010", "developers": ["LucasArts"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 87, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/a55ec752c055ffa24eb9b72dad50b5ea-98.jpg", "descriptions": "Monkey Island 2 Special Edition: LeChuck's Revenge will allow for direct control of Guybrush, allowing players to forego the old point-and-click system of navigation if they choose, and will include an interactive object hint system that can be used to highlight objects of interest in theMonkey Island 2 Special Edition: LeChuck's Revenge will allow for direct control of Guybrush, allowing players to forego the old point-and-click system of navigation if they choose, and will include an interactive object hint system that can be used to highlight objects of interest in the environment. Pirate historians will \"arr\" with delight with in-game audio commentary from the game’s creators as they share their thoughts and memories about the making of the game. Players will also be able to get a glimpse of yesteryear with an in-game art viewer offering up classic glimpses of select areas of the game. … Expand"}, {"name": "Red Dead Redemption: Undead Nightmare Pack", "details_link": "https://www.metacritic.com/game/playstation-3/red-dead-redemption-undead-nightmare-pack", "publisher": "Rockstar Games", "release_date": "Oct 26 2010", "developers": ["Rockstar San Diego"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Historic", "General", "Historic", "Open-World"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/1d78b6e33800ccfcec69ad19dd72c457-98.jpg", "descriptions": "Red Dead Redemption: Undead Nightmare Pack brings more adventures and challenges to the Red Dead universe."}, {"name": "Pokemon White Version", "details_link": "https://www.metacritic.com/game/ds/pokemon-white-version", "publisher": "Nintendo", "release_date": "Mar  6 2011", "developers": ["Game Freak"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Trainer"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/a4aca6749024192e5c2e7e59a91c667d-98.jpg", "descriptions": "Pokémon Black Version and Pokémon White Version feature new Pokémon that players can catch, train and battle as they progress through the game, and some Pokémon can only be caught in one version of the game. For example, the Legendary Pokémon Reshiram canPokémon Black Version and Pokémon White Version feature new Pokémon that players can catch, train and battle as they progress through the game, and some Pokémon can only be caught in one version of the game. For example, the Legendary Pokémon Reshiram can only be caught in Pokémon Black Version, while the Legendary Pokémon Zekrom can only be caught in Pokémon White Version. Additionally, the two games feature different areas for the first time in the series, with the game world of Pokémon Black Version featuring a unique metropolitan area called Black City, and a lush, green area named White Forest only found in Pokémon White Version. Pokémon Black Version and Pokémon White Version also mark the first time in a Pokémon video game that the seasons will change in the game world. Certain Pokémon appear more frequently during different seasons, and players can only access some areas during a specific season.… Expand"}, {"name": "Dragon Quest IX: Sentinels of the Starry Skies", "details_link": "https://www.metacritic.com/game/ds/dragon-quest-ix-sentinels-of-the-starry-skies", "publisher": "Nintendo", "release_date": "Jul 11 2010", "developers": ["Level 5"], "platforms": "DS", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 87, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/5f35a972e8e261180e50c2b44b4969ab-98.jpg", "descriptions": "Developed by Level 5 (the developers of \"Dragon Quest VIII,\" \"Dark Cloud\" and \"Rogue Galaxy\") Dragon Quest IX unites the key components that made the previous Dragon Quest titles such as success. Horii and Sugiyama are on board to provide their talents as DQIX takes the series in a decidedlyDeveloped by Level 5 (the developers of \"Dragon Quest VIII,\" \"Dark Cloud\" and \"Rogue Galaxy\") Dragon Quest IX unites the key components that made the previous Dragon Quest titles such as success. Horii and Sugiyama are on board to provide their talents as DQIX takes the series in a decidedly different direction. For the first time, the DQ franchise has an action-oriented title where battles take place on the field (much like \"Crystal Chronicles\"). To cap off the presentation, SQEX announced that the game supports four-player multiplayer. [Famitsu/Square Enix]… Expand"}, {"name": "Pokemon X", "details_link": "https://www.metacritic.com/game/3ds/pokemon-x", "publisher": "Nintendo", "release_date": "Oct 12 2013", "developers": ["Game Freak"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Trainer"], "meta_score": 87, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/83159bc1d95bbcbcfcdb0487e738d0cd-98.jpg", "descriptions": "Pokemon X and Y are the first mainline Pokemon games made for the 3DS and feature a mix of Pokemon old and new as well as a trio of new starting Pokemon - a watery toad Froakie, a fiery deer Fennekin, and a grass monster Chespin."}, {"name": "RimWorld", "details_link": "https://www.metacritic.com/game/pc/rimworld", "publisher": "Ludeon Studios", "release_date": "Oct 17 2018", "developers": ["Ludeon Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Strategy", "Real-Time", "General"], "meta_score": 87, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/1/0329e8b1707011bd4d222128db29fe3f-98.jpg", "descriptions": "A sci-fi colony sim driven by an intelligent AI storyteller. Inspired by Dwarf Fortress and Firefly. Generates stories by simulating psychology, ecology, gunplay, melee combat, climate, biomes, diplomacy, interpersonal relationships, art, medicine, trade, and more."}, {"name": "Tom Clancy's Splinter Cell: Pandora Tomorrow", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-splinter-cell-pandora-tomorrow", "publisher": "Ubisoft", "release_date": "Mar 23 2004", "developers": ["Ubisoft Shanghai"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1-4 ", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/5f8530a5c55700a20fd0ed1e31e1adad-98.jpg", "descriptions": "Once again assume the role Sam Fisher as you defend and assist the U.S. troops who become emroiled in a conflict between East Timor and Indonesian guerillas. Immerse yourself into a deep, tangible, tension-packed techno-thriller without compare. Master your new arsenal of moves and gadgetsOnce again assume the role Sam Fisher as you defend and assist the U.S. troops who become emroiled in a conflict between East Timor and Indonesian guerillas. Immerse yourself into a deep, tangible, tension-packed techno-thriller without compare. Master your new arsenal of moves and gadgets to save the innocent from a global threat. Conceal yourself in real-time moving shadows for the first time.… Expand"}, {"name": "Baldur's Gate: Dark Alliance", "details_link": "https://www.metacritic.com/game/playstation-2/baldurs-gate-dark-alliance", "publisher": "VU Games", "release_date": "Dec  2 2001", "developers": ["Snowblind Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/cab4f0254910a7e06025e860f868e308-98.jpg", "descriptions": "A darkness is gathering in the sprawling port town of Baldur's Gate. Members of the deteriorating city have been found dead, people fear leaving home, and rumors abound of a thieves' guild civil war brewing beneath the streets of the city. The player, down on his luck and carrying littleA darkness is gathering in the sprawling port town of Baldur's Gate. Members of the deteriorating city have been found dead, people fear leaving home, and rumors abound of a thieves' guild civil war brewing beneath the streets of the city. The player, down on his luck and carrying little other than a sword strapped to his back, comes fresh to the town and becomes all that stands in the way of the greatest threat ever to strike Baldur's Gate and the Sword Coast.  [Interplay]… Expand"}, {"name": "Europa Universalis II", "details_link": "https://www.metacritic.com/game/pc/europa-universalis-ii", "publisher": "Strategy First", "release_date": "Nov 12 2001", "developers": ["Paradox Development Studio"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 87, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/e938af400efaec898ce92f94c906607c-98.jpg", "descriptions": "From the medieval battles of Jeanne D'Arc to the fantastic empires of the Incas to the flaming wars of Napoleon, EU II invites you to take the seat as the ruler of a superpower for 400 epic years. The challenge begins in 1419 - the 100 years war between France and England - and ends with theFrom the medieval battles of Jeanne D'Arc to the fantastic empires of the Incas to the flaming wars of Napoleon, EU II invites you to take the seat as the ruler of a superpower for 400 epic years. The challenge begins in 1419 - the 100 years war between France and England - and ends with the rise and eventual fall of one of Europe's greatest strategists, Napoleon. Take on the role of the Colonizing Might of Spain, the feudal warlords of Samurai Japan as well as the small trading nation of Genoa. [Strategy First]… Expand"}, {"name": "Tony Hawk's Pro Skater 3", "details_link": "https://www.metacritic.com/game/playstation/tony-hawks-pro-skater-3", "publisher": "Activision", "release_date": "Oct 29 2001", "developers": ["Shaba Games"], "platforms": ["PC", "PlayStation 2", "PlayStation"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/fd66bd4e1e026af69f79a6b87d798f3d-98.jpg", "descriptions": "You may not be able to live like the legend, but now you can skate like him.  Skate as the legendary Tony Hawk or choose from a dream team of 12 top pro skaters, including old favorites like Lasek, Thomas, Muska, and Steamer, as well as new talent like Gilfberg, Caballero, Koston, andYou may not be able to live like the legend, but now you can skate like him.  Skate as the legendary Tony Hawk or choose from a dream team of 12 top pro skaters, including old favorites like Lasek, Thomas, Muska, and Steamer, as well as new talent like Gilfberg, Caballero, Koston, and Mullen.  Or enjoy full customization abilities with the enhanced Create-a-Skater (now including female skaters) and the Skatepark Editor.  Travel from L.A. to Tokyo, Suburbia to Skater's Island performing challenges and meeting goals.  New moves include the Revert, which allows you to link vert tricks, and flatland tricks such as Caspers, the Primo, and Handstand Manual.  If you're good, you can even unlock hidden pro footage.… Expand"}, {"name": "Metropolis Street Racer", "details_link": "https://www.metacritic.com/game/dreamcast/metropolis-street-racer", "publisher": "Sega", "release_date": "Jan 15 2001", "developers": ["Bizarre Creations"], "platforms": "Dreamcast", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 87, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/1/c4bc26db3e7c26c722222bd0174a312a-98.jpg", "descriptions": "Enter a new age of driving, a new form of thinking and feeling, and totally immerse yourself in the most advanced driving game ever created. Your 'Kudos' is the only path to success, since this is a unique test of skill, style and precision, which spans the streets of London, Tokyo and SanEnter a new age of driving, a new form of thinking and feeling, and totally immerse yourself in the most advanced driving game ever created. Your 'Kudos' is the only path to success, since this is a unique test of skill, style and precision, which spans the streets of London, Tokyo and San Francisco. Be astounded by the realism, push your limits round 250+ different circuits, in hundreds of challenging events. Indulge up to 8 people in a unique multiplayer experience, and prepare yourself for the ultimate Internet Kudos Challenge… Expand"}, {"name": "Power Stone 2", "details_link": "https://www.metacritic.com/game/dreamcast/power-stone-2", "publisher": "Capcom", "release_date": "Aug 23 2000", "developers": ["Capcom"], "platforms": "Dreamcast", "genres": ["Action", "Fighting", "3D"], "meta_score": 87, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/275f8ba22ada950e9d8d1cd1242b7226-98.jpg", "descriptions": "The world's most revolutionary fighting game does it again! Power Stone 2 takes go-anywhere, grab-anything combat, and introduces awesome new innovations to the hit arcade fighting series. Now, up to four players wage insane battles in fully interactive, multi-level stages. Master over 120The world's most revolutionary fighting game does it again! Power Stone 2 takes go-anywhere, grab-anything combat, and introduces awesome new innovations to the hit arcade fighting series. Now, up to four players wage insane battles in fully interactive, multi-level stages. Master over 120 different items used in battle - weapons, vehicles traps, power-upsand more! As if chaotic swashbuckling battles weren't enough, combine forces with other players to battle monstrous bosses to win the game!… Expand"}, {"name": "Cuphead", "details_link": "https://www.metacritic.com/game/switch/cuphead", "publisher": "Studio MDHR", "release_date": "Apr 17 2019", "developers": ["Studio MDHR"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/ff10db91dc7f90f6a6accdf30417f17b-98.jpg", "descriptions": "Cuphead is a classic run and gun action game heavily focused on boss battles. Inspired by cartoons of the 1930s, the visuals and audio are painstakingly created with the same techniques of the era, i.e. traditional hand drawn cel animation, watercolor backgrounds, and original jazzCuphead is a classic run and gun action game heavily focused on boss battles. Inspired by cartoons of the 1930s, the visuals and audio are painstakingly created with the same techniques of the era, i.e. traditional hand drawn cel animation, watercolor backgrounds, and original jazz recordings.\rPlay as Cuphead or Mugman (in single player or local co-op) as you traverse strange worlds, acquire new weapons, learn powerful super moves, and discover hidden secrets while you try and pay your debt back to the devil!… Expand"}, {"name": "Burnout Paradise: The Ultimate Box", "details_link": "https://www.metacritic.com/game/pc/burnout-paradise-the-ultimate-box", "publisher": "Electronic Arts", "release_date": "Feb  5 2009", "developers": ["Criterion Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "8  Online", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 87, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/5421a33294285c590b5db14edc4870bf-98.jpg", "descriptions": "Burnout Paradise The Ultimate Box is a special edition release that includes the award-winning Burnout Paradise game, the previously-released Cagney and Bikes downloadable content updates, plus the brand new Burnout Paradise Party pack. The Party pack brings the social fun of BurnoutBurnout Paradise The Ultimate Box is a special edition release that includes the award-winning Burnout Paradise game, the previously-released Cagney and Bikes downloadable content updates, plus the brand new Burnout Paradise Party pack. The Party pack brings the social fun of Burnout Paradise into an offline multiplayer mode where players compete in different stunt, speed and skill events. The mode is designed to allow up to eight friends to “pass-the-pad” in dozens of quick-fire, turn-based challenges. The Party pack also includes a host of new features including a restart option added for racing and easier control of the early vehicles. Burnout Paradise proves that crashing is awesome! Next generation technology has enabled an unprecedented level of crash deformation allowing you to experience the most explosive pile-ups in the series’ history. Now the development team can realize their original vision for the Burnout franchise: an open world environment where you can do anything, anywhere, anytime. Feel the adrenaline course through your veins as you take to the road for the first time in Paradise City, where the action is all around you. Explore the city, discover events, and look for the best opportunities to crash, jump and pull signature takedowns. In Burnout Paradise you're given the keys to the city, but it's up to you to earn the keys to the meanest and most dangerous cars on the street, and earn your Burnout license. [Electronic Arts]… Expand"}, {"name": "FIFA Soccer 09", "details_link": "https://www.metacritic.com/game/xbox-360/fifa-soccer-09", "publisher": "EA Sports", "release_date": "Oct 13 2008", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "24  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/d8146f1b47f586644aef51e4cf59e631-98.jpg", "descriptions": "Powered by the third generation of the EA SPORTS football engine, FIFA 09 features more than 250 core gameplay additions and enhancements that deliver the most responsive, intelligent and realistic action ever for the series. Enjoy turning defenders with more controlled dribbling and ballPowered by the third generation of the EA SPORTS football engine, FIFA 09 features more than 250 core gameplay additions and enhancements that deliver the most responsive, intelligent and realistic action ever for the series. Enjoy turning defenders with more controlled dribbling and ball control, snapping off precision shots with improved first-time shooting mechanics and firing beautifully timed passes with greater accuracy, placing the ball exactly where you want it. With new player momentum physics the speed and weight of the player determines everything from the distance of a slide tackle and the power of a header to the severity of player collisions and the height of a player’s jump. Plus, players now behave according to their physical attributes with larger, stronger players dominating collisions, battles for control of the ball, and position in challenges for two player headers. FIFA 09 features new Custom Team Tactics that gives you all the tools to become a first-team coach. For the first time, go inside the game engine to customize the positioning and support play of your teammates and decide exactly how your team will play in any situation. Now you are the player, coach and manager! You have the power to adjust and customize tactical settings so CPU players and your team perform just like the real-world team plays or how you think it should play. Save your tactics and then make strategic decisions to exploit your opponent’s weaknesses, all on-the-fly. [Electronic Arts]… Expand"}, {"name": "Jeanne d'Arc", "details_link": "https://www.metacritic.com/game/psp/jeanne-darc", "publisher": "SCEA", "release_date": "Aug 21 2007", "developers": ["Level 5"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Historic", "Historic", "Tactics"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/f4189f9919e5a6bced37e1bb3d6520d7-98.jpg", "descriptions": "The Jeanne d'Arc story begins far in the past, when a great war was waged by mankind against demonic armies attempting to invade the human world. During that time, five brave heroes created armlets to restrain the demon gods. In a quest to turn back the rueful army, a young crusader namedThe Jeanne d'Arc story begins far in the past, when a great war was waged by mankind against demonic armies attempting to invade the human world. During that time, five brave heroes created armlets to restrain the demon gods. In a quest to turn back the rueful army, a young crusader named Jeanne is commanded by mysterious voices to use the power of the magical armlet to seal away the demon king and recover her homeland once and for all. Set among sprawling fields, battle-torn villages, and intricate dungeons, Jeanne d'Arc unfolds through more than 40 expansive and highly detailed environments, where players will engage in the pursuit of France's resurgence. Players control up to 14 characters throughout the journey, including humans and beasts, as they battle a variety of enemies in the quest to turn back the English domination. Jeanne d'Arc delivers a strategic, turn-based battle system where players engage in unique team attacks and defensive schemes, using multiple characters' skills in combination to create devastating strikes. Further adding to the depth of play, each character has access to one of eight weapon types that are also upgradeable as players' progress through the game. Additionally, players can customize their characters with more than 150 different skills and abilities throughout the game. [SCEA]… Expand"}, {"name": "Street Fighter V: Arcade Edition", "details_link": "https://www.metacritic.com/game/playstation-4/street-fighter-v-arcade-edition", "publisher": "Capcom", "release_date": "Jan 16 2018", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 87, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/c3ff9db6a6ad91873bee0c36175f9c5d-98.jpg", "descriptions": "Street Fighter V: Arcade Edition is a brand-new disc that includes all base content from the original Street Fighter V release, Arcade Mode and a code for Character Pass 1 and 2 content, which includes 12 playable characters and 12 premium costumes.* ARCADE MODE\nChoose from six differentStreet Fighter V: Arcade Edition is a brand-new disc that includes all base content from the original Street Fighter V release, Arcade Mode and a code for Character Pass 1 and 2 content, which includes 12 playable characters and 12 premium costumes.* ARCADE MODEChoose from six different paths themed after classic Street Fighter games.* GALLERYUnlock hundreds of illustrations as you play through Arcade Mode.* TEAM BATTLE Assemble local teams, set your own rules and see who comes out on top.* EXTRA BATTLEComplete online challenges to earn Fight Money, EXP, unique costumes and more.* NEW V-TRIGGERSEach character will have two V-Triggers, adding more depth to the combat system.* NEW VISUALSThe UI is redesigned with new color schemes and exciting pre-and-post fight effects.… Expand"}, {"name": "Battlefield: Bad Company 2", "details_link": "https://www.metacritic.com/game/pc/battlefield-bad-company-2", "publisher": "EA Games", "release_date": "Mar  2 2010", "developers": ["EA DICE"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/57ad2c928a527dc6f54617e7b2f72be1-98.jpg", "descriptions": "In this installment, the Bad Company crew again find themselves in the heart of the action, where they must use every weapon and vehicle at their disposal to survive. In Battlefield: Bad Company 2, the 'B' company fight their way through snowy mountaintops, dense jungles and dusty villages.In this installment, the Bad Company crew again find themselves in the heart of the action, where they must use every weapon and vehicle at their disposal to survive. In Battlefield: Bad Company 2, the 'B' company fight their way through snowy mountaintops, dense jungles and dusty villages. With a heavy arsenal of deadly weapons and a slew of vehicles to aid them, the crew set off on their mission and they are ready to blow up, shoot down, blast through, wipe out and utterly destroy anything that gets in their way. Total destruction is the name of the game, delivered as only the DICE next generation Frostbite engine can. [Electronic Arts]… Expand"}, {"name": "The Stanley Parable: Ultra Deluxe", "details_link": "https://www.metacritic.com/game/switch/the-stanley-parable-ultra-deluxe", "publisher": "Galactic Cafe", "release_date": "Apr 27 2022", "developers": ["Crows Crows Crows"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/9f66ee935e07149a8c887be2ca315fe8-98.jpg", "descriptions": "The Stanley Parable: Ultra Deluxe is an expanded re-imagining of 2013's The Stanley Parable. You will play as Stanley, and you will not play as Stanley. You will make a choice, and you will become powerless. You are not here to win. The Stanley Parable is a game that plays you."}, {"name": "Guacamelee!", "details_link": "https://www.metacritic.com/game/playstation-vita/guacamelee!", "publisher": "DrinkBox Studios", "release_date": "Apr  9 2013", "developers": ["DrinkBox Studios"], "platforms": ["PlayStation 3", "PlayStation Vita"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D", "", "Metroidvania"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/72e3b643b1e6aac21bc9fd30fac6a8b2-98.jpg", "descriptions": "The game features a down on his luck Mexican named Juan Aguacate, who sets out to save the world when El Presidente's Daughter is kidnapped by an Evil Charro Skeleton. The story takes place in and around a small village in Mexico, and has the player travelling through alternate dimensionsThe game features a down on his luck Mexican named Juan Aguacate, who sets out to save the world when El Presidente's Daughter is kidnapped by an Evil Charro Skeleton. The story takes place in and around a small village in Mexico, and has the player travelling through alternate dimensions including \"The World of the Dead\" and \"The World of Nightmares\" on his quest to rescue the girl he loves.… Expand"}, {"name": "FIFA Soccer 09", "details_link": "https://www.metacritic.com/game/playstation-3/fifa-soccer-09", "publisher": "EA Sports", "release_date": "Oct 13 2008", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 20 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 87, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/e133e40e7d549c0bb27e84122c91c8f2-98.jpg", "descriptions": "Powered by the third generation of the EA SPORTS football engine, FIFA 09 features more than 250 core gameplay additions and enhancements that deliver the most responsive, intelligent and realistic action ever for the series. Enjoy turning defenders with more controlled dribbling and ballPowered by the third generation of the EA SPORTS football engine, FIFA 09 features more than 250 core gameplay additions and enhancements that deliver the most responsive, intelligent and realistic action ever for the series. Enjoy turning defenders with more controlled dribbling and ball control, snapping off precision shots with improved first-time shooting mechanics and firing beautifully timed passes with greater accuracy, placing the ball exactly where you want it. With new player momentum physics the speed and weight of the player determines everything from the distance of a slide tackle and the power of a header to the severity of player collisions and the height of a player’s jump. Plus, players now behave according to their physical attributes with larger, stronger players dominating collisions, battles for control of the ball, and position in challenges for two player headers. FIFA 09 features new Custom Team Tactics that gives you all the tools to become a first-team coach. For the first time, go inside the game engine to customize the positioning and support play of your teammates and decide exactly how your team will play in any situation. Now you are the player, coach and manager! You have the power to adjust and customize tactical settings so CPU players and your team perform just like the real-world team plays or how you think it should play. Save your tactics and then make strategic decisions to exploit your opponent’s weaknesses, all on-the-fly. [Electronic Arts]… Expand"}, {"name": "Astral Chain", "details_link": "https://www.metacritic.com/game/switch/astral-chain", "publisher": "Nintendo", "release_date": "Aug 30 2019", "developers": ["PlatinumGames"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 87, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/9/8c2eaef143968e1ef036e7e0d95cd856-98.jpg", "descriptions": "As part of a police special task force, it’s up to you to fight against mysterious, alien-like creatures who have invaded the world.  In the Ark, a multi-cultural city in the near future, disaster strikes when gates to another dimension suddenly appear! Dangerous creatures begin to emerge,As part of a police special task force, it’s up to you to fight against mysterious, alien-like creatures who have invaded the world.  In the Ark, a multi-cultural city in the near future, disaster strikes when gates to another dimension suddenly appear! Dangerous creatures begin to emerge, attacking the people and polluting the land, and normal police forces are unable to compete with them. To stand up against these threats, a brand new, special police unit known as Neuron is formed. Choose between two playable characters – one male, one female – on your adventure. The character you don’t choose also appears as your younger twin, and a fellow member of Neuron.  In order to resist the creatures, humanity developed a special weapon: the Legion. The Legion acts as your partner, and helps with your investigations. However, it’s in battle where the Legion shows its real ability...… Expand"}, {"name": "Yakuza 6: The Song of Life", "details_link": "https://www.metacritic.com/game/xbox-one/yakuza-6-the-song-of-life", "publisher": "Sega", "release_date": "Mar 25 2021", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 87, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/0069076c342c882b43cc76692f71cc27-98.jpg", "descriptions": "In Yakuza 6, Kazuma Kiryu will find out exactly how much people are willing to sacrifice for family -- be those ties through blood or bond -- when he investigates a series of shadowy events that involve the ones he holds closest to his heart. Fresh out of a three-year prison sentence, anIn Yakuza 6, Kazuma Kiryu will find out exactly how much people are willing to sacrifice for family -- be those ties through blood or bond -- when he investigates a series of shadowy events that involve the ones he holds closest to his heart. Fresh out of a three-year prison sentence, an older and weathered Kiryu comes to find out that his surrogate daughter, Haruka, has gone missing from the orphanage he looks after. The trail leads him to his old stomping grounds in Kamurocho, where he discovers that she has been struck by a car and now lies in a coma. To make matters worse, Kiryu learns that Haruka now has a son that he must look after. With baby in hand, Kiryu journeys to the seaside town of Onomichi, Hiroshima to unravel the truth about Haruka, her son, and a sinister secret that the Hiroshima yakuza are harbouring. From the unparalleled realism of the new setting of Onomichi, a beautiful, sleepy port town in Hiroshima Prefecture, to the latest evolution of Kamurocho, the biggest red-light district in Tokyo, Yakuza 6 is the ultimate iteration the game's blend of gritty crime story, hyper-explosive combat, and all the vices and distractions those locales have to offer.… Expand"}, {"name": "Steins;Gate", "details_link": "https://www.metacritic.com/game/pc/steinsgate", "publisher": "Jast", "release_date": "Mar 31 2014", "developers": ["M2"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["First-Person", "Modern", "Adventure", "General", "Visual Novel"], "meta_score": 87, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/6/3cd8cdaf7d7099eb1c1b00fdae5219dd-98.jpg", "descriptions": "Set in Akihabara, the Mecca of Japanese anime culture, Steins;Gate follows a group of friends who accidentally invent a method of sending messages to the past. Their discovery drags them into a world of conspiracy and shifting timelines where the push of a button can change the course of history."}, {"name": "NCAA Football 06", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-football-06", "publisher": "EA Sports", "release_date": "Jul 11 2005", "developers": ["EA Sports"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 87, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/6a81c83ea41a95025b90138ea0dc64fc-98.jpg", "descriptions": "In an all-new Race for the Heisman mode, players can start their career as a prep star and work their way to becoming one of the nation’s top collegiate players with the hopes of winning the coveted Heisman Trophy. Gamers can act as Impact Players and single handedly break games wide openIn an all-new Race for the Heisman mode, players can start their career as a prep star and work their way to becoming one of the nation’s top collegiate players with the hopes of winning the coveted Heisman Trophy. Gamers can act as Impact Players and single handedly break games wide open with highlight reel moves and special animations or take control of a program and make a run for the championship through a revamped Dynasty Mode.  In addition, NCAA Football 06 has the exclusive license for college football videogames, and will be the only game to feature actual teams, stadiums and schools. [Electronic Arts]… Expand"}, {"name": "GRID (2008)", "details_link": "https://www.metacritic.com/game/pc/grid-2008", "publisher": "Codemasters", "release_date": "Jun  3 2008", "developers": ["Codemasters"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "12  Online", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/7762a5f1e834eda841a1bceb42d5001f-98.jpg", "descriptions": "(Also known as \"Race Dirver: GRID\")  GRID takes players to dramatic and beautifully realized race locations over three continents to compete in a variety of racing events. Packed with the most powerful race cars - new and classic, circuit and drift - players compete to conquer the most(Also known as \"Race Dirver: GRID\")  GRID takes players to dramatic and beautifully realized race locations over three continents to compete in a variety of racing events. Packed with the most powerful race cars - new and classic, circuit and drift - players compete to conquer the most prestigious official race tracks and championships then beyond to compete in challenging city-based competitions, and then on through to road events and urban street races. The drama, the rivalries, the aggression and the crashes; this is not a game about collecting cars or spending all of your time in the front-end tuning suspension settings or designing liveries. Codemasters wants to make racing exciting again. Gamers compete on Europe's greatest official race tracks in prestige Marques including Aston Martin, Koenigsegg and Pagani. Iconic cities across the U.S, including San Francisco, Washington DC and Detroit - each with their own atmosphere and events - play host to diverse street races, where high-performance V8 muscle cars set the pace in aggressive, closely fought pack competitions. And in the Far East, Japanese racing culture sets the tone where night races, including Drift racing, takes drivers through neon illuminated cities and to outlying mountain roads. There's also the opportunity to compete in races that operate on the fringes of legality in the back streets and industrial areas of Yokohama. [Codemasters]… Expand"}, {"name": "Gran Turismo 7", "details_link": "https://www.metacritic.com/game/playstation-5/gran-turismo-7", "publisher": "PlayStation Studios", "release_date": "Mar  4 2022", "developers": ["Polyphony Digital"], "platforms": ["PlayStation 4", "PlayStation 5"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 87, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/0/fc2ed38cd981a47d38f24911317270a9-98.jpg", "descriptions": "From classic vehicles and tracks to the reintroduction of the legendary GT Simulation Mode – GT 7 brings together the best features from past installments of the series alongside the future. An even more realistic driving experience awaits thanks to haptic feedback, which brings to life whatFrom classic vehicles and tracks to the reintroduction of the legendary GT Simulation Mode – GT 7 brings together the best features from past installments of the series alongside the future. An even more realistic driving experience awaits thanks to haptic feedback, which brings to life what it’s like when the tires hit the road. PS5’s immersive 3D audio allows players to sense the position of other cars and drivers around them.… Expand"}, {"name": "Night in the Woods", "details_link": "https://www.metacritic.com/game/playstation-4/night-in-the-woods", "publisher": "Infinite Fall", "release_date": "Feb 21 2017", "developers": ["Infinite Fall"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Fantasy", "Action Adventure", "Adventure", "General"], "meta_score": 87, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/d4b4b8dea97e1b18b9147c49cfbf5a37-98.jpg", "descriptions": "Night In The Woods is a 2D story-focused adventure/exploration game with extracurricular activities to enjoy, characters to meet, and secrets to discover. Run, jump and use astral projection to explore the many sides of town of Possum Springs and the surrounding environs. Waste time aroundNight In The Woods is a 2D story-focused adventure/exploration game with extracurricular activities to enjoy, characters to meet, and secrets to discover. Run, jump and use astral projection to explore the many sides of town of Possum Springs and the surrounding environs. Waste time around town with your crew of nerd friends. Acquire abilities that allow you to stroll into new areas. Unearth the secrets of a big cast of characters and the town itself. Experience a nutty world and the events unfolding there. Play bass. Break stuff.… Expand"}, {"name": "DiRT 3", "details_link": "https://www.metacritic.com/game/playstation-3/dirt-3", "publisher": "Codemasters", "release_date": "May 24 2011", "developers": ["Codemasters"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 87, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/00d428f6854c5cc2f96210b9330c2a4b-98.jpg", "descriptions": "Dirt 3 takes Codemasters' off-road series back to its rallying roots."}, {"name": "Critter Crunch", "details_link": "https://www.metacritic.com/game/playstation-3/critter-crunch", "publisher": "Capy Games", "release_date": "Oct  8 2009", "developers": ["Player X"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3"], "num_players": "2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 87, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/6a1284f8c2dfb69cd4782c23d9919426-98.jpg", "descriptions": "[Playstation Network]  Critter Crunch is fueled by an original and award-winning “food chain” puzzle mechanic, which is all about feeding critters into each other until they burst. It's exactly as cute as it is horrible and sad, just like nature itself! The game features a bunch of single[Playstation Network]  Critter Crunch is fueled by an original and award-winning “food chain” puzzle mechanic, which is all about feeding critters into each other until they burst. It's exactly as cute as it is horrible and sad, just like nature itself! The game features a bunch of single player modes like adventure & puzzle, as well as online and local multiplayer in versus & co-op flavors, with a plethora of fancy trophies to collect. It also has lots of really pretty 1080p art that should make your HDTV happy. [Capybara]… Expand"}, {"name": "Guilty Gear -Strive-", "details_link": "https://www.metacritic.com/game/playstation-5/guilty-gear--strive-", "publisher": "Arc System Works", "release_date": "Jun  8 2021", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 32 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 87, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/2dd10b770056b3a891f89c3ca35cd3f3-98.jpg", "descriptions": "“Guilty Gear -Strive-“ is the latest entry in the Guilty Gear fighting game franchise. Created by Daisuke Ishiwatari and developed by Arc System Works, “Guilty Gear -Strive-“ upholds the series’ reputation for groundbreaking hybrid 2D/3D cell-shaded graphics and intense, rewarding gameplay.“Guilty Gear -Strive-“ is the latest entry in the Guilty Gear fighting game franchise. Created by Daisuke Ishiwatari and developed by Arc System Works, “Guilty Gear -Strive-“ upholds the series’ reputation for groundbreaking hybrid 2D/3D cell-shaded graphics and intense, rewarding gameplay. There is a fully voiced story mode diving deep into the Guilty Gear universe, new characters joining fan favorites, and robust rollback net code. The cutting-edge 2D/3D hybrid graphics pioneered in the Guilty Gear series have been raised to the next level in “Guilty Gear -Strive-“. The new artistic direction and improve character animations will go beyond anything you’ve seen before in a fighting game!… Expand"}, {"name": "Crypt of the NecroDancer", "details_link": "https://www.metacritic.com/game/pc/crypt-of-the-necrodancer", "publisher": "Brace Yourself Games", "release_date": "Apr 23 2015", "developers": ["Brace Yourself Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "genres": ["Action", "Role-Playing", "Rhythm", "General", "Action RPG", "Music"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/747eb75cc2313ad0d6e32271691dea6f-98.jpg", "descriptions": "A hardcore rhythm-based roguelike game. Can you survive this deadly dungeon of dance, slay the NecroDancer, and recapture your still beating heart? Or will you be a slave to the rhythm for all eternity? Players must move on the beat to navigate procedurally generated dungeons while battlingA hardcore rhythm-based roguelike game. Can you survive this deadly dungeon of dance, slay the NecroDancer, and recapture your still beating heart? Or will you be a slave to the rhythm for all eternity? Players must move on the beat to navigate procedurally generated dungeons while battling dancing skeletons, zombies, dragons, and more! Groove with the game's epic dance soundtrack, or select songs from your own MP3 collection! You can even play with a dance pad to really shake your bones!… Expand"}, {"name": "La-Mulana", "details_link": "https://www.metacritic.com/game/wii/la-mulana", "publisher": "EnjoyUp Games", "release_date": "Sep 20 2012", "developers": ["Asterizm Co.", "Ltd"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Platformer", "Open-World", "2D", "2D", ""], "meta_score": 87, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/0b6504fc238092bc0200e281e92400e6-98.jpg", "descriptions": "La-Mulana is a archaelogy action and exploration game where players take control of Professor Lemeza and his inseparable whip to discover the mysteries of Humanity!"}, {"name": "Max Payne 3", "details_link": "https://www.metacritic.com/game/playstation-3/max-payne-3", "publisher": "Rockstar Games", "release_date": "May 15 2012", "developers": ["Rockstar Games", "Rockstar Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/4f6f32a7cc3afb26b1018a89452c218a-98.jpg", "descriptions": "In addition to an expansive single-player campaign, Max Payne 3 is the first entry in the series to introduce a thorough multiplayer experience. In a unique twist, Max Payne 3 multiplayer delivers an experience that dynamically alters maps and mode progression for all players in a match.In addition to an expansive single-player campaign, Max Payne 3 is the first entry in the series to introduce a thorough multiplayer experience. In a unique twist, Max Payne 3 multiplayer delivers an experience that dynamically alters maps and mode progression for all players in a match. Along with traditional multiplayer modes, Max Payne 3 also includes a deep reward and leveling system, persistent clans and multiple strategic load-out options.… Expand"}, {"name": "Legends of Runeterra", "details_link": "https://www.metacritic.com/game/pc/legends-of-runeterra", "publisher": "Riot Games", "release_date": "Apr 29 2020", "developers": ["Riot Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 87, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/ebbdbe11334b986914e608c02b4d3f10-98.jpg", "descriptions": "Face off in dynamic, alternating combat full of opportunities to adapt and outplay. Make your move, but be ready to react, because your opponent has a plan of their own. It all comes down to this—can you outwit them and win?"}, {"name": "Pokemon Sun", "details_link": "https://www.metacritic.com/game/3ds/pokemon-sun", "publisher": "Nintendo", "release_date": "Nov 18 2016", "developers": ["Game Freak"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 87, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/be7a469e5c345b13846e625865f5f579-98.jpg", "descriptions": "Using Pokemon Bank, you'll be able to transfer Pokemon you've caught in the Nintendo 3DS Virtual Console versions of Pokemon Red, Pokemon Blue, and Pokemon Yellow into your copy of Pokemon Sun or Pokemon Moon. Pokemon from Pokemon Omega Ruby, Pokemon Alpha Sapphire, Pokemon X, and Pokemon YUsing Pokemon Bank, you'll be able to transfer Pokemon you've caught in the Nintendo 3DS Virtual Console versions of Pokemon Red, Pokemon Blue, and Pokemon Yellow into your copy of Pokemon Sun or Pokemon Moon. Pokemon from Pokemon Omega Ruby, Pokemon Alpha Sapphire, Pokemon X, and Pokemon Y can also be brought into Pokemon Sun and Pokemon Moon in the same way.… Expand"}, {"name": "Sins of a Solar Empire", "details_link": "https://www.metacritic.com/game/pc/sins-of-a-solar-empire", "publisher": "Stardock", "release_date": "Feb  4 2008", "developers": ["Ironclad Games"], "platforms": "PC", "num_players": "10  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/101e261b08a787737051ca10b2592948-98.jpg", "descriptions": "Sins of a Solar Empire represents the birth of the RT4X genre, seamlessly blending spectacular tactical combat with grand-scale space strategy. Players must conquer worlds, engage in diplomacy and trade with other civilizations, and use the resources at their disposal to enhance theirSins of a Solar Empire represents the birth of the RT4X genre, seamlessly blending spectacular tactical combat with grand-scale space strategy. Players must conquer worlds, engage in diplomacy and trade with other civilizations, and use the resources at their disposal to enhance their economy, develop new technology and increase military power. They must then test their mettle on a 3D tactical battlefield, where their ships will fight it out in stunning visual glory. [Stardock]… Expand"}, {"name": "Atari 50: The Anniversary Celebration", "details_link": "https://www.metacritic.com/game/xbox-series-x/atari-50-the-anniversary-celebration", "publisher": "Atari", "release_date": "Nov 11 2022", "developers": ["Digital Eclipse"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 87, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/d30ae49ce7f15a5de92b71e6e9eacb3a-98.jpg", "descriptions": "It has been five decades since a small team in Silicon Valley first combined their creativity, curiosity and passion into making video games and hardware. The result of their efforts was Atari, one of the most recognizable and enduring entertainment and pop culture brands in the world.It has been five decades since a small team in Silicon Valley first combined their creativity, curiosity and passion into making video games and hardware. The result of their efforts was Atari, one of the most recognizable and enduring entertainment and pop culture brands in the world.Atari 50: The Anniversary Celebration takes players on an interactive journey through 50 years of video games via interviews with designers, developers and industry leaders, documentary footage, product design documents, high-resolution original artwork, and a specially-curated list of more than 90 playable games.… Expand"}, {"name": "Dragon Ball FighterZ", "details_link": "https://www.metacritic.com/game/switch/dragon-ball-fighterz", "publisher": "Bandai Namco Games", "release_date": "Sep 28 2018", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 6 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 87, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/6c9cc301c257ee591029186806423bd9-98.jpg", "descriptions": "After the success of the Xenoverse series, its time to introduce a new classic 2D DRAGON BALL fighting game for this generations consoles. DRAGON BALL FighterZ is born from what makes the DRAGON BALL series so loved and famous: endless spectacular fights with its allpowerful fighters.After the success of the Xenoverse series, its time to introduce a new classic 2D DRAGON BALL fighting game for this generations consoles. DRAGON BALL FighterZ is born from what makes the DRAGON BALL series so loved and famous: endless spectacular fights with its allpowerful fighters. Partnering with Arc System Works, DRAGON BALL FighterZ maximizes high end Anime graphics and brings easy to learn but difficult to master fighting gameplay to audiences worldwide. \r\rKey Features:\r * 3vs3 TAG/SUPPORT\rAllows players to train and master more than one fighter/style which brings deeper gameplay\r * HIGH-END ANIME GRAPHICS\rUsing the power of the Unreal engine and the talented team at Arc System Works, DRAGON BALL FighterZ is a visual tour-de-force \r\r* SPECTACULAR FIGHTS\rExperience aerial combos, destructible stages, famous scenes from the DRAGON BALL anime reproduced in 60FPS and 1080p resolution (Higher resolution will be supported on PS4 Pro and Xbox Scorpio)… Expand"}]