[
  {
    "name": "NBA 2K2",
    "details_link": "https://www.metacritic.com/game/dreamcast/nba-2k2",
    "publisher": "Sega",
    "release_date": "Oct 24 2001",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": [
      "PlayStation 2",
      "Dreamcast"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Basketball",
      "Sim"
    ],
    "meta_score": 93,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/3/c13da19efd63efbe6e43e9133a6dd11c-98.jpg",
    "descriptions": "Exploit the defender with a lightning quick drop step move before you launch all out attack, finishing with an impressive dunk! With enhanced player performance such as this, the most renowned basketball game ever has been improved on all levels. Run the floor with new moves, exploit the newExploit the defender with a lightning quick drop step move before you launch all out attack, finishing with an impressive dunk! With enhanced player performance such as this, the most renowned basketball game ever has been improved on all levels. Run the floor with new moves, exploit the new steal system then stand back in awe as you're put right behind the cameras in replay mode. With the addition of legendary urban playground courts, including the famous Mosswood Park, NBA2K2 is the true basketball experience.… Expand"
  },
  {
    "name": "SoulCalibur II",
    "details_link": "https://www.metacritic.com/game/playstation-2/soulcalibur-ii",
    "publisher": "Namco",
    "release_date": "Aug 27 2003",
    "developers": [
      "Namco"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 92,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/1/7e95a65de79908b5999ca31af61d63b6-98.jpg",
    "descriptions": "A new page in history has begun as the most highly-anticipated fighting game ever finally arrives! The greatest 3-D weapons-based fighter will provide non-stop action, excitement and surprises as you go one-on-one against your favorite challengers. 13 historic fighters plus all newA new page in history has begun as the most highly-anticipated fighting game ever finally arrives! The greatest 3-D weapons-based fighter will provide non-stop action, excitement and surprises as you go one-on-one against your favorite challengers. 13 historic fighters plus all new combatants including Necrid, specially designed by Todd McFarlane Productions, Inc. Unique special guest fighters for each platform include Link (GameCube), Heihachi (PS2), and Todd McFarlane's Spawn (Xbox). 7 exciting modes of play including Arcade, Vs, Time Attack, Survival, Team Battle, Practice, and Weapon Master. Collect 200 different weapons in the all-new mission-complete Weapon Master mode. [Namco]… Expand"
  },
  {
    "name": "The Elder Scrolls V: Skyrim",
    "details_link": "https://www.metacritic.com/game/playstation-3/the-elder-scrolls-v-skyrim",
    "publisher": "Bethesda Softworks",
    "release_date": "Nov 11 2011",
    "developers": [
      "Bethesda Game Studios"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "First-Person",
      "First-Person",
      "Western-Style"
    ],
    "meta_score": 92,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/6/372529409ea6cc3faadf5674fd96ba2a-98.jpg",
    "descriptions": "The next chapter in the Elder Scrolls saga arrives from the Bethesda Game Studios. Skyrim reimagines the open-world fantasy epic, bringing to life a complete virtual world open for you to explore any way you choose. Play any type of character you can imagine, and do whatever you want; theThe next chapter in the Elder Scrolls saga arrives from the Bethesda Game Studios. Skyrim reimagines the open-world fantasy epic, bringing to life a complete virtual world open for you to explore any way you choose. Play any type of character you can imagine, and do whatever you want; the legendary freedom of choice, storytelling, and adventure of The Elder Scrolls is realized like never before. Skyrim's new game engine brings to life a complete virtual world with rolling clouds, rugged mountains, bustling cities, lush fields, and ancient dungeons. Choose from hundreds of weapons, spells, and abilities. The new character system allows you to play any way you want and define yourself through your actions. Battle ancient dragons like you've never seen. As Dragonborn, learn their secrets and harness their power for yourself.… Expand"
  },
  {
    "name": "Prince of Persia: The Sands of Time",
    "details_link": "https://www.metacritic.com/game/xbox/prince-of-persia-the-sands-of-time",
    "publisher": "Ubisoft",
    "release_date": "Nov 12 2003",
    "developers": [
      "Ubisoft"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "PlayStation 3",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 92,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/7/de89400659bb1ce4017aa9a154ef4900-98.jpg",
    "descriptions": "Embark on a journey of scorched sands and ancient legends.  A young prince, drawn to the dark powers of a magic dagger, unleashes a deadly evil upon a beautiful kingdom.  Guide the Prince on his quest to reverse the curse by using the Sands of Time, a power which allows you to erase theEmbark on a journey of scorched sands and ancient legends.  A young prince, drawn to the dark powers of a magic dagger, unleashes a deadly evil upon a beautiful kingdom.  Guide the Prince on his quest to reverse the curse by using the Sands of Time, a power which allows you to erase the past, see into the future and slow down the present.  Perform gravity-defying acrobatics and swashbuckling attacks in a staggering array of landscapes and kingdoms.  Restore peace to the land and fulfill your destiny.… Expand"
  },
  {
    "name": "Call of Duty 4: Modern Warfare",
    "details_link": "https://www.metacritic.com/game/pc/call-of-duty-4-modern-warfare",
    "publisher": "Activision",
    "release_date": "Nov  5 2007",
    "developers": [
      "Infinity Ward"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "Up to 18 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 92,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/5/bdbee338493df7d9024ef31a95bdeff9-98.jpg",
    "descriptions": "As Call of Duty 4: Modern Warfare's single player campaign unfolds, the player is introduced to new gameplay at every turn – one moment you are fast-roping from your Black Hawk helicopter after storming into the war zone with an armada of choppers, the next you are a sniper, underAs Call of Duty 4: Modern Warfare's single player campaign unfolds, the player is introduced to new gameplay at every turn – one moment you are fast-roping from your Black Hawk helicopter after storming into the war zone with an armada of choppers, the next you are a sniper, under concealment, in a Ghillie suit miles behind enemy lines, the next you are engaging hostiles from an AC-130 gunship thousands of feet above the battlefield. Mixed with explosive action, Call of Duty 4: Modern Warfare also delivers special effects, including use of depth of field, rim-lighting, character self-shadowing, real time post-processing, texture streaming as well as physics-enabled effects. Infinity Ward deployed a dedicated team from the start to deliver a new level of depth to multiplayer. Building on the hit \"Call of Duty 2\" online experience, Call of Duty 4: Modern Warfare's new multiplayer provides the community an addictive and accessible experience to gamers of all levels. [Activision]… Expand"
  },
  {
    "name": "Forza Horizon 4",
    "details_link": "https://www.metacritic.com/game/xbox-one/forza-horizon-4",
    "publisher": "Microsoft Game Studios",
    "release_date": "Sep 28 2018",
    "developers": [
      "Playground Games"
    ],
    "platforms": [
      "PC",
      "Xbox Series X",
      "Xbox One"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Racing",
      "Simulation",
      "Automobile"
    ],
    "meta_score": 92,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/8/e68ca0b7fdc8a0c3dd2df6792d8fd986-98.jpg",
    "descriptions": "For the first time in the racing and driving genre, experience dynamic seasons in a shared open-world. Explore beautiful scenery, collect over 450 cars, and become a Horizon Superstar in historic Britain."
  },
  {
    "name": "God of War III",
    "details_link": "https://www.metacritic.com/game/playstation-3/god-of-war-iii",
    "publisher": "SCEA",
    "release_date": "Mar 16 2010",
    "developers": [
      "SCE Santa Monica"
    ],
    "platforms": "PlayStation 3",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "Fantasy",
      "Linear"
    ],
    "meta_score": 92,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/4/d497302faebe5d7c1600cc7654e4b9a1-98.jpg",
    "descriptions": "Set in the realm of brutal Greek mythology, God of War III is a single-player game which allows players to take on the climatic role of the ex-Spartan warrior, Kratos, as he scales through the intimidating heights of Mt. Olympus and the dark depths of Hell to seek revenge on those who haveSet in the realm of brutal Greek mythology, God of War III is a single-player game which allows players to take on the climatic role of the ex-Spartan warrior, Kratos, as he scales through the intimidating heights of Mt. Olympus and the dark depths of Hell to seek revenge on those who have betrayed him. Armed with double-chained blades, and an array of new weapons and magic for this iteration of the trilogy, Kratos must take on mythology’s darkest creatures while solving intricate puzzles throughout his merciless quest to destroy Olympus. [SCEA]… Expand"
  },
  {
    "name": "Divinity: Original Sin II - Definitive Edition",
    "details_link": "https://www.metacritic.com/game/xbox-one/divinity-original-sin-ii---definitive-edition",
    "publisher": "Larian Studios Games",
    "release_date": "Aug 31 2018",
    "developers": [
      "Larian Studios Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Western-Style"
    ],
    "meta_score": 92,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/1/bafa8d1fe71c5113d8313e407174d5e2-98.jpg",
    "descriptions": "Set a thousand years after the first game, Divinity: Original Sin II presents a darker, more grounded narrative and expands on the tactical combat system of its award-winning predecessor. In Divinity: Original Sin, you were on a quest for the forbidden Source magic. Now, you yourself are aSet a thousand years after the first game, Divinity: Original Sin II presents a darker, more grounded narrative and expands on the tactical combat system of its award-winning predecessor. In Divinity: Original Sin, you were on a quest for the forbidden Source magic. Now, you yourself are a Sourcerer: a dangerously powerful individual whose abilities summon creatures from the encroaching Void. The Divine is dead and the Void is everywhere. Sourcerers are blamed and the Divine Order is leading the charge against the threat: you. Captured and sent to Fort Joy, you will be \"cured\" of your powers -- no matter the cost. But the Order has secrets of its own that may cast doubt on its so-called holy mission. As you escape from Fort Joy, you realize that if the world remains godless, it will be consumed by the Void.… Expand"
  },
  {
    "name": "NFL 2K3",
    "details_link": "https://www.metacritic.com/game/gamecube/nfl-2k3",
    "publisher": "Sega",
    "release_date": "Aug 21 2002",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": [
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 92,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/2/9debfb899d33a2be56886778d90f974d-98.jpg",
    "descriptions": "NFL 2K3 upgrades Sega Sports' football series with realistic player animations, play-calling intelligence, and an on-the-fly audible system. With Franchise mode, you get total team control as player, coach, and general manager. A new ESPN broadcast system lets you review all the highlightsNFL 2K3 upgrades Sega Sports' football series with realistic player animations, play-calling intelligence, and an on-the-fly audible system. With Franchise mode, you get total team control as player, coach, and general manager. A new ESPN broadcast system lets you review all the highlights from your games. Now you can track the best players, make the smartest trades, and build the most dominant team in the league. NFL 2K3 also brings you closer to the action with updated rosters and authentic stadiums.… Expand"
  },
  {
    "name": "SSX Tricky",
    "details_link": "https://www.metacritic.com/game/playstation-2/ssx-tricky",
    "publisher": "EA Sports Big",
    "release_date": "Nov  5 2001",
    "developers": [
      "EA Canada"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Alternative",
      "Snowboarding"
    ],
    "meta_score": 92,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/9/9aa754c887685ac24621695c5c7b963a-98.jpg",
    "descriptions": "Second-generation rider physics provide more in-air and on-snow user control. Compete in the World Circuit, go head-to-head in the unique Showoff (trick) versions of nine courses on the World Circuit, or just kick it in Free Ride. New Garibaldi and Alaska courses let you get more verticalSecond-generation rider physics provide more in-air and on-snow user control. Compete in the World Circuit, go head-to-head in the unique Showoff (trick) versions of nine courses on the World Circuit, or just kick it in Free Ride. New Garibaldi and Alaska courses let you get more vertical and catch more air, while all the original courses have some new surprises. [Electronic Arts]… Expand"
  },
  {
    "name": "NHL 2002",
    "details_link": "https://www.metacritic.com/game/playstation-2/nhl-2002",
    "publisher": "Electronic Arts",
    "release_date": "Sep 24 2001",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Ice Hockey",
      "Sim"
    ],
    "meta_score": 92,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/7/f68a1e3fddb8d1918d9e066c20d798b2-98.jpg",
    "descriptions": "The PlayStation 2 version features include Career Mode, allowing you to compete for the Stanley Cup for 10 consecutive years and build a true hockey dynasty. Also included are Quick Game, Season, Playoffs, Shootout, and Tournament modes.  [EA Sports]"
  },
  {
    "name": "Guitar Hero II",
    "details_link": "https://www.metacritic.com/game/xbox-360/guitar-hero-ii",
    "publisher": "RedOctane",
    "release_date": "Apr  3 2007",
    "developers": [
      "Harmonix Music Systems"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox 360"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 92,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/5/895e9b9a60d11c4d6b59962f5a6b340f-98.jpg",
    "descriptions": "Rock the Rhythm, Lead, and Bass Guitar tracks in the follow-up sequel to \"Guitar Hero.\" Form your guitar duo and shred riffs cooperatively or go head to head in all new multiplayer modes. With over 55 tracks to rock out to, you'll go from Guitar Hero to Guitar god in one press of a fretRock the Rhythm, Lead, and Bass Guitar tracks in the follow-up sequel to \"Guitar Hero.\" Form your guitar duo and shred riffs cooperatively or go head to head in all new multiplayer modes. With over 55 tracks to rock out to, you'll go from Guitar Hero to Guitar god in one press of a fret button. Choose from multiple rock characters and jam at concert venues that grow in size as your rock career progresses. You'll start your rock career playing small clubs and bars, but if you play well you'll work your way up to stadiums and arenas. Guitar Hero II takes the guitar rock experience to new volumes by allowing players to play 3 different guitar tracks: Rhythm, Bass, and Lead. Guitar Hero II introduces all new multiplayer modes like: cooperative, pro-face off, and face off, letting 2 Guitar Heroes conduct their own symphonies of destruction. Shred School: Guitar Hero II features an all new practice mode, allowing Guitar Zeroes to become Guitar Heroes with enough practice. With Guitar Hero II for Xbox 360 rock rhythm, lead, or bass guitar tracks with downloadable content and the new X-Plorer controller, designed specifically for the Xbox 360. [RedOctane]… Expand"
  },
  {
    "name": "Prince of Persia: The Sands of Time",
    "details_link": "https://www.metacritic.com/game/playstation-2/prince-of-persia-the-sands-of-time",
    "publisher": "Ubisoft",
    "release_date": "Nov  6 2003",
    "developers": [
      "Ubisoft"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 92,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/7/d7f073d7e7e747f0c0857998c9c1fffe-98.jpg",
    "descriptions": "Amidst the sands of ancient Persia, a young Prince unleashes a deadly evil. Embark on a harrowing quest to restore peace and the fabric of Time. Embody a legendary hero with gravity-defying acrobatics, ferocious fighting combos, and the ability to bend time to fulfill his bidding. Wield theAmidst the sands of ancient Persia, a young Prince unleashes a deadly evil. Embark on a harrowing quest to restore peace and the fabric of Time. Embody a legendary hero with gravity-defying acrobatics, ferocious fighting combos, and the ability to bend time to fulfill his bidding. Wield the power of the Sands of Time - a mythical force allowing the Prince to erase the past, behold the future, and freeze the present. You'll uncover the mysteries of a world never before explored in action-adventure gaming. Ancient Persia, mythical and deadly, holds a staggering array of landscapes and kingdoms to explore and conquer. [Ubi Soft]… Expand"
  },
  {
    "name": "Uncharted 3: Drake's Deception",
    "details_link": "https://www.metacritic.com/game/playstation-3/uncharted-3-drakes-deception",
    "publisher": "SCEA",
    "release_date": "Nov  1 2011",
    "developers": [
      "Naughty Dog"
    ],
    "platforms": "PlayStation 3",
    "num_players": "Up to 10 ",
    "genres": [
      "Action Adventure",
      "Modern",
      "Modern",
      "Linear"
    ],
    "meta_score": 92,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/5/bf1916f0ff130db8fa3e82fe5d1ac55b-98.jpg",
    "descriptions": "A search for the fabled \"Atlantis of the Sands\" propels fortune hunter Nathan Drake on a trek into the heart of the Arabian Desert. When the terrible secrets of this lost city are unearthed, Drake's quest descends into a desperate bid for survival that strains the limits of his endurance andA search for the fabled \"Atlantis of the Sands\" propels fortune hunter Nathan Drake on a trek into the heart of the Arabian Desert. When the terrible secrets of this lost city are unearthed, Drake's quest descends into a desperate bid for survival that strains the limits of his endurance and forces him to confront his deepest fears. … Expand"
  },
  {
    "name": "Rock Band",
    "details_link": "https://www.metacritic.com/game/xbox-360/rock-band",
    "publisher": "Electronic Arts",
    "release_date": "Nov 20 2007",
    "developers": [
      "Harmonix Music Systems"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "4  Online",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 92,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/8/91e0ff63522e1eed892dceaa9d4ff3f2-98.jpg",
    "descriptions": "Play together in your living room or across the world! Rock Band offers deep online functionality, allowing players to rock together whether they’re in Rhode Island or Reykjavik. Major record labels and leading music publishers have signed on to provide unrivaled access to master recordingsPlay together in your living room or across the world! Rock Band offers deep online functionality, allowing players to rock together whether they’re in Rhode Island or Reykjavik. Major record labels and leading music publishers have signed on to provide unrivaled access to master recordings and legendary rock artists – from punk, metal and alternative to classic and southern rock. Rock Band ships with 45 fearsome tracks from artists like Bon Jovi and The Ramones to Black Sabbath and Stone Temple Pilots. Full support for downloadable content delivers never-ending challenges. New content will be available every week. Download full albums for play with Rock Band including the iconic rock album 'Who's Next' by The Who. Metallica has signed on to offer several tracks as digitally-distributed game levels for Rock Band as well as \"Enter Sandman\" for the Rock Band ship disc. Create your own rock avatar! Mold a unique rocker using Rock Band's character creator. Chose from gender, body shape, face, hair, clothes, tattoos and signature moves. Don't forget to pick your specialized rockin’ instrument. Drumming in the spotlight! Showcase a real drum solo with Rock Band's freestyle drum fill windows featured in each song. Break out your own rhythm and style as anything goes! Vocalists can bring the crowd to their feet during Rock Band’s freestyle vocal fill windows. Ad-lib your own words or shout to the crowd to raise the rock intensity of the performance. Band mates can fail out of a song for poor performance, but the band still plays on. Rescue your failing mate by busting out signature moves and blistering solos to wow the crowd with showmanship. Earn bonus points for your band during Rock Band’s Unison Phrase opportunities if everyone plays perfectly. [Harmonix]… Expand"
  },
  {
    "name": "Journey",
    "details_link": "https://www.metacritic.com/game/playstation-4/journey",
    "publisher": "SCEA",
    "release_date": "Jul 21 2015",
    "developers": [
      "Tricky Pixels"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation 4"
    ],
    "num_players": "2 ",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 92,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/0/e0bd76cf934d8165e7acb7abf9202ec0-98.jpg",
    "descriptions": "The pioneers that brought you the award-winning PlayStation Network titles flOw & Flower are back with another title that challenges traditional gaming conventions. With Journey, thatgamecompany (TGC) continues its tradition of delivering simple gameplay and accessible controls in a richThe pioneers that brought you the award-winning PlayStation Network titles flOw & Flower are back with another title that challenges traditional gaming conventions. With Journey, thatgamecompany (TGC) continues its tradition of delivering simple gameplay and accessible controls in a rich interactive environment that invites players to explore and experience emotional chords that are still uncommon in video games.\r An exotic adventure with a more serious tone, Journey presents TGCs unique vision of an online adventure experience. Awakening in an unknown world, the player walks, glides, and flies through a vast and awe-inspiring landscape, while discovering the history of an ancient, mysterious civilization along the way.\r Journeys innovative approach to online play encourages players to explore this environment with strangers who cross their path from time to time. By traveling together, they can re-shape the experience  creating authentic moments they will remember and discuss with others.… Expand"
  },
  {
    "name": "Bloodborne",
    "details_link": "https://www.metacritic.com/game/playstation-4/bloodborne",
    "publisher": "SCEA",
    "release_date": "Mar 24 2015",
    "developers": [
      "From Software"
    ],
    "platforms": "PlayStation 4",
    "num_players": "Up to 5 ",
    "genres": [
      "Fantasy",
      "Role-Playing",
      "Action Adventure",
      "General",
      "Action RPG"
    ],
    "meta_score": 92,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/5/d31120073f909d2c034c09f91e7a5073-98.jpg",
    "descriptions": "Bloodborne is an action RPG in which you hunt for answers in the ancient city of Yharnam, now cursed with a strange endemic illness spreading through the streets like a disease. Peril, death and madness infest this dark world, and you're tasked with uncovering its darkest secrets which willBloodborne is an action RPG in which you hunt for answers in the ancient city of Yharnam, now cursed with a strange endemic illness spreading through the streets like a disease. Peril, death and madness infest this dark world, and you're tasked with uncovering its darkest secrets which will be necessary for you to survive. Armed with a singular arsenal of weaponry, including guns and saw cleavers, you'll require wits, strategy and reflexes to dispatch the agile and intelligent enemies that guard the city's underbelly. You will utility holy chalices to access an array of vast underground ruins, chock full of traps, beasts, and rewards, to explore and conquer on your own or with other people.… Expand"
  },
  {
    "name": "Eternal Darkness: Sanity's Requiem",
    "details_link": "https://www.metacritic.com/game/gamecube/eternal-darkness-sanitys-requiem",
    "publisher": "Nintendo",
    "release_date": "Jun 23 2002",
    "developers": [
      "Silicon Knights"
    ],
    "platforms": "GameCube",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Horror"
    ],
    "meta_score": 92,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/0/9b2f8b7f00cb38e56c579eb2934b2893-98.jpg",
    "descriptions": "This horror story spans generations, so you must relive the blood-soaked history while conjuring spells, solving puzzles, and slaying supernatural beasts. Whether you're creeping around as the Roman Centurion, Cambodian villager, or any of the other characters, the psychological thrillerThis horror story spans generations, so you must relive the blood-soaked history while conjuring spells, solving puzzles, and slaying supernatural beasts. Whether you're creeping around as the Roman Centurion, Cambodian villager, or any of the other characters, the psychological thriller will challenge you to use your mind as well as your might. The story is historically based and features many significant real-world events and locations, including the blood-soaked fields of the Somme, the jungle-ridden temples of Angkor Wat, the deserts of Persia, and the haunted vales of Rhode Island.… Expand"
  },
  {
    "name": "Warcraft III: Reign of Chaos",
    "details_link": "https://www.metacritic.com/game/pc/warcraft-iii-reign-of-chaos",
    "publisher": "Blizzard Entertainment",
    "release_date": "Jul  3 2002",
    "developers": [
      "Blizzard Entertainment"
    ],
    "platforms": "PC",
    "genres": [
      "Strategy",
      "Real-Time",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 92,
    "users_score": 9.2,
    "image": "https://static.metacritic.com/images/products/games/1/381270905624fa84865e1fe874eb8eb5-98.jpg",
    "descriptions": "[Metacritic's 2002 PC Game of the Year] It has been nearly fifteen years since the war between the orcs and humans ended. An uneasy peace settled over the land while, for years, the drums of war were silent. Yet the kingdoms of men grew complacent in their victory - and slowly, the defeated[Metacritic's 2002 PC Game of the Year] It has been nearly fifteen years since the war between the orcs and humans ended. An uneasy peace settled over the land while, for years, the drums of war were silent. Yet the kingdoms of men grew complacent in their victory - and slowly, the defeated orcish clans regrouped under the banner of a new visionary leader. Now a darker shadow has fallen over the world, threatening to extinguish all life - all hope. The drums of war play upon the winds once again - rising urgently towards the inevitable hour when the skies will rain fire - and the world will tremble before the coming of the Burning Legion. The Day of Judgment has come... [Blizzard]… Expand"
  },
  {
    "name": "SSX 3",
    "details_link": "https://www.metacritic.com/game/gamecube/ssx-3",
    "publisher": "EA Sports Big",
    "release_date": "Oct 20 2003",
    "developers": [
      "EA Canada"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox 360",
      "GameCube"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Alternative",
      "Snowboarding"
    ],
    "meta_score": 92,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/3/e81b715ef08828c025cf0c570d260447-98.jpg",
    "descriptions": "Drop in and conquer the massive, living mountain rife with ego-crushing challenges and gravity-bending thrills.  SSX 3 returns with more slopes and all-new hazards to overcome including lightning storms, vertical drops, serpentine slopestyle courses and avalanches.  Customize your rider'sDrop in and conquer the massive, living mountain rife with ego-crushing challenges and gravity-bending thrills.  SSX 3 returns with more slopes and all-new hazards to overcome including lightning storms, vertical drops, serpentine slopestyle courses and avalanches.  Customize your rider's clothes, abilities, and moves.  Pull off three levels of awesome \"Uber tricks.\" Dominate the mountain, and then test your skills online.  It's a long way down, so make sure you're ready for the challenge.… Expand"
  },
  {
    "name": "The Sims",
    "details_link": "https://www.metacritic.com/game/pc/the-sims",
    "publisher": "Maxis",
    "release_date": "Feb  4 2000",
    "developers": [
      "Maxis"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "",
    "genres": [
      "Simulation",
      "Miscellaneous",
      "Virtual Life",
      "Virtual",
      "Virtual Life"
    ],
    "meta_score": 92,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/0/d5141262ae8d42c853a26d370d0398eb-98.jpg",
    "descriptions": "In \"SimCity,\" you had the power to build and control cities ... with The Sims, you'll create and control people!"
  },
  {
    "name": "Banjo-Kazooie",
    "details_link": "https://www.metacritic.com/game/nintendo-64/banjo-kazooie",
    "publisher": "Nintendo",
    "release_date": "May 31 1998",
    "developers": [
      "Rare Ltd."
    ],
    "platforms": "Nintendo 64",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 92,
    "users_score": 9.2,
    "image": "https://static.metacritic.com/images/products/games/9/98e36d3664285d5615e4cfd7e08a044d-98.jpg",
    "descriptions": "Trouble is brewing on Spiral Mountain! Gruntilda the witch, wildly jealous of Tooty the Honey Bear's good looks; is determined to steal them for herself! But even as she whisks the helpless youngster off to her tower, Tooty's big brother Banjo and his loud-mouthed partner Kazooie are hot onTrouble is brewing on Spiral Mountain! Gruntilda the witch, wildly jealous of Tooty the Honey Bear's good looks; is determined to steal them for herself! But even as she whisks the helpless youngster off to her tower, Tooty's big brother Banjo and his loud-mouthed partner Kazooie are hot on the trail to rescue her...Aided by the mystical shaman Mumbo Jumbo, Banjo and Kazooie must tackle gloomy swamps, scorching deserts, towering mountain ranges and spooky haunted houses on their way to the final confrontation at the summit of Gruntilda's Lair. … Expand"
  },
  {
    "name": "Sid Meier's Gettysburg!",
    "details_link": "https://www.metacritic.com/game/pc/sid-meiers-gettysburg!",
    "publisher": "Electronic Arts",
    "release_date": "Sep 30 1997",
    "developers": [
      "Firaxis Games"
    ],
    "platforms": "PC",
    "num_players": "1-8 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Wargame",
      "Real-Time",
      "General"
    ],
    "meta_score": 92,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/2/36c9df22d3203a49b8d1f56422d701e3-98.jpg",
    "descriptions": "Experience victory in Sid Meier's Gettysburg! It's the most engrossing and sophisticated real-time strategy game ever. In a stunning 3D battlefield, you plan the tactics, lead the troops, and take history into your own hands. Attack from the trees to protect your brigade,rally around aExperience victory in Sid Meier's Gettysburg! It's the most engrossing and sophisticated real-time strategy game ever. In a stunning 3D battlefield, you plan the tactics, lead the troops, and take history into your own hands. Attack from the trees to protect your brigade,rally around a General for a quicker recovery, entrench your troops as your cannons blast the hillside, and much, much more with just a click of the mouse! Complete multiplayer support via internet, LAN, modem and serial link. [Firaxis]… Expand"
  },
  {
    "name": "Celeste",
    "details_link": "https://www.metacritic.com/game/switch/celeste",
    "publisher": "Matt Makes Games Inc.",
    "release_date": "Jan 25 2018",
    "developers": [
      "Matt Makes Games Inc."
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Stadia",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 92,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/4/a53232ef0f7a0122744dfd3901f9bf7e-98.jpg",
    "descriptions": "Help Madeline survive her journey to the top of Celeste Mountain in this super-tight, hand-crafted platformer from the creators of TowerFall."
  },
  {
    "name": "Rock Band 2",
    "details_link": "https://www.metacritic.com/game/wii/rock-band-2",
    "publisher": "MTV Games",
    "release_date": "Dec 18 2008",
    "developers": [
      "Harmonix Music Systems"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360",
      "Wii"
    ],
    "num_players": "4  Online",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 92,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/0/5a2921c36523372618a6dd034c28c36a-98.jpg",
    "descriptions": "Rock Band 2 builds upon its foundation as the first music game to introduce co-operative band gameplay, multiple instruments, a robust online multiplayer experience, an unrivaled offering of downloadable content and raises the bar by delivering an entirely new level of depth, connectivity,Rock Band 2 builds upon its foundation as the first music game to introduce co-operative band gameplay, multiple instruments, a robust online multiplayer experience, an unrivaled offering of downloadable content and raises the bar by delivering an entirely new level of depth, connectivity, authenticity and features including: Backwards compatibility with Rock Band downloadable music content. All previously purchased tracks immediately load into your Rock Band 2 song list. No need to re-purchase or re-download. The biggest and most diverse soundtrack ever featuring some of rock's most prolific acts, comprised entirely of master recordings. Major new and dynamic online modes that connect the entire Rock Band community in more ways than ever before both locally and globally. More variety of instrument choices than ever before with new and improved drum and guitar peripherals, enhanced functionality and innovative new designs - all fully compatible with the original Rock Band instruments. [MTV]… Expand"
  },
  {
    "name": "Resident Evil 4",
    "details_link": "https://www.metacritic.com/game/pc/resident-evil-4",
    "publisher": "Capcom",
    "release_date": "Mar 24 2023",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Xbox Series X",
      "PC"
    ],
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 92,
    "users_score": 5.1,
    "image": "https://static.metacritic.com/images/products/games/3/f98d947c9c051f991d0701195eec0130-98.jpg",
    "descriptions": "SURVIVAL IS JUST THE BEGINNING...Resident Evil 4 is a remake of the 2005 original Resident Evil 4. Reimagined for 2023 to bring state-of-the-art survival horror. Resident Evil 4 preserves the essence of the original game, while introducing modernized gameplay, a reimagined storyline, andSURVIVAL IS JUST THE BEGINNING...Resident Evil 4 is a remake of the 2005 original Resident Evil 4. Reimagined for 2023 to bring state-of-the-art survival horror. Resident Evil 4 preserves the essence of the original game, while introducing modernized gameplay, a reimagined storyline, and vividly detailed graphics to make this the latest survival horror game where life and death, terror and catharsis intersect. \r\rSTORY:\r6 years have passed since the biological disaster in Raccoon City. Leon S. Kennedy, one of the survivors of the incident,\rhas been recruited as an agent reporting directly to the president of the United States. With the experience of multiple missions on his back, Leon is sent to rescue the president's kidnapped daughter. He tracks her to a secluded European village, where there is something terribly wrong with the villagers. And the curtain rises on this story of daring rescue and grueling horror.… Expand"
  },
  {
    "name": "Forza Motorsport",
    "details_link": "https://www.metacritic.com/game/xbox/forza-motorsport",
    "publisher": "Microsoft Game Studios",
    "release_date": "May  3 2005",
    "developers": [
      "Microsoft Game Studios"
    ],
    "platforms": "Xbox",
    "num_players": "8  Online",
    "genres": [
      "Driving",
      "Racing",
      "GT / Street"
    ],
    "meta_score": 92,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/4/2b554f02e598064d9fc95b6954ffc869-98.jpg",
    "descriptions": "Forza Motorsport lets you own, customize, and race your favorite cars. You can collect models from more than 60 manufacturers and then race to earn money for upgrades and aftermarket parts. Test-drive your vehicle on various tracks, ranging from the challenging Nurburgring Nordschleife toForza Motorsport lets you own, customize, and race your favorite cars. You can collect models from more than 60 manufacturers and then race to earn money for upgrades and aftermarket parts. Test-drive your vehicle on various tracks, ranging from the challenging Nurburgring Nordschleife to the streets of Rio de Janeiro. You can even train your own \"Drivatars\" to use the same racing techniques you do, so they can race for you in competitions or train new drivers on your team. In addition to single-player challenges, the game includes multiplayer modes that are playable via Xbox Live. … Expand"
  },
  {
    "name": "Madden NFL 2004",
    "details_link": "https://www.metacritic.com/game/xbox/madden-nfl-2004",
    "publisher": "EA Sports",
    "release_date": "Aug 12 2003",
    "developers": [
      "EA Tiburon"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 92,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/2/4ac90c8e31045e89589af95c163cbf7a-98.jpg",
    "descriptions": "In its 14th season, Madden NFL Football isn't showing signs of slowing down. Madden NFL 2004 adds new features such as Playmaker Control and Owner Mode to it's deepen its football simulation. This year, players can make adjustments after the snap and create championship caliber plays withIn its 14th season, Madden NFL Football isn't showing signs of slowing down. Madden NFL 2004 adds new features such as Playmaker Control and Owner Mode to it's deepen its football simulation. This year, players can make adjustments after the snap and create championship caliber plays with the easy-to-use Playmaker Control. The new Owner mode allows you build and manage your own stadium in addition to your own team. Compete against other players through EA Sports Online Tournaments. With new plays, modes, and online play, Madden NFL 2004 is the most complete, authentic installment in the series yet.… Expand"
  },
  {
    "name": "Super Street Fighter IV",
    "details_link": "https://www.metacritic.com/game/playstation-3/super-street-fighter-iv",
    "publisher": "Capcom",
    "release_date": "Apr 27 2010",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "3DS",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "3D",
      "2D",
      "3D"
    ],
    "meta_score": 92,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/6/4c7bf654cf9356412468517f2cd07a30-98.jpg",
    "descriptions": "The follow-up to Street Fighter IV further redefines the fighting game genre with classic 2D Street Fighter fighting action, a host of new and returning characters, more advanced online gameplay, new ultra combos and much more. Super Street Fighter IV features the full roster of 25The follow-up to Street Fighter IV further redefines the fighting game genre with classic 2D Street Fighter fighting action, a host of new and returning characters, more advanced online gameplay, new ultra combos and much more. Super Street Fighter IV features the full roster of 25 characters from Street Fighter IV such as Ryu, Ken, Crimson Viper, Abel, El Fuerte, and Rufus, while adding about eight characters new to the world of Street Fighter IV. The impressive new roster includes classic combatants from previous Street Fighter games like T. Hawk as well as all-new characters such as the mysterious and deadly female fighter, Juri. Super Street Fighter IV adds new Ultra Combos and advancements to the state of the art online matchmaking and online gameplay introduced in Street Fighter IV with numerous additional features. Super Street Fighter IV takes many of the groundbreaking features introduced in Street Fighter IV and refines everything to deliver the ultimate vision of Street Fighter to fans the world over. [Capcom]… Expand"
  },
  {
    "name": "Forza Horizon 5",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/forza-horizon-5",
    "publisher": "Xbox Game Studios",
    "release_date": "Nov  5 2021",
    "developers": [
      "Playground Games"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Racing",
      "Simulation",
      "Automobile"
    ],
    "meta_score": 92,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/3/c3a8634bbf83888742c8fc7290559202-98.jpg",
    "descriptions": "Your Ultimate Horizon Adventure awaits! Explore the vibrant and ever-evolving open world landscapes of Mexico with limitless, fun driving action in hundreds of the world’s greatest cars."
  },
  {
    "name": "World Soccer Winning Eleven 7 International",
    "details_link": "https://www.metacritic.com/game/pc/world-soccer-winning-eleven-7-international",
    "publisher": "VU Games",
    "release_date": "Apr  9 2004",
    "developers": [
      "KCET"
    ],
    "platforms": "PC",
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 92,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/6/98957a2e03ecc41b18c8054e8e15193a-98.jpg",
    "descriptions": "Winning Eleven 7 International features 100 teams, 21 stadiums, new player models and key additions to the Master League. Winning Eleven 7 also utilizes a custom designed engine that allows for great flexibility and customization. Upon entering a match, players will find incredibly masterfulWinning Eleven 7 International features 100 teams, 21 stadiums, new player models and key additions to the Master League. Winning Eleven 7 also utilizes a custom designed engine that allows for great flexibility and customization. Upon entering a match, players will find incredibly masterful gameplay, beautifully rendered stadiums and picture-perfect player models. While on the field, players will experience true-to-life gameplay, with carefully tuned A.I., realistic pace and balance. [Konami]… Expand"
  },
  {
    "name": "Advance Wars",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/advance-wars",
    "publisher": "Nintendo",
    "release_date": "Sep  9 2001",
    "developers": [
      "Intelligent Systems"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-4 ",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Modern"
    ],
    "meta_score": 92,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/6/b21a9afc3d11ee04313d49d9890363c5-98.jpg",
    "descriptions": "The battle lines have been drawn, and an elite group of sly strategists are massing troops at your borders. You'll have to command ground, air and naval forces if you hope to survive the coming wars, and it won't be easy. With 114 maps to battle on and both Single-Pak and Multi-Pak linkThe battle lines have been drawn, and an elite group of sly strategists are massing troops at your borders. You'll have to command ground, air and naval forces if you hope to survive the coming wars, and it won't be easy. With 114 maps to battle on and both Single-Pak and Multi-Pak link modes, Advance Wars brings turn-based strategy to a depth never before seen on a handheld!… Expand"
  },
  {
    "name": "Vagrant Story",
    "details_link": "https://www.metacritic.com/game/playstation/vagrant-story",
    "publisher": "Square EA",
    "release_date": "May 15 2000",
    "developers": [
      "SquareSoft"
    ],
    "platforms": "PlayStation",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 92,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/2/4e0dd908bee16a52afabc754bb050782-98.jpg",
    "descriptions": "Relive an adventurous tale rich with agents, espionage, and conspiracies. Challenge deadly monsters and villains with your steel and magic. Clear your name by uncovering a sinister plot -- or perish in the attempt."
  },
  {
    "name": "What Remains of Edith Finch",
    "details_link": "https://www.metacritic.com/game/xbox-one/what-remains-of-edith-finch",
    "publisher": "Annapurna Interactive",
    "release_date": "Jul 19 2017",
    "developers": [
      "Giant Sparrow"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox Series X",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "First-Person"
    ],
    "meta_score": 92,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/2/87de43eaf2f4e07dff482aedd847676a-98.jpg",
    "descriptions": "What Remains of Edith Finch is a collection of short stories about a cursed family in Washington State."
  },
  {
    "name": "Team Fortress 2",
    "details_link": "https://www.metacritic.com/game/pc/team-fortress-2",
    "publisher": "Electronic Arts",
    "release_date": "Oct 10 2007",
    "developers": [
      "Valve Software"
    ],
    "platforms": "PC",
    "num_players": "Up to 32 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Tactical",
      "Modern"
    ],
    "meta_score": 92,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/6/43275793dfcefd238b98ee2d88939192-98.jpg",
    "descriptions": "Team Fortress 2 (TF2) is the sequel to the game that put class-based, multiplayer team warfare on the map. TF2 delivers new gametypes, a signature art style powered by Valve’s next generation animation technology, persistent player statistics, and more. Unlike other \"class-based\" games thatTeam Fortress 2 (TF2) is the sequel to the game that put class-based, multiplayer team warfare on the map. TF2 delivers new gametypes, a signature art style powered by Valve’s next generation animation technology, persistent player statistics, and more. Unlike other \"class-based\" games that offer a variety of combat classes only, Team Fortress 2 packs a wild variety of classes which provide a broad range of tactical abilities and personalities, and lend themselves to a variety of player skills. Play as the flame-throwing Pyro, the room clearing Heavy, or the Spy, a master of disguises. Other classes include: Scout, Sniper, Medic, Engineer, Demoman, or Soldier. TF2 features the most advanced graphics of any Source-based game released to date – and the most exciting class-based action ever created. [Valve]… Expand"
  },
  {
    "name": "System Shock 2",
    "details_link": "https://www.metacritic.com/game/pc/system-shock-2",
    "publisher": "Looking Glass Studios",
    "release_date": "Aug 11 1999",
    "developers": [
      "Looking Glass Studios",
      "Irrational Games"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Sci-Fi",
      "Sci-Fi",
      "Survival"
    ],
    "meta_score": 92,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/3/41829351f4d06d0cc356218ddbd8f99d-98.jpg",
    "descriptions": "Like System Shock 1, there will be persistent levels (i.e., drop an item on one level, and you could go back later to retrieve it), gameplay elements like logs, inventory, skills, persistent world, leaning, hacking, rpg elements, multiple weapons and enemies, and a compelling storyline.Like System Shock 1, there will be persistent levels (i.e., drop an item on one level, and you could go back later to retrieve it), gameplay elements like logs, inventory, skills, persistent world, leaning, hacking, rpg elements, multiple weapons and enemies, and a compelling storyline. Unlike most other first person shooters, the purpose of System Shock was not to kill everything in sight; nor was it a \"find the key to move onto the next level\" game. The plot was always present, but not so confining as in traditional shooters - there was almost always more than one task to accomplish. Levels were realistically designed and had logical reasons behind them. It is the principle of System Shock 2 to continue this game design. [sshock2.com]… Expand"
  },
  {
    "name": "Tom Clancy's Splinter Cell: Chaos Theory",
    "details_link": "https://www.metacritic.com/game/pc/tom-clancys-splinter-cell-chaos-theory",
    "publisher": "Ubisoft",
    "release_date": "Mar 28 2005",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "3DS",
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Modern",
      "General",
      "Modern"
    ],
    "meta_score": 92,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/2/b775d7f8b057751ca5cf185373d69095-98.jpg",
    "descriptions": "The year is 2008. Information Warfare has evolved into the most dangerous threat to global stability. You are Sam Fisher, Third Echelon's most skilled Splinter Cell operative. You are assigned to execute a hazardous series of operations to investigate and eliminate a new source ofThe year is 2008. Information Warfare has evolved into the most dangerous threat to global stability. You are Sam Fisher, Third Echelon's most skilled Splinter Cell operative. You are assigned to execute a hazardous series of operations to investigate and eliminate a new source of information attacks, originating in North Korea. To succeed, you will employ a host of unconventional counterintelligence activities to gather intel, disrupt enemy operations and neutralize adversary targets. As Information Warfare evolves, so must the Splinter Cell. You must penetrate deeper into hostile territory and operate undetected, closer to the enemy than ever before. At your disposal is a lethal array of tactics ranging from Combat Knife techniques, experimental prototype weapons skills, and more radical hand-to-hand techniques such as the Inverted Chokehold. Experience the thrill of acting as a lone operative fighting tomorrow's threats in the field, and of cooperating online with a partner to accomplish crucial missions. Die in action, and the free world dies with you. Never-before-seen graphics technology offers the best visuals ever to appear on any platform. Advanced physics engine allows rag doll physics, particle effects and perfect interaction with the environment. The most complete arsenal of weapons and gadgets, from the combat knife to experimental prototype combat systems. Totally open level design with multipaths and optional secondary objectives. [Ubisoft]… Expand"
  },
  {
    "name": "Final Fantasy XII",
    "details_link": "https://www.metacritic.com/game/playstation-2/final-fantasy-xii",
    "publisher": "Square Enix",
    "release_date": "Oct 31 2006",
    "developers": [
      "Square Enix"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 92,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/9/f31d130bdbaa3a0e1f74e744349fb34f-98.jpg",
    "descriptions": "The story takes place in a world called \"Ivalice,\" in an age when magic was commonplace and airships plied the skies - the Archadian Empire, seeking to strengthen its base of power, had been invading and subjugating its neighboring lands one by one- a fate which befell the small Kingdom ofThe story takes place in a world called \"Ivalice,\" in an age when magic was commonplace and airships plied the skies - the Archadian Empire, seeking to strengthen its base of power, had been invading and subjugating its neighboring lands one by one- a fate which befell the small Kingdom of Dalmasca. Archadia's invasion and the subsequent death of the Dalmascan king prompted the Princess Ashe, the sole surviving heir to the Dalmascan throne, to take up arms against the invaders. In her struggle to oust the occupying Archadian forces and restore freedom to her people, Ashe must watch as many of her allies pay the blood price for that freedom. Though tempted to abandon all hope in the face of the Empire's might, her determination keeps her from succumbing before what would seem to be inevitable defeat. Then she meets Vaan, an urchin from the Dalmascan capital of Rabanastre. Vaan dreams of one day becoming a sky pirate, escaping the Empire on his airship. Vaan, Ashe, Vaan's friend Penelo, the sky pirate Balthier, his partner Fran and many more are on an adventure through Ivalice that traces the mysteries behind the Archadian Empire's invasion. Bringing with it a wide array of new gameplay elements, Final Fantasy XII will change the way players think about the Final Fantasy series. Numerous possibilities abound within each scenario, allowing for a less linear, more unique experience for each player. The game also supports Dolby Pro Logic II both in-game and during movie sequences, immersing the player in the middle of the action. [Square Enix]… Expand"
  },
  {
    "name": "Undertale",
    "details_link": "https://www.metacritic.com/game/playstation-4/undertale",
    "publisher": "tobyfox",
    "release_date": "Aug 15 2017",
    "developers": [
      "tobyfox",
      "8-4"
    ],
    "platforms": [
      "PC",
      "PlayStation Vita",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 92,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/1/385b89f553f016616c5365cdc0f9b6f7-98.jpg",
    "descriptions": "Welcome to UNDERTALE. In this RPG, you control a human who falls underground into the world of monsters. Now you must find your way out... or stay trapped forever.\r ((Healthy Dog's Warning: Game contains imagery that may be harmful to players with photosensitive epilepsy or similarWelcome to UNDERTALE. In this RPG, you control a human who falls underground into the world of monsters. Now you must find your way out... or stay trapped forever.\r ((Healthy Dog's Warning: Game contains imagery that may be harmful to players with photosensitive epilepsy or similar condition.))\r features:\r *    Killing is unnecessary: negotiate out of danger using the unique battle system.\r*    Time your attacks for extra damage, then dodge enemy attacks in a style reminiscent of top-down shooters.\r*    Original art and soundtrack brimming with personality.\r*    Soulful, character-rich story with an emphasis on humor.\r*    Created mostly by one person.\r*    Become friends with all of the bosses!\r*    At least 5 dogs.\r*    You can date a skeleton.\r*    Hmmm... now there are 6 dogs...?\r*    Maybe you won't want to date the skeleton.\r*    I thought I found a 7th dog, but it was actually just the 3rd dog.\r*    If you play this game, can you count the dogs for me...? I'm not good at it.… Expand"
  },
  {
    "name": "Madden NFL 2003",
    "details_link": "https://www.metacritic.com/game/gamecube/madden-nfl-2003",
    "publisher": "EA Sports",
    "release_date": "Aug 12 2002",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 92,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/8/20796a237361cbca71ecace4b8c54e40-98.jpg",
    "descriptions": "The game of football just got more real with Madden NFL 2003.  This year's installment of the Madden NFL Football series features more depth, new animation, realistic player AI, and in-depth play modes.  Hop on John Madden's Cruiser Tour Bus and travel to all NFL cities to complete skilledThe game of football just got more real with Madden NFL 2003.  This year's installment of the Madden NFL Football series features more depth, new animation, realistic player AI, and in-depth play modes.  Hop on John Madden's Cruiser Tour Bus and travel to all NFL cities to complete skilled tasks in the all-new Mini-Camp mode.  The improved graphics and presentation now show sidearm QBs, gang-tackling, stand-still receiver catches, and more than 300 realistic player faces.  Madden NFL 2003 gives you more control than ever before, with faster game speed, a more finely tuned passing game, and independent audibles for defensive line, linebackers, and defensive backs.… Expand"
  },
  {
    "name": "The Witcher 3: Wild Hunt",
    "details_link": "https://www.metacritic.com/game/playstation-4/the-witcher-3-wild-hunt",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "May 19 2015",
    "developers": [
      "CD Projekt Red Studio"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action RPG",
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 92,
    "users_score": 9.2,
    "image": "https://static.metacritic.com/images/products/games/2/425471cad15e750c9d5c3c50e9604e38-98.jpg",
    "descriptions": "With the Empire attacking the Kingdoms of the North and the Wild Hunt, a cavalcade of ghastly riders,  breathing down your neck, the only way to survive is to fight back. As Geralt of Rivia, a master swordsman and monster hunter, leave none of your enemies standing. Explore a gigantic openWith the Empire attacking the Kingdoms of the North and the Wild Hunt, a cavalcade of ghastly riders,  breathing down your neck, the only way to survive is to fight back. As Geralt of Rivia, a master swordsman and monster hunter, leave none of your enemies standing. Explore a gigantic open world, slay beasts and decide the fates of whole communities with your actions, all in a genuine next generation format. Also known as \"The Witcher III: Wild Hunt\"… Expand"
  },
  {
    "name": "Super Mario World: Super Mario Advance 2",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/super-mario-world-super-mario-advance-2",
    "publisher": "Nintendo",
    "release_date": "Feb  9 2002",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Game Boy Advance",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 92,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/8/5f6feb85d196ccad9296f6a651fb42fa-98.jpg",
    "descriptions": "Mario hasn't even had a chance to savor his victory in the original Super Mario Advance, and already he's back for more in Super Mario World: Super Mario Advance 2.  This game is a re-creation of the Super NES classic Super Mario World, featuring every last secret exit and all 74 levels ofMario hasn't even had a chance to savor his victory in the original Super Mario Advance, and already he's back for more in Super Mario World: Super Mario Advance 2.  This game is a re-creation of the Super NES classic Super Mario World, featuring every last secret exit and all 74 levels of platform-jumping action.  Once again, Princess Peach has been kidnapped by the ever-diabolical Bowser, and Mario and Luigi set out on a massive adventure to rescue her.  As either Mario or Luigi, you'll solve puzzles, shoot fireballs, fly, and discover the hidden secrets in Dinosaur Island.… Expand"
  },
  {
    "name": "ESPN NFL 2K5",
    "details_link": "https://www.metacritic.com/game/xbox/espn-nfl-2k5",
    "publisher": "Sega",
    "release_date": "Jul 20 2004",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 92,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/5/d1c1dfb1e12db668cf20daca9ffd840e-98.jpg",
    "descriptions": "ESPN NFL 2K5 kicks off the football season with an improved ESPN presentation, a variety of player moves, and more. Now you can perform all-new moves during an entire season, while earning points to customize your crib with different items. The game also features new modes, including ESPNESPN NFL 2K5 kicks off the football season with an improved ESPN presentation, a variety of player moves, and more. Now you can perform all-new moves during an entire season, while earning points to customize your crib with different items. The game also features new modes, including ESPN 25th Anniversary mode, where you can play in classic NFL situations over the past 25 years. First-Person Football mode returns with new camera switching, improved audio, passing control options, and more.… Expand"
  },
  {
    "name": "Super Smash Bros. Melee",
    "details_link": "https://www.metacritic.com/game/gamecube/super-smash-bros-melee",
    "publisher": "Nintendo",
    "release_date": "Dec  2 2001",
    "developers": [
      "HAL Labs"
    ],
    "platforms": "GameCube",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 92,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/2/ce2253ae8ccda749432abce5bf9704fc-98.jpg",
    "descriptions": "Nintendo's all-star cast of combatants is back in Super Smash Bros. Melee, along with a new batch of brawlers ready to tear it up.  The sequel to Super Smash Bros. keeps the same basic premise: Characters duke it out in interactive environments, using special attacks and various items toNintendo's all-star cast of combatants is back in Super Smash Bros. Melee, along with a new batch of brawlers ready to tear it up.  The sequel to Super Smash Bros. keeps the same basic premise: Characters duke it out in interactive environments, using special attacks and various items to knock each other into the abyss.  Some new defensive techniques add an even deeper level of complexity to the combat.  In addition to traditional battle royale matches, players can select all-new ways to play like Coin mode and Tournament mode.… Expand"
  },
  {
    "name": "Madden NFL 2003",
    "details_link": "https://www.metacritic.com/game/xbox/madden-nfl-2003",
    "publisher": "EA Sports",
    "release_date": "Aug 12 2002",
    "developers": [
      "EA Tiburon"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 92,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/3/5999c1ea1c1a2b16d3312ae9e6344a49-98.jpg",
    "descriptions": "The game of football just got more real with Madden NFL 2003.  This year's installment of the Madden NFL Football series features more depth, new animation, realistic player AI, and in-depth play modes.  Hop on John Madden's Cruiser Tour Bus and travel to all NFL cities to complete skilledThe game of football just got more real with Madden NFL 2003.  This year's installment of the Madden NFL Football series features more depth, new animation, realistic player AI, and in-depth play modes.  Hop on John Madden's Cruiser Tour Bus and travel to all NFL cities to complete skilled tasks in the all-new Mini-Camp mode.  The improved graphics and presentation now show sidearm QBs, gang-tackling, stand-still receiver catches, and more than 300 realistic player faces.  Madden NFL 2003 gives you more control than ever before, with faster game speed, a more finely tuned passing game, and independent audibles for defensive line, linebackers, and defensive backs.… Expand"
  },
  {
    "name": "Virtua Tennis",
    "details_link": "https://www.metacritic.com/game/dreamcast/virtua-tennis",
    "publisher": "SegaSoft",
    "release_date": "Jun  8 2000",
    "developers": [
      "Hitmaker"
    ],
    "platforms": [
      "PC",
      "Dreamcast"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Tennis"
    ],
    "meta_score": 92,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/9/db284544b02195a66ffb2bd9adf19353-98.jpg",
    "descriptions": "Imagine how a tennis player feels when he enters the arena, the crowd is cheering, the atmosphere electric, the adrenaline rushes... Well now you can with Virtua Tennis, the most lifelike and playable tennis game ever! Play as one of eight licensed players and uncover the secret stars. AsImagine how a tennis player feels when he enters the arena, the crowd is cheering, the atmosphere electric, the adrenaline rushes... Well now you can with Virtua Tennis, the most lifelike and playable tennis game ever! Play as one of eight licensed players and uncover the secret stars. As well as the traditional arcade mode you can play in the exhibition mode, with 4 player action via doubles play. Once you're mastered these modes take on the world in the world circuit mode, with unique training games, different challenges and shops to buy clothing, equipment, stages and playing partners. Virtua Tennis - so realisitc you can almost taste the strawberries and cream.… Expand"
  },
  {
    "name": "Rome: Total War",
    "details_link": "https://www.metacritic.com/game/pc/rome-total-war",
    "publisher": "Activision",
    "release_date": "Sep 22 2004",
    "developers": [
      "Creative Assembly"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Real-Time",
      "Historic",
      "General",
      "Historic"
    ],
    "meta_score": 92,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/8/ad55d9788ea13dda7e5bb26cc91bebb5-98.jpg",
    "descriptions": "Rome: Total War is the next generation in epic strategy gaming from the critically acclaimed and award winning Total War brand. The aim of the game is to conquer, rule and manipulate the Roman Empire with the ultimate goal of being declared as the \"Imperator\" of Rome. Set in a time when theRome: Total War is the next generation in epic strategy gaming from the critically acclaimed and award winning Total War brand. The aim of the game is to conquer, rule and manipulate the Roman Empire with the ultimate goal of being declared as the \"Imperator\" of Rome. Set in a time when the mighty Roman Empire emerged to conquer the known world against powerful enemies; when gladiators fought to a bloody death in the Coliseum; when Spartacus defied the might of the empire; when Hannibal led his invincible army and his war elephants across the Alps to strike fear into the very heart of Rome itself; and when Julius Caesar finally smashed the Barbarian Gauls. This was a time of brutal confrontation between civilisation and barbarism, and of civil war as the ancient world's only superpower turned on itself. A completely new Total War engine uses innovative technology and groundbreaking design to bring the world of ancient Rome to life to deliver the biggest and most cinematic battles ever seen in a videogame. So the battles in Rome: Total War maintain the epic scale that fans of Total War are used to, but now use high-detailed 3D polygonal troops and allows huge cities to be displayed on the battlefields. The result is truly spectacular. [Activision]… Expand"
  },
  {
    "name": "Forza Motorsport 3",
    "details_link": "https://www.metacritic.com/game/xbox-360/forza-motorsport-3",
    "publisher": "Microsoft Game Studios",
    "release_date": "Oct 27 2009",
    "developers": [
      "Turn 10"
    ],
    "platforms": "Xbox 360",
    "num_players": "Up to 8 ",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "GT / Street",
      "GT / Street",
      "Automobile"
    ],
    "meta_score": 92,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/4/7a32661fe419a5c83118a3080732ee5a-98.jpg",
    "descriptions": "Whether it's an exotic sports car like the new Audi R8 V10, a classic American muscle car such as the Ford GT, or a hot Asian import such as the Nissan 370Z, everyone has a dream car. The game makes it possible for everyone to experience the thrill of owning the world's most exotic andWhether it's an exotic sports car like the new Audi R8 V10, a classic American muscle car such as the Ford GT, or a hot Asian import such as the Nissan 370Z, everyone has a dream car. The game makes it possible for everyone to experience the thrill of owning the world's most exotic and exquisite cars. Live the most realistic racing experience ever as you take the wheel of more than 400 of the most-beloved cars on over 100 renowned real-world tracks and exotic road courses from around the globe. With breathtaking HD graphics and the most advanced vehicle performance modeling in a video game, Forza Motorsport 3 includes a host of driving assists and adjustable skill levels to make the game a gripping pick-up-and-play experience for audiences of all ages and skill levels. [Microsoft]… Expand"
  },
  {
    "name": "Demon's Souls",
    "details_link": "https://www.metacritic.com/game/playstation-5/demons-souls",
    "publisher": "Sony Interactive Entertainment",
    "release_date": "Nov 11 2020",
    "developers": [
      "JapanStudio",
      "Bluepoint Games"
    ],
    "platforms": "PlayStation 5",
    "num_players": "Up to 6 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 92,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/7/1aa54a2d35e13b422ee8fcc40c1126fd-98.jpg",
    "descriptions": "From PlayStation Studios and Bluepoint Games comes a remake of the PlayStation classic, Demon’s Souls. Entirely rebuilt from the ground up and masterfully enhanced, this remake introduces the horrors of a fog-laden, dark fantasy land to a whole new generation of gamers. Those who’ve facedFrom PlayStation Studios and Bluepoint Games comes a remake of the PlayStation classic, Demon’s Souls. Entirely rebuilt from the ground up and masterfully enhanced, this remake introduces the horrors of a fog-laden, dark fantasy land to a whole new generation of gamers. Those who’ve faced its trials and tribulations before, can once again challenge the darkness in stunning visual quality and incredible performance. In his quest for power, the 12th King of Boletaria, King Allant channelled the ancient Soul Arts, awakening a demon from the dawn of time itself, The Old One. With the summoning of The Old One, a colorless fog swept across the land, unleashing nightmarish creatures that hungered for human souls. Those whose souls were stripped from them, lost their minds – left only with the desire to attack the sane that remained. Now, Boletaria is cut off from the outside world, and the knights who dare penetrate the deep fog to free the land from its plight, are never seen again. As a lone warrior who has braved the baneful fog, you must face the hardest of challenges to earn the title “Slayer of Demons” and send The Old One back to its slumber.… Expand"
  },
  {
    "name": "Okami HD",
    "details_link": "https://www.metacritic.com/game/pc/okami-hd",
    "publisher": "Capcom",
    "release_date": "Dec 12 2017",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 92,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/8/83687c09b1a6c87ad1b258d6c91c3a98-98.jpg",
    "descriptions": "In Okami, the player takes the role of the mythical sun goddess Amaterasu, in the form of a wolf. Her task is to restore color (or 'life') to the world by destroying the monsters who have stolen it. Since Amaterasu is a diety, there are naturally people who worship her and people who don't.In Okami, the player takes the role of the mythical sun goddess Amaterasu, in the form of a wolf. Her task is to restore color (or 'life') to the world by destroying the monsters who have stolen it. Since Amaterasu is a diety, there are naturally people who worship her and people who don't. The more people who worship her (as a result of her restoring color and doing other good deeds for them), the more powerful she becomes.… Expand"
  },
  {
    "name": "Undertale",
    "details_link": "https://www.metacritic.com/game/pc/undertale",
    "publisher": "tobyfox",
    "release_date": "Sep 15 2015",
    "developers": [
      "tobyfox"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "General",
      "Japanese-Style"
    ],
    "meta_score": 92,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/3/abeb761486bf180fe9ed3ab6c6a2d793-98.jpg",
    "descriptions": "Welcome to UNDERTALE. In this RPG, you control a human who falls underground into the world of monsters. Now you must find your way out... or stay trapped forever."
  },
  {
    "name": "Batman: Arkham Asylum",
    "details_link": "https://www.metacritic.com/game/xbox-360/batman-arkham-asylum",
    "publisher": "Eidos Interactive",
    "release_date": "Aug 25 2009",
    "developers": [
      "Rocksteady Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 92,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/3/65594c9202cc0696a7aebf636d91cdc4-98.jpg",
    "descriptions": "In Batman: Arkham Asylum, the player assumes the role of Batman as he delivers The Joker to Arkham Asylum. There, the imprisoned super-villains have set a trap and an immersive combat gaming experience unfolds. With an original script penned by Emmy Award-winning Batman writer Paul Dini, theIn Batman: Arkham Asylum, the player assumes the role of Batman as he delivers The Joker to Arkham Asylum. There, the imprisoned super-villains have set a trap and an immersive combat gaming experience unfolds. With an original script penned by Emmy Award-winning Batman writer Paul Dini, the game brings the universe of DC Comics' detective to life with stunning graphics. Batman: Arkham Asylum offers players the chance to battle Gotham's worst villains with Batman's physical and psychological strength in a graphically distinct and story-driven game. [Eidos Interactive]… Expand"
  },
  {
    "name": "Super Mario Sunshine",
    "details_link": "https://www.metacritic.com/game/gamecube/super-mario-sunshine",
    "publisher": "Nintendo",
    "release_date": "Aug 25 2002",
    "developers": [
      "Nintendo"
    ],
    "platforms": "GameCube",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 92,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/3/2301cd42a12f22abc02386f4db6be4b2-98.jpg",
    "descriptions": "When Mario, Peach, and an entourage of Peach's loyal Toad friends set out for a tropical vacation on lovely Isle Delfino, they're in store for much more than a relaxing holiday. A mustachioed maniac has mucked up the entire island, and Mario is accused of committing the crime. Armed with aWhen Mario, Peach, and an entourage of Peach's loyal Toad friends set out for a tropical vacation on lovely Isle Delfino, they're in store for much more than a relaxing holiday. A mustachioed maniac has mucked up the entire island, and Mario is accused of committing the crime. Armed with a hi-tech water cannon called FLUDD (Flash Liquidizer Ultra Dousing Device), Mario sets out to clean the island, clear his name, and solve the mystery of the villainous vandal. With new enemies, moves, and surprises, Super Mario Sunshine offers plenty of challenges. … Expand"
  },
  {
    "name": "SSX 3",
    "details_link": "https://www.metacritic.com/game/xbox/ssx-3",
    "publisher": "EA Sports Big",
    "release_date": "Oct 20 2003",
    "developers": [
      "EA Canada"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox 360",
      "Xbox"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Alternative",
      "Snowboarding"
    ],
    "meta_score": 92,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/8/2f561ef4197cd3cb8634e3210754bc85-98.jpg",
    "descriptions": "Drop in and conquer the massive, living mountain rife with ego-crushing challenges and gravity-bending thrills.  SSX 3 returns with more slopes and all-new hazards to overcome including lightning storms, vertical drops, serpentine slopestyle courses and avalanches.  Customize your rider'sDrop in and conquer the massive, living mountain rife with ego-crushing challenges and gravity-bending thrills.  SSX 3 returns with more slopes and all-new hazards to overcome including lightning storms, vertical drops, serpentine slopestyle courses and avalanches.  Customize your rider's clothes, abilities, and moves.  Pull off three levels of awesome \"Uber tricks.\" Dominate the mountain, and then test your skills online.  It's a long way down, so make sure you're ready for the challenge.… Expand"
  },
  {
    "name": "SoulCalibur II",
    "details_link": "https://www.metacritic.com/game/xbox/soulcalibur-ii",
    "publisher": "Namco",
    "release_date": "Aug 27 2003",
    "developers": [
      "Namco"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 92,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/98w-game.jpg",
    "descriptions": "Open the next chapter in world of Soul Calibur.  Soul Calibur II features seven distinctive gameplay modes including: Arcade, Versus, Time Attack, Survival, Team Battle, Practice, and the console exclusive Weapon Master.  Collect up to 200 different weapons and battle characters with theirOpen the next chapter in world of Soul Calibur.  Soul Calibur II features seven distinctive gameplay modes including: Arcade, Versus, Time Attack, Survival, Team Battle, Practice, and the console exclusive Weapon Master.  Collect up to 200 different weapons and battle characters with their own styles, strengths, and abilities.  In addition to the 13 fighters, each platform has unique special fighters:  Link for GameCube, Heihachi for PS2, and Spawn for Xbox.  Prove yourself through soul and sword.… Expand"
  },
  {
    "name": "Tony Hawk's Pro Skater",
    "details_link": "https://www.metacritic.com/game/playstation/tony-hawks-pro-skater",
    "publisher": "Activision",
    "release_date": "Aug 31 1999",
    "developers": [
      "Neversoft Entertainment"
    ],
    "platforms": "PlayStation",
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Alternative",
      "Skateboarding"
    ],
    "meta_score": 92,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/8/059013a8a670e5095a3aed3578525c22-98.jpg",
    "descriptions": "Skate as legendary Tony Hawk, or as one of nine top pros. Work your way up the ranks by landing suicidal tricks in brutal competitions to become the highest-ranked skate champ."
  },
  {
    "name": "Thief: The Dark Project",
    "details_link": "https://www.metacritic.com/game/pc/thief-the-dark-project",
    "publisher": "Eidos Interactive",
    "release_date": "Nov 30 1998",
    "developers": [
      "Looking Glass Studios"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 92,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/8/5ad714bbb546e18712d102ff186a860c-98.jpg",
    "descriptions": "Sneak through the shadows of 12 treacherous missions including haunted cathedrals, subterranean ruins, and forbidding prisons, in a dark and sinister city. Stalk your prey on the quest for stolen goods with your blackjack, sword and an assortment of unique arrows. Steal for money and uncoverSneak through the shadows of 12 treacherous missions including haunted cathedrals, subterranean ruins, and forbidding prisons, in a dark and sinister city. Stalk your prey on the quest for stolen goods with your blackjack, sword and an assortment of unique arrows. Steal for money and uncover the hidden agendas of your allies and enemies as you play through an unravelling story of deception and revenge. Survive in a world where shadows are your only ally, trust is not an option, and confrontation results in death! [Eidos Interactive]… Expand"
  },
  {
    "name": "Fire Emblem: Awakening",
    "details_link": "https://www.metacritic.com/game/3ds/fire-emblem-awakening",
    "publisher": "Nintendo",
    "release_date": "Feb  4 2013",
    "developers": [
      "Intelligent Systems"
    ],
    "platforms": "3DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Fantasy",
      "Fantasy",
      "Tactics"
    ],
    "meta_score": 92,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/7/28f99406a0bd02b1eabe932b08e70fca-98.jpg",
    "descriptions": "Lead an army of soldiers in a series of scaled turn-based strategy battles. In the process, develop relationships with your team, utilizing their special abilities on the battlefield to gain victory and advance the story, which features a wide array of characters from a variety of nationsLead an army of soldiers in a series of scaled turn-based strategy battles. In the process, develop relationships with your team, utilizing their special abilities on the battlefield to gain victory and advance the story, which features a wide array of characters from a variety of nations and backgrounds. They can be joined by a character of your making, with a unique appearance crafted as you see fit.… Expand"
  },
  {
    "name": "Cuphead in the Delicious Last Course",
    "details_link": "https://www.metacritic.com/game/xbox-one/cuphead-in-the-delicious-last-course",
    "publisher": "Studio MDHR",
    "release_date": "Jun 30 2022",
    "developers": [
      "Studio MDHR"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 92,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/9/0fbf98cef1de3c34457ba3689e5cce5c-98.jpg",
    "descriptions": "Another helping of classic Cuphead action awaits you in Cuphead - The Delicious Last Course! Brothers Cuphead and Mugman are joined by the clever, adventurous Ms. Chalice for a rollicking adventure on a previously undiscovered Inkwell Isle! With the aid of new weapons, magical charms, andAnother helping of classic Cuphead action awaits you in Cuphead - The Delicious Last Course! Brothers Cuphead and Mugman are joined by the clever, adventurous Ms. Chalice for a rollicking adventure on a previously undiscovered Inkwell Isle! With the aid of new weapons, magical charms, and Ms. Chalice’s unique abilities, players will take on a new cast of fearsome, larger than life bosses to assist the jolly Chef Saltbaker in Cuphead’s final challenging quest! … Expand"
  },
  {
    "name": "Age of Empires II: The Age of Kings",
    "details_link": "https://www.metacritic.com/game/pc/age-of-empires-ii-the-age-of-kings",
    "publisher": "Microsoft Game Studios",
    "release_date": "Sep 30 1999",
    "developers": [
      "Ensemble Studios"
    ],
    "platforms": "PC",
    "num_players": "Up to 8 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Historic",
      "Historic",
      "Command"
    ],
    "meta_score": 92,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/9/53abcfcadb6f434b568c2796266719c1-98.jpg",
    "descriptions": "Age of Empires II: The Age of Kings is the sequel to the award-winning, best-selling real-time strategy game \"Age of Empires.\" Age of Empires II spans a thousand years, from the fall of Rome through the Middle Ages in which players lead one of 13 civilizations into greatness. The game keepsAge of Empires II: The Age of Kings is the sequel to the award-winning, best-selling real-time strategy game \"Age of Empires.\" Age of Empires II spans a thousand years, from the fall of Rome through the Middle Ages in which players lead one of 13 civilizations into greatness. The game keeps the epic scope of Age of Empires' game play while evolving the combat and economic features. [Microsoft]… Expand"
  },
  {
    "name": "Final Fantasy X",
    "details_link": "https://www.metacritic.com/game/playstation-2/final-fantasy-x",
    "publisher": "Square EA",
    "release_date": "Dec 17 2001",
    "developers": [
      "SquareSoft"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 92,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/5/b7f26182e71fdd691cd0801827cf0180-98.jpg",
    "descriptions": "Final Fantasy's first game on the Playstation 2 is the first to use voice acting and a massive leap in the cinematic approach to storytelling.  Stop reading and go play."
  },
  {
    "name": "Prince of Persia: The Sands of Time",
    "details_link": "https://www.metacritic.com/game/gamecube/prince-of-persia-the-sands-of-time",
    "publisher": "Ubisoft",
    "release_date": "Nov 18 2003",
    "developers": [
      "Ubisoft"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "PlayStation 3",
      "GameCube"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 92,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/3/17e4c9bab649a643f2651e9280948ec1-98.jpg",
    "descriptions": "Embark on a journey of scorched sands and ancient legends.  A young prince, drawn to the dark powers of a magic dagger, unleashes a deadly evil upon a beautiful kingdom.  Guide the Prince on his quest to reverse the curse by using the Sands of Time, a power which allows you to erase theEmbark on a journey of scorched sands and ancient legends.  A young prince, drawn to the dark powers of a magic dagger, unleashes a deadly evil upon a beautiful kingdom.  Guide the Prince on his quest to reverse the curse by using the Sands of Time, a power which allows you to erase the past, see into the future and slow down the present.  Perform gravity-defying acrobatics and swashbuckling attacks in a staggering array of landscapes and kingdoms.  Restore peace to the land and fulfill your destiny.… Expand"
  },
  {
    "name": "The Walking Dead: A Telltale Games Series",
    "details_link": "https://www.metacritic.com/game/xbox-360/the-walking-dead-a-telltale-games-series",
    "publisher": "Telltale Games",
    "release_date": "Apr 27 2012",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Switch",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Adventure",
      "Compilation",
      "Compilation",
      "Point-and-Click"
    ],
    "meta_score": 92,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/2/50857d4bd9642be8b4a0581e29bc47c8-98.jpg",
    "descriptions": "Based on Robert Kirkman's award-winning comic book series, The Walking Dead is about a world devastated by an undead apocalypse and the horrifying choices you're forced to make to survive. Assume the role of Lee Everett, a convicted criminal, who has been given a second chance at life in aBased on Robert Kirkman's award-winning comic book series, The Walking Dead is about a world devastated by an undead apocalypse and the horrifying choices you're forced to make to survive. Assume the role of Lee Everett, a convicted criminal, who has been given a second chance at life in a world devastated by the undead. With corpses returning to life and survivors stopping at nothing to maintain their own safety, protecting an orphaned girl named Clementine may offer you redemption in a world gone to hell.… Expand"
  },
  {
    "name": "Unreal Tournament (1999)",
    "details_link": "https://www.metacritic.com/game/pc/unreal-tournament-1999",
    "publisher": "GT Interactive",
    "release_date": "Nov 30 1999",
    "developers": [
      "Epic Games"
    ],
    "platforms": "PC",
    "num_players": "1-32 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 92,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/7/357f319f140dffaa47e3750dda02411e-98.jpg",
    "descriptions": "The stakes are high. On the one hand, fame, fortune, glory; on the other hand, death. Prove your skill in the arenas of the future, leading your team of computer-controlled \"bots\" to victory in the Grand Tournament, or compete with the best of the best via LAN or the Internet inThe stakes are high. On the one hand, fame, fortune, glory; on the other hand, death. Prove your skill in the arenas of the future, leading your team of computer-controlled \"bots\" to victory in the Grand Tournament, or compete with the best of the best via LAN or the Internet in seat-of-your-pants battles. While Unreal Tournament offers the finest in classic \"Deathmatch\" play, right out of the box you can compete in Team Deathmatch or Capture the Flag. Control strategic points on the map to rack up your score in Domination, or test your skills in Assault, as one team defends its base from the other. Each game type comes with its own special maps and rules, for never-ending variety and challenge. Add gameplay mutators such as Jump Match or InstaGib, and Unreal Tournament will keep your wits honed to a razor edge. [Infogrames]… Expand"
  },
  {
    "name": "Sid Meier's Alpha Centauri",
    "details_link": "https://www.metacritic.com/game/pc/sid-meiers-alpha-centauri",
    "publisher": "Electronic Arts",
    "release_date": "Feb 12 1999",
    "developers": [
      "Firaxis Games"
    ],
    "platforms": "PC",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Sci-Fi",
      "Sci-Fi",
      "4X"
    ],
    "meta_score": 92,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/5/a03b34d6914545e009e220641c077282-98.jpg",
    "descriptions": "Legendary designer Sid Meier presents the next evolution in strategy games, with the most addictive, compelling gameplay yet. Explore the alien planet that is your new home and uncover its myriad mysteries. Discover over 75 extraordinary technologies. Build over 60 base upgrades andLegendary designer Sid Meier presents the next evolution in strategy games, with the most addictive, compelling gameplay yet. Explore the alien planet that is your new home and uncover its myriad mysteries. Discover over 75 extraordinary technologies. Build over 60 base upgrades and large-scale secret projects for your empire. Conquer your enemies with a war machine that you design from over 32,000 possible unit types. [Firaxis]… Expand"
  },
  {
    "name": "Wave Race 64",
    "details_link": "https://www.metacritic.com/game/nintendo-64/wave-race-64",
    "publisher": "Nintendo",
    "release_date": "Nov  1 1996",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Nintendo 64",
    "num_players": "1-2 ",
    "genres": [
      "Driving",
      "Racing",
      "Snow / Water"
    ],
    "meta_score": 92,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/1/b0d2364f763465350130cb716a94e0a1-98.jpg",
    "descriptions": "Wave Race 64 is sure to provide some of the most exciting racing you've ever experienced. Feel the pounding and crashing of the waves as you accelerate into straight-aways, whip around the marker buoys and go airborne on the jump ramps. Don't race alone - challenge a friend! Take control inWave Race 64 is sure to provide some of the most exciting racing you've ever experienced. Feel the pounding and crashing of the waves as you accelerate into straight-aways, whip around the marker buoys and go airborne on the jump ramps. Don't race alone - challenge a friend! Take control in three different modes of play - Championship, Time Trials and Stunt Mode. Nine challenging courses set in exotic locales - race conditions change and the wave action responds to the way both you and your opponents race!… Expand"
  },
  {
    "name": "Divinity: Original Sin II - Definitive Edition",
    "details_link": "https://www.metacritic.com/game/playstation-4/divinity-original-sin-ii---definitive-edition",
    "publisher": "Larian Studios Games",
    "release_date": "Aug 31 2018",
    "developers": [
      "Larian Studios Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Role-Playing",
      "Western-Style"
    ],
    "meta_score": 92,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/2/9a871bea6579f599afb60a8843ff7f52-98.jpg",
    "descriptions": "Set a thousand years after the first game, Divinity: Original Sin II presents a darker, more grounded narrative and expands on the tactical combat system of its award-winning predecessor. In Divinity: Original Sin, you were on a quest for the forbidden Source magic. Now, you yourself are aSet a thousand years after the first game, Divinity: Original Sin II presents a darker, more grounded narrative and expands on the tactical combat system of its award-winning predecessor. In Divinity: Original Sin, you were on a quest for the forbidden Source magic. Now, you yourself are a Sourcerer: a dangerously powerful individual whose abilities summon creatures from the encroaching Void. The Divine is dead and the Void is everywhere. Sourcerers are blamed and the Divine Order is leading the charge against the threat: you. Captured and sent to Fort Joy, you will be \"cured\" of your powers -- no matter the cost. But the Order has secrets of its own that may cast doubt on its so-called holy mission. As you escape from Fort Joy, you realize that if the world remains godless, it will be consumed by the Void.… Expand"
  },
  {
    "name": "Galactic Civilizations II: Twilight of the Arnor",
    "details_link": "https://www.metacritic.com/game/pc/galactic-civilizations-ii-twilight-of-the-arnor",
    "publisher": "Stardock",
    "release_date": "Apr 30 2008",
    "developers": [
      "Stardock"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Sci-Fi",
      "Sci-Fi",
      "4X"
    ],
    "meta_score": 92,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/5/2237ad0c25e6f081fa3fcbd5260c101b-98.jpg",
    "descriptions": "The galaxy is being consumed by the fires of war as we enter the final act of the Dread Lord saga. Galactic Civilizations II: Twilight of the Arnor is the second  expansion pack to the award-winning PC strategy game, Galactic Civilizations II. Galactic Civilizations II: Twilight of the ArnorThe galaxy is being consumed by the fires of war as we enter the final act of the Dread Lord saga. Galactic Civilizations II: Twilight of the Arnor is the second  expansion pack to the award-winning PC strategy game, Galactic Civilizations II. Galactic Civilizations II: Twilight of the Arnor expands the gameplay of Galactic Civilizations in all new ways. New campaign detailing the final chapter in the Dread Lords wars. The Terror Star arrives, capable of destroying any star. Unique technology trees for all 12 civilizations. Unique planetary improvements for each civilization. New 3D engine powered map editor. New Scenario Editor for creating highly detailed custom games. New Campaign Editor for players who want to create their own custom epic campaigns for themselves or to share with others. New Metaverse Tournaments: Specific maps & scenarios recorded to the Metaverse with prizes for top players. [Stardock]… Expand"
  },
  {
    "name": "Super Smash Bros. for Wii U",
    "details_link": "https://www.metacritic.com/game/wii-u/super-smash-bros-for-wii-u",
    "publisher": "Nintendo",
    "release_date": "Nov 21 2014",
    "developers": [
      "Bandai Namco Games"
    ],
    "platforms": [
      "3DS",
      "Wii U"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "3D",
      "2D",
      "2D",
      "3D"
    ],
    "meta_score": 92,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/2/16c5274896a7b7bebc8705b51bb427dc-98.jpg",
    "descriptions": "Duke it out with your favorite Nintendo characters in Super Smash Bros. for the Nintendo Wii U."
  },
  {
    "name": "Guitar Hero II",
    "details_link": "https://www.metacritic.com/game/playstation-2/guitar-hero-ii",
    "publisher": "RedOctane",
    "release_date": "Nov  7 2006",
    "developers": [
      "Harmonix Music Systems"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 2"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Rhythm",
      "Music"
    ],
    "meta_score": 92,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/5/0dfdae77ce80f04923f504d385c1885f-98.jpg",
    "descriptions": "Rock the Rhythm, Lead, and Bass Guitar tracks in the follow-up sequel to \"Guitar Hero.\" Form your guitar duo and shred riffs cooperatively or go head to head in all new multiplayer modes. With over 55 tracks to rock out to, you'll go from Guitar Hero to Guitar god in one press of a fretRock the Rhythm, Lead, and Bass Guitar tracks in the follow-up sequel to \"Guitar Hero.\" Form your guitar duo and shred riffs cooperatively or go head to head in all new multiplayer modes. With over 55 tracks to rock out to, you'll go from Guitar Hero to Guitar god in one press of a fret button. Choose from multiple rock characters and jam at concert venues that grow in size as your rock career progresses. You'll start your rock career playing small clubs and bars, but if you play well you'll work your way up to stadiums and arenas. Guitar Hero II takes the guitar rock experience to new volumes by allowing players to play 3 different guitar tracks: Rhythm, Bass, and Lead. Guitar Hero II introduces all new multiplayer modes like: cooperative, pro-face off, and face off, letting 2 Guitar Heroes conduct their own symphonies of destruction. Shred School: Guitar Hero II features an all new practice mode, allowing Guitar Zeroes to become Guitar Heroes with enough practice. [RedOctane]… Expand"
  },
  {
    "name": "Final Fantasy VII",
    "details_link": "https://www.metacritic.com/game/playstation/final-fantasy-vii",
    "publisher": "SCEA",
    "release_date": "Sep  3 1997",
    "developers": [
      "SquareSoft"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PlayStation"
    ],
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 92,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/0/2284e7dc83a75d99f0c6f874a29cbcd2-98.jpg",
    "descriptions": "An epic adventure across 3 cd-roms. What begins as a rebellion against an evil corporation becomes much more. And what erupts goes beyond imagination. With vivid landscapes, lush 3D animation and environments, Square Soft's multi-million dollar masterpiece is like nothing ever seen before."
  },
  {
    "name": "Rock Band",
    "details_link": "https://www.metacritic.com/game/playstation-3/rock-band",
    "publisher": "Electronic Arts",
    "release_date": "Nov 20 2007",
    "developers": [
      "Harmonix Music Systems"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 2",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "4  Online",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 92,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/9/f59a165783e6c9b9a2dbb186ed1a4fe5-98.jpg",
    "descriptions": "Play together in your living room or across the world! Rock Band offers deep online functionality, allowing players to rock together whether they’re in Rhode Island or Reykjavik. Major record labels and leading music publishers have signed on to provide unrivaled access to master recordingsPlay together in your living room or across the world! Rock Band offers deep online functionality, allowing players to rock together whether they’re in Rhode Island or Reykjavik. Major record labels and leading music publishers have signed on to provide unrivaled access to master recordings and legendary rock artists – from punk, metal and alternative to classic and southern rock. Rock Band ships with 45 fearsome tracks from artists like Bon Jovi and The Ramones to Black Sabbath and Stone Temple Pilots. Full support for downloadable content delivers never-ending challenges. New content will be available every week. Download full albums for play with Rock Band including the iconic rock album 'Who's Next' by The Who. Metallica has signed on to offer several tracks as digitally-distributed game levels for Rock Band as well as \"Enter Sandman\" for the Rock Band ship disc. Create your own rock avatar! Mold a unique rocker using Rock Band's character creator. Chose from gender, body shape, face, hair, clothes, tattoos and signature moves. Don't forget to pick your specialized rockin’ instrument. Drumming in the spotlight! Showcase a real drum solo with Rock Band's freestyle drum fill windows featured in each song. Break out your own rhythm and style as anything goes! Vocalists can bring the crowd to their feet during Rock Band’s freestyle vocal fill windows. Ad-lib your own words or shout to the crowd to raise the rock intensity of the performance. Band mates can fail out of a song for poor performance, but the band still plays on. Rescue your failing mate by busting out signature moves and blistering solos to wow the crowd with showmanship. Earn bonus points for your band during Rock Band’s Unison Phrase opportunities if everyone plays perfectly. [Harmonix]… Expand"
  },
  {
    "name": "Chrono Trigger",
    "details_link": "https://www.metacritic.com/game/ds/chrono-trigger",
    "publisher": "Square Enix",
    "release_date": "Nov 25 2008",
    "developers": [
      "TOSE"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "DS"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Console-style RPG",
      "Console-style RPG",
      "Japanese-Style"
    ],
    "meta_score": 92,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/1/18fb04116449897b794477cfabbc9b5c-98.jpg",
    "descriptions": "[Metacritic's 2008 DS Game of the Year] When a newly developed teleportation device malfunctions at the Millennial Fair, young Crono must travel through time to rescue his unfortunate companion from an intricate web of past and present perils. The swashbuckling adventure that ensues soon[Metacritic's 2008 DS Game of the Year] When a newly developed teleportation device malfunctions at the Millennial Fair, young Crono must travel through time to rescue his unfortunate companion from an intricate web of past and present perils. The swashbuckling adventure that ensues soon unveils an evil force set to destroy the world, triggering Crono's race against time to change the course of history and bring about a brighter future. Features an engaging and unparalleled storyline, leading to the discovery of multiple epic conclusions to a journey that transcends time. An inspiring musical score created by Yasunori Mitsuda. Intriguing battle system made possible by the unique combination of the Active Time Battle system and Tech skills. Famed character designer Akira Toriyama lends his signature art style to create the vibrant world that has captivated gamers around the world. Taking advantage of the Nintendo DS hardware, CHRONO TRIGGER makes its way onto the portable platform with all-new dual screen presentation and Touch-Screen functionality. A brand new dungeon and a Wireless Play mode adds exciting new dimensions to this timeless classic. [Square Enix]… Expand"
  },
  {
    "name": "Bayonetta 2",
    "details_link": "https://www.metacritic.com/game/switch/bayonetta-2",
    "publisher": "Nintendo",
    "release_date": "Feb 16 2018",
    "developers": [
      "Nintendo",
      "PlatinumGames"
    ],
    "platforms": [
      "Wii U",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Linear"
    ],
    "meta_score": 92,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/6/ac323c38bfe096a79b5982d595644731-98.jpg",
    "descriptions": "In this climatic sequel to the critically acclaimed Bayonetta action game, players will be on the edge of their seats from start to finish. Brimming with epic, gorgeous cut scenes and battles that are more exhilarating than ever, this game never lets up on the action. Fight on top of a jetIn this climatic sequel to the critically acclaimed Bayonetta action game, players will be on the edge of their seats from start to finish. Brimming with epic, gorgeous cut scenes and battles that are more exhilarating than ever, this game never lets up on the action. Fight on top of a jet as it soars through a downtown city. Duke it out against a giant angel, who bears a whip for an arm, on top of a speeding train. And take to the skies in a fight against a demonic monster while ascending to the top of a skyscraper.… Expand"
  },
  {
    "name": "Final Fantasy XIV: Endwalker",
    "details_link": "https://www.metacritic.com/game/pc/final-fantasy-xiv-endwalker",
    "publisher": "Square Enix",
    "release_date": "Dec  7 2021",
    "developers": [
      "Square Enix"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "PC"
    ],
    "genres": [
      "Role-Playing",
      "Massively Multiplayer"
    ],
    "meta_score": 92,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/5/95bd63f43928f86ed8872be385e94e82-98.jpg",
    "descriptions": "Endwalker is the fourth expansion pack for FINAL FANTASY XIV Online. Experience the climax of the Hydaelyn and Zodiark story, and encounter an even greater calamity than ever before as you travel to the far reaches of Hydaelyn and even to the moon."
  },
  {
    "name": "Journey",
    "details_link": "https://www.metacritic.com/game/playstation-3/journey",
    "publisher": "SCEA",
    "release_date": "Mar 13 2012",
    "developers": [
      "ThatGameCompany"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Adventure",
      "General",
      "Platformer",
      "Platformer",
      "3D",
      "3D"
    ],
    "meta_score": 92,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/2/f87c9b921ad2410e5d7d067555697a77-98.jpg",
    "descriptions": "Enter the world of Journey, the third game from indie developers thatgamecompany (creators of \"flOw\" and \"Flower\"). Journey is an interactive parable, an anonymous online adventure to experience a person’s life passage and their intersections with other’s. You wake alone and surrounded byEnter the world of Journey, the third game from indie developers thatgamecompany (creators of \"flOw\" and \"Flower\"). Journey is an interactive parable, an anonymous online adventure to experience a person’s life passage and their intersections with other’s. You wake alone and surrounded by miles of burning, sprawling desert, and soon discover the looming mountaintop which is your goal. Faced with rolling sand dunes, age-old ruins, caves and howling winds, your passage will not be an easy one. The goal is to get to the mountaintop, but the experience is discovering who you are, what this place is, and what is your purpose. Travel and explore this ancient, mysterious world alone, or with a stranger you meet along the way. Soar above ruins and glide across sands as you discover the secrets of a forgotten civilization. [thatgamecompany]… Expand"
  },
  {
    "name": "Xenoblade Chronicles",
    "details_link": "https://www.metacritic.com/game/wii/xenoblade-chronicles",
    "publisher": "Nintendo",
    "release_date": "Apr  6 2012",
    "developers": [
      "Monolith Soft"
    ],
    "platforms": [
      "3DS",
      "Wii"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Console-style RPG",
      "Action RPG"
    ],
    "meta_score": 92,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/0/50229636af5b08561069ca8a953a1cad-98.jpg",
    "descriptions": "Xenoblade Chronicles throws you into a universe bursting with imagination. Take hold of an ancient sword that offers glimpses of the future, customise your characters extensively and discover a world where your relationships with others matter."
  },
  {
    "name": "Conker's Bad Fur Day",
    "details_link": "https://www.metacritic.com/game/nintendo-64/conkers-bad-fur-day",
    "publisher": "Rare Ltd.",
    "release_date": "Mar  4 2001",
    "developers": [
      "Rare Ltd."
    ],
    "platforms": "Nintendo 64",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 92,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/4/b00858c98efd550238c03422664a2dea-98.jpg",
    "descriptions": "The day after his 21st birthday bash, Conker's sporting the worst hangover ever, and he just can't seem to find his way home. Prepare to stagger through randy, raunchy, raucous scenarios crammed full of bad manners, twisted humor, and graphic bodily functions. Unless you're a fan ofThe day after his 21st birthday bash, Conker's sporting the worst hangover ever, and he just can't seem to find his way home. Prepare to stagger through randy, raunchy, raucous scenarios crammed full of bad manners, twisted humor, and graphic bodily functions. Unless you're a fan of violence, foul language, and racy innuendo, you'd best steer clear of this one.… Expand"
  },
  {
    "name": "Medal of Honor",
    "details_link": "https://www.metacritic.com/game/playstation/medal-of-honor",
    "publisher": "Electronic Arts",
    "release_date": "Oct 31 1999",
    "developers": [
      "Dreamworks Interactive"
    ],
    "platforms": "PlayStation",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Historic"
    ],
    "meta_score": 92,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/8/0174c4ab5061bc82a1d7b692cb661e76-98.jpg",
    "descriptions": "Tomorrow is D-Day. Tonight you land behind enemy lines. The tide of the way is in your hands. You are an elite Special Forces agent sent to execute covert operations, search and rescue missions, and commando raids. Fight to win the medal of Honor in the only game that lets you take on Nazis in WWII."
  },
  {
    "name": "PaRappa the Rapper",
    "details_link": "https://www.metacritic.com/game/playstation/parappa-the-rapper",
    "publisher": "SCEA",
    "release_date": "Oct 31 1997",
    "developers": [
      "NanaOn-Sha"
    ],
    "platforms": "PlayStation",
    "num_players": "1 Player",
    "genres": [
      "Miscellaneous",
      "Rhythm",
      "Music"
    ],
    "meta_score": 92,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/8/ecc8ae7b5f3fa75945d7798eedc1c4de-98.jpg",
    "descriptions": "Help Parappa rap with the best of the master rappers and straight into Sunny's heart. Guaranteed you'll be singin' and dancin' along with Parappa and his pals to the most fun of mixes."
  },
  {
    "name": "Rock Band 2",
    "details_link": "https://www.metacritic.com/game/xbox-360/rock-band-2",
    "publisher": "MTV Games",
    "release_date": "Sep 14 2008",
    "developers": [
      "Harmonix Music Systems"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 92,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/8/ee041845c62b5fa4611e9a8da1103548-98.jpg",
    "descriptions": "Rock Band 2 builds upon its foundation as the first music game to introduce co-operative band gameplay, multiple instruments, a robust online multiplayer experience, an unrivaled offering of downloadable content and raises the bar by delivering an entirely new level of depth, connectivity,Rock Band 2 builds upon its foundation as the first music game to introduce co-operative band gameplay, multiple instruments, a robust online multiplayer experience, an unrivaled offering of downloadable content and raises the bar by delivering an entirely new level of depth, connectivity, authenticity and features including: Backwards compatibility with Rock Band downloadable music content. All previously purchased tracks immediately load into your Rock Band 2 song list. No need to re-purchase or re-download. The biggest and most diverse soundtrack ever featuring some of rock's most prolific acts, comprised entirely of master recordings. Major new and dynamic online modes that connect the entire Rock Band community in more ways than ever before both locally and globally. More variety of instrument choices than ever before with new and improved drum and guitar peripherals, enhanced functionality and innovative new designs - all fully compatible with the original Rock Band instruments. [MTV]… Expand"
  },
  {
    "name": "Mario Kart 8 Deluxe",
    "details_link": "https://www.metacritic.com/game/switch/mario-kart-8-deluxe",
    "publisher": "Nintendo",
    "release_date": "Apr 28 2017",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Switch",
    "num_players": "Up to 12 ",
    "genres": [
      "Other",
      "Racing",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 92,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/3/47645cf22467c563a70fca6c8930b5ba-98.jpg",
    "descriptions": "Race and battle your friends in the definitive version of Mario Kart 8. Hit the road with the definitive version of Mario Kart 8 and play anytime, anywhere! Race your friends or battle them in a revised battle mode on new and returning battle courses. Play locally in up to 4-playerRace and battle your friends in the definitive version of Mario Kart 8. Hit the road with the definitive version of Mario Kart 8 and play anytime, anywhere! Race your friends or battle them in a revised battle mode on new and returning battle courses. Play locally in up to 4-player multiplayer in 1080p while playing in TV Mode. Every track from the Wii U version, including DLC, makes a glorious return. Plus, the Inklings appear as all-new guest characters, along with returning favorites, such as King Boo, Dry Bones, and Bowser Jr. Race your friends in the definitive version of Mario Kart 8, only on Nintendo Switch. Race as every character on every track from the Wii U version, including DLC characters and tracks. Pop some balloons in the revamped Battle mode, complete with Balloon Battle and Bob-omb Blast. Battle on new courses, like Urchin Underpass and Battle Stadium, or returning ones, such as GCN Luigi's Mansion and SNES Battle Course 1. Inkling Girl & Inkling Boy from Splatoon, King Boo, Dry Bones, and Bowser Jr. join the roster. Players can choose a new Smart Steering feature which makes driving and staying on the track easy for novice players and kids even at 200cc. Three new vehicles have been added, two are even inspired by Splatoon. Carry two items at the same time. Returning items include Boo, the item stealing ghost, and the Feather, which gives you a high jump in battle mode. Play your friends in local wireless multiplayer with up to 8 players. Drive through in 1080p HD quality in TV mode. Play on the go with handheld mode and play anytime, anywhere.… Expand"
  },
  {
    "name": "The ICO & Shadow of the Colossus Collection",
    "details_link": "https://www.metacritic.com/game/playstation-3/the-ico-shadow-of-the-colossus-collection",
    "publisher": "SCEA",
    "release_date": "Sep 27 2011",
    "developers": [
      "Bluepoint Games"
    ],
    "platforms": "PlayStation 3",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Action Adventure",
      "Fantasy",
      "Compilation",
      "Compilation"
    ],
    "meta_score": 92,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/8/39d71f081d5125e4047472e3a3087d94-98.jpg",
    "descriptions": "This collection provides HD and 3D updates for PS2 classics Ico and Shadow of the Colossus."
  },
  {
    "name": "Rayman Origins",
    "details_link": "https://www.metacritic.com/game/wii/rayman-origins",
    "publisher": "Ubisoft",
    "release_date": "Nov 15 2011",
    "developers": [
      "UBlart Montpellier"
    ],
    "platforms": [
      "3DS",
      "PC",
      "PlayStation 3",
      "PlayStation Vita",
      "Xbox 360",
      "Wii"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Action Adventure",
      "Platformer",
      "Fantasy",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 92,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/4/c44ae3c0eda64bfd427cd6607b982eb7-98.jpg",
    "descriptions": "Rayman's new adventure is a two-dimensional cooperative platformer with a colorful, whimsical art style."
  },
  {
    "name": "Metroid Prime 2: Echoes",
    "details_link": "https://www.metacritic.com/game/gamecube/metroid-prime-2-echoes",
    "publisher": "Nintendo",
    "release_date": "Nov 15 2004",
    "developers": [
      "Retro Studios"
    ],
    "platforms": "GameCube",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 92,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/5/f35b394325a97880e1119abdb3040f29-98.jpg",
    "descriptions": "The sequel to Metroid Prime puts you in the role of bounty hunter Samus Aran once again. Your mission is to locate federation troopers who are missing on Aether--a planet torn into light and dark domains. To help you travel through the depths of light and dark, you'll have all-new beamThe sequel to Metroid Prime puts you in the role of bounty hunter Samus Aran once again. Your mission is to locate federation troopers who are missing on Aether--a planet torn into light and dark domains. To help you travel through the depths of light and dark, you'll have all-new beam weapons, a screw attack, and power-ups. Eliminate your enemies, solve puzzles, and open doors in an effort to restore peace to Aether. Metroid Prime 2: Echoes also features competitive multiplayer modes supporting up to four players. … Expand"
  },
  {
    "name": "Out of the Park Baseball 17",
    "details_link": "https://www.metacritic.com/game/pc/out-of-the-park-baseball-17",
    "publisher": "Out Of The Park Developments",
    "release_date": "Mar 22 2016",
    "developers": [
      "Out Of The Park Developments"
    ],
    "platforms": "PC",
    "genres": [
      "Sports",
      "Team",
      "Baseball",
      "Sim"
    ],
    "meta_score": 92,
    "users_score": 3.3,
    "image": "https://static.metacritic.com/images/products/games/9/b238df9640d72ce55102ef2d32cc9ca0-98.jpg",
    "descriptions": "Step into the shoes of a team owner, GM, and/or field manager to own the future or rewrite the past of your favorite real-world club. Start a new career with 2016 Opening Day rosters of the real major or minor leagues, or span through 150 years of history and run any club from the past!Step into the shoes of a team owner, GM, and/or field manager to own the future or rewrite the past of your favorite real-world club. Start a new career with 2016 Opening Day rosters of the real major or minor leagues, or span through 150 years of history and run any club from the past! Perform drafts, trades, scouting, waivers, team finances and personnel. Negotiate player contracts. Dive into the more hands-on management and set your team's lineups, pitching staffs, and in-game strategy. You can oversee your league at a high level, or play out each game, managing play by play or even pitch by pitch!… Expand"
  },
  {
    "name": "Metroid Fusion",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/metroid-fusion",
    "publisher": "Nintendo",
    "release_date": "Nov 17 2002",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Sci-Fi"
    ],
    "meta_score": 92,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/0/6fcefda39efcc83dfb720c95f29a25b9-98.jpg",
    "descriptions": "While lending mission support on planet SR388, interstellar bounty hunter Samus Aran is attacked by an X parasite, an organism with the ability to mimic the abilities of any creature it infects. Near death, Samus is saved by a vaccin made from the DNA of the last Metroid--the X parasite'sWhile lending mission support on planet SR388, interstellar bounty hunter Samus Aran is attacked by an X parasite, an organism with the ability to mimic the abilities of any creature it infects. Near death, Samus is saved by a vaccin made from the DNA of the last Metroid--the X parasite's only natural predator. When the X spread to a research station in orbit around SR388, a weakened Samurs is forced to exterminate them all...or die trying.… Expand"
  },
  {
    "name": "The Witcher 3: Wild Hunt - Blood and Wine",
    "details_link": "https://www.metacritic.com/game/pc/the-witcher-3-wild-hunt---blood-and-wine",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "May 30 2016",
    "developers": [
      "CD Projekt Red Studio"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 92,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/9/5d5a7a9179be279cd4026f1e2e46fea5-98.jpg",
    "descriptions": "This expansion pack is an old-school add on with 20 hours of new adventures, where players will travel to the land of Toussaint."
  },
  {
    "name": "Final Fantasy VI Advance",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/final-fantasy-vi-advance",
    "publisher": "Nintendo",
    "release_date": "Feb  5 2007",
    "developers": [
      "TOSE"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-2 ",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 92,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/4/851b036f01ceff4c3eb6f7ed3d3b6b68-98.jpg",
    "descriptions": "This title are more than a simple port of the SNES classic — every aspect of the games has been reviewed and enhanced. Additionally, a host of brand-new elements has been seamlessly merged with the original game, providing unexpected surprises for longtime fans. With new dungeons, newThis title are more than a simple port of the SNES classic — every aspect of the games has been reviewed and enhanced. Additionally, a host of brand-new elements has been seamlessly merged with the original game, providing unexpected surprises for longtime fans. With new dungeons, new job classes, and other exciting features, both old-school players and newcomers can enjoy this genre-defining FINAL FANTASY title in a portable format.… Expand"
  },
  {
    "name": "Rayman Legends",
    "details_link": "https://www.metacritic.com/game/wii-u/rayman-legends",
    "publisher": "Ubisoft",
    "release_date": "Sep  3 2013",
    "developers": [
      "Ubisoft Montpellier"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation Vita",
      "Stadia",
      "Xbox 360",
      "Xbox One",
      "Wii U"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 92,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/2/aeb2e45b1c99f4293195a84abaab0c04-98.jpg",
    "descriptions": "Rayman, Globox, and the Teensies are off wandering through an enchanted forest when they discover a mysterious tent filled with a series of captivating paintings. As they look more closely, they notice each painting seems to tell the story of a mythical world. While focusing on a paintingRayman, Globox, and the Teensies are off wandering through an enchanted forest when they discover a mysterious tent filled with a series of captivating paintings. As they look more closely, they notice each painting seems to tell the story of a mythical world. While focusing on a painting that shows a medieval land, they are suddenly sucked into the painting, entering the world, and the adventure begins. The gang must run, jump and fight their way through each world to save the day and discover the secrets of every legendary painting. Rayman Legends takes full advantage of the Wii U and its new GamePad’s capabilities. Use the touch screen to take out enemies, manipulate platforms, cut ropes to clear a path and much more. With the gyroscope technology, you can move rotating platform and there are many more surprises to come.… Expand"
  },
  {
    "name": "Dragon Quest XI S: Echoes of an Elusive Age - Definitive Edition",
    "details_link": "https://www.metacritic.com/game/xbox-one/dragon-quest-xi-s-echoes-of-an-elusive-age---definitive-edition",
    "publisher": "Square Enix",
    "release_date": "Dec  4 2020",
    "developers": [
      "Square Enix"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Stadia",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 92,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/9/1725e1443242215681efde81b68e293b-98.jpg",
    "descriptions": "The Definitive Edition includes all the content from the original release of the acclaimed DRAGON QUEST XI, and adds extra character-specific scenarios, the choice of playing with the original soundtrack or a grand orchestral version of the music, the ability to switch between 2D and 3DThe Definitive Edition includes all the content from the original release of the acclaimed DRAGON QUEST XI, and adds extra character-specific scenarios, the choice of playing with the original soundtrack or a grand orchestral version of the music, the ability to switch between 2D and 3D graphic modes, a Japanese voice-acting option, and much more. … Expand"
  },
  {
    "name": "Tiger Woods PGA Tour 2003",
    "details_link": "https://www.metacritic.com/game/pc/tiger-woods-pga-tour-2003",
    "publisher": "Electronic Arts",
    "release_date": "Nov  5 2002",
    "developers": [
      "Headgate"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Individual",
      "Golf",
      "Sim",
      "Sim"
    ],
    "meta_score": 92,
    "users_score": 5.0,
    "image": "https://static.metacritic.com/images/products/games/1/57208b2108584c00b71e2e81f098d962-98.jpg",
    "descriptions": "New course lineup: Twelve detailed courses include Pebble Beach Golf Links, TPC of Scottsdale and Torrey Pines South. New effects: Feel the sun, the wind, the fog and the grass as you walk 18. The most PGA TOUR pros: Play as or against Tiger Woods, Ty Tryon, Vijay Singh, Brad Faxon and manyNew course lineup: Twelve detailed courses include Pebble Beach Golf Links, TPC of Scottsdale and Torrey Pines South. New effects: Feel the sun, the wind, the fog and the grass as you walk 18. The most PGA TOUR pros: Play as or against Tiger Woods, Ty Tryon, Vijay Singh, Brad Faxon and many others. TrueSwing technology: Take full control over your swing, from straight drives to hooks and draws. Career mode: Purchase new equipment and lessons, hone your skills, and make your way to the top of the career rankings. [EA Sports]… Expand"
  },
  {
    "name": "Madden NFL 2005",
    "details_link": "https://www.metacritic.com/game/xbox/madden-nfl-2005",
    "publisher": "EA Sports",
    "release_date": "Aug  9 2004",
    "developers": [
      "EA Tiburon"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 91,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/4/74aad42c859e3e7a6341c3be7b495567-98.jpg",
    "descriptions": "Madden NFL 2005 introduces the Hit Stick, a new feature that lets players turn a game around with a crucial tackle. Along with all-new defensive preplay controls and defensive artificial intelligence enhancements, the defense now has a diverse arsenal of weapons available. Also, the depth ofMadden NFL 2005 introduces the Hit Stick, a new feature that lets players turn a game around with a crucial tackle. Along with all-new defensive preplay controls and defensive artificial intelligence enhancements, the defense now has a diverse arsenal of weapons available. Also, the depth of Franchise mode grows with the addition of Storyline Central, a weekly radio talk show that discusses current stories regarding your team and the league. With even more Franchise mode additions, hundreds of new animations, and the new Create-a-Fan feature, Madden NFL 2005 takes the series to the next level.… Expand"
  },
  {
    "name": "Super Street Fighter IV",
    "details_link": "https://www.metacritic.com/game/xbox-360/super-street-fighter-iv",
    "publisher": "Capcom",
    "release_date": "Apr 27 2010",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "3DS",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "3D",
      "2D",
      "3D"
    ],
    "meta_score": 91,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/5/f66a3c6efb08b11dfe4ff5767fac2c04-98.jpg",
    "descriptions": "The follow-up to Street Fighter IV further redefines the fighting game genre with classic 2D Street Fighter fighting action, a host of new and returning characters, more advanced online gameplay, new ultra combos and much more. Super Street Fighter IV features the full roster of 25The follow-up to Street Fighter IV further redefines the fighting game genre with classic 2D Street Fighter fighting action, a host of new and returning characters, more advanced online gameplay, new ultra combos and much more. Super Street Fighter IV features the full roster of 25 characters from Street Fighter IV such as Ryu, Ken, Crimson Viper, Abel, El Fuerte, and Rufus, while adding about eight characters new to the world of Street Fighter IV. The impressive new roster includes classic combatants from previous Street Fighter games like T. Hawk as well as all-new characters such as the mysterious and deadly female fighter, Juri. Super Street Fighter IV adds new Ultra Combos and advancements to the state of the art online matchmaking and online gameplay introduced in Street Fighter IV with numerous additional features. Super Street Fighter IV takes many of the groundbreaking features introduced in Street Fighter IV and refines everything to deliver the ultimate vision of Street Fighter to fans the world over. [Capcom]… Expand"
  },
  {
    "name": "Unavowed",
    "details_link": "https://www.metacritic.com/game/switch/unavowed",
    "publisher": "Wadjet Eye Games",
    "release_date": "Jul  7 2021",
    "developers": [
      "Wadjet Eye Games"
    ],
    "platforms": [
      "PC",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "General",
      "Adventure",
      "Point-and-Click"
    ],
    "meta_score": 91,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/0/2eb154327ff6788be50295248a039145-98.jpg",
    "descriptions": "Join the ranks of the Unavowed, and fight against the oncoming darkness.\r A demon possessed you one year ago. Since that day, you unwillingly tore a trail of bloodshed through New York City. Waking up on a stormy rooftop, you meet your saviors: the Unavowed, an ancient society dedicated toJoin the ranks of the Unavowed, and fight against the oncoming darkness.\r A demon possessed you one year ago. Since that day, you unwillingly tore a trail of bloodshed through New York City. Waking up on a stormy rooftop, you meet your saviors: the Unavowed, an ancient society dedicated to stopping evil. Life as you knew it is over, but by joining them you have a chance to reverse some of the damage you’ve done—and, if you choose wisely, to redeem yourself.\r Shape your hero: Name the playable character, choose their gender, and pick from three origin stories to customize the protagonist.\r Choose your party: Select two out of four companions to join you on missions across the boroughs of New York City. Each member of the Unavowed has a unique personality and skillset, providing different solutions to the obstacles you’ll encounter.\r Follow your conscience: Difficult choices await. In Unavowed’s subtly branching storyline, your decisions could come back to help you… or haunt you.\r Play how you want: Controls refined for Nintendo Switch™ allow you to play comfortably with either the Joy-Con™ controllers or the touch screen.… Expand"
  },
  {
    "name": "Pac-Man Championship Edition DX",
    "details_link": "https://www.metacritic.com/game/playstation-3/pac-man-championship-edition-dx",
    "publisher": "Namco Bandai Games",
    "release_date": "Nov 23 2010",
    "developers": [
      "Namco Bandai Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "Xbox 360",
      "PlayStation 3"
    ],
    "genres": [
      "Adventure",
      "General",
      "Action",
      "General",
      "General",
      "Arcade"
    ],
    "meta_score": 91,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/2/50793fa82314f2f937ba0625eaf1351f-98.jpg",
    "descriptions": "PAC-MAN Championship Edition DX continues to uphold NAMCO BANDAI's tradition of enhancing a classic franchise for today's gamer. Building upon PAC-MAN Championship Edition’s original six courses, the new game features more than 100 varied and mind-boggling mazes to navigate. Several newPAC-MAN Championship Edition DX continues to uphold NAMCO BANDAI's tradition of enhancing a classic franchise for today's gamer. Building upon PAC-MAN Championship Edition’s original six courses, the new game features more than 100 varied and mind-boggling mazes to navigate. Several new modes will also be available to test a player's pellet-munching aptitude. In Time Attack Mode, players will vie for the quickest clear time. Fulfill a series of objectives in Mission Mode or compete to devour the most number of ghosts gobbled in Ghost Mode. … Expand"
  },
  {
    "name": "Rock Band 2",
    "details_link": "https://www.metacritic.com/game/playstation-3/rock-band-2",
    "publisher": "MTV Games",
    "release_date": "Oct 19 2008",
    "developers": [
      "Harmonix Music Systems"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "4  Online",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 91,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/9/078d1b8cf44ad22a5d8213faabc6985f-98.jpg",
    "descriptions": "Rock Band 2 builds upon its foundation as the first music game to introduce co-operative band gameplay, multiple instruments, a robust online multiplayer experience, an unrivaled offering of downloadable content and raises the bar by delivering an entirely new level of depth, connectivity,Rock Band 2 builds upon its foundation as the first music game to introduce co-operative band gameplay, multiple instruments, a robust online multiplayer experience, an unrivaled offering of downloadable content and raises the bar by delivering an entirely new level of depth, connectivity, authenticity and features including: Backwards compatibility with Rock Band downloadable music content. All previously purchased tracks immediately load into your Rock Band 2 song list. No need to re-purchase or re-download. The biggest and most diverse soundtrack ever featuring some of rock's most prolific acts, comprised entirely of master recordings. Major new and dynamic online modes that connect the entire Rock Band community in more ways than ever before both locally and globally. More variety of instrument choices than ever before with new and improved drum and guitar peripherals, enhanced functionality and innovative new designs - all fully compatible with the original Rock Band instruments. [MTV]… Expand"
  },
  {
    "name": "Dark Souls II",
    "details_link": "https://www.metacritic.com/game/xbox-360/dark-souls-ii",
    "publisher": "Namco Bandai Games",
    "release_date": "Mar 11 2014",
    "developers": [
      "From Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action RPG",
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 91,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/3/b7f326b66df897c9e0e10c48d440f606-98.jpg",
    "descriptions": "Prepare to die... Again. Dare yourself to engage against intense gameplay in a vast world powered by a new engine. Immerse yourself into mind-bending environments filled with new twisted monsters and deadly bosses. A vast array of threats will prey on human senses & phobias - auditoryPrepare to die... Again. Dare yourself to engage against intense gameplay in a vast world powered by a new engine. Immerse yourself into mind-bending environments filled with new twisted monsters and deadly bosses. A vast array of threats will prey on human senses & phobias - auditory hallucinations, vertigo, acrophobia, etc. More intricate customization options provide weapons and armor tailoring to player style. [Namco Bandai Games]… Expand"
  },
  {
    "name": "Dishonored",
    "details_link": "https://www.metacritic.com/game/pc/dishonored",
    "publisher": "Bethesda Softworks",
    "release_date": "Oct  8 2012",
    "developers": [
      "Arkane Studios"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Modern",
      "General",
      "Modern"
    ],
    "meta_score": 91,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/2/5579c6cdb4efaaab0dc07abaa4bf6644-98.jpg",
    "descriptions": "Approach each assassination with your own unique style. Use shadow and sound to your advantage to traverse silently through levels unseen by enemies, or attack foes head-on as they react to your aggression. The malleable combat system allows you to creatively synthesize your abilities,Approach each assassination with your own unique style. Use shadow and sound to your advantage to traverse silently through levels unseen by enemies, or attack foes head-on as they react to your aggression. The malleable combat system allows you to creatively synthesize your abilities, supernatural powers and gadgets as you negotiate your way through the levels and dispatch your targets. Improvise and adapt to define your modus operandi.… Expand"
  },
  {
    "name": "ESPN NFL Football",
    "details_link": "https://www.metacritic.com/game/playstation-2/espn-nfl-football",
    "publisher": "Sega",
    "release_date": "Sep  3 2003",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-16 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 91,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/6/057262e83fa08236f68d62eaa739619e-98.jpg",
    "descriptions": "ESPN NFL Football brings the complete NFL experience. Whether it's by making an opponent lose his shorts from a stop-and-go juke, by scraping your toes down as you make an acrobatic first-down catch along the sideline, or by piling on top of a swarming gang tackle on fourth and short -- youESPN NFL Football brings the complete NFL experience. Whether it's by making an opponent lose his shorts from a stop-and-go juke, by scraping your toes down as you make an acrobatic first-down catch along the sideline, or by piling on top of a swarming gang tackle on fourth and short -- you will truly feel everything that makes the National Football League so intense. Don't look. Don't listen. Feel.… Expand"
  }
]