[{"name": "Rebel Galaxy Outlaw", "details_link": "https://www.metacritic.com/game/pc/rebel-galaxy-outlaw", "publisher": "Double Damage Games", "release_date": "Aug 13 2019", "developers": ["Double Damage Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 77, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/b0b465733a69d3e40967250fc0037083-98.jpg", "descriptions": "Out of cash, out of luck, out on the fringe. Juno Markev has a killer to tail, a debt to pay, and more trouble headed her way. In the Dodge Sector it’s hard to get by – and even harder to get even."}, {"name": "Ultimate Marvel vs. Capcom 3", "details_link": "https://www.metacritic.com/game/playstation-4/ultimate-marvel-vs-capcom-3", "publisher": "Capcom", "release_date": "Dec  3 2016", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/3bcafb81bf543eb17c18cd4e2e333180-98.jpg", "descriptions": "The Marvel and Capcom universes collide once again in this Ultimate installment of the popular fighting franchise. With new fighters, epic new modes and rebalanced gameplay, Ultimate Marvel vs. Capcom 3 asks only one question — are you ready for the Ultimate fighting experience?"}, {"name": "Dead or Alive 5 Ultimate", "details_link": "https://www.metacritic.com/game/playstation-3/dead-or-alive-5-ultimate", "publisher": "Tecmo Koei America Corp.", "release_date": "Sep  3 2013", "developers": ["Team Ninja"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/7ac48efa74ffdba999545e0c2e23f598-98.jpg", "descriptions": "DEAD OR ALIVE 5 ULTIMATE is the definitive DEAD OR ALIVE 5 package, with new content aimed to bring players the best 3D DoA fighting experience to date. The addition of modes from DEAD OR ALIVE 5 PLUS, including \"Details Plus\" and a tutorial mode, will allow novice and expert fighters toDEAD OR ALIVE 5 ULTIMATE is the definitive DEAD OR ALIVE 5 package, with new content aimed to bring players the best 3D DoA fighting experience to date. The addition of modes from DEAD OR ALIVE 5 PLUS, including \"Details Plus\" and a tutorial mode, will allow novice and expert fighters to refine their fighting style with precision.… Expand"}, {"name": "Life is Strange: Before the Storm - Episode 3: Hell is Empty", "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-before-the-storm---episode-3-hell-is-empty", "publisher": "Square Enix", "release_date": "Dec 19 2017", "developers": ["Deck Nine Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/3fdc781251c99236233376d96aa16b04-98.jpg", "descriptions": null}, {"name": "Pac-Man Championship Edition 2", "details_link": "https://www.metacritic.com/game/playstation-4/pac-man-championship-edition-2", "publisher": "Bandai Namco Games", "release_date": "Sep 13 2016", "developers": ["Bandai Namco Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Arcade"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/32c1f10b8103262174a4987beb0ab51f-98.jpg", "descriptions": "A new sequel in the PAC-MAN Championship Edition series comes to next-generation consoles and PC. Taking highlights from the past, PAC-MAN Championship Edition 2 takes the best aspects from Championship Edition and Championship Edition DX and evolves the game for the future Featuring 3DA new sequel in the PAC-MAN Championship Edition series comes to next-generation consoles and PC. Taking highlights from the past, PAC-MAN Championship Edition 2 takes the best aspects from Championship Edition and Championship Edition DX and evolves the game for the future Featuring 3D graphics and funky visuals, the latest version of the classic game takes chomping and chasing through mazes to a new level.… Expand"}, {"name": "Street Fighter V", "details_link": "https://www.metacritic.com/game/playstation-4/street-fighter-v", "publisher": "Capcom", "release_date": "Feb 16 2016", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 77, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/5/f35f9cef0939c58fb8b2c77ee2c5e449-98.jpg", "descriptions": "Birdie and Charlie Nash make their return to the Street Fighter universe, where they join classic characters like Ryu, Chun-Li, Cammy, and M. Bison. Many more new and returning characters will be added to the diverse roster, offering a wide variety of fighting styles for players to chooseBirdie and Charlie Nash make their return to the Street Fighter universe, where they join classic characters like Ryu, Chun-Li, Cammy, and M. Bison. Many more new and returning characters will be added to the diverse roster, offering a wide variety of fighting styles for players to choose from. New Strategies and Battle Mechanics: Highly accessible new battle mechanics, which revolve around the V-Gauge and EX Gauge, provide a new layer of strategy and depth to the franchise that all players can enjoy. V-Trigger: Unique abilities that use the entire V-Gauge, giving players the opportunity to inflict damage when activated. V-Skill: Utility skills (such as evasion) for each character that can be activated at any time. V-Reversal: Unique counterattacks that use one stock of the V-Gauge. Critical Arts: Ultimate attacks that use the entire EX Gauge. For the first time in franchise history, the online community is unified into a single player pool, allowing for even more rivalries to be born. [Playstation.com]\r … Expand"}, {"name": "Persona 4 Arena Ultimax", "details_link": "https://www.metacritic.com/game/pc/persona-4-arena-ultimax", "publisher": "Sega", "release_date": "Mar 17 2022", "developers": ["Arc System Works"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "PC"], "genres": ["Action", "Fighting", "2D"], "meta_score": 77, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/2/67aac0561c9ce15b0ebe18871e89d593-98.jpg", "descriptions": "In P4AU, the characters from Persona 4 and Persona 3 once again find themselves teaming up to face off in the P-1 Climax, a series of battles which must be won before the world ends. The original cast of characters from Persona 3 and 4 are back to discover the mastermind behind the wholeIn P4AU, the characters from Persona 4 and Persona 3 once again find themselves teaming up to face off in the P-1 Climax, a series of battles which must be won before the world ends. The original cast of characters from Persona 3 and 4 are back to discover the mastermind behind the whole tournament, while a few new faces join the fight, including Junpei Iori, Yukari Takeba, Rise Kujikawa, and more. But standing in their way is the dual katana-wielding Sho Minazuki, a huge threat to everyone involved in the P-1 Climax. Worse yet, there's a Sho lookalike who can wield a Persona...… Expand"}, {"name": "Touhou Spell Bubble", "details_link": "https://www.metacritic.com/game/switch/touhou-spell-bubble", "publisher": "Taito Corporation", "release_date": "Oct 29 2020", "developers": ["Taito Corporation"], "platforms": "Switch", "num_players": "2 ", "genres": ["Puzzle", "Matching"], "meta_score": 77, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/a9e64e1c62deacd8dd84281c4e323232-98.jpg", "descriptions": "Rythmic puzzle action meets arranged Touhou beats!\r A fusion of rhythm and puzzle in a simple to pick up action puzzle game! 20 characters and 48 arranged tracks from Touhou to do battle with!\r\n\r\n■Puzzle action with a new, rythmic beat!\r\nA simple to control puzzle game with an added layerRythmic puzzle action meets arranged Touhou beats!\r A fusion of rhythm and puzzle in a simple to pick up action puzzle game! 20 characters and 48 arranged tracks from Touhou to do battle with!\r ■Puzzle action with a new, rythmic beat!\rA simple to control puzzle game with an added layer of rhythm-action combine to produce a whole new puzzle experience played to a catchy beat!\r ■Play with Touhou Project characters!\rMake use of all 20 characters from Touhou Project, including Reimu and Marisa, and a total of 60 different spell cards to aim for victory!\r ■Story mode!\rThe game also includes a story mode that you can play by yourself. Travel through the world of Gensoukyo and enjoy an original story, only available here!\r ■Challenge mode!\rYou will fight against strong enemies with designated characters and spells in the challenge mode.\rThere are also stages with higher difficulty level. Let's challenge it!\"\r ■A collection of 48 arranged tracks from Touhou Project!\rA total of 48 tracks including, of course, many fan favourites along with 12 exclusive, new tracks only available in Spell Bubble!… Expand"}, {"name": "I Am Dead", "details_link": "https://www.metacritic.com/game/pc/i-am-dead", "publisher": "Annapurna Interactive", "release_date": "Oct  8 2020", "developers": ["Hollow Ponds and Richard Hogg"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/f6759d7a25cc1172976881c39a245950-98.jpg", "descriptions": "I Am Dead is a charming puzzle adventure game from the creators of Hohokum and Wilmot’s Warehouse about exploring the afterlife."}, {"name": "Mega Man 11", "details_link": "https://www.metacritic.com/game/xbox-one/mega-man-11", "publisher": "Capcom", "release_date": "Oct  2 2018", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/ac59521e1d17f0e3cfa79190f418ffbe-98.jpg", "descriptions": "Thirty years ago, in 1987, a super robot named Mega Man was created. In 2018 after 30 years of unforgettable adventures the fight for everlasting peace continues! The tight action-platformer gameplay that made the series a success is alive and well. To save the day, the Blue Bomber mustThirty years ago, in 1987, a super robot named Mega Man was created. In 2018 after 30 years of unforgettable adventures the fight for everlasting peace continues! The tight action-platformer gameplay that made the series a success is alive and well. To save the day, the Blue Bomber must battle Robot Masters and take their powerful weapons for himself, which now changes the hero's appearance with new levels of detail. A new, vivid visual style refreshes the series' iconic colorfulness, combining hand-drawn environments with detailed, 3D character models.… Expand"}, {"name": "Minecraft: Wii U Edition", "details_link": "https://www.metacritic.com/game/wii-u/minecraft-wii-u-edition", "publisher": "Mojang AB", "release_date": "Dec 17 2015", "developers": ["4J Studios"], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox 360", "Xbox One", "Wii U"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Sandbox"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/f301e3e9b50ea98054139e682636764d-98.jpg", "descriptions": "The game involves players creating and destroying various types of blocks in a three dimensional environment. The player takes an avatar that can destroy or create blocks, forming fantastic structures, creations and artwork across the various multiplayer servers in multiple game modes."}, {"name": "F1 2013", "details_link": "https://www.metacritic.com/game/pc/f1-2013", "publisher": "Codemasters", "release_date": "Oct  3 2013", "developers": ["Codemasters"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/e2665d64c78c0051a593714314664a32-98.jpg", "descriptions": "F1 2013 sees Codemasters introducing a new F1 Classics mode, opening up circuits and drivers from the 1980s."}, {"name": "Your Shape Fitness Evolved 2012", "details_link": "https://www.metacritic.com/game/xbox-360/your-shape-fitness-evolved-2012", "publisher": "Ubisoft", "release_date": "Nov  8 2011", "developers": ["Ubisoft"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Sports", "Miscellaneous", "General", "Exercise / Fitness"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/5fc087ca65b174ce66b9bfcf0d319e0a-98.jpg", "descriptions": "Your Shape: Fitness Evolved, launched in November 2011, is the #1 fitness game on Kinect. With consumer feedback in mind, Your Shape: Fitness Evolved 2012 returns with a revisited game structure that will make content easily accessible and bring more of what players wanted to see. As one ofYour Shape: Fitness Evolved, launched in November 2011, is the #1 fitness game on Kinect. With consumer feedback in mind, Your Shape: Fitness Evolved 2012 returns with a revisited game structure that will make content easily accessible and bring more of what players wanted to see. As one of the most extensive fitness offerings on the market, Your Shape: Fitness Evolved 2012 includes over 60 new moves and over 10 hours of special classes.  With everything from martial arts to dance or boot camp, Your Shape: Fitness Evolved 2012 will provide users a very broad variety of activities. The tracking has also been pushed to the next level with brand new  floor movements as well as a better feedback system where instead of only telling you what you are doing wrong, your coach will also tell you how to do it right. … Expand"}, {"name": "Angry Birds", "details_link": "https://www.metacritic.com/game/psp/angry-birds", "publisher": "Chillingo Ltd", "release_date": "Jan  4 2011", "developers": ["Rovio Mobile", "Abstraction Games", "Rovio Entertainment"], "platforms": ["iPhone/iPad", "PC", "PSP"], "num_players": "1 Player", "genres": ["Strategy", "Miscellaneous", "Puzzle", "Action", "General", "General", "General"], "meta_score": 77, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/3/c0f1417b2a59f92c2d91e84262533f18-98.jpg", "descriptions": "Use the unique powers of the Angry Birds to destroy the greedy pigs' defenses!**The survival of the Angry Birds is at stake. Dish out revenge on the greedy pigs who stole their eggs. Use the unique powers of each bird to destroy the pigs’ defenses. Angry Birds features challengingUse the unique powers of the Angry Birds to destroy the greedy pigs' defenses!**The survival of the Angry Birds is at stake. Dish out revenge on the greedy pigs who stole their eggs. Use the unique powers of each bird to destroy the pigs’ defenses. Angry Birds features challenging physics-based gameplay and hours of replay value. Each level requires logic, skill and force to solve.**If you get stuck in the game, you can purchase the Mighty Eagle! Mighty Eagle is a one-time in-app purchase in Angry Birds that gives unlimited use. This phenomenal creature will soar from the skies to wreak havoc and smash the pesky pigs into oblivion. There’s just one catch: you can only use the aid of Mighty Eagle to pass a level once per hour. Mighty Eagle also includes all new gameplay goals and achievements!**In addition to the Mighty Eagle, Angry Birds now has power-ups! Boost your birds’ abilities and three-star levels to unlock secret content! Angry Birds now has the following amazing power-ups: Sling Scope for laser targeting, King Sling for maximum flinging power, Super Seeds to supersize your birds, and Birdquake to shake pigs’ defenses to the ground!**#1 IPHONE PAID APP in US, UK, Canada, Italy, Germany, Russia, Sweden, Denmark, Finland, Singapore, Poland, France, Netherlands, Malta, Greece, Austria, Australia, Turkey, UAE, Saudi Arabia, Israel, Belgium, Norway, Hungary, Malaysia, Luxembourg, Portugal, Czech Republic, Spain, Ireland, Romania, New Zealand, Latvia, Lithuania, Estonia, Nicaragua, Kazakhstan, Argentina, Bulgaria, Slovakia, Slovenia, Mauritius, Chile, Hong Kong, Pakistan, Taiwan, Colombia, Indonesia, Thailand, India, Kenya, Macedonia, Croatia, Macau, Paraguay, Peru, Armenia, Philippines, Vietnam, Jordan and Kuwait. **Note: if you are having a problem with your device crashing after installing the update, try shutting down and restarting the device. If you are still having problems, contact support@rovio.com.#1 IPHONE PAID GAME in more countries than we can count!Terms of Use: http://www.rovio.com/eula*Privacy Policy: http://www.rovio.com/privacy*This application may require internet connectivity and subsequent data transfer charges may apply.… Expand"}, {"name": "DeathSpank", "details_link": "https://www.metacritic.com/game/pc/deathspank", "publisher": "Hothead Games", "release_date": "Oct 25 2010", "developers": ["Hothead Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General", "Action RPG"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/0724a3d9013d0b8d043085356149f4c3-98.jpg", "descriptions": "This is a new game series written by Ron Gilbert that follows the adventures of a misguided hero named DeathSpank."}, {"name": "Al Emmo and the Lost Dutchman's Mine", "details_link": "https://www.metacritic.com/game/pc/al-emmo-and-the-lost-dutchmans-mine", "publisher": "Himalaya Studios", "release_date": "Sep  6 2006", "developers": ["Himalaya Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Third-Person", "Point-and-Click", "Modern", "Modern"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/2500994071b5046dc2decc0f4b1f79ad-98.jpg", "descriptions": "Al Emmo and the Lost Dutchman's Mine, a witty western with a healthy dose of adventure, follows in the tradition of classic adventure gaming. Join Al, a middle-aged, feeble, Easterner, on his journey into the heart of the Wild-West in search of a suitable bride. Enjoy the quaint gold-rushAl Emmo and the Lost Dutchman's Mine, a witty western with a healthy dose of adventure, follows in the tradition of classic adventure gaming. Join Al, a middle-aged, feeble, Easterner, on his journey into the heart of the Wild-West in search of a suitable bride. Enjoy the quaint gold-rush town of Anozira; chat up highly flirtatious babes; cautiously evade warring Indian tribes; discover legends of lost gold; bask in the intense summer heat; encounter breathtaking landscapes; meet up with the occasional rabid prairie dog, and more. [Himalaya Studios]… Expand"}, {"name": "Tony Hawk's American Wasteland", "details_link": "https://www.metacritic.com/game/xbox/tony-hawks-american-wasteland", "publisher": "Activision", "release_date": "Oct 18 2005", "developers": ["Neversoft Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Xbox"], "num_players": "6  Online", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/190239e2fb6fd5d1c77508ab9e2d13be-98.jpg", "descriptions": "Now you can cruise through LA without loading levels or stopping gameplay in Tony Hawk's American Wasteland. You can skate or BMX through a new story mode that takes you through all-new skate areas using tricks that have never appeared in previous Tony Hawk games. The cash that you earn canNow you can cruise through LA without loading levels or stopping gameplay in Tony Hawk's American Wasteland. You can skate or BMX through a new story mode that takes you through all-new skate areas using tricks that have never appeared in previous Tony Hawk games. The cash that you earn can be used to customize your equipment and your skater by going to tattoo parlors and skate shops. Tony Hawk's American Wasteland also includes a classic mode that features classic Tony Hawk Pro Skater maps and objectives.… Expand"}, {"name": "SoulCalibur V", "details_link": "https://www.metacritic.com/game/xbox-360/soulcalibur-v", "publisher": "Namco Bandai Games", "release_date": "Jan 31 2012", "developers": ["Project Soul"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 77, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/0af4c7078ff38bd8d87eb1d44c1b2a33-98.jpg", "descriptions": "Developed by the Project Soul team, SOULCALIBUR V begins 17 years after the events of SOULCALIBUR IV with new heroes and returning warriors clashing in a showdown between good and evil. The tale of Patroklos, son of Sophitia Alexandra, unfolds as his family's destiny intertwines with theDeveloped by the Project Soul team, SOULCALIBUR V begins 17 years after the events of SOULCALIBUR IV with new heroes and returning warriors clashing in a showdown between good and evil. The tale of Patroklos, son of Sophitia Alexandra, unfolds as his family's destiny intertwines with the Soul swords. With the series' 8-way run, allowing for true 3D movement during matches, a refined battle system, and fine graphics, SOULCALIBUR V might be for anyone looking for a knock-down, drag-out fight. … Expand"}, {"name": "Pro Evolution Soccer 2011", "details_link": "https://www.metacritic.com/game/playstation-3/pro-evolution-soccer-2011", "publisher": "Konami", "release_date": "Oct 19 2010", "developers": ["Konami"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/e3742c7831a6a2672ca959ea38294288-98.jpg", "descriptions": "The PRO EVOLUTION SOCCER franchise has long been regarded as offering incredible realism and control, however PRO EVOLUTION SOCCER 2011 will reinvigorate the series with the most advanced set of improved gameplay additions, control options and to catch up with the evolution of the real-lifeThe PRO EVOLUTION SOCCER franchise has long been regarded as offering incredible realism and control, however PRO EVOLUTION SOCCER 2011 will reinvigorate the series with the most advanced set of improved gameplay additions, control options and to catch up with the evolution of the real-life soccer. Central to its total freedom of play, PRO EVOLUTION SOCCER 2011 introduces a power bar for each player that allows the user to determine the exact strength and placement of every pass and shot. Balls can now be spread absolutely anywhere with surgical precision, with long balls into space, short passes to feet, and intricate one-twos allowing the player to dictate play and control the tempo of a match. … Expand"}, {"name": "Final Fantasy IV: The Complete Collection", "details_link": "https://www.metacritic.com/game/psp/final-fantasy-iv-the-complete-collection", "publisher": "Square Enix", "release_date": "Apr 18 2011", "developers": ["Bullets"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Miscellaneous", "General", "Console-style RPG", "Compilation", "Compilation"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/73986656e6919bfff68ae17914541867-98.jpg", "descriptions": "Final Fantasy IV: Complete Collection contains both Final Fantasy IV and The After Years in one collection."}, {"name": "Othercide", "details_link": "https://www.metacritic.com/game/playstation-4/othercide", "publisher": "Focus Home Interactive", "release_date": "Jul 28 2020", "developers": ["Lightbulb Crew"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/2e20182d2cc321797dd6b1f138344d71-98.jpg", "descriptions": "Othercide is a horror-themed turn-based strategy game where the lore and game mechanics are tightly intertwined to deliver a twisted, dark and challenging experience. Enter a brutal world under assault from terrifying creatures from another dimension, hold back the tide with limitedOthercide is a horror-themed turn-based strategy game where the lore and game mechanics are tightly intertwined to deliver a twisted, dark and challenging experience. Enter a brutal world under assault from terrifying creatures from another dimension, hold back the tide with limited resources and endure brutal conditions in visually stunning world.Experience dynamic turn-based combat and a new way to anticipate enemy movements to perform a flawless tactical plan. Using the Initiative Sequence System and unique set of skills, you will be able to interrupt an enemy attack, plan a delayed action that will be triggered later on in the timeline and use reaction skill to respond to any threat.Prepare to suffer and face close calls in our terrifying and ruthless universe. With roguelite features, deadly missions, limited resources and permanent death, there is no room for errors.Level up, unlock new skills and collect memories from the death of your enemies. A limited number of these bonuses can be implemented to your skills to boost their stats. But choose wisely as once implemented, you can't take them back, unless... you decide to sacrifice your Daughter!Make dramatic choices and endure with your Daughters traumatic experiences which will make them stronger or weaker.Othercide invites you in a ethereal monochromatic dimension with only dashes of crimson red where your worst nightmares come to life.… Expand"}, {"name": "Expeditions: Conquistador", "details_link": "https://www.metacritic.com/game/pc/expeditions-conquistador", "publisher": "Logic Artists", "release_date": "May 30 2013", "developers": ["Logic Artists"], "platforms": "PC", "genres": ["Role-Playing", "General", "General"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/13ff9905b3c0af50f82bf597231e5a5f-98.jpg", "descriptions": "Expeditions: Conquistador is a story-driven tactical roleplaying game with a touch of strategic resource management and a pinch of choose-your-own-adventure."}, {"name": "Call of Juarez: Bound in Blood", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-juarez-bound-in-blood", "publisher": "Ubisoft", "release_date": "Jun 30 2009", "developers": ["Techland"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/d035349a54a499d78c8c95145531ea39-98.jpg", "descriptions": "Call of Juarez: Bound in Blood transports players from a ravaged Civil War-era Georgia to the Aztec ruins of Mexico. In the wildest West ever depicted, players can embody both McCall brothers in an intense storyline full of greed, lust and lawlessness that takes place during a legendaryCall of Juarez: Bound in Blood transports players from a ravaged Civil War-era Georgia to the Aztec ruins of Mexico. In the wildest West ever depicted, players can embody both McCall brothers in an intense storyline full of greed, lust and lawlessness that takes place during a legendary period of American history.  Become a Gunslinger - Harness a variety of weapons from various revolvers to heavy-caliber cannons and machine guns. Every accurate shot increases concentration, which allows players to unleash deadly shooting modes when outnumbered and even deadlier ones when the brothers work together. Dual Collaborative Gameplay - Players choose to embody Ray or Thomas, each with a distinctive gameplay style (close or long range), specific abilities (lasso, dynamite, etc.) and arsenal of deadly weapons (dual guns, long-range carbine, etc.). Take advantage of each of their strengths and join in the fiercest fights imaginable. Never Before Seen Western Experience - Experience the iconic settings full of outlaws - the West before it was tamed. The McCall brothers face a renegade Apache Chief, a greedy Mexican bandit, a vindictive Colonel, and others, all driven by greed with moral disregard. Enjoy a wide variety of situations, using horses, canoes and wagons to explore the vast natural landscapes of the fabled Wild West and its legendary period. Innovative Online Multiplayer - Developed in unison with the single player mode, multiplayer offers numerous modes and maps, resulting in endless hours of Wild West mayhem. Gunslingers, bandits and marshals struggle online for the bounty. Multiple characters are unlocked for team-based objective modes or the straightforward team death match. With a new Bounty system, players increase the bounty on their head with more kills. Get rid of the deadliest among you to increase your bank roll. [Ubisoft]… Expand"}, {"name": "Capcom Arcade Stadium", "details_link": "https://www.metacritic.com/game/playstation-4/capcom-arcade-stadium", "publisher": "Capcom", "release_date": "May 25 2021", "developers": ["Capcom"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 77, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/3/c4a3aacf40e189146bb787290a169205-98.jpg", "descriptions": "Relive the Capcom classics!Shooters, fighting, actionall your favorite genres in this exciting collection! Capcom Arcade Stadium brings back all the nostalgia of the arcade, while adding in new and exciting features you'll wish you had back then!\n\nJust Like the Good Old Days\nFromRelive the Capcom classics!Shooters, fighting, actionall your favorite genres in this exciting collection! Capcom Arcade Stadium brings back all the nostalgia of the arcade, while adding in new and exciting features you'll wish you had back then!Just Like the Good Old DaysFrom 3D-rendered arcade cabinets to scanline filters, there's everything you need to recreate that arcade atmosphere. Fully customizable display settings let you craft your own personal experience and truly relive the glory days of arcade gaming.Brand New Ways to PlayWith gameplay rewind, speed adjustment, and the ability to save and load your game at any time, your old favorites will feel new all over again!Every game has online leaderboard rankings, so you can see where you stack up against players all over the world!Capcom Arcade Stadium, where retro appeal meets cutting-edge features for a fresh take on Capcom's classics!… Expand"}, {"name": "Life is Strange: Episode 1 - Chrysalis", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-episode-1---chrysalis", "publisher": "Square Enix", "release_date": "Jan 30 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action Adventure", "General"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/ae56570ddab90394450b098380dfa886-98.jpg", "descriptions": "Chrysalis is an introduction to the world of Life is Strange. You’ll see Max and Chloe reunite and you’ll make important choices that will influence their destiny. You will observe some of the short-term consequences of those choices but know that there are also mid and long-termChrysalis is an introduction to the world of Life is Strange. You’ll see Max and Chloe reunite and you’ll make important choices that will influence their destiny. You will observe some of the short-term consequences of those choices but know that there are also mid and long-term repercussions that will pan out over the course of the later episodes, in a butterfly effect manner. [DONTNOD]… Expand"}, {"name": "Wasteland 2: Director's Cut", "details_link": "https://www.metacritic.com/game/xbox-one/wasteland-2-directors-cut", "publisher": "Deep Silver", "release_date": "Oct 13 2015", "developers": ["InXile Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 77, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/28a6b5edcca6ac874b9822bd3a839405-98.jpg", "descriptions": "Wasteland 2 is the direct sequel to the first ever post-apocalyptic computer RPG. The original Wasteland was the inspiration for the FALLOUT series of games, and the first RPG to allow players to split parties for tactical considerations, to face players with moral choices, and to make themWasteland 2 is the direct sequel to the first ever post-apocalyptic computer RPG. The original Wasteland was the inspiration for the FALLOUT series of games, and the first RPG to allow players to split parties for tactical considerations, to face players with moral choices, and to make them deal with the consequences of their actions. It was the first to provide far more than the one-key-for-one-lock style of puzzle solving. It was groundbreaking, which is why IGN named it one of the top 25 PC games of all time, Computer Gaming World named it the Adventure Game of the year in 1988, and it was short-listed for inclusion in the Smithsonian Institutions current Art of the Computer Game exhibition.\r Wasteland was set in a dangerous, post-apocalyptic world in the American Southwest. Over the course of adventures rangers would receive promotions, acquire new skills and equipment, then face new challenges with outcomes that changed depending on the strategy used to defeat them. The game featured a strong storyline which required painful decisions by players; and a storyline that allowed for maximum re-playability. Wasteland 2, with your participation and insights, will recapture all that and provide more.  It'll finally be the game worthy to be a Wasteland sequel, as challenging and rewarding as the original, with all added capacity and dazzle of games today.… Expand"}, {"name": "Field Commander", "details_link": "https://www.metacritic.com/game/psp/field-commander", "publisher": "Sony Online Entertainment", "release_date": "May 23 2006", "developers": ["Sony Online Entertainment", "Mind Control Software"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/927278614303f20117e535cf8a09e95d-98.jpg", "descriptions": "Field Commander is the first military turn-based strategy game for PSP and the only title that offers engaging, challenging skill based warfare in a realistic military setting. You play as a Field Commander working for the Global Defense League, an independent organization established by theField Commander is the first military turn-based strategy game for PSP and the only title that offers engaging, challenging skill based warfare in a realistic military setting. You play as a Field Commander working for the Global Defense League, an independent organization established by the Allied Nations to defend the world against covert organizations whose goals include terrorism, genocide, and global domination. Your main enemy in these scenarios is Shadow Hold, an evil terrorist organization bent on inciting wars, illicit arms deals and global domination. Command the land, skies and sea. Orchestrate an offensive attack through 30 unique missions, each one coming alive in beautiful 3D environments with highly-detailed terrain and dynamic visual effects. With an arsenal of 15 army divisions and 11 commanding officers to choose from, the power is yours to outwit the enemy at every turn.… Expand"}, {"name": "Dying Light 2 Stay Human", "details_link": "https://www.metacritic.com/game/pc/dying-light-2-stay-human", "publisher": "Square Enix", "release_date": "Feb  4 2022", "developers": ["Techland"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Survival"], "meta_score": 77, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/1/238d9205b4f9e5e8dc1c2632f1f4953c-98.jpg", "descriptions": "THE FATE OF THE CITY IS IN YOUR HANDS It's been 15 years since humanity lost to the virus. The last great human settlement exists within an unforgiving, infected world, plunged into a modern dark age. During the day, bandits, factions and starving survivors roam the streets scavenging forTHE FATE OF THE CITY IS IN YOUR HANDS It's been 15 years since humanity lost to the virus. The last great human settlement exists within an unforgiving, infected world, plunged into a modern dark age. During the day, bandits, factions and starving survivors roam the streets scavenging for scraps - or someone to take them from, by violence if necessary. At night the infected roam free, evacuating their dark hideouts to prey on the living. You are Aiden Caldwell, an infected survivor. Your exceptional agility and brutal combat skills make you a powerful ally and a valuable commodity in this dangerous world. You can achieve things no one else can. Enter places no one else dares. With your unique abilities you have the power to be an agent of change within this decaying metropolis.\r YOUR CHOICES, YOUR WORLD\rYou must make tough decisions and hard sacrifices as you decide the fate of a society on the brink of collapse. The effect of the choices you make will have a huge impact on entire regions of the city, uncovering new land masses and areas to explore. Play the entire campaign in up to four-player co-op. Host your own games or join other players' and see how their choices have played out differently to your own.\r EXCEPTIONAL AGILITY AND BRUTAL COMBAT\rOn your journey from humble beginnings to a person of great power, you have unprecedented freedom of movement across the city, seamlessly integrated with brutal first person combat.\r A MODERN DARK AGE\rIn a desperate city, where resources and power are scarce, unstable, and trust in ruling bodies is all but eroded; humankind has reverted to a dark age. Civilization is gone but the relics are still there. This is a violent, primal & unforgiving world - and so are its inhabitants.\r THE INFECTION HAS EVOLVED\rThe infection has evolved and become more sensitive to UV light. Society exists in the relative safety of sunlight, while the infected hide in the shadows of buildings. At night the infected roam the streets freely searching for prey, presenting opportunities for you to explore areas of the city inaccessible by day.… Expand"}, {"name": "Cyber Shadow", "details_link": "https://www.metacritic.com/game/playstation-5/cyber-shadow", "publisher": "Yacht Club Games", "release_date": "Jan 26 2021", "developers": ["Yacht Club Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/ef2b74f25033614eb29ca7c72441d396-98.jpg", "descriptions": "The world has been taken over by synthetic lifeforms. A desperate plea for help sets Shadow on a journey to uncover what started the path to perpetual ruin. Slash through the techno hordes, leap past traps, and nimbly navigate the ruins of Mekacity."}, {"name": "Shu", "details_link": "https://www.metacritic.com/game/playstation-4/shu", "publisher": "Coatsink Software", "release_date": "Oct  4 2016", "developers": ["Coatsink Software"], "platforms": ["PC", "PlayStation Vita", "Switch", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/ab506e8682e8354c7529ce89cd6e205a-98.jpg", "descriptions": "When the great and terrible Storm destroys Shu's village, he embarks on a desperate journey to survive. On his travels he'll encounter stranded villagers survivors of the devastation that need his help. In return for his assistance, these peculiar characters will grant Shu unique specialWhen the great and terrible Storm destroys Shu's village, he embarks on a desperate journey to survive. On his travels he'll encounter stranded villagers survivors of the devastation that need his help. In return for his assistance, these peculiar characters will grant Shu unique special abilities that he can use to traverse the treacherous path ahead. Their only hope is to work together, in search of sanctuary - and a way to stop the Storm. Can you outrun the end of world? Features: 15 lush, expansive levels, set in 5 diverse lands; A plethora of collectibles and secrets to discover; 10 recruitable characters, each with their own unique power; An incredible original soundtrack; Compete in time trials to see who is the fastest out of your friends - or the world. [Playstation.com]… Expand"}, {"name": "Gary Grigsby's World at War", "details_link": "https://www.metacritic.com/game/pc/gary-grigsbys-world-at-war", "publisher": "Matrix Games", "release_date": "Mar 25 2005", "developers": ["2By3 Games"], "platforms": "PC", "num_players": "5  Online", "genres": ["Strategy", "Turn-Based", "Historic", "General", "Historic"], "meta_score": 77, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/6/cf31acdea9de8a5b21871ffa283d37ba-98.jpg", "descriptions": "Gary Grigsby's World At War gives you the chance to really run a world war. History is yours to write and things may turn out differently. The Western Allies may be conquered by Germany, or Japan may defeat China. With you at the controls, leading the fates of nations and alliances. TakeGary Grigsby's World At War gives you the chance to really run a world war. History is yours to write and things may turn out differently. The Western Allies may be conquered by Germany, or Japan may defeat China. With you at the controls, leading the fates of nations and alliances. Take command in this dynamic turn-based game and test strategies that long-past generals and world leaders could only dream of. Now anything is possible in this new strategic offering from Matrix Games and 2 by 3 Games. [Matrix Games]… Expand"}, {"name": "Call of Duty: Modern Warfare II", "details_link": "https://www.metacritic.com/game/xbox-series-x/call-of-duty-modern-warfare-ii", "publisher": "Activision", "release_date": "Oct 28 2022", "developers": ["Infinity Ward"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Arcade"], "meta_score": 77, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/f843a9a0e68eceab36d6ba128a26e8a6-98.jpg", "descriptions": "A global squad of iconic veterans and new legends of yet untold clandestine missions, these Operators are set to deliver a new era of Call of Duty when Modern Warfare II releases on October 28, 2022.Initial asset intel brings revelations about key members of Task Force 141, including TeamA global squad of iconic veterans and new legends of yet untold clandestine missions, these Operators are set to deliver a new era of Call of Duty when Modern Warfare II releases on October 28, 2022.Initial asset intel brings revelations about key members of Task Force 141, including Team leader Captain John Price, Sergeant Kyle \"Gaz\" Garrick, Sergeant \"Soap\" MacTavish, lone-wolf Simon \"Ghost\" Riley, and Colonel Alejandro Vargas of the Mexican Special Forces.… Expand"}, {"name": "RUSH", "details_link": "https://www.metacritic.com/game/wii-u/rush", "publisher": "Two Tribes", "release_date": "Dec 12 2013", "developers": ["Two Tribes"], "platforms": ["PC", "Wii U"], "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/ea94f7452a5a59f8339eaa2539e0e960-98.jpg", "descriptions": "Rush is a unique 3D puzzle game."}, {"name": "LEGO Batman 2: DC Super Heroes", "details_link": "https://www.metacritic.com/game/wii-u/lego-batman-2-dc-super-heroes", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "May 21 2013", "developers": ["TT Games"], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/70fb8fed84a7984d6a25c6a0dce64d2a-98.jpg", "descriptions": "LEGO Batman 2: DC Super Heroes is an Action-Adventure game set within the Batman universe, and filled with LEGO versions of heroes and villains from the Batman comic series, working together/against those from the Justice League comic series."}, {"name": "Zeno Clash", "details_link": "https://www.metacritic.com/game/pc/zeno-clash", "publisher": "Tripwire Interactive", "release_date": "Apr 21 2009", "developers": ["ACE Team"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "Shooter", "Beat-'Em-Up", "First-Person", "Fantasy", "3D", "Sci-Fi"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/75d3971a57985ae75df88f82406c0fd0-98.jpg", "descriptions": "Zeno Clash is an action/fighting game set in a punk fantasy world. The game is played from a first person perspective and the combat is generally up close and brutal. Experience a deep storyline set in a fantastic world. Play the role of Ghat, a man banished by his own brothers and forced toZeno Clash is an action/fighting game set in a punk fantasy world. The game is played from a first person perspective and the combat is generally up close and brutal. Experience a deep storyline set in a fantastic world. Play the role of Ghat, a man banished by his own brothers and forced to begin a desperate journey past the forbidden desert and to the end of the world. [Steam]… Expand"}, {"name": "Hamtaro: Ham-Ham Games", "details_link": "https://www.metacritic.com/game/game-boy-advance/hamtaro-ham-ham-games", "publisher": "Nintendo", "release_date": "Jul 27 2004", "developers": ["Alphadream Corporation"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Sports", "General"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/a77baf541c6a4c24f917bd926c1a2dcd-98.jpg", "descriptions": "Put your athletic skills to the test with Hamtaro and his Ham-Ham pals as they compete in the 2004 Ham-Ham Games. You must guide different Ham-Hams to victory in 15 sporting events; including archery, sprinting, sailing, swimming, and more. Root for your favorite Hamtaro characters as theyPut your athletic skills to the test with Hamtaro and his Ham-Ham pals as they compete in the 2004 Ham-Ham Games. You must guide different Ham-Hams to victory in 15 sporting events; including archery, sprinting, sailing, swimming, and more. Root for your favorite Hamtaro characters as they go head-to-head with new Ham-Hams, such as the pirates of Team Seaham. Also, with the Game Boy Advance Game Link Cable, you can trade statistics and collectible costumes with your friends. … Expand"}, {"name": "I-Ninja", "details_link": "https://www.metacritic.com/game/gamecube/i-ninja", "publisher": "Namco", "release_date": "Dec  4 2003", "developers": ["Argonaut Games"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/2a252a34b536e833283aaf268dae66f5-98.jpg", "descriptions": "He might be small, but he's one angry Ninja.  I-Ninja stars a consummate warrior who has spent years mastering his weapons and honing his skills.  Challenged by the world's most wicked villain, Master O-Dor, and his menacing army of Ranx, the young ninja must now put his skills to use.  WithHe might be small, but he's one angry Ninja.  I-Ninja stars a consummate warrior who has spent years mastering his weapons and honing his skills.  Challenged by the world's most wicked villain, Master O-Dor, and his menacing army of Ranx, the young ninja must now put his skills to use.  With access to multiple weapons, including shurikens, swords, blowguns, and rocket launchers, guide I-Ninja through imaginative missions, mini-quests, and a face off with a menacing 150-foot robot.  There is no challenge too big or risk to great for I-Ninja.… Expand"}, {"name": "James Bond 007: NightFire", "details_link": "https://www.metacritic.com/game/playstation-2/james-bond-007-nightfire", "publisher": "Electronic Arts", "release_date": "Nov 18 2002", "developers": ["Eurocom Entertainment Software"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/5a1360bfbde7c8e8419ebc32b02636e9-98.jpg", "descriptions": "The ultimate secret agent is back in his most dangerous adventure yet in James Bond 007: NightFire. Explore new heights and depths like never before-infiltrate towering skyscrapers, take on treacherous underwater missions, and maneuver your sleek Aston Martin V12 Vanquish through the streetsThe ultimate secret agent is back in his most dangerous adventure yet in James Bond 007: NightFire. Explore new heights and depths like never before-infiltrate towering skyscrapers, take on treacherous underwater missions, and maneuver your sleek Aston Martin V12 Vanquish through the streets of Tokyo while turning on the Bond charm with glamorous (and sometimes deadly) Bond women. New state-of-the-art upgradeable gadgets and weapons and original missions including zero-gravity assignments will leave you shaken and stirred. [Electronic Arts]… Expand"}, {"name": "Harry Potter and the Chamber of Secrets", "details_link": "https://www.metacritic.com/game/xbox/harry-potter-and-the-chamber-of-secrets", "publisher": "EA Games", "release_date": "Nov 14 2002", "developers": ["Eurocom Entertainment Software"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/1cd6d52ccff853fa7494dae3e9a2a035-98.jpg", "descriptions": "Be Harry Potter in a new adventure with more magic, friends, and danger. In his sophomore year at Hogwarts School of Witchcraft and Wizardry, Harry stumbles upon a dark chapter in the school's past. In an effort to confront the powers at the heart of the Chamber of Secrets, you'll learn newBe Harry Potter in a new adventure with more magic, friends, and danger. In his sophomore year at Hogwarts School of Witchcraft and Wizardry, Harry stumbles upon a dark chapter in the school's past. In an effort to confront the powers at the heart of the Chamber of Secrets, you'll learn new spells, undertake new quests, make new friends, and challenge new adversaries. Do you dare take the chance that you might face the evil Lord Voldemort again?… Expand"}, {"name": "Operation Flashpoint: Resistance", "details_link": "https://www.metacritic.com/game/pc/operation-flashpoint-resistance", "publisher": "Codemasters", "release_date": "Jul 10 2002", "developers": ["Bohemia Interactive"], "platforms": "PC", "num_players": "1-64 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/1/542ab899e65ca9836ed741722497c187-98.jpg", "descriptions": "Resistance, the official expansion to Operation Flashpoint,  is set years before O.F.'s Cold War reached crisis point, and delivers a campaign which forms a prequel to the original game's plot.  The game casts the player as Victor Troska, an experienced ex-Special Forces soldier. HavingResistance, the official expansion to Operation Flashpoint,  is set years before O.F.'s Cold War reached crisis point, and delivers a campaign which forms a prequel to the original game's plot.  The game casts the player as Victor Troska, an experienced ex-Special Forces soldier. Having turned his back on his military past, Troska has settled into respectable civilian life on an island just a short distance from the original game's three islands. However, his situation changes when Soviet forces invade the island group, destroying Troska's idyllic dreams. Reluctant at first to return to a conflict situation, he is forced to participate in, and then lead, the ramshackle Resistance effort, which grows up in response to the Soviet occupation. [Codemasters]… Expand"}, {"name": "World Tour Soccer 2002", "details_link": "https://www.metacritic.com/game/playstation-2/world-tour-soccer-2002", "publisher": "SCEA", "release_date": "Feb 17 2002", "developers": ["SCEE London Studio"], "platforms": "PlayStation 2", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/401b36e18adda737f9eabf28c586d494-98.jpg", "descriptions": "Known as \"This is Football 2002\" for its European release, WTS 2002 features more than 300 teams from throughout the world including national teams from USA, England, Brazil, France and Japan and international clubs like Manchester, Leeds and Liverpool. Complete Team Management functions letKnown as \"This is Football 2002\" for its European release, WTS 2002 features more than 300 teams from throughout the world including national teams from USA, England, Brazil, France and Japan and international clubs like Manchester, Leeds and Liverpool. Complete Team Management functions let you switch on the fly and take advantage of any opening. [SCEA]… Expand"}, {"name": "Etherlords", "details_link": "https://www.metacritic.com/game/pc/etherlords", "publisher": "Fishtank Interactive", "release_date": "Nov 12 2001", "developers": ["Nival Interactive"], "platforms": ["iPhone/iPad", "PC"], "num_players": "1-2 ", "genres": ["Strategy", "Turn-Based", "General", "General"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/7cf04b7493552ee4fca0dfa30ed1dee4-98.jpg", "descriptions": "Select your sorcerer hero from among four powerful races, and summon an army of monsters who clash for control of the world. Upgrade and enhance your magic arsenal, choosing from over 300 available spells. Features over 20 levels. [Fishtank Interactive]"}, {"name": "FIFA Soccer 2002", "details_link": "https://www.metacritic.com/game/pc/fifa-soccer-2002", "publisher": "EA Sports", "release_date": "Oct 29 2001", "developers": ["EA Sports"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/3b276d9b5349a28a196aa8feeadd5837-98.jpg", "descriptions": "FIFA 2002?s new passing system incorporates an open-ended and flexible passing model. Pass the ball into space, utilize through-balls and one-two?s. Direct your teammates on strategic runs thru the defense. The new system is enjoyable for players of all levels, creating a deeply satisfyingFIFA 2002?s new passing system incorporates an open-ended and flexible passing model. Pass the ball into space, utilize through-balls and one-two?s. Direct your teammates on strategic runs thru the defense. The new system is enjoyable for players of all levels, creating a deeply satisfying football experience. [EA Sports]… Expand"}, {"name": "Alone in the Dark: The New Nightmare", "details_link": "https://www.metacritic.com/game/playstation/alone-in-the-dark-the-new-nightmare", "publisher": "Infogrames", "release_date": "Jun 18 2001", "developers": ["Darkworks"], "platforms": ["PC", "PlayStation"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/ae814c135c24064f07355655230bb8e9-98.jpg", "descriptions": "From the moment Edward Carnby and Aline Cedrac set foot on Shadow Island, they are confronted by mysterious, evil creatures intent on thwarting their progress to recover 3 ancient tablets believed to hold the secret key to some incredible menacing phenomenon. Fears threaten from everyFrom the moment Edward Carnby and Aline Cedrac set foot on Shadow Island, they are confronted by mysterious, evil creatures intent on thwarting their progress to recover 3 ancient tablets believed to hold the secret key to some incredible menacing phenomenon. Fears threaten from every corner. The slightest shadow could be hiding deep secrets, or concealing worse nightmares...… Expand"}, {"name": "Tenchu 2: Birth of the Stealth Assassins", "details_link": "https://www.metacritic.com/game/playstation/tenchu-2-birth-of-the-stealth-assassins", "publisher": "Activision", "release_date": "Aug  7 2000", "developers": ["Acquire"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/1/1c14f9b5c6fe5ec9c7cc830d70c82e7f-98.jpg", "descriptions": "Before the events of Tenchu, the House of Gohda is rocked by betrayal. As shadow warriors Rikimaru, Ayame and Tatsumaru, you are called on to restore pride to the name of your master. For you have been born to a life of honor... a life of stealth. Discover even more ways to slay your foesBefore the events of Tenchu, the House of Gohda is rocked by betrayal. As shadow warriors Rikimaru, Ayame and Tatsumaru, you are called on to restore pride to the name of your master. For you have been born to a life of honor... a life of stealth. Discover even more ways to slay your foes with 21 new stealth kill techniques. Take on the role of three ninja assassins, each with their own story and fighting techniques. Strike from the shadows in 29 new day and night stealth missions. Utilize a variety of new ninja weapons and items, like flaming arrows and invisibility.… Expand"}, {"name": "Army Men: Air Combat", "details_link": "https://www.metacritic.com/game/nintendo-64/army-men-air-combat", "publisher": "3DO", "release_date": "Jul 14 2000", "developers": ["3DO"], "platforms": "Nintendo 64", "genres": ["Action", "General"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/38b8c934c5715ec41e26ca909c61dad7-98.jpg", "descriptions": "Pilot one of four toy helicopters through the treacherous terrain of your backyard, the local playground, picnic areas and nearby beaches. Engage in both air-to-air and air-to-ground combat with enemies ranging from battleships to butterflies. Utilize the unique abilities of each 'copter toPilot one of four toy helicopters through the treacherous terrain of your backyard, the local playground, picnic areas and nearby beaches. Engage in both air-to-air and air-to-ground combat with enemies ranging from battleships to butterflies. Utilize the unique abilities of each 'copter to battle armies of mutant insects; destroy rampaging remote control cars; blow up sand castles; and save Sarge from being melted by kids with magnifying glasses. Real combat. Plastic men.… Expand"}, {"name": "Pokemon Snap", "details_link": "https://www.metacritic.com/game/nintendo-64/pokemon-snap", "publisher": "Nintendo", "release_date": "Jun 30 1999", "developers": ["Hal"], "platforms": "Nintendo 64", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/85b9109de3c4a137540bb5285d8efa1c-98.jpg", "descriptions": "The Professor has asked you to capture the Wild Pokemon of Pokémon island...on film! Tour the island in your ZERO-ONE vehicle and snap pictures of Pokémon in their natural habitat. Wild Pokémon are often camera-shy, so you'll have to use special items to bring them outThe Professor has asked you to capture the Wild Pokemon of Pokémon island...on film! Tour the island in your ZERO-ONE vehicle and snap pictures of Pokémon in their natural habitat. Wild Pokémon are often camera-shy, so you'll have to use special items to bring them out in the open. Only the best shots will do for the Professor's Pokémon Report, so sharpen your photography skills and get ready to SNAP!… Expand"}, {"name": "Banjo-Kazooie", "details_link": "https://www.metacritic.com/game/xbox-360/banjo-kazooie", "publisher": "Microsoft Game Studios", "release_date": "Dec  3 2008", "developers": ["4J Studios"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/7c3d522dede36e6ed7521fd03986be89-98.jpg", "descriptions": "[Xbox Live Arcade]  The classic Nintendo platformer stars a big, goofy honey bear named Banjo who wears tight yellow shorts and carries around a raucous, red-crested breegull named Tooie in his backpack. The bear-and-bird duo must use constant teamwork to rescue Banjo's sister from the evil[Xbox Live Arcade]  The classic Nintendo platformer stars a big, goofy honey bear named Banjo who wears tight yellow shorts and carries around a raucous, red-crested breegull named Tooie in his backpack. The bear-and-bird duo must use constant teamwork to rescue Banjo's sister from the evil Gruntilda who wants to steal her beauty.… Expand"}, {"name": "They Are Billions", "details_link": "https://www.metacritic.com/game/pc/they-are-billions", "publisher": "Numantian Games", "release_date": "Jun 18 2019", "developers": ["Numantian Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/fcfbb9c6f258208fd6a5fdcb594f9325-98.jpg", "descriptions": "They Are Billions is a Steampunk strategy game set on a post-apocalyptic planet. Build and defend colonies to survive against the billions of the infected that seek to annihilate the few remaining living humans. Can humanity survive after the zombie apocalypse?"}, {"name": "Virginia", "details_link": "https://www.metacritic.com/game/playstation-4/virginia", "publisher": "505 Games", "release_date": "Sep 22 2016", "developers": ["505 Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 77, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/497b39bbb5fb80996efac98740605914-98.jpg", "descriptions": "Virginia is a single-player first-person thriller set in a small town with a secret. Experience a missing person’s investigation through the eyes of graduate FBI agent Anne Tarver."}, {"name": "FIFA Soccer 09", "details_link": "https://www.metacritic.com/game/pc/fifa-soccer-09", "publisher": "EA Sports", "release_date": "Oct 14 2008", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/4b3a7e2049174ea2ff51f9332d6522fa-98.jpg", "descriptions": "FIFA 09 on PC has been customized and designed exclusively for the platform. The gameplay engine features year-on-year improvements, delivering the detail demanded by football fans. FIFA 09 also features new customizable mouse and keyboard controls that deliver deeper, more intuitive commandFIFA 09 on PC has been customized and designed exclusively for the platform. The gameplay engine features year-on-year improvements, delivering the detail demanded by football fans. FIFA 09 also features new customizable mouse and keyboard controls that deliver deeper, more intuitive command over your squad for more fluid football action. Now utilize the mouse as a point-and-click tool to send teammates on runs, make pin-point accurate passes, and blast powerful shots on target. Plus, you have the tools to draw up trick moves using the mouse or perform one of 32 skill moves in your arsenal, including new scoop turns, rainbow flicks, heel-to-heel knocks and ball rolls just like Ronaldinho. More than 17 customizable actions in all enable you to design the game to suit your style of play. FIFA 09 on PC now features new, leading-edge visuals that deliver graphics that exploits the power of hi-spec gaming PCs, as requested by PC gamers. Star players are featured in photorealistic quality with remodeled likenesses that show off skin tones and muscles in greater detail for ultra-realistic action. FIFA 09 also features customizable widgets that can now integrated into the menu system to connect you to the FIFA community and real-world football so you stay connected while playing. [Electronic Arts]… Expand"}, {"name": "FIFA World Cup: Germany 2006", "details_link": "https://www.metacritic.com/game/pc/fifa-world-cup-germany-2006", "publisher": "Electronic Arts", "release_date": "Apr 24 2006", "developers": ["EA Canada"], "platforms": ["Xbox 360", "PC"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/8033d2f2f3664aa60f2bb062ad45f40b-98.jpg", "descriptions": "2006 FIFA World Cup features 12 official stadiums used at 2006 FIFA World Cup Germany and stadiums from each qualifying region. Gamers can play as their favorite team from qualification right through to a virtual reproduction of the tournament in Germany. With enhanced player animations, EA2006 FIFA World Cup features 12 official stadiums used at 2006 FIFA World Cup Germany and stadiums from each qualifying region. Gamers can play as their favorite team from qualification right through to a virtual reproduction of the tournament in Germany. With enhanced player animations, EA SPORTS has emulated close to 100 of the world's superstars, capturing their playing styles and individual likenesses. In addition to enabling gamers to participate in the 2006 FIFA World Cup Germany by taking control of one of 127 national teams, the game features new compelling modes of play, including the groundbreaking Global Challenge that tests even the most hardcore soccer fan by recreating classic moments in FIFA World Cup history. Furthermore, the game supports up to eight-way multiplayer matches and features a plethora of in-game unlockable content such as legendary players and exclusive apparel. [Electronic Arts]… Expand"}, {"name": "Tchia", "details_link": "https://www.metacritic.com/game/pc/tchia", "publisher": "Awaceb", "release_date": "Mar 21 2023", "developers": ["Awaceb"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Action Adventure", "Open-World"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/a8947d6ecf7e310a99f08de03fa51438-98.jpg", "descriptions": "A Tropical Open-World adventure. Climb, glide, swim, and sail your boat around a beautiful archipelago in this physics-driven sandbox. Use Tchia's special ability to take control of any animal or object you can find, and Jam on your fully playable Ukulele. A game inspired by New Caledonia."}, {"name": "Pillars of Eternity II: Deadfire", "details_link": "https://www.metacritic.com/game/playstation-4/pillars-of-eternity-ii-deadfire", "publisher": "Obsidian Entertainment", "release_date": "Jan 28 2020", "developers": ["Obsidian Entertainment", "Red Cerberus"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 77, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/3/0acfb16082336938ef31b903c46c8329-98.jpg", "descriptions": "Pursue a rogue god over land and sea in the sequel to the multi-award-winning RPG Pillars of Eternity. Captain your ship on a dangerous voyage of discovery across the vast unexplored archipelago region of the Deadfire. Bend the world to your will, as you explore the depths of infinitePursue a rogue god over land and sea in the sequel to the multi-award-winning RPG Pillars of Eternity. Captain your ship on a dangerous voyage of discovery across the vast unexplored archipelago region of the Deadfire. Bend the world to your will, as you explore the depths of infinite possibilities, including detailed character customization, total freedom of exploration, and more meaningful choices at every turn.Features:* Immerse yourself in a deeper single player RPG game experience -- enriched with cutting edge technology and features, Deadfire builds on the foundation of classic D&D gameplay with vastly improved graphics, deeper game mechanics and a whole new hand-crafted adventure where choices truly matter.* Discover the new region of the Deadfire -- plot your own course by ship and explore the rich and exotic islands of the archipelago region, discovering new places interacting with their inhabitants and engaging in a variety of quests at every port.* Build your party and customize your companions -- choose from 7 different companions to join you on your quest and assign multiple classes and deeper abilities for each. Witness their personal relationships and interactions unfold with the addition of the new companion system.* Captain your ship across the seas -- as your stronghold on the seas, your ship is much more than simply a vessel for exploring. Upgrade your ship and crew and choose what skills you improve in order to survive dangerous encounters along the way.… Expand"}, {"name": "1979 Revolution: Black Friday", "details_link": "https://www.metacritic.com/game/switch/1979-revolution-black-friday", "publisher": "Digerati Distribution", "release_date": "Aug  2 2018", "developers": ["iNK Stories"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/b547a7e3004bc59bdb9b68e05e015ced-98.jpg", "descriptions": "Based on true stories and historical events, 1979 Revolution: Black Friday is an interactive drama about choice and consequence, chaos and order. The year is 1978, the place is Tehran, Iran. You play a photojournalist who returns home to find his people protesting the ruling King, the Shah.Based on true stories and historical events, 1979 Revolution: Black Friday is an interactive drama about choice and consequence, chaos and order. The year is 1978, the place is Tehran, Iran. You play a photojournalist who returns home to find his people protesting the ruling King, the Shah. Armed with your camera, you're soon pulled into a dangerous world of revolution and civil unrest. … Expand"}, {"name": "Giana Sisters: Twisted Dreams", "details_link": "https://www.metacritic.com/game/pc/giana-sisters-twisted-dreams", "publisher": "Black Forest Games", "release_date": "Oct 22 2012", "developers": ["Black Forest Games"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/7a63f2215600f7923e7f6d2483b49048-98.jpg", "descriptions": "Project Giana is a platformer with a twist that derives its name from the protagonist, a little girl stuck in a dream world."}, {"name": "Alien Swarm", "details_link": "https://www.metacritic.com/game/pc/alien-swarm", "publisher": "Valve Software", "release_date": "Jul 19 2010", "developers": ["Valve Software"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/e6ae610c616b9cc3474cab2b574e5cfd-98.jpg", "descriptions": "Available free of charge, the game thrusts players into an epic bug hunt featuring a unique blend of co-op play and squad-level tactics. With your friends, form a squad of four distinct IAF Marine classes. Plan your attack using an unlockable arsenal of weapons with countless loadoutAvailable free of charge, the game thrusts players into an epic bug hunt featuring a unique blend of co-op play and squad-level tactics. With your friends, form a squad of four distinct IAF Marine classes. Plan your attack using an unlockable arsenal of weapons with countless loadout configurations against a wide variety of aliens. Blaze your way through an overrun, off-world colony, eradicating the alien infestation in environments ranging from the icy planet's surface, to a subterranean lava-flooded mining facility. Along with the game get the complete code base for Alien Swarm that features updates to the Source engine as well as the SDK. Alien Swarm adds 3rd person camera, depth of field, improved dynamic shadows and a wide variety of gameplay additions to the Source engine. [Steam]… Expand"}, {"name": "Art Style: BASE 10", "details_link": "https://www.metacritic.com/game/ds/art-style-base-10", "publisher": "Nintendo", "release_date": "Jul  6 2009", "developers": ["Skip Ltd."], "platforms": "DS", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/ffb5152f3ac276cdccf87187d8c6ddcd-98.jpg", "descriptions": "[DSiWare; also known as \"Art Style: BASE 10\"]  The Art Style series brings you unique, simple-to-play games with striking visuals and immersive sound. Art Style: CODE is a fast-paced puzzle game that will test your quick arithmetic skills. Line up the moving digits with the stylus so that[DSiWare; also known as \"Art Style: BASE 10\"]  The Art Style series brings you unique, simple-to-play games with striking visuals and immersive sound. Art Style: CODE is a fast-paced puzzle game that will test your quick arithmetic skills. Line up the moving digits with the stylus so that they add up to 10 in a horizontal or vertical line to clear them from the screen. Three single-player modes are included: Target (clear a set number of digits), Puzzle (clear the screen in as few moves as possible) and Endless (keep clearing digits for a high score). You can also use DS Download Play to challenge a friend in VS Mode. All they need is another Nintendo DSi, or even a Nintendo DS/DS Lite system. [Nintendo]… Expand"}, {"name": "Rune Factory 2: A Fantasy Harvest Moon", "details_link": "https://www.metacritic.com/game/ds/rune-factory-2-a-fantasy-harvest-moon", "publisher": "Natsume", "release_date": "Nov 18 2008", "developers": ["Neverland"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/624fce168ff1e4747d8cbbbe10434e37-98.jpg", "descriptions": "Rune Factory 2 is set several years after the first game. The evil Sechs Empire has been defeated, and the Kingdom of Norad is once again at peace. Things may not stay that way for long, however, as dark premonitions foretell of dangers to come.  It's up to player to uncover the source ofRune Factory 2 is set several years after the first game. The evil Sechs Empire has been defeated, and the Kingdom of Norad is once again at peace. Things may not stay that way for long, however, as dark premonitions foretell of dangers to come.  It's up to player to uncover the source of these premonitions and bring peace to the kingdom once more. Over the course of the story, players will build and develop a farm, befriend townspeople, raise monsters, take on quests, and find a wife. Rune Factory 2 offers innovative Touch Screen controls, easy-to-use menus, and an all-new compelling storyline. In a first for the Rune Factory series, the story of Rune Factory 2 is multigenerational. Players begin the game as Kyle, a strange man who comes to Alvarna Village. Eventually, players will take on the role of Kyle's child, opening up a whole new adventure. It's an innovative feature that allows players to follow the story of their family and the townsfolk over two generations. [Natsume]… Expand"}, {"name": "FIFA World Cup: Germany 2006", "details_link": "https://www.metacritic.com/game/playstation-2/fifa-world-cup-germany-2006", "publisher": "Electronic Arts", "release_date": "Apr 24 2006", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/ac7fb1e0dd5ee38458dcb0158ae487b3-98.jpg", "descriptions": "2006 FIFA World Cup features 12 official stadiums used at 2006 FIFA World Cup Germany and stadiums from each qualifying region. Gamers can play as their favorite team from qualification right through to a virtual reproduction of the tournament in Germany. With enhanced player animations, EA2006 FIFA World Cup features 12 official stadiums used at 2006 FIFA World Cup Germany and stadiums from each qualifying region. Gamers can play as their favorite team from qualification right through to a virtual reproduction of the tournament in Germany. With enhanced player animations, EA SPORTS has emulated close to 100 of the world's superstars, capturing their playing styles and individual likenesses. In addition to enabling gamers to participate in the 2006 FIFA World Cup Germany by taking control of one of 127 national teams, the game features new compelling modes of play, including the groundbreaking Global Challenge that tests even the most hardcore soccer fan by recreating classic moments in FIFA World Cup history. Furthermore, the game supports up to eight-way multiplayer matches and features a plethora of in-game unlockable content such as legendary players and exclusive apparel. [Electronic Arts]… Expand"}, {"name": "Soldiers: Heroes of World War II", "details_link": "https://www.metacritic.com/game/pc/soldiers-heroes-of-world-war-ii", "publisher": "Codemasters", "release_date": "Jun 30 2004", "developers": ["Best Way"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 77, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/1c8f2a9a3e94a0bb77eadd8ab47c329b-98.jpg", "descriptions": "Soldiers is a third-person tactical action game that plays out like a blockbuster war movie. 30+ missions, More than 100 vehicles, 25+ weapons. Pitching the player headlong into the war-torn battlegrounds of Europe. Direct control for targeted shots to take out a tank track or execute aSoldiers is a third-person tactical action game that plays out like a blockbuster war movie. 30+ missions, More than 100 vehicles, 25+ weapons. Pitching the player headlong into the war-torn battlegrounds of Europe. Direct control for targeted shots to take out a tank track or execute a headshot for the quick kill. Real ballistic physics and truly destructible environments. Group control a team of elite special forces soldiers. Advanced AI - the enemy will attack in formation; retreat if necessary; look for cover; ambush you, etc. Over 100 different human animations in the game providing realism and detail! [Codemasters]… Expand"}, {"name": "Shadows of the Damned", "details_link": "https://www.metacritic.com/game/playstation-3/shadows-of-the-damned", "publisher": "Electronic Arts", "release_date": "Jun 21 2011", "developers": ["Grasshopper Manufacture"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/6b30f6c1cb5bf23ffb14bb44a1db620a-98.jpg", "descriptions": "No More Heroes creator Goichi Suda and Resident Evil 4 director Shinji Mikami are hard at work on a new horror action game to be published by EA."}, {"name": "The Elder Scrolls Online: Morrowind", "details_link": "https://www.metacritic.com/game/pc/the-elder-scrolls-online-morrowind", "publisher": "Bethesda Softworks", "release_date": "May 22 2017", "developers": ["ZeniMax Media"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 77, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/7ce912239e44b2088fc9dc75c7bca2e5-98.jpg", "descriptions": "For players who already own The Elder Scrolls Online, adventure awaits in this new chapter of the award-winning online series. Morrowind is on the verge of destruction, and it’s up to you to save it from a deadly Daedric threat. Embark on a dangerous journey through legendary locales."}, {"name": "The Godfather", "details_link": "https://www.metacritic.com/game/xbox/the-godfather", "publisher": "Electronic Arts", "release_date": "Mar 21 2006", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Historic"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/e4c3c2f3176aef65335bcb33269250e8-98.jpg", "descriptions": "You can move up the ranks of the Corleone crime family in The Godfather. In the game based on the book and movie, you go from humble beginnings of petty crime and rise to be the most powerful crime lord in all of New York. The Godfather features customizable characters and a persistentYou can move up the ranks of the Corleone crime family in The Godfather. In the game based on the book and movie, you go from humble beginnings of petty crime and rise to be the most powerful crime lord in all of New York. The Godfather features customizable characters and a persistent gameworld, where your decisions affect how other characters interact with you. Marlon Brando, James Caan, and Robert Duvall return to the franchise to voice characters in the game as well.… Expand"}, {"name": "Crisis Core: Final Fantasy VII Reunion", "details_link": "https://www.metacritic.com/game/switch/crisis-core-final-fantasy-vii-reunion", "publisher": "Square Enix", "release_date": "Dec 13 2022", "developers": ["Square Enix", "TOSE"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/8e6ef59cb16ed75777578ba36e7564a7-98.jpg", "descriptions": "CRISIS CORE -FINAL FANTASY VII- REUNION is a full remaster of the PlayStation Portable exclusive CRISIS CORE -FINAL FANTASY VII-, which originally launched back in 2007.CRISIS CORE -FINAL FANTASY VII- REUNION is a true remaster that follows the original's narrative: Zack Fair's mission toCRISIS CORE -FINAL FANTASY VII- REUNION is a full remaster of the PlayStation Portable exclusive CRISIS CORE -FINAL FANTASY VII-, which originally launched back in 2007.CRISIS CORE -FINAL FANTASY VII- REUNION is a true remaster that follows the original's narrative: Zack Fair's mission to find the missing SOLDIER Genesis Rhapsodos. It features multiple improvements from the original game - for example, the graphics have been converted to HD, with all the 3D models, from the characters to everything else, being fully refreshed. What's more the dialogue is now fully voice-acted, and there's a new arrangement for the soundtrack!… Expand"}, {"name": "Sucker for Love: First Date", "details_link": "https://www.metacritic.com/game/pc/sucker-for-love-first-date", "publisher": "DreadXP", "release_date": "Jan 20 2022", "developers": ["Akabaka"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Visual Novel"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/bc15b84f293b4055e1c090038356442a-98.jpg", "descriptions": "Obsessed with occult rituals, you have finally obtained the last thing you need to summon the eldritch horror that has been haunting your dreams; a strange, bright-pink Necronomicon. You perform the only ritual that doesn't appear to be insane ramblings, and inadvertently summon Ln'eta, aObsessed with occult rituals, you have finally obtained the last thing you need to summon the eldritch horror that has been haunting your dreams; a strange, bright-pink Necronomicon. You perform the only ritual that doesn't appear to be insane ramblings, and inadvertently summon Ln'eta, a cute cthulhu-like girl. She agrees to a kiss, on the condition that you perform a few rituals from the book for her first. Looking back at the Necronomicon... all of the other pages suddenly make sense?Put the 'love' in 'Lovecraftian horror'! Perform terrifying rituals to win the affections of eldritch horrors and smooch 'em... at any cost!… Expand"}, {"name": "Sakuna: Of Rice and Ruin", "details_link": "https://www.metacritic.com/game/playstation-4/sakuna-of-rice-and-ruin", "publisher": "XSEED Games", "release_date": "Nov 10 2020", "developers": ["Edelweiss"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/7d352ef492cfcc79e16e41ad30c2dd9e-98.jpg", "descriptions": "Sakuna: Of Rice and Ruin combines side-scrolling action with deep crafting and farming simulation. Players take on the role of Sakuna, a spoiled harvest goddess banished to a dangerous island with a group of outcast humans. As she explores the beautiful, forbidding environments of theSakuna: Of Rice and Ruin combines side-scrolling action with deep crafting and farming simulation. Players take on the role of Sakuna, a spoiled harvest goddess banished to a dangerous island with a group of outcast humans. As she explores the beautiful, forbidding environments of the island, she will also find a home in a mountain village, proving herself worthy of her title by harvesting rice and bettering the lives of humans. In addition to being a fresh take on Japanese mythology and a love letter to action games, Sakuna: Of Rice and Ruin is an ode to rice and an engrossing simulation of the craft behind the agriculture.… Expand"}, {"name": "Cat Quest II", "details_link": "https://www.metacritic.com/game/switch/cat-quest-ii", "publisher": "PQube", "release_date": "Oct 24 2019", "developers": ["The Gentlebros"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General", "Action RPG"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/dd2e436e63d8f1809c4680bcc71e669b-98.jpg", "descriptions": "Following the success of CAT QUEST, developers The Gentlebros return to the world of Felingard, a fantastical land under threat from a continuing war."}, {"name": "Whispers of a Machine", "details_link": "https://www.metacritic.com/game/pc/whispers-of-a-machine", "publisher": "Raw Fury", "release_date": "Apr 17 2019", "developers": ["Clifftop Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/8eb523b742f83f180ca3154bbd6247e0-98.jpg", "descriptions": "Whispers of a Machine is a Sci-Fi Nordic Noir that tells the story of Vera, a cybernetically augmented detective in a post-AI world, who investigates a string of murders and unravels a dark conflict over forbidden technology."}, {"name": "Flashback", "details_link": "https://www.metacritic.com/game/switch/flashback", "publisher": "Microids", "release_date": "Jun 17 2018", "developers": ["Paul Cuisset"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/8d086f4784069fe486306fd1f5b1bc1b-98.jpg", "descriptions": "THE ACTION-ADVENTURE CLASSIC IS BACK TO CELEBRATE ITS 25TH ANNIVERSARY!2142. After fleeing from a space ship but stripped of all memory, the eminent scientist Conrad B. Hart awakens on Titan, a colonised moon of the planet Saturn. His enemies and kidnappers are snapping at his heels. HeTHE ACTION-ADVENTURE CLASSIC IS BACK TO CELEBRATE ITS 25TH ANNIVERSARY!2142. After fleeing from a space ship but stripped of all memory, the eminent scientist Conrad B. Hart awakens on Titan, a colonised moon of the planet Saturn. His enemies and kidnappers are snapping at his heels. He must find a way back to Earth, defending himself against the dangers he encounters and unravelling an insidious extra-terrestrial plot that threatens the planetOn its 25th anniversary, rediscover this classic, consistently ranked among the best 100 games of all time! It was one of the first games to use motion capture technology for more realistic animations, with backgrounds that were entirely hand-drawn and a gripping science-fiction storyline.In addition to the original 1993 game, this version includes a Modern mode, with:* Post-FX graphic filters,* Completely remastered sound and music,* A brand new \"Rewind\" function, variable according to the level of difficulty* Tutorials for those who need a boost!See if you're up to the challenge with all the demanding gameplay of the period!… Expand"}, {"name": "Bloodstained: Curse of the Moon", "details_link": "https://www.metacritic.com/game/pc/bloodstained-curse-of-the-moon", "publisher": "Inti Creates", "release_date": "May 24 2018", "developers": ["Inti Creates"], "platforms": ["3DS", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "2D"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/1817f472eb8f379e22fa3c2c1f24982b-98.jpg", "descriptions": "Battle with swords and whips in this retro-style action game brought to you by game creator Koji Igarashi and Inti Creates!Play as Zangetsu, a demon slayer bearing a deep grudge, who must travel through perilous lands to defeat a powerful demon lurking in a dark castle. Zangetsu will meetBattle with swords and whips in this retro-style action game brought to you by game creator Koji Igarashi and Inti Creates!Play as Zangetsu, a demon slayer bearing a deep grudge, who must travel through perilous lands to defeat a powerful demon lurking in a dark castle. Zangetsu will meet fellow travelers along the way, who can join your journey as playable characters.Switching to these characters with their unique abilities will unlock new paths through the treacherous stages. Your choices in recruiting these adventurers will change the difficulty of the game, and may even affect the ending!*Bloodstained: Curse of the Moon is the 8-bit style game promised as a stretch goal of the 2015 Kickstarter campaign for \"Bloodstained: Ritual of the Night.\"… Expand"}, {"name": "Figment", "details_link": "https://www.metacritic.com/game/pc/figment", "publisher": "Bedtime Digital Games", "release_date": "Sep 22 2017", "developers": ["Bedtime Digital Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/a0273771a9f40a02e81cfdd4453ee15e-98.jpg", "descriptions": "Figment is an action-adventure game that invites you to explore a unique surreal universe filled with music, humor and multi layered narrative. Join Dusty and his ever-optimistic friend, Piper, on an adventure through the different sides of the mind seeking to restore the courage that's been lost."}, {"name": "Project Zero 2: Wii Edition", "details_link": "https://www.metacritic.com/game/wii/project-zero-2-wii-edition", "publisher": "Nintendo", "release_date": "Jun 29 2012", "developers": ["Koei Tecmo Games"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 77, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/4570689e2c8702509cf36296f8601c5d-98.jpg", "descriptions": "A horror sequel for the Wii."}, {"name": "Dragon Quest Heroes: The World Tree's Woe and the Blight Below", "details_link": "https://www.metacritic.com/game/playstation-4/dragon-quest-heroes-the-world-trees-woe-and-the-blight-below", "publisher": "Square Enix", "release_date": "Oct 13 2015", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["2D", "Action", "Beat-'Em-Up", "3D"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/c0c5264fce653a9c1c16d81ac483f897-98.jpg", "descriptions": "In DRAGON QUEST HEROES, players must rise up against insurmountable odds, challenging swarms of enemies and conquering gigantic monsters. DRAGON QUEST HEROES comes to the PlayStation 4 with characters and monsters designed by artist Akira Toriyama."}, {"name": "Stellaris: Console Edition", "details_link": "https://www.metacritic.com/game/playstation-4/stellaris-console-edition", "publisher": "Tantalus", "release_date": "Feb 26 2019", "developers": ["Paradox Development Studio"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/75ec4c4508c6151b36d6c19a2ee94cda-98.jpg", "descriptions": "Featuring deep strategic gameplay, an enormous selection of alien races and emergent storytelling, Stellaris has a deeply challenging system that rewards interstellar exploration as you traverse, discover, interact and learn more about the multitude of species you will encounter during yourFeaturing deep strategic gameplay, an enormous selection of alien races and emergent storytelling, Stellaris has a deeply challenging system that rewards interstellar exploration as you traverse, discover, interact and learn more about the multitude of species you will encounter during your travels.\r Etch your name across the cosmos by uncovering remote celestial outposts,and entire civilizations. Will you expand through war or walk the path of diplomacy to achieve your goals?… Expand"}, {"name": "Humankind", "details_link": "https://www.metacritic.com/game/pc/humankind", "publisher": "SegaSoft", "release_date": "Aug 17 2021", "developers": ["Amplitude Studios"], "platforms": ["PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "4X"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/91e3183e8051d002c0cca6596942d638-98.jpg", "descriptions": "HUMANKIND is a Historical Strategy game where YOU will re-write the entire narrative of humankind – a convergence of culture, history, and values that allows you to create a civilization that is as unique as you are. HOW FAR WILL YOU PUSH HUMANKIND?"}, {"name": "The Elder Scrolls Online: Tamriel Unlimited", "details_link": "https://www.metacritic.com/game/xbox-one/the-elder-scrolls-online-tamriel-unlimited", "publisher": "Bethesda Softworks", "release_date": "Jun  9 2015", "developers": ["ZeniMax Media"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Massively Multiplayer", "genres": ["First-Person", "First-Person", "Massively Multiplayer Online", "Fantasy", "Role-Playing", "Massively Multiplayer"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/22ffdb6a6059439f1283de105a6eba45-98.jpg", "descriptions": "The Elder Scrolls Online: Tamriel Unlimited includes all the gameplay from the original PC/Mac game, plus all the updates and content additions, including the new Justice and Champion systems.  All existing PC/Mac game accounts, open or closed, will be updated to the Tamriel UnlimitedThe Elder Scrolls Online: Tamriel Unlimited includes all the gameplay from the original PC/Mac game, plus all the updates and content additions, including the new Justice and Champion systems.  All existing PC/Mac game accounts, open or closed, will be updated to the Tamriel Unlimited edition in March and former players will be invited back to the game at that time to experience all that is new in the world. New players will make a one-time purchase of the game and play, without restrictions, for as long as they like – without game subscription fees. Tamriel Unlimited will be supported with special, optional downloadable content available for purchase and an in-game Crown Store for convenience and customization items. Regular updates and new gameplay will be offered to all players to enjoy free of additional charges. [Bethesda]… Expand"}, {"name": "Inazuma Eleven Go: Chrono Stones: Thunderflash", "details_link": "https://www.metacritic.com/game/3ds/inazuma-eleven-go-chrono-stones-thunderflash", "publisher": "Level 5", "release_date": "Mar 27 2015", "developers": ["Level 5"], "platforms": "3DS", "genres": ["Sports", "Soccer", "Arcade", "Team"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/2c093a1b20099e759c70adf78cbc2fb3-98.jpg", "descriptions": "Fight for the future of football in Inazuma Eleven GO Chrono Stones: Wildfire and Thunderflash on Nintendo 3DS and 2DS, as the Raimon Jr. High team thrust themselves into a time-bending RPG, where new armourfied Fighting Spirits, new characters, and new footballing adventures await."}, {"name": "Kaze and the Wild Masks", "details_link": "https://www.metacritic.com/game/playstation-4/kaze-and-the-wild-masks", "publisher": "Soedesco", "release_date": "Mar 26 2021", "developers": ["PixelHive"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Platformer", "2D"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/d6a3dd2404874c7882c143252ed8dee1-98.jpg", "descriptions": "Unleash the skills of the Wild Masks to get powers from the tiger, eagle, lizard and shark. Uncover the secrets of the Crystal Islands in 30+ levels with over 50 bonus levels. Relive your childhood memories of classic platformer with high quality frame by frame pixel art. Pave your wayUnleash the skills of the Wild Masks to get powers from the tiger, eagle, lizard and shark. Uncover the secrets of the Crystal Islands in 30+ levels with over 50 bonus levels. Relive your childhood memories of classic platformer with high quality frame by frame pixel art. Pave your way through a satisfyingly smooth, but challenging platformer.\r… Expand"}, {"name": "LEGO City Undercover", "details_link": "https://www.metacritic.com/game/xbox-one/lego-city-undercover", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr  4 2017", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Wii U", "Xbox One"], "genres": ["Action Adventure", "Open-World"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/561dd7ee4712bb450a080aa47a938415-98.jpg", "descriptions": "In LEGO City: Undercover developed by TT Games and published by Nintendo, players assume the identity of Chase McCain, an undercover detective armed with clever disguises. As players run, drive and even fly through the city, they'll use the Wii U GamePad as a map, communicator andIn LEGO City: Undercover developed by TT Games and published by Nintendo, players assume the identity of Chase McCain, an undercover detective armed with clever disguises. As players run, drive and even fly through the city, they'll use the Wii U GamePad as a map, communicator and indispensable crime scanner. This is the first time that the LEGO City play sets have come to life on a gaming platform and it's exclusively on the Wii U console.… Expand"}, {"name": "Baldur's Gate: Siege of Dragonspear", "details_link": "https://www.metacritic.com/game/pc/baldurs-gate-siege-of-dragonspear", "publisher": "Beamdog", "release_date": "Mar 31 2016", "developers": ["Overhaul Games"], "platforms": "PC", "genres": ["Role-Playing", "Western-Style"], "meta_score": 77, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/7/1782d3b9da0d2ba5d284f0ee99f28bb6-98.jpg", "descriptions": "Baldur’s Gate: Siege of Dragonspear adds a new chapter to the Bhaalspawn saga. The events occurring between Baldur’s Gate and Baldur’s Gate II are at last revealed in this 25-hour expansion pack for Baldur's Gate: Enhanced Edition."}, {"name": "EA Sports UFC 3", "details_link": "https://www.metacritic.com/game/xbox-one/ea-sports-ufc-3", "publisher": "Electronic Arts", "release_date": "Jan 30 2018", "developers": ["EA Sports"], "platforms": ["PlayStation 4", "Xbox One"], "num_players": "2 ", "genres": ["Sports", "Individual", "Combat", "Boxing / Martial Arts"], "meta_score": 77, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/4a946d636aa9c9d344f01f7f6c5b743f-98.jpg", "descriptions": "Real Player Motion - New cutting-edge animation technology makes every move, strike, and combination more realistic, responsive, and rewarding. G.O.A.T. Career Mode - Build hype to gain fans and create rivalries that capture the world’s attention. Then fight to dominate the Octagon.Real Player Motion - New cutting-edge animation technology makes every move, strike, and combination more realistic, responsive, and rewarding. G.O.A.T. Career Mode - Build hype to gain fans and create rivalries that capture the world’s attention. Then fight to dominate the Octagon. Multiplayer Mode - New customizable multiplayer modes let you and your friends face off with highlight-reel knockouts.\r… Expand"}, {"name": "Gears of War 3: RAAM's Shadow", "details_link": "https://www.metacritic.com/game/xbox-360/gears-of-war-3-raams-shadow", "publisher": "Microsoft Game Studios", "release_date": "Dec 13 2011", "developers": ["Epic Games"], "platforms": "Xbox 360", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/f1acf8e8eb6cdf2561af7f0bff9efc98-98.jpg", "descriptions": "Starring a cast of characters both new and eerily familiar to the series, RAAM’s Shadow delivers more than three hours of new campaign gameplay set in a storyline that precedes the events of the first Gears of War, as well as six new multiplayer characters, the Chocolate Weapon Skin Set andStarring a cast of characters both new and eerily familiar to the series, RAAM’s Shadow delivers more than three hours of new campaign gameplay set in a storyline that precedes the events of the first Gears of War, as well as six new multiplayer characters, the Chocolate Weapon Skin Set and an additional 250 Gamerscore. RAAM’s Shadow drops players into the events of Sera post-Emergence Day, as Zeta Squad is enlisted to evacuate Ilima City and protect the citizens against a Locust Kryll storm. Taking on the infamous Locust leader from Gears 1, General RAAM, Zeta is led by Michael Barrick (from Gears of War comics fame) and comprised of familiar faces such as Lt. Minh Young Kim (Gears 1) and Tai Kaliso (Gears 2), and also includes a new female comrade, Alicia Valera. [Microsoft]… Expand"}, {"name": "Crysis 3", "details_link": "https://www.metacritic.com/game/playstation-3/crysis-3", "publisher": "EA Games", "release_date": "Feb 19 2013", "developers": ["Crytek"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 77, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/69a22b4583890fc9a43905351cbee5e5-98.jpg", "descriptions": "Set in the year 2047, Prophet has embarked upon a revenge mission after uncovering the truth behind Cell Corporation's motives for building the quarantined Nanodomes. The citizens were informed that the giant citywide structures were resurrected to protect the population and to cleanse theseSet in the year 2047, Prophet has embarked upon a revenge mission after uncovering the truth behind Cell Corporation's motives for building the quarantined Nanodomes. The citizens were informed that the giant citywide structures were resurrected to protect the population and to cleanse these metropolises of the remnants of Ceph forces. In reality, the Nanodomes are CELL's covert attempt at a land and technology grab in their quest for global domination. With Alien Ceph lurking around every corner and human enemies on the attack, nobody is safe in the path of vengeance. Everyone is a target in Prophet's quest for retribution.… Expand"}, {"name": "Mega Man Zero 3", "details_link": "https://www.metacritic.com/game/game-boy-advance/mega-man-zero-3", "publisher": "Capcom", "release_date": "Oct  5 2004", "developers": ["Inti"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/ee7dc93dcf14fc77e5e331348a50bcc9-98.jpg", "descriptions": "Mega Man Zero 3 continues the saga of the main character, Zero, and introduces new gameplay elements that build and expand upon previous games in the Zero series. While Zero and his Reploid (robot) allies continue the fight for peace in Neo Arcadia, a new reploid, Omega, attempts toMega Man Zero 3 continues the saga of the main character, Zero, and introduces new gameplay elements that build and expand upon previous games in the Zero series. While Zero and his Reploid (robot) allies continue the fight for peace in Neo Arcadia, a new reploid, Omega, attempts to brainwash the Resistance. Now, as Zero, you must save your allies by using new customizable chips, a new Recoil Rod weapon, Cyber Elves that increase your abilities, and secret disks that offer valuable information.… Expand"}, {"name": "Islets", "details_link": "https://www.metacritic.com/game/pc/islets", "publisher": "Armor Games", "release_date": "Aug 24 2022", "developers": ["Kyle Thompson"], "platforms": ["Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "Metroidvania"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/208dc32c7b2af4af98b31d13b1bec0a9-98.jpg", "descriptions": "Iko is an aspiring yet hopeful warrior exploring the land and sky to reunite a series of floating islands. With his rickety airship, he must travel from island to island in order to reignite each one's magnetic core while fighting off the many adversaries standing in his way.Islets is aIko is an aspiring yet hopeful warrior exploring the land and sky to reunite a series of floating islands. With his rickety airship, he must travel from island to island in order to reignite each one's magnetic core while fighting off the many adversaries standing in his way.Islets is a surprisingly wholesome metroidvania about making connections with the people around you. By reuniting the islands and befriending a cast of charming characters, the world expands and reveals new parts of each area for Iko to explore. Scour every nook and cranny in order to collect the many upgrades hidden around this world and face its numerous hidden challenges!There's also a tour guide to show you around, but you should be careful. The guy's got some really weird vibes...… Expand"}, {"name": "Exo One", "details_link": "https://www.metacritic.com/game/xbox-series-x/exo-one", "publisher": "Future Friends Games", "release_date": "Nov 18 2021", "developers": ["Exbleative"], "platforms": ["PC", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "General", "Space", "Civilian"], "meta_score": 77, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/51e43ba4eaef4724370754e7fb9aae01-98.jpg", "descriptions": "A strange signal… an alien craft… Exo One is an interplanetary, gravity-defying journey through space and time. Master a truly alien traversal system and move through enigmatic and desolate landscapes in ways you’ve never experienced. Use gravity and momentum to reach colossal speeds andA strange signal… an alien craft… Exo One is an interplanetary, gravity-defying journey through space and time. Master a truly alien traversal system and move through enigmatic and desolate landscapes in ways you’ve never experienced. Use gravity and momentum to reach colossal speeds and exhilarating heights.… Expand"}, {"name": "Golf Club: Wasteland", "details_link": "https://www.metacritic.com/game/xbox-one/golf-club-wasteland", "publisher": "Untold Tales", "release_date": "Sep  3 2021", "developers": ["Demagog Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Adventure", "Puzzle", "Action", "General"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/565e8011e5455f4240cb7a0d07f70115-98.jpg", "descriptions": "Human life is wiped out. Earth is now a golf course for the ultra-rich. The rich fled to Mars but venture back to a desolate Earth for a round of golf. Each hole in the wasteland offers its own little story and possible puzzle to sink the perfect shot. Play through destroyed brutalistHuman life is wiped out. Earth is now a golf course for the ultra-rich. The rich fled to Mars but venture back to a desolate Earth for a round of golf. Each hole in the wasteland offers its own little story and possible puzzle to sink the perfect shot. Play through destroyed brutalist monuments, crumbling shopping malls, and abandoned museums as neon signs and poignant graffiti take swings at current events, Silicon Valley culture and humanity. Piece together the full story of how humanity fell through three distinct sources. Details from the lone golfer’s story, who's come back to Earth for one last game. The Radio Nostalgia From Mars broadcast that gives a glimpse into the lives of those who escaped. And the narration of a “secret spectator” watching from a distance...Be accompanied by a purposefully composed soundtrack as well as personal stories broadcasted on Radio Nostalgia From Mars. The station caters to citizens of Mars, nostalgic for Earth as they listen to music from the 2020s, and dial in to share their memories of the planet. A smooth-voiced radio DJ keeps the show flowing with updates and announcements hinting at a not-so-glamorous life on Mars. Three distinct modes mean every golfer can find something for their tastes. Casual players can focus just on the story and a relaxing scenic round of golf in Story Mode. Those looking for an extra challenge can beat each hole under par using skill and puzzle solving through Challenge Mode. While the total pros can try Iron Mode, where there’s almost zero room for error. Easy-to grasp controls and a minimalist UI underpin the whole game so anyone can easily pick up and play at their own pace. … Expand"}, {"name": "Indivisible", "details_link": "https://www.metacritic.com/game/playstation-4/indivisible", "publisher": "505 Games", "release_date": "Oct  8 2019", "developers": ["Lab Zero Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/2ae2a9b30e73d828856dc8fd48b55735-98.jpg", "descriptions": "INDIVISIBLE is inspired by classics like Valkyrie Profile and Metroid, and has the unique character, world, and gameplay depth Lab Zero is known for. Meet Ajna, Indivisible protagonist. Ajna is a headstrong girl raised in a remote village. Her father, the town's guardian, has trained her toINDIVISIBLE is inspired by classics like Valkyrie Profile and Metroid, and has the unique character, world, and gameplay depth Lab Zero is known for. Meet Ajna, Indivisible protagonist. Ajna is a headstrong girl raised in a remote village. Her father, the town's guardian, has trained her to be strong in mind and body to prepare her for things to come. Ajna discovers a mysterious power in herself, and sets off on a world-spanning journey. Along the way, a number of unique heroes will join her on her quest.… Expand"}, {"name": "Pinstripe", "details_link": "https://www.metacritic.com/game/switch/pinstripe", "publisher": "Armor Games", "release_date": "Oct 25 2018", "developers": ["Armor Games", "Atmos Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "General"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/8c287d8b2a0894c20a293d9263ced5d6-98.jpg", "descriptions": "Pinstripe is an emotionally charged adventure through Hell created entirely by a one-man team over the course of five years. Play as Teddy, an estranged ex-minister forced to venture through the frozen afterlife in search of his three-year-old daughter Bo, and her perverse kidnapper.Pinstripe is an emotionally charged adventure through Hell created entirely by a one-man team over the course of five years. Play as Teddy, an estranged ex-minister forced to venture through the frozen afterlife in search of his three-year-old daughter Bo, and her perverse kidnapper. Discover the dark secrets of Teddy's past, and confront his sleazy, demonic nemesis, Mr. Pinstripe. Thomas Brush, the creator of award-winning indie games Coma and Skinny, reveals a gorgeous art style, breathtaking score, and chilling story with influences from The Nightmare Before Christmas, Coraline, and Alice in Wonderland. … Expand"}, {"name": "The Walking Dead: The Telltale Series - The Final Season", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-the-telltale-series---the-final-season", "publisher": "Telltale Games", "release_date": "Aug 13 2018", "developers": ["Telltale Games", "Skybound Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/d31686fa685c237e0a25d91fc0c8f11f-98.jpg", "descriptions": "After years on the road facing threats both living and dead, a secluded school might finally be Clementine’s chance for a home. But protecting it will mean sacrifice. In this gripping, emotional final season, your choices will define your relationships and determine how Clementine’s story ends."}, {"name": "Final Fantasy XV: Royal Edition", "details_link": "https://www.metacritic.com/game/playstation-4/final-fantasy-xv-royal-edition", "publisher": "Square Enix", "release_date": "Mar  6 2018", "developers": ["Square Enix"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/10cc03f94b0a22d8d4a7f5617291164e-98.jpg", "descriptions": "Final Fantasy XV Royal Edition elevates the RPG to new levels, including add-on content and new features. Join Prince Noctis and his closest friends as they fight against the empire in an effort to take back their fallen kingdom."}, {"name": "Kerbal Space Program", "details_link": "https://www.metacritic.com/game/playstation-4/kerbal-space-program", "publisher": "SQUADTeam", "release_date": "Jul 12 2016", "developers": ["Flying Tiger Development"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Simulation", "Space", "Combat", "Civilian"], "meta_score": 77, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/b408bfe307f9eadb8c6759877b8979d7-98.jpg", "descriptions": "In Kerbal Space Program you must build a space-worthy ship, capable of flying its crew out into space without killing any of them. At your disposal is a collection of parts, which must be assembled to create a functional craft. Each part has its own function and will affect the way a shipIn Kerbal Space Program you must build a space-worthy ship, capable of flying its crew out into space without killing any of them. At your disposal is a collection of parts, which must be assembled to create a functional craft. Each part has its own function and will affect the way a ship flies (or does not). So strap yourself in, and get ready to try some Rocket Science.… Expand"}, {"name": "Men of War: Assault Squad", "details_link": "https://www.metacritic.com/game/pc/men-of-war-assault-squad", "publisher": "1C", "release_date": "Feb 25 2011", "developers": ["THQ", "1C", "1C Entertainment"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Military", "Military", "Tactics"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/3355a76dc61621c299797a098a5f9627-98.jpg", "descriptions": "This stand-alone expansion pack for Men of War focuses on skirmish maps and multiplayer play."}, {"name": "Singularity", "details_link": "https://www.metacritic.com/game/playstation-3/singularity", "publisher": "Activision", "release_date": "Jun 29 2010", "developers": ["Raven Software"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/6b9110d5aa745b72c0b5110b7d3c9451-98.jpg", "descriptions": "On a clandestine mission deep into Russian territory, an American black ops team crash lands on an island research base that was mysteriously abandoned in the 1950’s. Cut off from the outside and under attack by an army of nightmarish creatures, Captain Nathaniel Renko is forced to battleOn a clandestine mission deep into Russian territory, an American black ops team crash lands on an island research base that was mysteriously abandoned in the 1950’s. Cut off from the outside and under attack by an army of nightmarish creatures, Captain Nathaniel Renko is forced to battle his way through the hostile territory armed with the TMD (Time Manipulation Device) – a time altering weapon created over 50 years ago. Who created the TMD and why is just one of the many Cold War secrets Renko must uncover as he is thrown back and forth across time, making choices that will alter the course of world history. [Raven Software]… Expand"}, {"name": "Command & Conquer 3: Kane's Wrath", "details_link": "https://www.metacritic.com/game/pc/command-conquer-3-kanes-wrath", "publisher": "EA Games", "release_date": "Mar 24 2008", "developers": ["EA LA"], "platforms": ["Xbox 360", "PC"], "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/6d90beab461d48f94ffb37e89405d438-98.jpg", "descriptions": "As the expansion pack to Command & Conquer 3 Tiberium Wars, this Real-time Strategy game returns to the Tiberium universe with Kane at the center of an epic new single player campaign which allows players to experience a new story that spans 20 years – from the rebirth of the Brotherhood ofAs the expansion pack to Command & Conquer 3 Tiberium Wars, this Real-time Strategy game returns to the Tiberium universe with Kane at the center of an epic new single player campaign which allows players to experience a new story that spans 20 years – from the rebirth of the Brotherhood of Nod after the Second Tiberium War through the dramatic events of the Third Tiberium War and beyond. The story is told through a new set of high-definition live action video sequences starring a celebrity cast. Joe Kucan, the original actor who portrayed the character Kane in Command & Conquer games over the last decade, reprises his role as the megalomaniacal leader of the Brotherhood of Nod. Kane's Wrath also features a new strategic layer to gameplay that allows players to establish bases, build customized armies, and attack their enemies on a global scale – and then dive into the frenzied tactical combat where their skills as a commander makes the difference in battle. The game introduces six new sub-factions and a wealth of new units, structures, and powers to the armies of the Global Defense Initiative, the Brotherhood of Nod, and the enigmatic alien Scrin. The Xbox 360 version features a revolutionary new radial interface designed specifically for console gamers. Taking RTS controls to a whole new level, players utilize the command stick to build, deploy, and attack. [Electronic Arts]… Expand"}, {"name": "ATV Offroad Fury 4", "details_link": "https://www.metacritic.com/game/playstation-2/atv-offroad-fury-4", "publisher": "SCEA", "release_date": "Oct 31 2006", "developers": ["Climax Group"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 77, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/1d45f53f2bf9a8d2311bc2c13476ce63-98.jpg", "descriptions": "Select your favorite ATV, or for the first time in franchise history, MX Bikes, Buggies, and Trophy Trucks to race through 72 tenacious tracks on six different continents en route to the checkered flag. Featuring an all-new story mode, players will be able to live the life of a rookie riderSelect your favorite ATV, or for the first time in franchise history, MX Bikes, Buggies, and Trophy Trucks to race through 72 tenacious tracks on six different continents en route to the checkered flag. Featuring an all-new story mode, players will be able to live the life of a rookie rider and earn a path to the ranks of professional racer. Players will experience the drama and intensity of realistic offroad racing with increasingly difficult race challenges and events all tied together with engaging, story-driven Full Motion Videos (FMVs). ATV Offroad Fury 4 adds cross communication capabilities with ATV Offroad Fury Pro for the PSP (PlayStationPortable) system, including vehicle exchanges and upgrades, shared online communities, and the ability to share user created circuits. Adding to the selection of classic ATVs, more than 30 new vehicles are available to race including MX bikes, buggies, and trophy trucks. Extensive vehicle customization provides players the chance to upgrade a vehicle's suspension, engine, gearbox, exhaust, intake, and brakes. New Cross-Connection Compatibility with ATV Offroad Fury Pro for PSP – Players are now able to share customized circuits, exchange and upgrade vehicles, and access chat rooms and newsgroups with the upcoming ATV Offroad Fury Pro for PSP. [SCEA]… Expand"}, {"name": "FIFA World Cup: Germany 2006", "details_link": "https://www.metacritic.com/game/xbox/fifa-world-cup-germany-2006", "publisher": "Electronic Arts", "release_date": "Apr 24 2006", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 77, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/c4fdb948da2d381538a59bef8d6df7d2-98.jpg", "descriptions": "2006 FIFA World Cup features 12 official stadiums used at 2006 FIFA World Cup Germany and stadiums from each qualifying region. Gamers can play as their favorite team from qualification right through to a virtual reproduction of the tournament in Germany. With enhanced player animations, EA2006 FIFA World Cup features 12 official stadiums used at 2006 FIFA World Cup Germany and stadiums from each qualifying region. Gamers can play as their favorite team from qualification right through to a virtual reproduction of the tournament in Germany. With enhanced player animations, EA SPORTS has emulated close to 100 of the world's superstars, capturing their playing styles and individual likenesses. In addition to enabling gamers to participate in the 2006 FIFA World Cup Germany by taking control of one of 127 national teams, the game features new compelling modes of play, including the groundbreaking Global Challenge that tests even the most hardcore soccer fan by recreating classic moments in FIFA World Cup history. Furthermore, the game supports up to eight-way multiplayer matches and features a plethora of in-game unlockable content such as legendary players and exclusive apparel.… Expand"}, {"name": "Car Battler Joe", "details_link": "https://www.metacritic.com/game/game-boy-advance/car-battler-joe", "publisher": "Natsume", "release_date": "Oct 21 2002", "developers": ["Ancient"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/fde7f320898d3eccfc8c425965c997ef-98.jpg", "descriptions": "Rampaging rogues roam the highways and byways that surround your village. If your believed the rumors, you would blame your missing father for the surge in vehicular violence. That's why you've decided to lead the life of a car battler, transporting cargo between towns and running down everyRampaging rogues roam the highways and byways that surround your village. If your believed the rumors, you would blame your missing father for the surge in vehicular violence. That's why you've decided to lead the life of a car battler, transporting cargo between towns and running down every lethal lead foot foolish enough to cross your path. This gritty work isn't easy. Other car battlers fight for money or fame, but you have a higher calling: You're determined to restore your family's lost honor and bring your father home.… Expand"}, {"name": "Blasphemous", "details_link": "https://www.metacritic.com/game/switch/blasphemous", "publisher": "Team17", "release_date": "Sep 10 2019", "developers": ["The Game Kitchen"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "", "Metroidvania"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/ae87cf7635276d4e1a4fa22744ed946b-98.jpg", "descriptions": "A foul curse has fallen upon the land of Cvstodia and all its inhabitants - it is simply known as The Miracle.\r Play as The Penitent One - a sole survivor of the massacre of the ‘Silent Sorrow’. Trapped in an endless cycle of death and rebirth, it’s down to you to free the world from thisA foul curse has fallen upon the land of Cvstodia and all its inhabitants - it is simply known as The Miracle.\r Play as The Penitent One - a sole survivor of the massacre of the ‘Silent Sorrow’. Trapped in an endless cycle of death and rebirth, it’s down to you to free the world from this terrible fate and reach the origin of your anguish. \r\rExplore this nightmarish world of twisted religion and discover its many secrets hidden deep inside. Use devastating combos and brutal executions to smite the hordes of grotesque monsters and titanic bosses, who are all ready to rip your limbs off. Locate and equip relics, rosary beads and prayers that call on the powers of the heavens to aid you in your quest to break your eternal damnation.… Expand"}]