[{"name": "Filament", "details_link": "https://www.metacritic.com/game/pc/filament", "publisher": "Kasedo Games", "release_date": "Apr 23 2020", "developers": ["Beard Envy"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Puzzle", "Action", "General"], "meta_score": 82, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/73942bcb2902b4d4455480113069930d-98.jpg", "descriptions": "An abandoned spaceship, missing crew and a lone mysterious voice. Solve challenging puzzles and uncover what really happened to the crew of The Alabaster."}, {"name": "MotoGP 20", "details_link": "https://www.metacritic.com/game/xbox-one/motogp-20", "publisher": "Deep Silver", "release_date": "Apr 23 2020", "developers": ["Milestone S.r.l", "Dorna Sports S.L."], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Racing", "Simulation", "Arcade", "Automobile"], "meta_score": 82, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/56bb315d12195fc9ed352e5171165429-98.jpg", "descriptions": "Take control of your own career, switch from real teams to new teams created with sponsors from the world of MotoGP™, decide the development of the bike and manage your technical unit to win. Improved physics, with even more realistic and complex braking management. The tire has been dividedTake control of your own career, switch from real teams to new teams created with sponsors from the world of MotoGP™, decide the development of the bike and manage your technical unit to win. Improved physics, with even more realistic and complex braking management. The tire has been divided into independent sectors for wear and temperature, and the fuel consumption can be managed with driving style and power maps. If you were looking for a challenge, this is definitely the one for you. Being a successful driver is much more than just keeping the throttle wide open. You also need to win with style! Unleash your creativity with 6 different graphic editors, including the new Suit and Livery editor for your bike. [Milestone]… Expand"}, {"name": "FIFA 15", "details_link": "https://www.metacritic.com/game/pc/fifa-15", "publisher": "Electronic Arts", "release_date": "Sep 23 2014", "developers": ["EA Sports"], "platforms": ["3DS", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox 360", "Xbox One", "PC"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim"], "meta_score": 82, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/8/c0185c984147d5435379bfc9bb46e5eb-98.jpg", "descriptions": "New to this year's installment, players have memories and will show emotion based on the context of the match. With over 600 new emotional reactions, players now respond to pivotal moments on the pitch – bad tackles, missed chances, epic goals - as they would in real life.  RefinedNew to this year's installment, players have memories and will show emotion based on the context of the match. With over 600 new emotional reactions, players now respond to pivotal moments on the pitch – bad tackles, missed chances, epic goals - as they would in real life.  Refined commentary highlights unique fan reactions, while chants and behaviors will be relevant to country or even your club. New bench reactions, side line character animations, 10-man goal celebrations, and more will strive to keep you engaged in the story of the match. Your teammates and opponents now recognize what’s happening in the match and will adjust their tactics just like real players.… Expand"}, {"name": "Recettear: An Item Shop's Tale", "details_link": "https://www.metacritic.com/game/pc/recettear-an-item-shops-tale", "publisher": "Carpe Fulgur", "release_date": "Sep 10 2010", "developers": ["EasyGameStation"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 82, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/4/deb2829ba6a2246f09326739bb25497f-98.jpg", "descriptions": "Recettear is the story of an item shop, the girl who lives in it, and the fairy who turned her life upside down. Recette Lemongrass finds herself in charge of an item shop built into her house, in order to pay back a loan her father took and then skipped out on - and Tear, her newfound fairyRecettear is the story of an item shop, the girl who lives in it, and the fairy who turned her life upside down. Recette Lemongrass finds herself in charge of an item shop built into her house, in order to pay back a loan her father took and then skipped out on - and Tear, her newfound fairy \"companion\", won't take no for an answer! As Recette, you have to decide how you'll get your stock - either through playing the markets in town or going out into the wild with an adventuring friend and thrashing beasts until they give up the goodies - how much to sell things for, what the shop should look like, and how to best go about getting the money Tear needs to pay off the loan. If you can't come up with the money... well, hope you like living in a cardboard box.… Expand"}, {"name": "Command & Conquer 3: Tiberium Wars", "details_link": "https://www.metacritic.com/game/xbox-360/command-conquer-3-tiberium-wars", "publisher": "EA Games", "release_date": "May  8 2007", "developers": ["EA LA"], "platforms": ["PC", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/ecf4529e9f328c0d1547c0e3323eeaa5-98.jpg", "descriptions": "It is 2047 and the stakes could not be higher. Tiberium—a self-replicating alien substance that has infected the Earth—is spreading like a radioactive ice age. The GDI, a high-tech alliance of the world’s most advanced nations, is fighting to contain Tiberium, but Kane, the megalomaniacalIt is 2047 and the stakes could not be higher. Tiberium—a self-replicating alien substance that has infected the Earth—is spreading like a radioactive ice age. The GDI, a high-tech alliance of the world’s most advanced nations, is fighting to contain Tiberium, but Kane, the megalomaniacal leader of The Brotherhood of NOD has other plans for Earth. Kane’s secret society turned superpower is bent on using Tiberium to take control and transform humanity into his twisted vision of the future. All-out war rages over Tiberium and the fate of the planet rests in the balance. Experience a revolution in RTS gaming with a single player campaign that rewards you for your gameplay style. Add layers of strategy to your gaming experience by building mobile bases, wielding the power of terrifying Ion Storms on the battlefield, or customizing your armies by combining units. Battle it out online with native voice-over IP, integrated clan support, and new spectator modes that let you play RTS games like a sport. [Electronic Arts]… Expand"}, {"name": "Sid Meier's Pirates!", "details_link": "https://www.metacritic.com/game/psp/sid-meiers-pirates!", "publisher": "2K Games", "release_date": "Jan 22 2007", "developers": ["Full Fat"], "platforms": ["iPhone/iPad", "PC", "PSP"], "num_players": "1-4 ", "genres": ["Strategy", "Real-Time", "General", "Historic"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/c73ef92e57230f7757747e1dd5232c12-98.jpg", "descriptions": "In Sid Meier's Pirates!, a strategy/adventure game, players take the role of a Pirate Captain in the 17th century Caribbean – amassing fortune and fame in an attempt to seize a rightful place as one of the most revered and feared pirates in history. Players test their skills as a sea captainIn Sid Meier's Pirates!, a strategy/adventure game, players take the role of a Pirate Captain in the 17th century Caribbean – amassing fortune and fame in an attempt to seize a rightful place as one of the most revered and feared pirates in history. Players test their skills as a sea captain exploring the high seas and dueling in land and sea battles in a richly detailed 3D world. Additional features for the PSP system include wireless Ad-Hoc multiplayer for up to four players, widescreen graphics, new treasure hunts and more. [2K Games]… Expand"}, {"name": "Harvest Moon: More Friends of Mineral Town", "details_link": "https://www.metacritic.com/game/game-boy-advance/harvest-moon-more-friends-of-mineral-town", "publisher": "Natsume", "release_date": "Jul 26 2005", "developers": ["TOSE"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Strategy", "Breeding/Constructing"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/fb5fd90c6b915ab3c42c79ff30a9f4b7-98.jpg", "descriptions": "Live the simple life as a farmer in Harvest Moon: More Friends of Mineral Town. This game is similar to the original Harvest Moon: Friends of Mineral Town, but now you can play as a girl who has left the city to pursue a life on the farm. You'll take part in growing crops, managingLive the simple life as a farmer in Harvest Moon: More Friends of Mineral Town. This game is similar to the original Harvest Moon: Friends of Mineral Town, but now you can play as a girl who has left the city to pursue a life on the farm. You'll take part in growing crops, managing livestock, finding a husband, and raising children.… Expand"}, {"name": "Need for Speed Underground 2", "details_link": "https://www.metacritic.com/game/playstation-2/need-for-speed-underground-2", "publisher": "Electronic Arts", "release_date": "Nov 15 2004", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "6  Online", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 82, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/6c01ccb6939b3b784ea7d6f45b8a85ad-98.jpg", "descriptions": "Need for Speed Underground 2 challenges gamers to immerse themselves in the tuner culture, exploring an expansive, free-roaming city divided into five distinct neighborhoods. Gamers encounter rival racers who initiate events, tip players off to the hottest racing spots, and show them whereNeed for Speed Underground 2 challenges gamers to immerse themselves in the tuner culture, exploring an expansive, free-roaming city divided into five distinct neighborhoods. Gamers encounter rival racers who initiate events, tip players off to the hottest racing spots, and show them where to buy the most sought-after licensed aftermarket upgrades. The game features new game modes, deep new performance customization and tuning, and more than 30 licensed cars. The game also delivers twice the visual customization upgrades as the original game, providing a staggering 70 billion possible car combinations for total automotive self-expression. [Electronic Arts]… Expand"}, {"name": "Forza Motorsport 7", "details_link": "https://www.metacritic.com/game/pc/forza-motorsport-7", "publisher": "Microsoft Game Studios", "release_date": "Oct  3 2017", "developers": ["Turn 10"], "platforms": ["Xbox One", "PC"], "num_players": "Up to 24 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 82, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/51e536d0a94c6e72d7ed3cf5a66f2e73-98.jpg", "descriptions": "Experience the thrill of motorsport at the limit. Enjoy graphics at 60fps and native 4K resolution in HDR. Collect and race more than 700 cars, including the largest collection of Ferraris, Porsches, and Lamborghinis ever. Challenge yourself across 30 famous destinations and 200 ribbons,Experience the thrill of motorsport at the limit. Enjoy graphics at 60fps and native 4K resolution in HDR. Collect and race more than 700 cars, including the largest collection of Ferraris, Porsches, and Lamborghinis ever. Challenge yourself across 30 famous destinations and 200 ribbons, where race conditions change every time you return to the track. [Microsoft]… Expand"}, {"name": "ETHER One", "details_link": "https://www.metacritic.com/game/pc/ether-one", "publisher": "White Paper Games", "release_date": "Mar 25 2014", "developers": ["White Paper Games"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "General", "3D", "First-Person"], "meta_score": 82, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/3e09a0c0aebf5f286aee043c8810dde7-98.jpg", "descriptions": "Ether One is a first person adventure that deals with the fragility of the human mind. There are two paths in the world you can choose from. At its core is a story exploration path free from puzzles where you can unfold the story at your own pace. There is also a deeper, more adventurousEther One is a first person adventure that deals with the fragility of the human mind. There are two paths in the world you can choose from. At its core is a story exploration path free from puzzles where you can unfold the story at your own pace. There is also a deeper, more adventurous path in which you can complete complex puzzles to restore life changing events of the patients history in order to help the validation of their life. The choice is left to you.… Expand"}, {"name": "BlazBlue: Calamity Trigger Portable", "details_link": "https://www.metacritic.com/game/psp/blazblue-calamity-trigger-portable", "publisher": "Aksys Games", "release_date": "Mar 10 2010", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/6faa174aad94bbcb9844c7d41ad5fb68-98.jpg", "descriptions": "This game is the ultimate 2D fighting game on the go! BlazBlue features all of the console modes—Arcade, Versus, Score Attack, Training, and Story…in addition to the all-new Shop and Legion modes, where you control your own party of fighters in an attempt to conquer the world of BlazBlue.This game is the ultimate 2D fighting game on the go! BlazBlue features all of the console modes—Arcade, Versus, Score Attack, Training, and Story…in addition to the all-new Shop and Legion modes, where you control your own party of fighters in an attempt to conquer the world of BlazBlue. [Aksys Games]… Expand"}, {"name": "Cult of the Lamb", "details_link": "https://www.metacritic.com/game/pc/cult-of-the-lamb", "publisher": "Devolver Digital", "release_date": "Aug 11 2022", "developers": ["Massive Monster"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/1f891db0b005adf257fd102e7c0bb4f4-98.jpg", "descriptions": "Start your own cult in a land of false prophets, venturing out into diverse and mysterious regions to build a loyal community of woodland worshippers and spread your Word to become the one true cult. BUILD YOUR FLOCK. Collect and use resources to build new structures, perform dark rituals toStart your own cult in a land of false prophets, venturing out into diverse and mysterious regions to build a loyal community of woodland worshippers and spread your Word to become the one true cult. BUILD YOUR FLOCK. Collect and use resources to build new structures, perform dark rituals to appease the gods, and give sermons to reinforce the faith of your flock. DESTROY THE NON-BELIEVERS. Explore a sprawling, randomly generated world, fight off hordes of enemies and defeat rival cult leaders in order to absorb their power and assert your cult's dominance. SPREAD YOUR WORD. Train your flock and embark on a quest to explore and discover the secrets of five mysterious regions. Cleanse the non-believers, spread enlightenment and perform mystical rituals on the journey to become the mighty lamb god.… Expand"}, {"name": "Bloodstained: Curse of the Moon", "details_link": "https://www.metacritic.com/game/switch/bloodstained-curse-of-the-moon", "publisher": "Inti Creates", "release_date": "May 24 2018", "developers": ["Inti Creates"], "platforms": ["3DS", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "2D"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/94a98cb2ef1ea2f17070e4990a5b605d-98.jpg", "descriptions": "Battle with swords and whips in this retro-style action game brought to you by game creator Koji Igarashi and Inti Creates!Play as Zangetsu, a demon slayer bearing a deep grudge, who must travel through perilous lands to defeat a powerful demon lurking in a dark castle. Zangetsu will meetBattle with swords and whips in this retro-style action game brought to you by game creator Koji Igarashi and Inti Creates!Play as Zangetsu, a demon slayer bearing a deep grudge, who must travel through perilous lands to defeat a powerful demon lurking in a dark castle. Zangetsu will meet fellow travelers along the way, who can join your journey as playable characters.Switching to these characters with their unique abilities will unlock new paths through the treacherous stages. Your choices in recruiting these adventurers will change the difficulty of the game, and may even affect the ending!*Bloodstained: Curse of the Moon is the 8-bit style game promised as a stretch goal of the 2015 Kickstarter campaign for \"Bloodstained: Ritual of the Night.\"… Expand"}, {"name": "Tony Hawk's Underground 2", "details_link": "https://www.metacritic.com/game/gamecube/tony-hawks-underground-2", "publisher": "Activision", "release_date": "Oct  4 2004", "developers": ["Neversoft Entertainment"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/f7f1fd1c28a31e572ca06cfc3011bac7-98.jpg", "descriptions": "You've been chosen by Tony Hawk to compete against Bam Margera's team in the World Destruction Tour. In an all-new storyline, Tony Hawk's Underground 2 takes you to skateparks around the world, where you can spray your custom tag, slap stickers, and even create new skate lines. Now you canYou've been chosen by Tony Hawk to compete against Bam Margera's team in the World Destruction Tour. In an all-new storyline, Tony Hawk's Underground 2 takes you to skateparks around the world, where you can spray your custom tag, slap stickers, and even create new skate lines. Now you can play as yourself, as your teammates, or as more than 20 special skaters. If you're feeling nostalgic for older Tony Hawk games, you can try Classic mode, which challenges you to accomplish your favorite goals, such as Secret Tape and High Score.… Expand"}, {"name": "Lunistice", "details_link": "https://www.metacritic.com/game/switch/lunistice", "publisher": "Deck 13", "release_date": "Nov 10 2022", "developers": ["A Grumpy Fox"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Shooter", "3D", "Rail"], "meta_score": 82, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/33aeafd620f82123b9d3cf369a3cd2af-98.jpg", "descriptions": "A 3D platformer with an art style inspired by original PlayStation and SEGA Saturn titles."}, {"name": "SOLAS 128", "details_link": "https://www.metacritic.com/game/switch/solas-128", "publisher": "Armor Games", "release_date": "Jan 25 2021", "developers": ["Amicable Animal"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 82, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/86d3cae640129cf9611a403a24f661dc-98.jpg", "descriptions": "SOLAS 128 takes place within a neon clockwork mechanism that is under attack. A strange external force has taken over, leaving disarray in its wake. Players must carefully repair the machine by learning how it works, and solving over 150 interlocking screens of puzzles.\r At its heart,SOLAS 128 takes place within a neon clockwork mechanism that is under attack. A strange external force has taken over, leaving disarray in its wake. Players must carefully repair the machine by learning how it works, and solving over 150 interlocking screens of puzzles.\r At its heart, SOLAS 128 is a beam deflection game with a difference. Instead of light beams, the game is built around distinct pulses which move in perfect sync with the unique, neon-soaked synthwave soundtrack. Players will need to reflect, collide, merge, split, and filter these pulses to explore the strange space, and reconnect the pathways that have been destroyed. Soon puzzles will start to spill across multiple screens, and they’ll need to think big to orchestrate a solution for the game’s damaged clockwork.… Expand"}, {"name": "Indivisible", "details_link": "https://www.metacritic.com/game/xbox-one/indivisible", "publisher": "505 Games", "release_date": "Oct  8 2019", "developers": ["Lab Zero Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/27bfef5d0a27837712157f8d0121dcd9-98.jpg", "descriptions": "INDIVISIBLE is inspired by classics like Valkyrie Profile and Metroid, and has the unique character, world, and gameplay depth Lab Zero is known for.\r Meet Ajna, Indivisible protagonist.\r\n\r\nAjna is a headstrong girl raised in a remote village. Her father, the town's guardian, has trainedINDIVISIBLE is inspired by classics like Valkyrie Profile and Metroid, and has the unique character, world, and gameplay depth Lab Zero is known for.\r Meet Ajna, Indivisible protagonist.\r Ajna is a headstrong girl raised in a remote village. Her father, the town's guardian, has trained her to be strong in mind and body to prepare her for things to come. Ajna discovers a mysterious power in herself, and sets off on a world-spanning journey. Along the way, a number of unique heroes will join her on her quest.… Expand"}, {"name": "Final Fantasy XIII", "details_link": "https://www.metacritic.com/game/xbox-360/final-fantasy-xiii", "publisher": "Square Enix", "release_date": "Mar  9 2010", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 82, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/93c82b2be64ecc37d2769383dcc894bb-98.jpg", "descriptions": "In Final Fantasy XIII, you will embark on a journey through the cityworld of Cocoon and the outerworld of Pulse. Along the way, you will encounter diverse allies who will fight alongside you. Execute powerful attacks with weapons and magic, and summon the enigmatic Eidolons with an evolvedIn Final Fantasy XIII, you will embark on a journey through the cityworld of Cocoon and the outerworld of Pulse. Along the way, you will encounter diverse allies who will fight alongside you. Execute powerful attacks with weapons and magic, and summon the enigmatic Eidolons with an evolved Active Time Battle system. Experience seamless transitions between real time gameplay and in-game cinematics. Do you have the courage to face your destiny?… Expand"}, {"name": "Midnight Club: Los Angeles", "details_link": "https://www.metacritic.com/game/playstation-3/midnight-club-los-angeles", "publisher": "Rockstar Games", "release_date": "Oct 20 2008", "developers": ["Rockstar San Diego"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/24441bb978b99aad6cb1c0a53195d6d7-98.jpg", "descriptions": "Whether driving by the beach or beating the competition by cutting through a parking garage at 200 mph, Midnight Club: Los Angeles provides a seamless, breathtaking environment for everyone who loves to compete. With no load times, no tracks, and no rules, the game allows players to race whoWhether driving by the beach or beating the competition by cutting through a parking garage at 200 mph, Midnight Club: Los Angeles provides a seamless, breathtaking environment for everyone who loves to compete. With no load times, no tracks, and no rules, the game allows players to race who they want, when they want, and where they want in an unbelievable recreation of Los Angeles. A racing game is nothing without the great cars and Midnight Club: Los Angeles allows extensive customization of vehicles for both performance and appearance. Players can now fully personalize their officially licensed imports, tuners, classic muscle cars and motorcycles both inside and out with a dizzying array of licensed rims, spoilers, interior gauges, tires and more. [Rockstar Games]… Expand"}, {"name": "Freedom Planet", "details_link": "https://www.metacritic.com/game/switch/freedom-planet", "publisher": "XSEED Games", "release_date": "Aug 30 2018", "developers": ["GalaxyTrail"], "platforms": ["PC", "PlayStation 4", "Wii U", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/4a2f5d6f7d237377695c721f488ab28a-98.jpg", "descriptions": "Freedom Planet is a combat-based platform adventure that pits a spunky dragon girl and her friends against an alien attack force. Theres trouble around every turn, from insects to giant robots to sheer explosive destruction, but youll have a variety of special fighting abilities to blastFreedom Planet is a combat-based platform adventure that pits a spunky dragon girl and her friends against an alien attack force. Theres trouble around every turn, from insects to giant robots to sheer explosive destruction, but youll have a variety of special fighting abilities to blast your way through each stage.\r - As Lilac, you can use Dragon powers to whip enemies with your hair, spin like a cyclone, or fly through the air at high speed like a comet.\r - As Carol, you can bust through foes with a flurry of punches and kicks or summon motorcycles that let you ride up walls and ceilings.… Expand"}, {"name": "The Vanishing of Ethan Carter", "details_link": "https://www.metacritic.com/game/pc/the-vanishing-of-ethan-carter", "publisher": "The Astronauts", "release_date": "Sep 25 2014", "developers": ["The Astronauts"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "General", "3D", "First-Person"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/1b5a0e062acf03bc85b6edea269ea893-98.jpg", "descriptions": "The Vanishing of Ethan Carter is a first-person story-driven mystery focused on exploration and discovery. As occult-minded private detective Paul Prospero communicates with the dead to discover the fate of a missing boy and the mystery behind a dark ancient force inhabiting Red Creek Valley."}, {"name": "Ys VIII: Lacrimosa of DANA", "details_link": "https://www.metacritic.com/game/switch/ys-viii-lacrimosa-of-dana", "publisher": "NIS America", "release_date": "Jun 26 2018", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "PlayStation Vita", "Stadia", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/60f28f1317a420f953dec234aef2afae-98.jpg", "descriptions": "Ys returns with a brand new adventure for the first time in 8 years! Adol awakens shipwrecked and stranded on a cursed island. There, he and the other shipwrecked passengers he rescues form a village to challenge fearsome beasts and mysterious ruins on the isolated island. Amidst this, AdolYs returns with a brand new adventure for the first time in 8 years! Adol awakens shipwrecked and stranded on a cursed island. There, he and the other shipwrecked passengers he rescues form a village to challenge fearsome beasts and mysterious ruins on the isolated island. Amidst this, Adol begins to dream of a mysterious blue-haired maiden living in an unknown world. Join Adol as he unravels the riddle of the cursed isle and the blue-haired maiden Dana in Ys VIII: Lacrimosa of Dana!\r FEATURES:\r An Epic Tale - Follow Adol on his latest adventure and uncover the mysteries of the cursed island. \r\rParty On! - Change your playable character on-the-fly as you battle ferocious foes in lighting-fast combat.\r Another Side - Unravel the mystery of the blue-haired maiden Dana through her unique gameplay sections.\r It Takes a Village! - Rescue your fellow shipwrecked passengers and bring them to your village where they will provide valuable services.… Expand"}, {"name": "Flight Simulator X: Acceleration", "details_link": "https://www.metacritic.com/game/pc/flight-simulator-x-acceleration", "publisher": "Microsoft Game Studios", "release_date": "Oct 23 2007", "developers": ["Microsoft Game Studios"], "platforms": "PC", "genres": ["Simulation", "Flight", "Modern Jet", "Combat", "Civilian"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/a8c91740fd32f7517dd925ac5d415f62-98.jpg", "descriptions": "The Flight Simulator X Acceleration Expansion Pack delivers an all new thrilling multiplayer race mode, new action-packed missions, and even more new content! Challenge friends in the new racing mode, or test your flight skills in the 20 new missions like being a NASA test pilot, performingThe Flight Simulator X Acceleration Expansion Pack delivers an all new thrilling multiplayer race mode, new action-packed missions, and even more new content! Challenge friends in the new racing mode, or test your flight skills in the 20 new missions like being a NASA test pilot, performing search and rescue on an ocean liner, or navigating a whiteout blizzard in the backcountry. Also included are six new scenery maps including the famed Red Bull Air Race courses, and three new planes such as the F/A-18A Hornet, EH-101 Helicopter and P-51D Mustang. [Microsoft]… Expand"}, {"name": "Far Cry 3: Blood Dragon", "details_link": "https://www.metacritic.com/game/playstation-3/far-cry-3-blood-dragon", "publisher": "Ubisoft", "release_date": "Apr 30 2013", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox 360", "Xbox One", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/adaad805dafd2b7c36483a846d8a34b1-98.jpg", "descriptions": "Far Cry 3: Blood Dragon is a spin-off that contains around eight hours of original content and features a single open-world island to explore, with many of Far Cry 3's gameplay systems and mechanics making a return."}, {"name": "Chernobylite", "details_link": "https://www.metacritic.com/game/xbox-one/chernobylite", "publisher": "All in! Games", "release_date": "Sep 28 2021", "developers": ["The Farm 51"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 82, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/c60f17615643548fd647b7b1c5dfcdbf-98.jpg", "descriptions": "Chernobylite is a new game from the creators of the critically-acclaimed Get Even.It's a science-fiction survival horror experience, mixing the free exploration of its disturbing world with challenging combat, unique crafting, and non-linear storytelling. Play as a physicist, one of theChernobylite is a new game from the creators of the critically-acclaimed Get Even.It's a science-fiction survival horror experience, mixing the free exploration of its disturbing world with challenging combat, unique crafting, and non-linear storytelling. Play as a physicist, one of the Chernobyl Power Plant's ex-employees, and investigate the mysterious disappearance of your beloved. Try to survive and reveal the contamination zone's twisted secrets. Remember, the military presence is not your only concern.Get ready for a thrilling adventure of survival, conspiracy, horror, love, and obsession. One that will prove to you that it's not about how you face your fears, it's about how you survive them.SURVIVEAlly or compete with other stalkers of the Chernobyl zone to survive. Remember that life is fragile, and it's your decisions that determine the fate of your companions. You can spend as long as you need preparing, however, be aware that your story is still being written. Every passing moment, your chances of success are dwindling: comrades are dying, supplies are running out, or an unexpected patrol could discover you. And on top of all this, supernatural dangers are arising around you in mysterious patterns. Each day brings new challenges with the ever-increasing severity of your current situation. Plan your strategy carefully if you want to survive.PLAY BY YOUR OWN RULESCraft your gear and weapons to protect yourself from the hostile military personnel and supernatural threats lurking in the zone. Make use of the sophisticated tools at your disposal to aid you in your struggle while navigating the rough and contaminated environment. Stay undetected and gather all the evidence you can to piece together events from the past.Decide what happens in the world around you by making choices and finding, or avoiding, the truth.EXPERIENCEMaintain your resolve and keep your wits about you the Chernobyl Nuclear Power Plant is not what it once was. No one can foresee the horrors that may have befallen your beloved.CHERNOBYLITE MAIN FEATURES:* Explore the beautiful and horrifyingly accurate 3D-scanned recreation of the Chernobyl Exclusion Zone.* Collaborate or compete with other stalkers of the Zone, but whatever you do, never fully trust them. Remember everybody has a hidden agenda. Always.* Face and survive the natural and supernatural threats.* Immerse yourself in the thrilling non-linear science-fiction horror story.* Make good use of your character's physics and chemistry knowledge to craft your equipment and manage your supplies.* Fight against the savage creatures pouring from the alternate reality.* Investigate and collect data with a set of sophisticated environment and substance analyzing tools.… Expand"}, {"name": "Borderlands: The Zombie Island of Dr. Ned", "details_link": "https://www.metacritic.com/game/playstation-3/borderlands-the-zombie-island-of-dr-ned", "publisher": "2K Games", "release_date": "Nov 24 2009", "developers": ["Gearbox Software"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/e5c04c0bfc6cf6cf36ed7c2b9c001bca-98.jpg", "descriptions": "(Downloadable Content)  The Zombie Island of Dr. Ned is an add-on pack for Borderlands with new enemy types, new missions, and new ... surprises. The Jakobs Corporation would like to invite you to experience the splendor of a corporate owned small town known as Jakobs Cove.  Any rumors you(Downloadable Content)  The Zombie Island of Dr. Ned is an add-on pack for Borderlands with new enemy types, new missions, and new ... surprises. The Jakobs Corporation would like to invite you to experience the splendor of a corporate owned small town known as Jakobs Cove.  Any rumors you may have heard about the \"undead\" walking our streets are completely preposterous and we officially deny them all.  If those rumors turn out to be true simply purchase a firearm from the conveniently located Jakobs Brand Vending Machines and aim for the head.  Also, would you mind saving our employees?  (Non-union only please).… Expand"}, {"name": "Etrian Odyssey II: Heroes of Lagaard", "details_link": "https://www.metacritic.com/game/ds/etrian-odyssey-ii-heroes-of-lagaard", "publisher": "Atlus", "release_date": "Jun 13 2008", "developers": ["Atlus"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/a8a32a11c15e6facdaae6ccd11205257-98.jpg", "descriptions": "In the Grand Duchy of High Lagaard, it is said that the Duke is descended from inhabitants of a castle in the sky. When an unforeseen crisis befalls the nation, it is decreed that the first explorer to retrieve the Grail of Kings from that mythical floating palace will be rewarded withIn the Grand Duchy of High Lagaard, it is said that the Duke is descended from inhabitants of a castle in the sky. When an unforeseen crisis befalls the nation, it is decreed that the first explorer to retrieve the Grail of Kings from that mythical floating palace will be rewarded with wealth and fame beyond imagining. Enter the central city of Lagaard and begin your journey to the clouds. Make the adventure yours - Rediscover true role-playing as you build your party of stalwart adventurers from 12 different classes. From basics like name and sex to advanced settings like combat formation, skills, and spells, every detail is yours to customize. The Odyssey continues - Experience an all-new story, more classes, improved mapping capabilities, new Force Skills, and over 100 side-quests. Chart your progress through the dungeons - Etrian Odyssey's innovative mapmaking tool returns with more options and features. Use the touch screen to map out the halls, chambers, treasures, and dangers of the realms you explore. [Atlus USA]… Expand"}, {"name": "Pro Evolution Soccer 2008", "details_link": "https://www.metacritic.com/game/playstation-2/pro-evolution-soccer-2008", "publisher": "Konami", "release_date": "Mar 11 2008", "developers": ["Konami"], "platforms": ["PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "8  Online", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/8ac4be00793e93f07117cf93da8c7267-98.jpg", "descriptions": "PES 2008 features a brand new intelligence system, called Teamvision, that adapts and reacts to players own gameplay styles to ensure that the computer controlled opponents are always challenging and forcing the player to think and chance their style of play to avoid being out-thought by thePES 2008 features a brand new intelligence system, called Teamvision, that adapts and reacts to players own gameplay styles to ensure that the computer controlled opponents are always challenging and forcing the player to think and chance their style of play to avoid being out-thought by the game. It learns counter attacks that target your weaknesses and look to exploit any repetitive tactics players use. Defenders react better to danger, closing down the ball and charging at shots and the goalkeepers hold shots that are closer to them as well. Teammates make more intelligent runs into space and the close control has been sharpened to ensure quick and fluid passing and speedy attacks can be built. The next gen versions also feature extensive edit modes so players can completely customise their PES 2008 experience. [Konami]… Expand"}, {"name": "Blood (1997)", "details_link": "https://www.metacritic.com/game/pc/blood-1997", "publisher": "GT Interactive", "release_date": "Mar  7 1997", "developers": ["Monolith Productions"], "platforms": "PC", "num_players": "2 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 82, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/4/34035b0b5a4b7dfa24d83276650ba9cd-98.jpg", "descriptions": "You'll battle cultists, gargoyles, zombies, hellhounds, and an unholy host of other terrors in your quest to stop Tchernobog. You must not only defeat the Cabal--you must scour its dread name from human memory. If that means eradicating everyone and everything the Cabal has ever tainted, soYou'll battle cultists, gargoyles, zombies, hellhounds, and an unholy host of other terrors in your quest to stop Tchernobog. You must not only defeat the Cabal--you must scour its dread name from human memory. If that means eradicating everyone and everything the Cabal has ever tainted, so be it. Of course, you'll first have to make your way through fortresses, castles, mines, mansions, and estates guarded and kept by Tchernobog's malevolent servants. Fortunately, it is wits that make the hero, and although you're in serious danger of losing yours, you've got enough left to improvise some pretty effective tools of destruction. Aerosol hairspray can be frightening enough on its own, but apply it to a lighter flame and you've got an instant flamethrower (kids, don't try this at home!). Likewise, a flare gun can brighten your prospects considerably against even the grimmest odds, which is to say nothing for shotguns, Tommy guns, and dynamite. Who knows, you may even find that there are some spirits on your side when you find yourself clutching a voodoo doll. [Monolith]… Expand"}, {"name": "The Legend of Heroes: Trails of Cold Steel III", "details_link": "https://www.metacritic.com/game/playstation-4/the-legend-of-heroes-trails-of-cold-steel-iii", "publisher": "NIS America", "release_date": "Oct 22 2019", "developers": ["Falcom"], "platforms": ["PC", "Stadia", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 82, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/4/753dfd7dea3226725fc4b3d25ee7703b-98.jpg", "descriptions": "The end of the civil war led to the turning point of a new era for the Erebonian Empire. Centering on Rean Schwarzer as the Ashen Chevalier, the young man who came to be seen as a hero within the country, a new story of young heroes will unfold."}, {"name": "Ys Origin", "details_link": "https://www.metacritic.com/game/switch/ys-origin", "publisher": "DotEmu", "release_date": "Oct  1 2020", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/ef8dd5cf57b49f674efc6a4048fafd3a-98.jpg", "descriptions": "700 years before the events of Ys I & II, the land of Ys was on the brink of destruction. Demons came in droves and forced the twin Goddesses who ruled the land to whisk their subjects away from the surface, into the safe embrace of the clouds. The demons were persistent, however,700 years before the events of Ys I & II, the land of Ys was on the brink of destruction. Demons came in droves and forced the twin Goddesses who ruled the land to whisk their subjects away from the surface, into the safe embrace of the clouds. The demons were persistent, however, erecting a massive tower in pursuit. The battle that raged upon the ground had begun ascending for a second round up above.… Expand"}, {"name": "Duelyst", "details_link": "https://www.metacritic.com/game/pc/duelyst", "publisher": "Counterplay Games", "release_date": "May  3 2016", "developers": ["Counterplay Games"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Fantasy", "Strategy", "Turn-Based", "General"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/31be5f193780a8634902ff49d6fb4663-98.jpg", "descriptions": "Duelyst is a tactical turn-based strategy game with a heavy focus on ranked competitive play, brought to you by veteran developers and creators from Diablo III, Rogue Legacy and the Ratchet & Clank series. \r\rThe world of Duelyst has an expansive identity and mythology, with gorgeousDuelyst is a tactical turn-based strategy game with a heavy focus on ranked competitive play, brought to you by veteran developers and creators from Diablo III, Rogue Legacy and the Ratchet & Clank series. \r\rThe world of Duelyst has an expansive identity and mythology, with gorgeous landscapes filled with rich, complex characters, untold stories and unraveled histories. The focus is on squad-based combat on a tactical map with fast-paced multiplayer 1v1 battles where victory comes from defeating your opponent's General. At launch, there will be five unique factions with a roster of 100+ battle units and spells.… Expand"}, {"name": "Command & Conquer: Red Alert 3", "details_link": "https://www.metacritic.com/game/pc/command-conquer-red-alert-3", "publisher": "Electronic Arts", "release_date": "Oct 28 2008", "developers": ["EA LA"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 82, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/2c1e8d5d53d2745d533edf0db2fdd280-98.jpg", "descriptions": "Red Alert 3 breaks new ground in the RTS genre, featuring a fully co-operative campaign while bringing back the series’ light-hearted style and classic, action-oriented gameplay. In Red Alert 3, the desperate leadership of a doomed Soviet Union travels back in time to change history andRed Alert 3 breaks new ground in the RTS genre, featuring a fully co-operative campaign while bringing back the series’ light-hearted style and classic, action-oriented gameplay. In Red Alert 3, the desperate leadership of a doomed Soviet Union travels back in time to change history and restore the glory of Mother Russia. The time travel mission goes awry, creating an alternate timeline where technology has followed an entirely different evolution, a new superpower has been thrust on to the world stage, and World War III is raging. The Empire of the Rising Sun has risen in the East, making World War III a three-way struggle between the Soviets, the Allies, and the Empire with armies fielding wacky and wonderful weapons and technologies like Tesla coils, heavily armed War Blimps, teleportation, armored bears, intelligent dolphins, floating island fortresses, and transforming tanks. Red Alert 3 asks the question \"What If?\" What if every bizarre research project and technology experiment for the last 70 years had actually borne fruit? What if the Philadelphia Experiment, time travel theory, teleportation, invisibility, Tesla technology, and a hundred other intriguing research projects had all paid off and gone mainstream? What if the Soviet Union survived and thrived; what would it look like 10 years in the future? What if the Japanese Empire had never fallen and instead became the ultimate high-tech military superpower?  The end result is an imaginative and playful vision of an alternate future filled with possibility. [Electronic Arts]… Expand"}, {"name": "The Walking Dead: The Telltale Definitive Series", "details_link": "https://www.metacritic.com/game/playstation-4/the-walking-dead-the-telltale-definitive-series", "publisher": "Skybound Games", "release_date": "Sep 10 2019", "developers": ["Telltale Games", "Skybound Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/08db6c6bf6757096c05db36a3fcfa024-98.jpg", "descriptions": "Play the acclaimed series that set the benchmark for storytelling in games, based on Robert Kirkman’s award-winning comic book, The Walking Dead. The Walking Dead: The Telltale Definitive Series contains all 4 Seasons, 400 Days, and The Walking Dead: Michonne, which includes over 50 hours ofPlay the acclaimed series that set the benchmark for storytelling in games, based on Robert Kirkman’s award-winning comic book, The Walking Dead. The Walking Dead: The Telltale Definitive Series contains all 4 Seasons, 400 Days, and The Walking Dead: Michonne, which includes over 50 hours of gameplay across 23 unique episodes.… Expand"}, {"name": "Thimbleweed Park", "details_link": "https://www.metacritic.com/game/switch/thimbleweed-park", "publisher": "Terrible Toybox", "release_date": "Sep 21 2017", "developers": ["Ron Gilbert and Gary Winnick", "Terrible Toybox"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/b973ba685061ec2de07a488f4734c277-98.jpg", "descriptions": "Thimbleweed Park is the curious story of two washed up federal agents called in to investigate a dead body found in the river just outside of town, bloated and pixelated from a death some too soon."}, {"name": "The Walking Dead: Episode 1 - A New Day", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-episode-1---a-new-day", "publisher": "Telltale Games", "release_date": "Apr 24 2012", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Miscellaneous", "Adventure", "General", "Compilation", "Point-and-Click"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/b16686f4f85035168fc7cc8c4f9cc8b1-98.jpg", "descriptions": "Episode one of a five-part game series set in the same universe as Robert Kirkman’s award-winning series. Play as Lee Everett, the convicted criminal who has been given a second chance at life in a world devastated by the undead. Experience events, meet people and visit locations thatEpisode one of a five-part game series set in the same universe as Robert Kirkman’s award-winning series. Play as Lee Everett, the convicted criminal who has been given a second chance at life in a world devastated by the undead. Experience events, meet people and visit locations that foreshadow the story of Deputy Sheriff Rick Grimes. A honed game experience in which actions, choices and decisions you make will affect how your story plays out across the entire series.… Expand"}, {"name": "FIFA Soccer 09", "details_link": "https://www.metacritic.com/game/playstation-2/fifa-soccer-09", "publisher": "EA Sports", "release_date": "Oct 13 2008", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation 2"], "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 82, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/b2ec13bcd5f0e3e66af5e8f42fbe7e9a-98.jpg", "descriptions": "With 500 new animation sequences and all-new collision and shielding systems - representing the biggest innovations to the game engine in four years -  FIFA 09 delivers more responsive, intelligent and realistic physical action. A new collision detection system with 360 degree coverage andWith 500 new animation sequences and all-new collision and shielding systems - representing the biggest innovations to the game engine in four years -  FIFA 09 delivers more responsive, intelligent and realistic physical action. A new collision detection system with 360 degree coverage and hundreds of new collision animations enable players to behave according to their physical attributes. Player speed, direction and strength now determine everything from the severity of the collision to the outcome of possession. Plus, contact occurs with shoulders, arms and legs. Stronger players possess the strength to knock down smaller players or use their body or arms to win challenges. Player strength and momentum also determine outcomes in challenges through the new shielding system, with dozens of new outcomes created. Plus, players can now shield the ball by pushing off the defender to create space - at the risk of being called for a foul - just like real life. The increased control shielding the ball adds another strategic element to matches, enabling you to slow the game’s pace as needed. [Electronic Arts]… Expand"}, {"name": "NCAA March Madness 2004", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-march-madness-2004", "publisher": "Electronic Arts", "release_date": "Nov 17 2003", "developers": ["NuFX"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 82, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/8ac879be9d23dbcb38bd39fd69e1d3dd-98.jpg", "descriptions": "Features Over 320 Schools: Dick Vitale and Brad Nessler preside over the passion and tradition of NCAA basketball competition with authentic fight songs, arenas, cheerleaders, and mascots. All-new game modes including Frat Party and Rivalry let you not only punish your most bitter rivals?Features Over 320 Schools: Dick Vitale and Brad Nessler preside over the passion and tradition of NCAA basketball competition with authentic fight songs, arenas, cheerleaders, and mascots. All-new game modes including Frat Party and Rivalry let you not only punish your most bitter rivals? but also take it to their mascots as well. Recruit elite high school players over 30 seasons in Dynasty Mode and take your team from the pre-season EA SPORTS Maui Invitational all the way to the Big Dance. Take on players from around the nation by competing in all-new online head-to-head or tournament games, while taunting your opponent with EA SPORTS Talk. Watch locker room videos detailing pre-game scouting reports and strategies from top coaches including Billy Donovan, Rick Majerus, and Gary Williams. Call offensive plays taken directly from each school's playbook, then shut down the opposition and cause turnovers with a full-court press or 2-3 zone. [EA Sports]… Expand"}, {"name": "NBA Live 2003", "details_link": "https://www.metacritic.com/game/xbox/nba-live-2003", "publisher": "Electronic Arts", "release_date": "Oct  8 2002", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 82, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/d9c5a400701b34f9c627e43507198099-98.jpg", "descriptions": "Live your dream of NBA superstardom in NBA Live 2003. This year's installment in the NBA Live series features a new control system that lets you make quick steals, monster shot blocks, and smooth crossover dribbles. New animations show everything from power dunks and rebounds to signatureLive your dream of NBA superstardom in NBA Live 2003. This year's installment in the NBA Live series features a new control system that lets you make quick steals, monster shot blocks, and smooth crossover dribbles. New animations show everything from power dunks and rebounds to signature moves and coaches' reactions. The game also features old NBA uniforms from basketball legends, such as Elgin Baylor, Jerry West, and Dr. J. Add to the mix fresh commentary and dialogue between player and coach, and you have a complete NBA experience. … Expand"}, {"name": "Links 2003", "details_link": "https://www.metacritic.com/game/pc/links-2003", "publisher": "Microsoft Game Studios", "release_date": "Sep 16 2002", "developers": ["Microsoft Game Studios"], "platforms": "PC", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 82, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/58bb0818feb95645aabc8eda8dc269af-98.jpg", "descriptions": "The newest version of the best-selling golf simulator of all-time features improved graphics, six brand-new championship courses, high-resolution 3D characters, a Dynamic Camera that lets you to see your shot from different perspectives, and improved putting with a new 3D Green Analyzer.The newest version of the best-selling golf simulator of all-time features improved graphics, six brand-new championship courses, high-resolution 3D characters, a Dynamic Camera that lets you to see your shot from different perspectives, and improved putting with a new 3D Green Analyzer. Links 2003 also brings improvements to the powerful Arnold Palmer Course Designer - the same 3D course architecture tool used by the Links team to create course graphics in stunning photorealistic detail. [Microsoft]… Expand"}, {"name": "Earth & Beyond", "details_link": "https://www.metacritic.com/game/pc/earth-beyond", "publisher": "Electronic Arts", "release_date": "Sep  2 2002", "developers": ["Westwood Studios"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi", "Sci-Fi"], "meta_score": 82, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/3b12a154d3c36dedbb07cb84c0ccc900-98.jpg", "descriptions": "Welcome to Earth & Beyond, the first online role-playing galaxy. It's your turn to pilot your own starship, adventure in a massive galaxy, and take part in a thriving community. Alien encounters, fierce combat, cutthroat commerce, new discoveries, perilous quests, strategic alliances,Welcome to Earth & Beyond, the first online role-playing galaxy. It's your turn to pilot your own starship, adventure in a massive galaxy, and take part in a thriving community. Alien encounters, fierce combat, cutthroat commerce, new discoveries, perilous quests, strategic alliances, diplomatic backstabbing, and epic wars await you and the friends you meet online. Earth & Beyond allows you to build your character and career in three distinct ways: exploration, trade and combat. The game is designed around these three activities, and each race, profession, skill, starship and item affects how well you excel in these core activities. [Electronic Arts]… Expand"}, {"name": "Syberia", "details_link": "https://www.metacritic.com/game/pc/syberia", "publisher": "The Adventure Company", "release_date": "Sep  1 2002", "developers": ["Microids"], "platforms": ["iPhone/iPad", "PlayStation 3", "Switch", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/16d42eff74845e2e423730752b0a8ec8-98.jpg", "descriptions": "Syberia is a pure adventure game, where the player will discover a magical world of automatons and meet amazing and intriguing characters in 4 mysterious and incredibly beautiful, realistic and detailed European environments. Syberia is a 3rd person perspective single-player, adventure gameSyberia is a pure adventure game, where the player will discover a magical world of automatons and meet amazing and intriguing characters in 4 mysterious and incredibly beautiful, realistic and detailed European environments. Syberia is a 3rd person perspective single-player, adventure game using unequalled graphics with 3D characters, with a rich and evolving storyline and a cast of very intriguing and interesting characters.… Expand"}, {"name": "NASCAR Thunder 2002", "details_link": "https://www.metacritic.com/game/xbox/nascar-thunder-2002", "publisher": "EA Sports", "release_date": "Nov 14 2001", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 82, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/2e8a8ad3cfc722453b8665d3a97e89e0-98.jpg", "descriptions": "The makers of Madden NFL hit the track with NASCAR Thunder™ 2002. Take on more than 50 NASCAR superstars on 23 Winston Cup Series tracks, with shockingly realistic damage effects, a complete \"rookie-to-champion\" career mode, and pit four gamers head-to-head on a single Xbox!The makers of Madden NFL hit the track with NASCAR Thunder™ 2002. Take on more than 50 NASCAR superstars on 23 Winston Cup Series tracks, with shockingly realistic damage effects, a complete \"rookie-to-champion\" career mode, and pit four gamers head-to-head on a single Xbox! It's NASCAR the way it was meant to be, from EA Sports.… Expand"}, {"name": "Virtual Pool 3", "details_link": "https://www.metacritic.com/game/pc/virtual-pool-3", "publisher": "Interplay", "release_date": "Nov 14 2000", "developers": ["Celeris"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Sports", "Miscellaneous", "Parlor", "Individual", "Billiards", "Billiards"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/4fce71da899404f3a08b2a63edbea210-98.jpg", "descriptions": "Features the \"Black Widow\" Jeanette Lee and an improved single-player mode."}, {"name": "The Sims: Livin' Large", "details_link": "https://www.metacritic.com/game/pc/the-sims-livin-large", "publisher": "EA Games", "release_date": "Aug 27 2000", "developers": ["Maxis"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/a5a4a003427ac06bce2a0418084500c8-98.jpg", "descriptions": "The official expansion pack for The Sims lets you take your Sims to new extremes. Help your Sims deal with everything from roach infestations to alien abductions. Give them the opportunity to become rock stars, talk show hosts, even UFO investigators, with five new career options.  [Electronic Arts]"}, {"name": "The Wolf Among Us: Episode 1 - Faith", "details_link": "https://www.metacritic.com/game/xbox-360/the-wolf-among-us-episode-1---faith", "publisher": "Telltale Games", "release_date": "Oct 11 2013", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Adventure", "Fantasy", "General", "Fantasy", "Point-and-Click"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/823d106d190f4c8ab10dbfdbf48f1c9c-98.jpg", "descriptions": "The Wolf Among Us is a 5-episode series from the creators of The Walking Dead. Based on Fables (DC Comics/Vertigo), an award-winning comic book series, it is an often violent, mature and hard-boiled thriller where the characters and creatures of myth, lore and legend are real and exist inThe Wolf Among Us is a 5-episode series from the creators of The Walking Dead. Based on Fables (DC Comics/Vertigo), an award-winning comic book series, it is an often violent, mature and hard-boiled thriller where the characters and creatures of myth, lore and legend are real and exist in our world. As Bigby Wolf - THE big bad wolf in human form - you discover that the brutal, bloody murder of a Fable is just a taste of things to come, in a game series where your every decision can have enormous consequences. Your choices matter: it’s not only WHAT you choose to do that will affect how your story plays out, but WHEN you choose to do it. A mature and gritty take on characters from fairy tales, legends and folklore who have escaped into our world. These are not the characters you’d see on a little child’s lunchbox. Play as Bigby Wolf: formerly the most feared monster among the Fables, now Sheriff of Fabletown and protector of those he used to hunt. He must restrain the beast within if he is to earn the trust of those around him. Choose Bigby’s actions carefully. Will you approach a situation calmly or unleash your inner rage? The way you act will determine how others respond to you. Set before the events seen in the first issue of the comics – you don’t have to know the characters or the world to play. [Telltale Games]… Expand"}, {"name": "Sonic the Hedgehog 2", "details_link": "https://www.metacritic.com/game/xbox-360/sonic-the-hedgehog-2", "publisher": "Sega", "release_date": "Sep 12 2007", "developers": ["Sega", "Backbone Entertainment"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "Switch", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/a719cb3588c9a52eadb71a8a6fcbf04f-98.jpg", "descriptions": "[Xbox Live Arcade]  With his new Super Spin Dash and \"Tails\" the Fox, Sonic is back and better than ever in Sonic The Hedgehog 2. Defy gravity in hair-raising loop-de-loops, bounce like a pinball and race like lightning. Play against friends at home or against others over Xbox Live in this[Xbox Live Arcade]  With his new Super Spin Dash and \"Tails\" the Fox, Sonic is back and better than ever in Sonic The Hedgehog 2. Defy gravity in hair-raising loop-de-loops, bounce like a pinball and race like lightning. Play against friends at home or against others over Xbox Live in this classic game. Enhanced graphics and sound: The game stays true to the original, but takes full advantage of high-definition graphics, with enhanced sound effects. Achievements and leaderboards: Take on the challenge of new achievements to conquer, and use the leaderboards to compare scores among friends and the rest of the Xbox LIVE world. Play with a friend at home, or go online and play Sonic and Tails with the world at large. [Sega]… Expand"}, {"name": "Metro Exodus", "details_link": "https://www.metacritic.com/game/xbox-one/metro-exodus", "publisher": "Deep Silver", "release_date": "Feb 15 2019", "developers": ["4A Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/f2d970f15c01935dc9397cf1ded62b77-98.jpg", "descriptions": "In Metro Exodus, Artyom and a band of survivors must flee the shattered ruins of the Moscow Metro and embark on an epic, continent-spanning journey across the post-apocalyptic Russian wilderness. Explore vast, non-linear levels, lose yourself in an immersive, sandbox survival experience, andIn Metro Exodus, Artyom and a band of survivors must flee the shattered ruins of the Moscow Metro and embark on an epic, continent-spanning journey across the post-apocalyptic Russian wilderness. Explore vast, non-linear levels, lose yourself in an immersive, sandbox survival experience, and follow a story-line that spans an entire year in the greatest Metro adventure yet. [Deep Silver]… Expand"}, {"name": "Metal Arms: Glitch in the System", "details_link": "https://www.metacritic.com/game/xbox/metal-arms-glitch-in-the-system", "publisher": "VU Games", "release_date": "Nov 18 2003", "developers": ["Swingin' Ape"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/0580375d84da5d52a18285ae2bc9212e-98.jpg", "descriptions": "Blast your way to victory as Glitch, the gun-slinging, half-ton menacing bot of Droid City.  Found as scrap metal, but transformed into destructive machinery, Glitch is determined to free his people from the evil clutches of General Corrosive and his maniacal army of Mil bots.  As youBlast your way to victory as Glitch, the gun-slinging, half-ton menacing bot of Droid City.  Found as scrap metal, but transformed into destructive machinery, Glitch is determined to free his people from the evil clutches of General Corrosive and his maniacal army of Mil bots.  As you venture through 40 missions, you'll find 17 deadly weapons, a variety of vehicles, and enemy bots that you can control.  Annihilate the General's sinister plan to dominate the world and salvage the robot race.… Expand"}, {"name": "MLB The Show 18", "details_link": "https://www.metacritic.com/game/playstation-4/mlb-the-show-18", "publisher": "Sony Interactive Entertainment", "release_date": "Mar 27 2018", "developers": ["Sony Interactive Entertainment"], "platforms": "PlayStation 4", "num_players": "Up to 8 ", "genres": ["Sports", "Team", "Baseball", "Sim"], "meta_score": 82, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/9103bf438246dd9f3132bd4d892060f6-98.jpg", "descriptions": "Your team. Your rivals. Your buddies. Your hometown. No matter why you play or why you love baseball, MLB The Show 18 is for a fan like you. The Show 18 delivers baseball just the way you want it, from fielding a roster of past Legends and current Superstars in Diamond Dynasty1,2, toYour team. Your rivals. Your buddies. Your hometown. No matter why you play or why you love baseball, MLB The Show 18 is for a fan like you. The Show 18 delivers baseball just the way you want it, from fielding a roster of past Legends and current Superstars in Diamond Dynasty1,2, to crushing homers with friends in Retro Mode games to meaningful RPG progression in Road to The Show®. Experience quicker, more satisfying games of baseball to dominate the competition on the couch, on the headset2 and on the diamond. More home runs, more epic plays, more classic legends, all in less time. For those who crave the best of baseball - Welcome to The Show. … Expand"}, {"name": "DCS: Black Shark", "details_link": "https://www.metacritic.com/game/pc/dcs-black-shark", "publisher": "Take-Two Interactive", "release_date": "Apr 13 2009", "developers": ["Eagle Dynamics"], "platforms": "PC", "genres": ["Simulation", "Flight", "Helicopter", "Helicopter", "Civilian"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/d37d3cd34690daa9fa6bd7081dde7ff5-98.jpg", "descriptions": "DCS: Black Shark is a PC game of the Russian Ka-50 attack helicopter and is the first title in a new Eagle Dynamics and The Fighter Collection simulation series: Digital Combat Simulator (DCS). Following Eagle Dynamics' tradition of excellence, \"DCS: Black Shark\" will bring an even moreDCS: Black Shark is a PC game of the Russian Ka-50 attack helicopter and is the first title in a new Eagle Dynamics and The Fighter Collection simulation series: Digital Combat Simulator (DCS). Following Eagle Dynamics' tradition of excellence, \"DCS: Black Shark\" will bring an even more realistic simulation experience than its predecessor \"Flaming Cliffs\". DCS: Black Shark will offer an unprecedented level of realism in regards to flight dynamics, instruments modeling, avionics systems, and weapon systems. The artificial Intelligence of ground vehicles and helicopters has been improved dramatically as well as weapon modeling. A new Mission Editor includes a powerful electronic mapping system that allows user to easily create missions and campaigns. A new campaign system allows the front line of the battlefield to move back and fourth according to your mission success or failure. [Eagle Dynamics]… Expand"}, {"name": "FIFA Soccer 08", "details_link": "https://www.metacritic.com/game/xbox-360/fifa-soccer-08", "publisher": "EA Sports", "release_date": "Oct  9 2007", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "32  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/464ac985d29b858ea63773d815798b8d-98.jpg", "descriptions": "The FIFA Soccer 08 next-gen gameplay engine, built to maximize the power of Xbox 360 and PLAYSTATION 3, delivers animations and ball control that is so responsive you feel like you are actually on the pitch. Players in FIFA Soccer 08 now benefit from A.I. so smart, it features a 35-pointThe FIFA Soccer 08 next-gen gameplay engine, built to maximize the power of Xbox 360 and PLAYSTATION 3, delivers animations and ball control that is so responsive you feel like you are actually on the pitch. Players in FIFA Soccer 08 now benefit from A.I. so smart, it features a 35-point decision engine which enables players to process multiple decisions and reactions in real-time. The A.I.'s dynamic ‘Threat Map’ system captures the excitement and realism of soccer. Players are now aware of their surroundings, reacting authentically to threats and opportunities to make intelligent football decisions. A true next-generation ball-striking engine calculates shot success by combining an almost infinite number of different contexts, including ball spin, pressure from defenders, player attributes, and even air pressure to recreate the drama and unpredictable nature of shooting. A new play mode called Be A Pro locks you in the role of a single player and challenges you to master the same disciplines as a real soccer player—from positioning and tackling to reading the field and passing. FIFA Soccer 08 introduces skill moves with a true next-generation organic 'building-block' system enabling you to combine tricks and skill moves together to recreate signature moves from the real-world superstars or define your own style of play. Animations can be interrupted at any time to transition into a new move, enabling you to read and respond to the defence, just like real life. Master the skills to break down the defence, elude your marker and lead your team to victory. Represent your club online against your rivals throughout the season in the F.A. Premier League, Bundesliga, French League or Mexican 1st Division. When they play, you play. [Electronic Arts]… Expand"}, {"name": "Pro Evolution Soccer 2010", "details_link": "https://www.metacritic.com/game/wii/pro-evolution-soccer-2010", "publisher": "Konami", "release_date": "Nov 10 2009", "developers": ["Konami"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Sports", "Traditional", "Team", "Football", "Soccer", "Sim", "Sim", "Sim"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/d340f6545ae2071e1de806ceb52f2af0-98.jpg", "descriptions": "PES 2010 focuses on enhancing the excitement of matches between players, making for a truly challenging experience that constantly tests the player. Intuitive zonal defending covers spaces and players need to look constantly for new ways to attack. PES 2010 focuses on being a real soccerPES 2010 focuses on enhancing the excitement of matches between players, making for a truly challenging experience that constantly tests the player. Intuitive zonal defending covers spaces and players need to look constantly for new ways to attack. PES 2010 focuses on being a real soccer simulation, as it requires both strategic play and quick reactions, as in real life. In addition to key out-field elements, goalkeepers are more versatile and with abilities matching those of modern shot-stoppers. The game's referees have also been reworked, with smarter AI elements allowing them to make more balanced calls during matches. PES 2010 has undergone a major visual revamp, with its celebrated player likenesses and animations now even closer to those of real-life players - including live player expressions to be depicted with an improved lighting system which differentiates between various conditions! [Konami]… Expand"}, {"name": "ModNation Racers", "details_link": "https://www.metacritic.com/game/playstation-3/modnation-racers", "publisher": "SCEA", "release_date": "May 25 2010", "developers": ["United Front Games"], "platforms": "PlayStation 3", "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/8caf3e52521ee418dabf106c05093fc0-98.jpg", "descriptions": "Exclusive to the PlayStation 3 and PSP systems, ModNation Racers empowers the player to customize their entire kart racing experience. Enjoy karting fun, where you can shoot, boost & drift your way to the finish line. Create your unique racing experience with the same tools used by theExclusive to the PlayStation 3 and PSP systems, ModNation Racers empowers the player to customize their entire kart racing experience. Enjoy karting fun, where you can shoot, boost & drift your way to the finish line. Create your unique racing experience with the same tools used by the development team. Express yourself by creating your own Mod character, quirky kart and imaginative track, and share your unique racing experience with the rest of the world. [SCEA]… Expand"}, {"name": "Soul Sacrifice Delta", "details_link": "https://www.metacritic.com/game/playstation-vita/soul-sacrifice-delta", "publisher": "SCEA", "release_date": "May 13 2014", "developers": ["SCE Japan Studio"], "platforms": "PlayStation Vita", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/becf4b748346a4e57d1a066088328d03-98.jpg", "descriptions": "The first obvious addition to Librom’s pages is the Bazaar Ledger; Carnatux’s bazaar, to be more precise."}, {"name": "King's Bounty: Armored Princess", "details_link": "https://www.metacritic.com/game/pc/kings-bounty-armored-princess", "publisher": "ValuSoft", "release_date": "Nov 19 2009", "developers": ["Katauri Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "General"], "meta_score": 82, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/3785e1e6d8cce6242f5fcf09e014a8e4-98.jpg", "descriptions": "King's Bounty: Armored Princess is a sequel to the critically acclaimed King's Bounty: The Legend. Players take on the role of Princess Amelie who travels around the world of Teana and searches for the renowned knight, and her mentor, Bill Gilbert. This new world of King's Bounty: ArmoredKing's Bounty: Armored Princess is a sequel to the critically acclaimed King's Bounty: The Legend. Players take on the role of Princess Amelie who travels around the world of Teana and searches for the renowned knight, and her mentor, Bill Gilbert. This new world of King's Bounty: Armored Princess is full of mysteries and dangers. The new character, the Princess, will encounter horrible creatures, huge monstrous bosses and a new race, the bloodthirsty Lizards. As in the multi-award winning game on which this sequel is based, the player has many options to resist these new enemies. Various new skills and characteristics of Amelie as well as her chance to fly will help her overcome the hordes attacking the kingdom. The Princess is also accompanied by a Domestic Dragon, at the very beginning small and amusing, but its abilities develop steadily until it becomes an incredible ally. He will do his best to protect the Princess during the battles, starting with easy blows and treasure hunting and finishing with battle rage and volcano summoning. [1C Company]… Expand"}, {"name": "Circuit Superstars", "details_link": "https://www.metacritic.com/game/pc/circuit-superstars", "publisher": "Square Enix", "release_date": "Oct 12 2021", "developers": ["Original Fire Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 82, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/ae8a550b0042270a7e58347375bd7aaa-98.jpg", "descriptions": "FEEL the rubber bite into the road as you pass the start/finish line and dive, brakes squealing, into the first corner! Circuit Superstars is a top-down racer built by racing fans, for racing fans."}, {"name": "Monster Hunter Stories 2: Wings of Ruin", "details_link": "https://www.metacritic.com/game/pc/monster-hunter-stories-2-wings-of-ruin", "publisher": "Capcom", "release_date": "Jul  9 2021", "developers": ["Capcom"], "platforms": ["Switch", "PC"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 82, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/0/decc2ecdb6d9990d6899bea5f9696a79-98.jpg", "descriptions": "Monster Hunter Stories 2: Wings of Ruin offers both RPG and Monster Hunter fans a unique new experience with a rich storyline featuring charming characters, challenging quests and friendly encounters with familiar monsters from the Monster Hunter series. Assuming the role of a young MonsterMonster Hunter Stories 2: Wings of Ruin offers both RPG and Monster Hunter fans a unique new experience with a rich storyline featuring charming characters, challenging quests and friendly encounters with familiar monsters from the Monster Hunter series. Assuming the role of a young Monster Rider who can use a Kinship Stone to form strong bonds with monsters, players can gain experience and improve their skills to form deeper connections with these wonderful creatures. When ready, players can embark on memorable adventures filled with dramatic events and heartwarming friendships as the epic tale unfolds.… Expand"}, {"name": "Chicken Police - Paint it RED!", "details_link": "https://www.metacritic.com/game/pc/chicken-police---paint-it-red!", "publisher": "The Wild Gentlemen", "release_date": "Nov  5 2020", "developers": ["The Wild Gentlemen"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/6cedc60c40fe0c7a6b171015912b1665-98.jpg", "descriptions": "Sonny Featherland and Marty MacChicken were once legendary detective partners in Clawville PD. Predatory division, nicknamed as the Chicken Police. But that was a decade ago and time had passed them by... Sonny is a semi-alcoholic wreck of a bird on paid leave, while Marty still hides behindSonny Featherland and Marty MacChicken were once legendary detective partners in Clawville PD. Predatory division, nicknamed as the Chicken Police. But that was a decade ago and time had passed them by... Sonny is a semi-alcoholic wreck of a bird on paid leave, while Marty still hides behind the facade of a star-detective.On the night of New Year's Eve, a mysterious woman visits Sonny with an errand which goes back to a dark corner of his past. Now, Sonny and Marty are back together again on a case stranger than anything they've ever encountered before!Chicken Police is an \"Orwellesque Buddycop Noir Adventure\", with a carefully crafted world, a gritty, dark story, and absurd humor. The game mixes elements of story-rich adventures with visual novel style dialogue-heavy storytelling, complete with a complex interrogation system, detective gameplay, and an ever-changing city.… Expand"}, {"name": "Tom Clancy's The Division 2: Warlords of New York", "details_link": "https://www.metacritic.com/game/xbox-one/tom-clancys-the-division-2-warlords-of-new-york", "publisher": "Massive Entertainment", "release_date": "Mar  3 2020", "developers": ["Massive Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 82, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/8/7dbe518a41ad6f6cd1677148cbff905c-98.jpg", "descriptions": "While The Division was working to secure Washington, D.C., a familiar shadow fell over the streets of New York. Aaron Keener - one of The Division's original antagonists, as well as the first Division Agent to go rogue - has brought the factions of New York City under his control, and usedWhile The Division was working to secure Washington, D.C., a familiar shadow fell over the streets of New York. Aaron Keener - one of The Division's original antagonists, as well as the first Division Agent to go rogue - has brought the factions of New York City under his control, and used them to conquer Lower Manhattan. With other rogue Agents and a lethal new viral strain at his command, Keener is poised to eradicate what little has been rebuilt since the catastrophic Black Friday pandemic. The battle to restore order continues, but now The Division has a new mission: Stop Keener at any cost.… Expand"}, {"name": "Pillars of Eternity: Complete Edition", "details_link": "https://www.metacritic.com/game/switch/pillars-of-eternity-complete-edition", "publisher": "Versus Evil", "release_date": "Aug  8 2019", "developers": ["Red Cerberus"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 82, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/7/00591a55d2c5cc104ff109c8346d30f2-98.jpg", "descriptions": "Pillars of Eternity, the ultimate role-playing experience on PC, comes to Xbox One! Created by and for role-playing fans by Obsidian Entertainment, masters of the RPG genre, Pillars started as a Kickstarter project, where it shattered all funding goals and pulled in more than 75,000 backers.Pillars of Eternity, the ultimate role-playing experience on PC, comes to Xbox One! Created by and for role-playing fans by Obsidian Entertainment, masters of the RPG genre, Pillars started as a Kickstarter project, where it shattered all funding goals and pulled in more than 75,000 backers. From there, it released to broad critical acclaim, won dozens of awards, and has been a fan favorite on the PC. Now, Paradox Arctic has adapted this unmissable RPG for an entirely new audience on major consoles -- bringing Pillars' fantastical world, tactical combat, and unforgettable story to fans on a whole new platform. Pillars of Eternity: Complete Edition includes all previously released additional content from the PC version, including all DLC and expansions in a single package. But Pillars of Eternity: Complete Edition goes beyond just offering everything together. Paradox Arctic has thoroughly updated the Xbox One version of the award-winning RPG for play with a controller, and have entirely redesigned the UI for easy viewing on televisions. Players will be able to easily navigate the game's detailed character creation, real-time-with-pause combat, and party management from their couches thanks to new TV-friendly menus and controls. Pillars of Eternity: Complete Edition features:  Award-winning writing, story and artwork of Pillars of Eternity, along with the expanded world and content of The White March: Parts I & II  Countless character creation options, from races and classes to character backgrounds which drive your personal story  An epic universe to explore, filled with intriguing party members and companions, a variety of in-game factions, and a lovingly rendered world to traverse  All major updates from the original PC version, including a raised level cap, expanded party AI options, and new difficulty levels  New UI and controls designed from the ground up, presenting the Pillars of Eternity experience like never before… Expand"}, {"name": "The Messenger", "details_link": "https://www.metacritic.com/game/playstation-4/the-messenger", "publisher": "Sabotage Studio", "release_date": "Mar 19 2019", "developers": ["Sabotage Studio"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/7b3358cba699d1a2fde8967875b307e8-98.jpg", "descriptions": "As a demon army besieges his village, a young ninja ventures through a cursed world, to deliver a scroll paramount to his clan’s survival. What begins as a classic action platformer soon unravels into an expansive time-traveling adventure full of thrills, surprises, and humor."}, {"name": "Toki Tori", "details_link": "https://www.metacritic.com/game/switch/toki-tori", "publisher": "Two Tribes", "release_date": "Mar 30 2018", "developers": ["Two Tribes"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "Wii U", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/22659e30e376d645340e8a9ec35e3ed0-98.jpg", "descriptions": "Take control of Toki Tori, a surprisingly heroic chicken, as he puzzles his way through 80+ levels spread over 5 unique worlds. Toki Tori isn’t very athletic, he can’t even jump. Luckily he has some great tools at his disposal, including the Telewarp, Freeze-o-Matic and InstantRock. CreativeTake control of Toki Tori, a surprisingly heroic chicken, as he puzzles his way through 80+ levels spread over 5 unique worlds. Toki Tori isn’t very athletic, he can’t even jump. Luckily he has some great tools at his disposal, including the Telewarp, Freeze-o-Matic and InstantRock. Creative thinking and problem solving are required to collect all eggs in each level, but don’t worry. When you get stuck, you can always rewind the time. And if all else fails, use the Wildcard to skip a level.\r - Classic egg-collecting puzzle platformer\r- 80+ levels, 5 worlds, dozens of hours of gameplay\r- A wide variety of puzzle-solving items and weapons\r- Never get stuck: rewind the time or skip a level\r- Super smooth graphics at 60 fps\r- HD Rumble support\r- Video capture support… Expand"}, {"name": "Rock Band Rivals", "details_link": "https://www.metacritic.com/game/xbox-one/rock-band-rivals", "publisher": "Performance Designed Products", "release_date": "Oct 18 2016", "developers": ["Harmonix Music Systems"], "platforms": ["PlayStation 4", "Xbox One"], "genres": ["Action", "Rhythm", "Music"], "meta_score": 82, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/f109b359712dcbfe23e1caa82e4a67ae-98.jpg", "descriptions": "The Rock Band Rivals expansion brings new features to Rock Band 4. Perform your way through an epic rock documentary about your band in a new campaign mode, join Crews to prove your skill and crush your opponents through weekly online challenges, and get a free backstage pass to months ofThe Rock Band Rivals expansion brings new features to Rock Band 4. Perform your way through an epic rock documentary about your band in a new campaign mode, join Crews to prove your skill and crush your opponents through weekly online challenges, and get a free backstage pass to months of additional game updates, including Synchronous Online Multiplayer with your friends this holiday. [Harmonix]… Expand"}, {"name": "Resident Evil HD Remaster", "details_link": "https://www.metacritic.com/game/xbox-one/resident-evil-hd-remaster", "publisher": "Capcom", "release_date": "Jan 20 2015", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Horror", "Action Adventure", "Survival"], "meta_score": 82, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/1297772fe101f2b4881d7f7db5b7ebb4-98.jpg", "descriptions": "In 1998 a special forces unit was dispatched to investigate some bizarre murders on the outskirts of Raccoon City. Upon arrival they were accosted by a pack of blood-thirsty dogs and were forced to take cover in a nearby mansion. But the scent of death hung heavy in the air. Supplies wereIn 1998 a special forces unit was dispatched to investigate some bizarre murders on the outskirts of Raccoon City. Upon arrival they were accosted by a pack of blood-thirsty dogs and were forced to take cover in a nearby mansion. But the scent of death hung heavy in the air. Supplies were scarce as they struggled to stay alive. … Expand"}, {"name": "Far Cry 4", "details_link": "https://www.metacritic.com/game/xbox-one/far-cry-4", "publisher": "Ubisoft", "release_date": "Nov 18 2014", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "First-Person", "Modern", "Arcade"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/5c107c482b33bc6b526b3806cfb4e710-98.jpg", "descriptions": "Hidden in the towering Himalayas lies a country thick with tradition and violence. You assume the role of Ajay Ghale, returning to the country of your birth, the lush forests and harsh snow-capped summits of Kyrat, to fulfill your mother’s final wish of distributing her ashes. This vast andHidden in the towering Himalayas lies a country thick with tradition and violence. You assume the role of Ajay Ghale, returning to the country of your birth, the lush forests and harsh snow-capped summits of Kyrat, to fulfill your mother’s final wish of distributing her ashes. This vast and unpredictable country offers visitors opportunity and danger. You summarily find yourself caught up in a rebellion to subvert the oppressive regime of Pagan Min, a figure notorious as much for his sense of style and charisma as for his cruelty and naked brutality. Navigating the treacherous landscape, you find your fate increasingly determined by the choices you make because in Kyrat, and every second is a story. In Far Cry 4, you’ll conquer fortress outposts from the back of a six-ton elephant and take to the skies as you rain down explosives from your moving perch in the gyrocopter. The vertical landscape of the Himalayas isn’t just a gorgeous backdrop, but a playground that encourages the gamer to scrap, hunt and explore, grappling cliffs or launching into the air, plummeting to the valley below in a controlled free fall with your wing suit. You’ll carry with you a truly unique arsenal of weaponry that lets you play your way, whether it’s sniping, sneaking or all-out assault. When all else fails, animals can be your most important allies or your greatest peril, as Kyrat’s wilderness delivers on the promise of a true open world anecdote factory.… Expand"}, {"name": "Age of Wonders III - Golden Realms", "details_link": "https://www.metacritic.com/game/pc/age-of-wonders-iii---golden-realms", "publisher": "Triumph Studios", "release_date": "Sep 18 2014", "developers": ["Triumph Studios"], "platforms": "PC", "genres": ["Fantasy", "Strategy", "Turn-Based", "General"], "meta_score": 82, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/4704227fc1d125b9fcaa87453b60c053-98.jpg", "descriptions": "Golden Realms greatly expands Age of Wonders III’s empire building mechanics and introduces new content. These new features are used in random maps, new scenarios and a new story campaign, where Halfling survivors settle in a distant land filled with danger and treasures never seen before."}, {"name": "Enslaved: Odyssey to the West", "details_link": "https://www.metacritic.com/game/xbox-360/enslaved-odyssey-to-the-west", "publisher": "Namco Bandai Games", "release_date": "Oct  5 2010", "developers": ["Ninja Theory"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/a2ca35d9e79c1416a9391593297f39b9-98.jpg", "descriptions": "More than 150 years in the future, the world has transformed into an unrecognizable state where all that remains are a dwindling human population and merciless robots left over from wars long past. In Enslaved, players take on the role of Monkey, a strong and brutish loner, and his AIMore than 150 years in the future, the world has transformed into an unrecognizable state where all that remains are a dwindling human population and merciless robots left over from wars long past. In Enslaved, players take on the role of Monkey, a strong and brutish loner, and his AI partner Trip, a technologically savvy but sheltered young woman from a peaceful community. Both become captured by a mysterious slave ship, which are rumored to harvest people and take them out west never to return. As they each attempt to escape, Trip realizes quickly that Monkey, with his raw strength and power, is the only hope she has of making the perilous journey back home. She hacks into a slave headband to enslave Monkey and link them together - if she dies, he dies. Her journey has now become his. Players must make sure both Monkey and Trip work together as they skillfully navigate through the world and survive against the dangerous enemy obstacles that lie in wait. Monkey will deftly wield his trusty staff weapon to attack and defend against enemies, using a combination of melee attacks, blocks and counters. He will also be able to perform spectacular takedown moves, allowing him to rip an enemy apart piece by piece, take its weapon for his own use or destroy it in one final blow. [Namco Bandai Games]… Expand"}, {"name": "Warhammer: Vermintide 2", "details_link": "https://www.metacritic.com/game/pc/warhammer-vermintide-2", "publisher": "Fatshark AB", "release_date": "Mar  8 2018", "developers": ["Fatshark AB", "Fatshark"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/894df9abc9e788c0a7d13ac0e0858483-98.jpg", "descriptions": "The sequel to the critically acclaimed Vermintide is a visually stunning and groundbreaking melee action game pushing the boundaries of the first person co-op genre. Join the fight now!"}, {"name": "Gears 5", "details_link": "https://www.metacritic.com/game/pc/gears-5", "publisher": "Microsoft Game Studios", "release_date": "Sep 10 2019", "developers": ["The Coalition"], "platforms": ["Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 82, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/edcea8ca80066b43903701a0035c8c34-98.jpg", "descriptions": "Sera is crumbling, your enemies uniting. Humanity’s reliance on technology has become their downfall and enemies are uniting to wipe out all survivors. As Kait, journey back to uncover the origins of the Locust, and fight with your squad to protect what’s left."}, {"name": "Strong Bad's Cool Game for Attractive People Episode 5: 8-Bit Is Enough", "details_link": "https://www.metacritic.com/game/pc/strong-bads-cool-game-for-attractive-people-episode-5-8-bit-is-enough", "publisher": "Telltale Games", "release_date": "Dec 15 2008", "developers": ["Telltale Games"], "platforms": "PC", "genres": ["Miscellaneous", "Adventure", "General", "Compilation"], "meta_score": 82, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/153ba14f5aaa033f34e7531b87240e33-98.jpg", "descriptions": "Trogdor must be stopped! The beefy-armed dragon of legend has broken free from his arcade cabinet and is burninating the land. With classic 8-bit games leaking into the real world and Strong Badia a fiery mess, only Strong Bad can take back the night and conquer this scorching menace onceTrogdor must be stopped! The beefy-armed dragon of legend has broken free from his arcade cabinet and is burninating the land. With classic 8-bit games leaking into the real world and Strong Badia a fiery mess, only Strong Bad can take back the night and conquer this scorching menace once and for all. Does anybody know how to kill a dragon? [TellTale Games]… Expand"}, {"name": "Prince of Persia", "details_link": "https://www.metacritic.com/game/pc/prince-of-persia", "publisher": "Ubisoft", "release_date": "Dec  9 2008", "developers": ["Ubisoft Montreal"], "platforms": ["3DS", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/b69bc7aecffd4f387181a075e67cc2ec-98.jpg", "descriptions": "Set in a land rooted in ancient Persian mythology, the Prince finds himself caught in an epic battle between the primal forces of light and darkness: the God of Light, Ormazd versus his brother Ahriman, the destructive God of Darkness. The Prince arrives just in time to witness theSet in a land rooted in ancient Persian mythology, the Prince finds himself caught in an epic battle between the primal forces of light and darkness: the God of Light, Ormazd versus his brother Ahriman, the destructive God of Darkness. The Prince arrives just in time to witness the destruction of the legendary Tree of Life - an act which threatens to plunge the entire world into eternal darkness. Manifested in the form of the Corruption, a dark substance that physically contaminates the land and the skies, the Prince must partner with Elika, a deadly companion, to heal the world from the evil Corruption. [Ubisoft]… Expand"}, {"name": "Clubhouse Games: 51 Worldwide Classics", "details_link": "https://www.metacritic.com/game/switch/clubhouse-games-51-worldwide-classics", "publisher": "Nintendo", "release_date": "Jun  5 2020", "developers": ["Nintendo", "Nd Cube"], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/e15b342486b29baa4d553150b86f399f-98.jpg", "descriptions": "Play and discover 51 board games, tabletop games, and more all in one package -- Clubhouse Games: 51 Worldwide Classics. This diverse collection includes games from all over the world across multiple genres, from familiar favorites like Chess to international hits like Mancala that have beenPlay and discover 51 board games, tabletop games, and more all in one package -- Clubhouse Games: 51 Worldwide Classics. This diverse collection includes games from all over the world across multiple genres, from familiar favorites like Chess to international hits like Mancala that have been around for 100s of years!\r Enjoy familiar favorites and learn hidden gems from around the world in this collection of 51 board games, tabletop games and more! Whether you like to sit and strategize or rely on reflexes, Clubhouse Games: 51 Worldwide Classics contains games from across an array of genres for you to play and discover. Each game is presented with stunning detail as dice clack and marbles glimmer.\r Strategic players will feel right at home with games like Four-in-a-row and Renegade, while those who prefer to use their reflexes can enjoy games like Slot Cars and Toy Boxing!\r With board games, card games, sports, solitaires and more, Clubhouse Games: 51 Worldwide Classics is an eclectic collection of games to play and discover on your Nintendo Switch.… Expand"}, {"name": "Halo Wars", "details_link": "https://www.metacritic.com/game/xbox-360/halo-wars", "publisher": "Microsoft Game Studios", "release_date": "Mar  3 2009", "developers": ["Ensemble Studios"], "platforms": "Xbox 360", "num_players": "6  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General", "Command"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/996365088757f0e4369505de5a7d2466-98.jpg", "descriptions": "Halo Wars is the next big real-time strategy game from Ensemble Studios, creators of \"Age of Empires.\" Designed exclusively for the Xbox 360, Halo Wars allows you to take charge of the human UNSC armies and see the Halo universe from a totally new perspective. Halo Wars takes place beforeHalo Wars is the next big real-time strategy game from Ensemble Studios, creators of \"Age of Empires.\" Designed exclusively for the Xbox 360, Halo Wars allows you to take charge of the human UNSC armies and see the Halo universe from a totally new perspective. Halo Wars takes place before Halo 1 during the UNSC’s first deadly encounters with the Covenant. Players lead the crew of the UNSC's \"Spirit of Fire\" from initial skirmishes to an all out war against the evil Covenant. [Ensemble Studios]… Expand"}, {"name": "PixelJunk Monsters Encore", "details_link": "https://www.metacritic.com/game/playstation-3/pixeljunk-monsters-encore", "publisher": "SCEA", "release_date": "May  8 2008", "developers": ["Q-Games"], "platforms": "PlayStation 3", "num_players": "2  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "Fantasy", "Defense"], "meta_score": 82, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/48199acd32a0a57f6ad6881433de78e2-98.jpg", "descriptions": "[Dowloadable Game]  PixelJunk Monsters Encore is an expansion pack to the tower defense game, PixelJunk Monsters. Encore includes 15 levels on a new map, \"Toki Island\", as well as the ability for players to track their score across both maps. Just as in the original game, Encore continues[Dowloadable Game]  PixelJunk Monsters Encore is an expansion pack to the tower defense game, PixelJunk Monsters. Encore includes 15 levels on a new map, \"Toki Island\", as well as the ability for players to track their score across both maps. Just as in the original game, Encore continues the simple real-time strategy concept of building, researching and base defending. [Sony]… Expand"}, {"name": "Wargroove", "details_link": "https://www.metacritic.com/game/pc/wargroove", "publisher": "Chucklefish", "release_date": "Feb  1 2019", "developers": ["Chucklefish"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["General", "Strategy", "Turn-Based", "Tactics"], "meta_score": 82, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/18dffef77605c472dff01543166af327-98.jpg", "descriptions": "Take to the battlefield with Wargroove, a strategy game for up to 4 players. Choose your Commander and wage turn-based war on battling factions. Design and share maps, cut-scenes and campaigns with easy-to-use editors and in-depth customization tools."}, {"name": "Joint Operations: Typhoon Rising", "details_link": "https://www.metacritic.com/game/pc/joint-operations-typhoon-rising", "publisher": "NovaLogic", "release_date": "Jun 15 2004", "developers": ["NovaLogic"], "platforms": "PC", "num_players": "64+  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/25e3fdd1b81e669ab3b3a068fe431224-98.jpg", "descriptions": "Set in Indonesia in the near future, Joint Operations takes the player to a country on the verge of disintegration. Regional independence movements have acquired advanced weaponry as the nation's military splits into competing factions. Escalating violence threatens innocent civilians andSet in Indonesia in the near future, Joint Operations takes the player to a country on the verge of disintegration. Regional independence movements have acquired advanced weaponry as the nation's military splits into competing factions. Escalating violence threatens innocent civilians and Western economic interests. [NovaLogic]… Expand"}, {"name": "Gnosia", "details_link": "https://www.metacritic.com/game/switch/gnosia", "publisher": "Playism", "release_date": "Mar  4 2021", "developers": ["Petit Depotto"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/7432299f0ac9387ca3cefe117a19f4e1-98.jpg", "descriptions": "The Gnosia lie. Pretending to be human, they’ll get in close, trick and deceive, and then eliminate one victim at a time... The crew of a drifting spaceship, facing off against a mysterious and deadly threat known as the “Gnosia” and having no idea who among them is really the enemy,The Gnosia lie. Pretending to be human, they’ll get in close, trick and deceive, and then eliminate one victim at a time... The crew of a drifting spaceship, facing off against a mysterious and deadly threat known as the “Gnosia” and having no idea who among them is really the enemy, formulate a desperate plan for survival. The most suspicious among them will be put into “cold sleep” one by one, in an effort to rid the ship of Gnosia.\r Gnosia is a Sci-Fi Social Deduction RPG in which you will engage in discussion with a variety of unique characters, with the aim of identifying the Gnosia among the group. Players will have to use what information they can gather during the discussions to ascertain whom they think is Gnosia and then vote to put them into cold sleep. As you progress, your abilities will improve - but so will those of the crew.\rAs the numbers of crew members, Gnosia, and various “roles” increase, it will become increasingly difficult to determine who is telling the truth. Work in collaboration with or against other crew members to ensure your survival until the end.\r ・Repeatedly play through “loops”, triggering special events to unravel mysteries in a uniquely original narrative. Certain events will unlock new commands for you to use during discussions.\r ・Step into a variety of roles to develop different character builds. Your stats will determine how effectively you can sway the group’s opinion or lie, and will also affect your likelihood of being selected for cold sleep.\r ・Engage with an engrossing and eclectic cast of characters and experience randomly triggered events, each one unique to its subject. Character events will reveal information about your crewmates in the form of special “Notes”.… Expand"}, {"name": "Sakuna: Of Rice and Ruin", "details_link": "https://www.metacritic.com/game/pc/sakuna-of-rice-and-ruin", "publisher": "XSEED Games", "release_date": "Nov 10 2020", "developers": ["Edelweiss"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/778340c64ca16fbe95d43e989c063af5-98.jpg", "descriptions": "Sakuna: Of Rice and Ruin is the forthcoming title from Edelweiss.Sakuna: Of Rice and Ruin combines side-scrolling action with deep crafting and farming simulation. Players take on the role of Sakuna, a spoiled harvest goddess banished to a dangerous island with a group of outcast humans.Sakuna: Of Rice and Ruin is the forthcoming title from Edelweiss.Sakuna: Of Rice and Ruin combines side-scrolling action with deep crafting and farming simulation. Players take on the role of Sakuna, a spoiled harvest goddess banished to a dangerous island with a group of outcast humans. As she explores the beautiful, forbidding environments of the island, she will also find a home in a mountain village, proving herself worthy of her title by harvesting rice and bettering the lives of humans. In addition to being a fresh take on Japanese mythology and a love letter to action games, Sakuna: Of Rice and Ruin is an ode to rice and an engrossing simulation of the craft behind the agriculture.… Expand"}, {"name": "MotorStorm: Pacific Rift", "details_link": "https://www.metacritic.com/game/playstation-3/motorstorm-pacific-rift", "publisher": "SCEA", "release_date": "Oct 28 2008", "developers": ["Evolution Studios"], "platforms": "PlayStation 3", "num_players": "12  Online", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/d7510ce3b5ef59393a66aa7faebeff6b-98.jpg", "descriptions": "The brutal offroad racing festival is back, with players this time attempting to tackle the diversity and unpredictability of a remote Pacific island environment. MotorStorm: Pacific Rift revisits the intense racing action introduced in last year's MotorStorm, this time allowing players toThe brutal offroad racing festival is back, with players this time attempting to tackle the diversity and unpredictability of a remote Pacific island environment. MotorStorm: Pacific Rift revisits the intense racing action introduced in last year's MotorStorm, this time allowing players to navigate a radically different tropical environment chock full of lush jungle, towering peaks, and crystal-clear water.  Players experience a greater selection of tracks and vehicles to choose, as well as extensive multiplayer options including four player split screen and races with up to 20 players online. Additionally players can utilize a new photo mode to save images within the game and for the first time be able to take music from their PS3's HDD to create a customized soundtrack. [Sony]… Expand"}, {"name": "Xpand Rally", "details_link": "https://www.metacritic.com/game/pc/xpand-rally", "publisher": "TopWare Interactive", "release_date": "Apr 20 2006", "developers": ["Techland"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/de982b1a412f3c0e64538fdfded6885b-98.jpg", "descriptions": "Xpand Rally is a breathtaking game that gives you the true to life experience of driving powerful rally cars amidst photorealistic sceneries. Realistic weather effects, rolling hills, and animated scenery all add to game's visual perfection. Xpand Rally also features highly detailed modelsXpand Rally is a breathtaking game that gives you the true to life experience of driving powerful rally cars amidst photorealistic sceneries. Realistic weather effects, rolling hills, and animated scenery all add to game's visual perfection. Xpand Rally also features highly detailed models of modern rally cars and handling physics developed with the help of rally sport professionals which further enhance the realism of driving experience. Xpand Rally combines the best elements of Rally and Rally Cross racing in one unique gaming experience. The game offers a career mode based on time trials during both: individual races and World Championship Series which will satisfy traditional Rally fans. The Rally Cross fans won't be disappointed either - they can challenge several opponents in head to head racing during competitions based on real and fictitious race events. Xpand Rally, as the only title on the market, brings the economy factor into a rally game. The player starts with a junk car and competes in races to earn money and acquire upgrades, repair damage, tweak performance and pay the race entry fees. [Techland]… Expand"}, {"name": "Prey", "details_link": "https://www.metacritic.com/game/pc/prey", "publisher": "Bethesda Softworks", "release_date": "May  5 2017", "developers": ["Arkane Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Role-Playing", "Shooter", "Action RPG", "First-Person", "Arcade"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/9aaffc733dabd8cf640c14d92ca1060b-98.jpg", "descriptions": "You awaken aboard Talos I, a space station orbiting the moon in the year 2032. You are the key subject in an experiment meant to change humanity forever – but things have gone terribly wrong. The space station has been overrun by hostile aliens and you are now being hunted. As you delve intoYou awaken aboard Talos I, a space station orbiting the moon in the year 2032. You are the key subject in an experiment meant to change humanity forever – but things have gone terribly wrong. The space station has been overrun by hostile aliens and you are now being hunted. As you delve into the dark secrets of Talos I and your own past, you have to survive using the tools found on the station, your wits, weapons, and mind-bending abilities. [Bethesda Softworks]… Expand"}, {"name": "NBA 2K19", "details_link": "https://www.metacritic.com/game/playstation-4/nba-2k19", "publisher": "2K Games", "release_date": "Sep  7 2018", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Arcade", "Sim"], "meta_score": 82, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/8/ce1eb478c3dbb118a32944104d32ff12-98.jpg", "descriptions": "NBA 2K celebrates 20 years of redefining what sports gaming can be, from best in class graphics & gameplay to groundbreaking game modes and an immersive open-world \"Neighborhood.\" NBA 2K19 promises to push limits as it brings gaming one step closer to real-life basketball excitement and culture."}, {"name": "Dark Souls II: Crown of the Sunken King", "details_link": "https://www.metacritic.com/game/pc/dark-souls-ii-crown-of-the-sunken-king", "publisher": "Bandai Namco Games", "release_date": "Jul 22 2014", "developers": ["Namco Bandai Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/0c0947613159678f859f85a3a4b40f0d-98.jpg", "descriptions": "Embark on a journey to reclaim a crown that Drangleic's King Vendrick once owned. This perilous quest will lead you through an entirely different world within the Dark Souls II universe, where stepped pyramids span a vast underground cavern. It is said that one of the ancient crowns layEmbark on a journey to reclaim a crown that Drangleic's King Vendrick once owned. This perilous quest will lead you through an entirely different world within the Dark Souls II universe, where stepped pyramids span a vast underground cavern. It is said that one of the ancient crowns lay buried deep within these dark caverns; but surely such a valued item cannot sit unguarded. Explore in search of a crown that holds the strength of lords from times long past.… Expand"}, {"name": "The Walking Dead: Episode 4 - Around Every Corner", "details_link": "https://www.metacritic.com/game/xbox-360/the-walking-dead-episode-4---around-every-corner", "publisher": "Telltale Games", "release_date": "Oct 10 2012", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "Adventure", "General", "Compilation", "Point-and-Click"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/43b69a0c0d83d474d7181be9e5b8a6a3-98.jpg", "descriptions": "The fourth installment in the zombie chronicle."}, {"name": "SSX", "details_link": "https://www.metacritic.com/game/xbox-360/ssx", "publisher": "EA Sports", "release_date": "Feb 28 2012", "developers": ["EA Canada"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Sports", "Alternative", "Individual", "Snowboarding", "Snowboarding", "Ski / Snowboard"], "meta_score": 82, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/00c393b7b469659a5236d84582f205e5-98.jpg", "descriptions": "SSX allows players to experience the franchise’s signature fun and adrenaline-packed gameplay across iconic mountain ranges all over the world. Utilizing NASA topographical satellite data, we’ve mapped out a Massive World for players to explore. Using a Google-Earth inspired interface,SSX allows players to experience the franchise’s signature fun and adrenaline-packed gameplay across iconic mountain ranges all over the world. Utilizing NASA topographical satellite data, we’ve mapped out a Massive World for players to explore. Using a Google-Earth inspired interface, navigate throughout nine expansive mountain ranges and regions, each with multiple peaks and multiple drops. SSX packs reality-defying gameplay into every run letting players Race, Trick, and Survive down huge open mountains. In addition, Explore, Global Events and RiderNet - SSX’s recommendation engine - headline an online feature set that will revolutionize social competition for gamers, making it fun and easy to compete with friends on your schedule.… Expand"}, {"name": "Shantae: Half-Genie Hero", "details_link": "https://www.metacritic.com/game/switch/shantae-half-genie-hero", "publisher": "XSEED Games", "release_date": "Jun  8 2017", "developers": ["WayForward"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Stadia", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/0d4e87fcfe29c8b37b8f8b1427383eca-98.jpg", "descriptions": "Shantae is roused from a deep sleep, suddenly alert. She plunges into the moonlit forest in search of answers. In nearby Scuttle Town she discovers a mysterious trapdoor, and beyond that, a luminous subterranean cavern. A familiar voice calls out, drawing Shantae to a beautiful fountain.Shantae is roused from a deep sleep, suddenly alert. She plunges into the moonlit forest in search of answers. In nearby Scuttle Town she discovers a mysterious trapdoor, and beyond that, a luminous subterranean cavern. A familiar voice calls out, drawing Shantae to a beautiful fountain. Touching its waters she is immediately spirited away to the fabled Genie Realm. At her feet a magical seal swells as some powerful evil seeks escape. The chamber trembles with a deep, bellowing roar and everything goes white. Shantae sits upright, back in her bed. Was it just a dream? Or a vision of things to come?… Expand"}, {"name": "Resident Evil HD Remaster", "details_link": "https://www.metacritic.com/game/pc/resident-evil-hd-remaster", "publisher": "Capcom", "release_date": "Jan 20 2015", "developers": ["Capcom"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Survival"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/2d13dee02d7df6c016369b7511d7730a-98.jpg", "descriptions": "In 1998 a special forces team was sent to investigate some bizarre murders on the outskirts of Raccoon City. Upon arrival they were attacked by a pack of blood-thirsty dogs and were forced to take cover in a nearby mansion. But the scent of death hung heavy in the air. Supplies were scarceIn 1998 a special forces team was sent to investigate some bizarre murders on the outskirts of Raccoon City. Upon arrival they were attacked by a pack of blood-thirsty dogs and were forced to take cover in a nearby mansion. But the scent of death hung heavy in the air. Supplies were scarce as they struggled to stay alive. … Expand"}, {"name": "Disgaea 4: A Promise Revisited", "details_link": "https://www.metacritic.com/game/playstation-vita/disgaea-4-a-promise-revisited", "publisher": "NIS America", "release_date": "Aug 12 2014", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation 3", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Strategy", "Turn-Based", "Fantasy", "Tactics"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/0d045869b7eaab7933a7243f9024a73f-98.jpg", "descriptions": "Disgaea 4 is a sequel to Disgaea, a hardcore, turn-based, strategy RPG. In Disgaea, character units have a limit to their movement and attack ranges, based on level and weapons equipped. There are other special game factors that let you take advantage of the 3D battle map, many of which areDisgaea 4 is a sequel to Disgaea, a hardcore, turn-based, strategy RPG. In Disgaea, character units have a limit to their movement and attack ranges, based on level and weapons equipped. There are other special game factors that let you take advantage of the 3D battle map, many of which are unique to Disgaea. As the 4th installment in the series Disgaea 4 adopts an all new graphic engine with a much more emphasis on a anime style graphics and also adopts many new game system for an exciting battle adventure.… Expand"}, {"name": "Loop Hero", "details_link": "https://www.metacritic.com/game/pc/loop-hero", "publisher": "Devolver Digital", "release_date": "Mar  4 2021", "developers": ["Four Quarters"], "platforms": ["Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/ea86f4ef187ce404e0c9ae7462c26660-98.jpg", "descriptions": "The Lich has thrown the world into a timeless loop and plunged its inhabitants into never ending chaos. Wield an expanding deck of mystical cards to place enemies, buildings, and terrain along each unique expedition loop for the brave hero."}, {"name": "Terra Nil", "details_link": "https://www.metacritic.com/game/pc/terra-nil", "publisher": "Devolver Digital", "release_date": "Mar 28 2023", "developers": ["Free Lives"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 82, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/facbe7bd653057b2de96e546193c48fc-98.jpg", "descriptions": "Terra Nil, from eco-warriors Free Lives (Broforce) and recycled publisher Devolver Digital, presents players with the task of environmental rejuvenation. Begin with the water system, slowly purify the soil, and cultivate pioneer greenery. Embark on more ambitious tasks, restore biodiversity,Terra Nil, from eco-warriors Free Lives (Broforce) and recycled publisher Devolver Digital, presents players with the task of environmental rejuvenation. Begin with the water system, slowly purify the soil, and cultivate pioneer greenery. Embark on more ambitious tasks, restore biodiversity, fix the climate, introduce wildlife, and finally recycle all the structures you used to get there, leaving the environment pristine.\r Each region of the game has its own flavour and procedural generation palette. Yet even within a region, no two playthroughs will be the same.\r Navigate sprawling, verdant, hand-painted environments where everything but the rocks move and breathe. A meditative soundtrack and stunning audio palette will accompany your efforts.… Expand"}, {"name": "Victor Vran: Overkill Edition", "details_link": "https://www.metacritic.com/game/switch/victor-vran-overkill-edition", "publisher": "Wired Productions", "release_date": "Aug 28 2018", "developers": ["Haemimont Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/47aa9e07f1d0800f90bb395062ed033a-98.jpg", "descriptions": "Overkill Edition includes the fully updated and award winning Action RPG Victor Vran, the expansive Fractured Worlds & the legendary Motorhead: Through The Ages. Look your very best and reinforce your play style with a monumental arsenal of powerful weapons, game-changing outfits, wickedOverkill Edition includes the fully updated and award winning Action RPG Victor Vran, the expansive Fractured Worlds & the legendary Motorhead: Through The Ages. Look your very best and reinforce your play style with a monumental arsenal of powerful weapons, game-changing outfits, wicked demon powers and fate-binding destiny cards. Redefine how you play at any moment, even in the heat of battle. Modify your demon slaying loadout as you dodge deadly attacks, leap from towering locations and take on hordes of hideous beasts and cunning boss monsters. Fedora or no fedora, you decide! Slaying demons doesn't have to be a lonely affair -- form a pack and find even greater strength in numbers, to explore the story of the dark world together.… Expand"}, {"name": "Cyber Shadow", "details_link": "https://www.metacritic.com/game/switch/cyber-shadow", "publisher": "Yacht Club Games", "release_date": "Jan 26 2021", "developers": ["Mechanical Head Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/ba4adf59bc81001c21902d3de5a2219c-98.jpg", "descriptions": "The world has been taken over by synthetic lifeforms. A desperate plea for help sets Shadow on a journey to uncover what started the path to perpetual ruin. Slash through the techno hordes, leap past traps, and nimbly navigate the ruins of Mekacity. Only you can unlock the secrets to yourThe world has been taken over by synthetic lifeforms. A desperate plea for help sets Shadow on a journey to uncover what started the path to perpetual ruin. Slash through the techno hordes, leap past traps, and nimbly navigate the ruins of Mekacity. Only you can unlock the secrets to your clan's ancient powers in Cyber Shadow, the quintessential Ninja Action game.… Expand"}, {"name": "Year Walk", "details_link": "https://www.metacritic.com/game/wii-u/year-walk", "publisher": "Simogo", "release_date": "Sep 17 2015", "developers": ["Simogo"], "platforms": ["iPhone/iPad", "PC", "Wii U"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/3eef78eb0a724dc844560c8a5942b2f7-98.jpg", "descriptions": "In the old days man tried to catch a glimpse of the future in the strangest of ways. Experience the ancient Swedish phenomena of year walking through a different kind of first person adventure that blurs the line between two and three dimensions as well as reality and the supernatural."}, {"name": "You Don't Know Jack", "details_link": "https://www.metacritic.com/game/playstation-3/you-dont-know-jack", "publisher": "THQ", "release_date": "Feb  8 2011", "developers": ["Jellyvision", "Iron Galaxy Studios"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 82, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/f4d6a96750a2bba7936d0e0069c40bdf-98.jpg", "descriptions": "The classic smart-aleck quiz show game is making its debut on current-generation consoles."}, {"name": "The Lord of the Rings: The Two Towers", "details_link": "https://www.metacritic.com/game/playstation-2/the-lord-of-the-rings-the-two-towers", "publisher": "EA Games", "release_date": "Oct 21 2002", "developers": ["Stormfront Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/dd7db2156cb442b415f59b52827d99f4-98.jpg", "descriptions": "Join the fellowship and experience all of the action from the first two blockbuster movies in The Lord of the Rings trilogy. Step into the roles of Aragorn the Ranger, Legolas the Elf, and Gimli the Dwarf, each with their own set of upgradeable attacks and combos. Battle Sauron's minionsJoin the fellowship and experience all of the action from the first two blockbuster movies in The Lord of the Rings trilogy. Step into the roles of Aragorn the Ranger, Legolas the Elf, and Gimli the Dwarf, each with their own set of upgradeable attacks and combos. Battle Sauron's minions including an army of 10,000 Uruk-Hai on the walls of Helm's Deep, hordes of Orcs on the plains of Rohan, and even the monstrous Cave Troll in Balin's Tomb. With scenes from both movies, and exclusive interviews with the stars from the films, you'll have everything you need to determine the fate of Middle-earth. [Electronic Arts]… Expand"}, {"name": "Celtic Kings: Rage of War", "details_link": "https://www.metacritic.com/game/pc/celtic-kings-rage-of-war", "publisher": "Strategy First", "release_date": "Aug 21 2002", "developers": ["Haemimont", "Haemimont Games"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/b8f2b00d458f791c84928be1532697cd-98.jpg", "descriptions": "Both RTS and Role-Playing gamers will enjoy the experience of becoming the young Warrior Larax, who after losing his beloved one, has given himself to the goddess of war, Kathubodua. In strategic mode, you play against computer opponents or other players on the Internet exercising yourBoth RTS and Role-Playing gamers will enjoy the experience of becoming the young Warrior Larax, who after losing his beloved one, has given himself to the goddess of war, Kathubodua. In strategic mode, you play against computer opponents or other players on the Internet exercising your strategic and tactical skills to achieve objective victory. You train and command many units, hire and develop heroes, acquire powerful artefacts and conquer strongholds and villages. Launch large-scale military campaigns against your foes to bring them to their knees. The game-play in this mode is similar to the traditional RTS gameplay. In adventure mode, you control a party of heroes and explore the world as the struggle between Caesar and the Gaul chieftain evolves. Which side you will support? Will you betray your allies of yesterday? Will you follow the mysterious druids as they request your assistance? Command strongholds and large armies; take risky missions behind the enemy lines. Find powerful artefacts to support you. [Strategy First]… Expand"}, {"name": "ATV Offroad Fury", "details_link": "https://www.metacritic.com/game/playstation-2/atv-offroad-fury", "publisher": "SCEA", "release_date": "Feb  5 2001", "developers": ["Rainbow Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/72322cf801718cd5509a3b5e148c51a3-98.jpg", "descriptions": "Conquer the terrain with 12 rugged ATVs and large offroad environments. ATV Offroad Fury delivers the excitement of ATV racing with high-performance two-stroke and four-stroke ATVs, 20 free-roaming race environments, and six unique events. Race authentic ATVs through six challenging events,Conquer the terrain with 12 rugged ATVs and large offroad environments. ATV Offroad Fury delivers the excitement of ATV racing with high-performance two-stroke and four-stroke ATVs, 20 free-roaming race environments, and six unique events. Race authentic ATVs through six challenging events, including Cross Country Enduro, Stadium Supercross, and Freestyle Stunt. You'll speed through whole deserts, forested landscapes, and old train yards. With realistic crashes, authentic stunts, and intense competition, ATV Offroad Fury immerses players in the action-packed world of offroad racing.… Expand"}, {"name": "B-17 Flying Fortress: The Mighty 8th!", "details_link": "https://www.metacritic.com/game/pc/b-17-flying-fortress-the-mighty-8th!", "publisher": "Atari", "release_date": "Dec 13 2000", "developers": ["Wayward Simulations"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 82, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/a4500bfdcc079360cffd30e6b680e4b2-98.jpg", "descriptions": "Feel the power of really flying a B-17! See what it was like to be part of the 10-man crew on dangerous bombing missions over occupied Europe. Outstanding graphics, animations, and sounds realistically recreate every aspect of the strategic air war in WWII.  [Hasbro Interactive]"}, {"name": "EverQuest: The Scars of Velious", "details_link": "https://www.metacritic.com/game/pc/everquest-the-scars-of-velious", "publisher": "Sony Online Entertainment", "release_date": "Dec  4 2000", "developers": ["Sony Online Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 82, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/be8512ec61f511463df12ef7b19d86fe-98.jpg", "descriptions": "Do you dare explore the lost continent of Velious? Here you will find some of the most dangerous and elusive creatures to ever roam the lands of Norrath. Challenge your resolve and adventuring skills as you set foot on the icy wastes and explore a land locked in turmoil and conflict.  [Sony]"}]