[{"name": "Gundam Versus", "details_link": "https://www.metacritic.com/game/playstation-4/gundam-versus", "publisher": "Bandai Namco Games", "release_date": "Sep 29 2017", "developers": ["Bandai Namco Games"], "platforms": "PlayStation 4", "num_players": "Up to 6 ", "genres": ["Action", "Simulation", "Fighting", "Vehicle", "3D", "Combat"], "meta_score": 68, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/a017e7ed495e931aaaac127aec381726-98.jpg", "descriptions": "The world famous mobile suit Gundam series and notorious head-to-head smash hit series, Gundam Versus, is coming for the first time for home console, this time built from the ground up exclusively for the PlayStation 4 system. Battle in explosive online two-versus-two and three-versusthreeThe world famous mobile suit Gundam series and notorious head-to-head smash hit series, Gundam Versus, is coming for the first time for home console, this time built from the ground up exclusively for the PlayStation 4 system. Battle in explosive online two-versus-two and three-versusthree team battles in this all-new title built from the ground up for the PlayStation 4 system. Each playable Mobile Suit comes equipped with its own weapons systems to learn and master.\r In battle you, as a player, will be allowed to go all out with blazing and lighting fast melee action in a robust selection of offline and online game modes. New quick actions bring more technical and strategic gameplay options. Call upon striker support characters to assist you in the heat of battle. Enhance your experience by choosing between two different Burst Systems: Blaze Gear and Lightning Gear, each with their own unique fighting characteristics to enhance melee combat, augment lock-on range and more!… Expand"}, {"name": "Fossil Fighters: Champions", "details_link": "https://www.metacritic.com/game/ds/fossil-fighters-champions", "publisher": "Nintendo", "release_date": "Nov 14 2011", "developers": ["RED Entertainment", "Artdink"], "platforms": "DS", "num_players": "Up to 4 ", "genres": ["Role-Playing", "General", "General", "Trainer"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/f85f71b575d4fa26a6c50f7ed4768f75-98.jpg", "descriptions": "In this dino-tastic sequel, players get some hands-on time to hunt and clean fossils, and revive and battle Vivosaurs. A fossil park is hosting a large-scale tournament in which competitors enter Vivosaurs created from dinosaur fossils into competition. Fossil Fighters from all over theIn this dino-tastic sequel, players get some hands-on time to hunt and clean fossils, and revive and battle Vivosaurs. A fossil park is hosting a large-scale tournament in which competitors enter Vivosaurs created from dinosaur fossils into competition. Fossil Fighters from all over the world compete against one another to find out who is the best Fossil Fighter.… Expand"}, {"name": "Seven: The Days Long Gone", "details_link": "https://www.metacritic.com/game/pc/seven-the-days-long-gone", "publisher": "IMGN.PRO", "release_date": "Dec  1 2017", "developers": ["IMGN.PRO"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "General", "Action RPG", "Open-World"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/19bab9b16e791c8aa1f246e07d223149-98.jpg", "descriptions": "If there's one place that Master Thief Teriel avoids at all costs, it's the prison island of Peh. But when a daring heist takes an unexpected turn, Teriel finds himself shackled on an airship bound for the infamous island. To make matters worse, the daemon inside his head makes it very clearIf there's one place that Master Thief Teriel avoids at all costs, it's the prison island of Peh. But when a daring heist takes an unexpected turn, Teriel finds himself shackled on an airship bound for the infamous island. To make matters worse, the daemon inside his head makes it very clear that the thief will never leave unless he does exactly what he's told.\r In Seven: The Days Long Gone you play as Teriel. You must use all of your cunning and clandestine skills to escape a web of deceit and betrayal, and ultimately survive Peh.… Expand"}, {"name": "Bubble Bobble 4 Friends", "details_link": "https://www.metacritic.com/game/switch/bubble-bobble-4-friends", "publisher": "Taito Corporation", "release_date": "Nov 19 2019", "developers": ["Taito Corporation", "ININ Games"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "Platformer", "2D"], "meta_score": 68, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/c0587f7cb0e5d0c12ad01ddcda2f637a-98.jpg", "descriptions": "The classic platforming franchise Bubble Bobble is  back. Bubble Bobble 4 Friends recreates the old bubble-based challenge with co-op for up to 4 players, exclusively on Nintendo Switch."}, {"name": "Kukoos - Lost Pets", "details_link": "https://www.metacritic.com/game/switch/kukoos---lost-pets", "publisher": "Maximum Games", "release_date": "Dec  6 2022", "developers": ["Petit Fabrik"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/6a5c813651a081d2c84969ef929f020d-98.jpg", "descriptions": "This 3D platformer takes players to a new universe of limitless adventures, join the Kukoos in a corky and upbeat adventure to rescue the brainwashed pets. Enter the Kukoo Tree and its infinite doors that take you to unimaginable words of dangers and wonders.The accessible gameplay teachesThis 3D platformer takes players to a new universe of limitless adventures, join the Kukoos in a corky and upbeat adventure to rescue the brainwashed pets. Enter the Kukoo Tree and its infinite doors that take you to unimaginable words of dangers and wonders.The accessible gameplay teaches beginners to progress and uncover the mysteries story. As you play and master the mechanics the game grows with the player and challenges you with more ways to interact and think outside the box.Play as K or Kika and meet many friendly Kukoos, not so friendly Sea creatures and Join Forces with 5 uncanny Pets that will change your gameplay, inviting you to learn adapt, unleashing new powers and ways think the levels.… Expand"}, {"name": "Far Cry 6 - Pagan: Control", "details_link": "https://www.metacritic.com/game/pc/far-cry-6---pagan-control", "publisher": "Ubisoft", "release_date": "Jan 11 2022", "developers": ["Ubisoft Toronto"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action Adventure", "Open-World"], "meta_score": 68, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/4/47cfd4bed68afbb633971dce790574c8-98.jpg", "descriptions": "Set within the confines of Min's mind, this DLC blends \"intense action and storytelling\" as players explore Min's psyche and attempt to help break the self-proclaimed King of Kyrat's cycle of guilt and violence. In order to convey the trial-and-error process of growth and self-reflection,Set within the confines of Min's mind, this DLC blends \"intense action and storytelling\" as players explore Min's psyche and attempt to help break the self-proclaimed King of Kyrat's cycle of guilt and violence. In order to convey the trial-and-error process of growth and self-reflection, Pagan: Control pays tribute to the rougelite genre, meaning each death as Min sends the player back to the start of the DLC with only their accumulated knowledge and skills to help guide them through their second (and third, and fourth...) time around. Last but not least, Far Cry 4 fans may be interested to know Min's original voice actor, Troy Baker, will be returning to the Far Cry series for this performance.… Expand"}, {"name": "Arietta of Spirits", "details_link": "https://www.metacritic.com/game/switch/arietta-of-spirits", "publisher": "Red Art Games", "release_date": "Aug 20 2021", "developers": ["Third Spirit"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "genres": ["Action Adventure", "General"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/b9f0f9be2be7f444c57c00de423c3d22-98.jpg", "descriptions": "Arietta of Spirits is a charming adventure game with emotion-filled narrative, no-filler gameplay, and fast paced combat. The game tells the story of Arietta and her family, visiting their Grandmother's cabin for the first time after her passing away a year prior. However, the family tripArietta of Spirits is a charming adventure game with emotion-filled narrative, no-filler gameplay, and fast paced combat. The game tells the story of Arietta and her family, visiting their Grandmother's cabin for the first time after her passing away a year prior. However, the family trip takes an unexpected turn when Arietta meets a mysterious new friend and gains the ability to see strange spirits that inhabit the island.\r-Explore a mysterious island with lush forests, murky caverns and dark secrets\r-Beautiful retro-styled pixel graphics and inspiring original soundtrack\r-Meet fascinating characters and discover the deep lore\r-Fight a wide range of enemies in reaction based combat\r-Easy to approach game mechanics, suitable for everyone … Expand"}, {"name": "Heroki", "details_link": "https://www.metacritic.com/game/switch/heroki", "publisher": "Picomy", "release_date": "Jul 20 2018", "developers": ["Picomy"], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/2a53de254df49ddb07042b7a170cab62-98.jpg", "descriptions": "The peaceful sky village of Levantia is in danger! The dastardly Dr. N. Forchin and his accomplice, Vapor, have stolen the Emerix - a powerful amulet and all hope may be lost. Fly into a beautiful action adventure and save a whimsical world full of flight and fantasy. Master the wind to fly,The peaceful sky village of Levantia is in danger! The dastardly Dr. N. Forchin and his accomplice, Vapor, have stolen the Emerix - a powerful amulet and all hope may be lost. Fly into a beautiful action adventure and save a whimsical world full of flight and fantasy. Master the wind to fly, freefall, dash and bash your way across beautiful 3D rendered sky-islands, jungles, seas and deserts. … Expand"}, {"name": "Shiness: The Lightning Kingdom", "details_link": "https://www.metacritic.com/game/pc/shiness-the-lightning-kingdom", "publisher": "Plug In Digital", "release_date": "Apr 18 2017", "developers": ["Enigami"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/d3b6ce6de94cc4cd032be81879087b70-98.jpg", "descriptions": "Shiness is an Action-RPG developed by indie development studio Enigami, which will let you travel in a captivating universe doomed to destruction ever since the fragmentation of the planet Mahera..."}, {"name": "White Night", "details_link": "https://www.metacritic.com/game/pc/white-night", "publisher": "Activision", "release_date": "Mar  3 2015", "developers": ["OSome Studio"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/240f6881ef94fd2fa7d52576cddabeb2-98.jpg", "descriptions": "Explore the macabre past of an aging mansion in the 1930's and solve puzzles of light and shadows in this fully black & white survival horror. Players are trapped in this nightmare where darkness is a persistent threat."}, {"name": "Rogue Stormers", "details_link": "https://www.metacritic.com/game/pc/rogue-stormers", "publisher": "Black Forest Games", "release_date": "Jul 17 2014", "developers": ["Black Forest Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/efe4b02d3dc3bca93db74458b1d93d9a-98.jpg", "descriptions": "Rogue Stormers combines run 'n' gun mayhem with roguelike and RPG elements, crazy 3D graphics and team play for one to 4 players, online and offline."}, {"name": "Buccaneer: The Pursuit of Infamy", "details_link": "https://www.metacritic.com/game/pc/buccaneer-the-pursuit-of-infamy", "publisher": "Blitz Games Studios", "release_date": "Dec  5 2008", "developers": ["Stickmen Studios"], "platforms": "PC", "genres": ["Strategy", "General", "General"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/46e37ac8f9d38e37b1d877f10c85714c-98.jpg", "descriptions": "Set sail across the Caribbean with Buccaneer. Will you become the world's greatest and most feared pirate captain, or will you let your infamy ebb away and risk mutiny at the hands of your bloodthirsty crew? Swashbuckling single player campaign across 50+ missions. Compete against up to 18Set sail across the Caribbean with Buccaneer. Will you become the world's greatest and most feared pirate captain, or will you let your infamy ebb away and risk mutiny at the hands of your bloodthirsty crew? Swashbuckling single player campaign across 50+ missions. Compete against up to 18 other cut-throats in team-based multiplayer. Captain one of 26 upgradeable pirate vessels. Explore the beauty of the Caribbean, with stunning shader technology. Instantly accessible arcade-like controls. [Steam]… Expand"}, {"name": "World Tour Soccer 2005", "details_link": "https://www.metacritic.com/game/playstation-2/world-tour-soccer-2005", "publisher": "SCEA", "release_date": "Apr 14 2004", "developers": ["SCEE London Studio"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/cdbc479ee3680f6a431acb035404f592-98.jpg", "descriptions": "Play as or against the world's best soccer stars with more than 18,000 players from 900 international and club teams from 23 leagues and 31 different divisions. Pull off a variety of classic soccer moves like the step-over and shimmy while trying to elude the stingy defense in pursuit ofPlay as or against the world's best soccer stars with more than 18,000 players from 900 international and club teams from 23 leagues and 31 different divisions. Pull off a variety of classic soccer moves like the step-over and shimmy while trying to elude the stingy defense in pursuit of that game-winning GOAL. Includes multiple modes of play including exhibition, season, career, challenge and international tournaments.… Expand"}, {"name": "NASCAR Thunder 2003", "details_link": "https://www.metacritic.com/game/pc/nascar-thunder-2003", "publisher": "Electronic Arts", "release_date": "Oct 16 2002", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-16 ", "genres": ["Driving", "Racing", "Simulation", "Stock Car", "Stock Car", "Automobile"], "meta_score": 68, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/cf513f4dc1bf2afd471d15ef8dbb7c07-98.jpg", "descriptions": "NASCAR Thunder 2003 features an all-new game engine with more realistic vehicle dynamics, including tire grip and wear patterns, handling and suspension behavior, and collision physics; fun entry-level control with progression to deeper \"simulation.\" The Career mode now includes 20NASCAR Thunder 2003 features an all-new game engine with more realistic vehicle dynamics, including tire grip and wear patterns, handling and suspension behavior, and collision physics; fun entry-level control with progression to deeper \"simulation.\" The Career mode now includes 20 successive seasons in which you will need to manage four major components while building a racing car. Compete for top sponsors, the best crewmembers, and the latest racing technology. [EA Sports]… Expand"}, {"name": "Dracula: The Last Sanctuary", "details_link": "https://www.metacritic.com/game/pc/dracula-the-last-sanctuary", "publisher": "DreamCatcher Interactive", "release_date": "Feb 11 2001", "developers": ["Canal+ Multimedia"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "First-Person", "Point-and-Click", "Modern", "Fantasy", "Modern"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/ef607051cb4745eb47742e04609101cf-98.jpg", "descriptions": "Immerse yourself in a hauntingly beautiful, incredibly realistic 3-D world of thrills and suspense. Journey through eerie atmospheric environments while attempting to solve the numerous puzzles and riddles that await you in this story-driven adventure.  [DreamCatcher Interactive]"}, {"name": "Crash Bash", "details_link": "https://www.metacritic.com/game/playstation/crash-bash", "publisher": "SCEA", "release_date": "Nov  6 2000", "developers": ["Eurocom Entertainment Software"], "platforms": "PlayStation", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/038b12153595546829e53ba0cf899945-98.jpg", "descriptions": "Crash and his friends are back in a knockdown, drag-out arena rumble.  Get ready to ride, race, jump, throw, and battle it out to the finish in frantic, head-to-head battles, and heart-pumping chases.  Choose your favorite character, including Crash, Coco, Dr. Neo Cortex, and new baddie RillCrash and his friends are back in a knockdown, drag-out arena rumble.  Get ready to ride, race, jump, throw, and battle it out to the finish in frantic, head-to-head battles, and heart-pumping chases.  Choose your favorite character, including Crash, Coco, Dr. Neo Cortex, and new baddie Rill Roo, and race for points in more than 30 competitive events.  With a Multitap, you can race up to three of your friends and show who's the top bandicoot.  It's a good old-fashioned bandicoot brawl.… Expand"}, {"name": "Orcs & Elves", "details_link": "https://www.metacritic.com/game/ds/orcs-elves", "publisher": "Electronic Arts", "release_date": "Nov 13 2007", "developers": ["id Software", "Fountainhead Entertainment"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/3b45db54a211543f90a4ad8ccc138aa0-98.jpg", "descriptions": "id Software has crafted an entirely new version of Orcs & Elves that utilizes the Nintendo DS unique technology platform. Orcs & Elves features higher graphical fidelity, more levels, items and monsters as players explore a massive Dwarven kingdom riddled with ancient treasures and fierceid Software has crafted an entirely new version of Orcs & Elves that utilizes the Nintendo DS unique technology platform. Orcs & Elves features higher graphical fidelity, more levels, items and monsters as players explore a massive Dwarven kingdom riddled with ancient treasures and fierce enemies. The game features hybrid gameplay, combining the best of first-person action and fast-paced tactical RPG gameplay. [Electronic Arts]… Expand"}, {"name": "Spider-Man: Web of Shadows", "details_link": "https://www.metacritic.com/game/xbox-360/spider-man-web-of-shadows", "publisher": "Activision", "release_date": "Oct 21 2008", "developers": ["Treyarch", "Shaba Games"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General", "Beat-'Em-Up", "Open-World", "2D"], "meta_score": 68, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/373eec85446a4b5e92818c9f5b38deaf-98.jpg", "descriptions": "New York City has been invaded and only Spider-Man can save it. The fate of New York is in your hands...Take Control. Spider-Man: Web of Shadows gives you an unprecedented level of gameplay choice, including, for the first time, control over the game's direction and outcome. Choose howNew York City has been invaded and only Spider-Man can save it. The fate of New York is in your hands...Take Control. Spider-Man: Web of Shadows gives you an unprecedented level of gameplay choice, including, for the first time, control over the game's direction and outcome. Choose how Spider-Man fights, which powers to upgrade, who in the Marvel universe to fight with or against, and the fate of New York City itself. Choose wisely. [Activision]… Expand"}, {"name": "NIER", "details_link": "https://www.metacritic.com/game/playstation-3/nier", "publisher": "Square Enix", "release_date": "Apr 27 2010", "developers": ["Cavia Inc."], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 68, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/8d719450ec26104606166ce5c5f61d48-98.jpg", "descriptions": "Nothing is as it seems in Square Enix's latest action adventure game, set in a crumbling world plagued by disease and dark, unrecognizable creatures. Players assume the role of the unyielding protagonist, NIER, resolute in his quest to discover a cure for his daughter, who is infected withNothing is as it seems in Square Enix's latest action adventure game, set in a crumbling world plagued by disease and dark, unrecognizable creatures. Players assume the role of the unyielding protagonist, NIER, resolute in his quest to discover a cure for his daughter, who is infected with the Black Scrawl virus. With powerful allies and a mysterious book, NIER encounters things that will confound even the mightiest of warriors. [Square Enix]… Expand"}, {"name": "Keepsake", "details_link": "https://www.metacritic.com/game/pc/keepsake", "publisher": "The Adventure Company", "release_date": "Mar 31 2006", "developers": ["Wicked Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Third-Person", "Point-and-Click", "Fantasy", "Fantasy"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/231d565c9a11730623856e59b1a4d673-98.jpg", "descriptions": "In an enchanted world of mystery, beauty and boundless imagination, begins the epic quest of Lydia, a young girl embarking on a journey of enlightenment that takes her to the gates of Dragonvale Academy where she will become a new apprentice. Upon her arrival, something is terribly amiss.In an enchanted world of mystery, beauty and boundless imagination, begins the epic quest of Lydia, a young girl embarking on a journey of enlightenment that takes her to the gates of Dragonvale Academy where she will become a new apprentice. Upon her arrival, something is terribly amiss. The campus is deserted and even Celeste, Lydia's best friend who is a scholar at the Academy, is no where to be found! While exploring, Lydia stumbles across a most disturbing object... a doll she gave Celeste as a keepsake. It is now clear to Lydia that treachery and sorrow lurks in the halls of the Academy. Accompanied by a charmed dragon named Zak, Lydia must quickly overcome trials in The Chamber of Passage, understand the secrets of the runes and glyphs, and master the forces of magic to uncover the mystery behind Celeste's disappearance, Dragonvale Academy and the beloved keepsake. [Adventure Company]… Expand"}, {"name": "Project Nimbus: Complete Edition", "details_link": "https://www.metacritic.com/game/switch/project-nimbus-complete-edition", "publisher": "GameTomo", "release_date": "May 16 2019", "developers": ["GameCrafterTeam"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/a1bcdd23ee17a574682bf9c848ae87a9-98.jpg", "descriptions": "Project Nimbus is a high-speed mech action game set on a devastated future Earth, where the player maneuvers a weaponized humanoid general-purpose Battle Frame. Engage enemy units with various weapons and defeat huge bosses and unique ace pilots. Fly the skies with 360 degrees of freedom,Project Nimbus is a high-speed mech action game set on a devastated future Earth, where the player maneuvers a weaponized humanoid general-purpose Battle Frame. Engage enemy units with various weapons and defeat huge bosses and unique ace pilots. Fly the skies with 360 degrees of freedom, and battle enemies with a variety of weapons and techniques, from smart missiles to the blade charge.… Expand"}, {"name": "The Hong Kong Massacre", "details_link": "https://www.metacritic.com/game/pc/the-hong-kong-massacre", "publisher": "Captain Rouge", "release_date": "Jan 22 2019", "developers": ["VRESKI"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 68, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/58512af3d1acb49c89d258c66e0b7bd5-98.jpg", "descriptions": "Blast your way through the streets of Hong Kong in a fast-paced, top-down shooter. Inspired by classic action movies, The Hong Kong Massacre places you at the center of a hard-boiled revenge story, filled with brutal, cinematic shootouts and vivid underworld locations."}, {"name": "Remothered: Tormented Fathers", "details_link": "https://www.metacritic.com/game/xbox-one/remothered-tormented-fathers", "publisher": "Stormind Games", "release_date": "Jul 25 2018", "developers": ["Stormind Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/0f976bd21b4806d6e2f484a1306aab06-98.jpg", "descriptions": "Remothered: Tormented Fathers is the pure and realistic survival horror videogame. A game by Darril Arts, directed by Chris Darril, developed by Stormind Games. Psychology plays a huge role within the game: heroes and enemies are atypical and the line between good and evil is blurred. TheRemothered: Tormented Fathers is the pure and realistic survival horror videogame. A game by Darril Arts, directed by Chris Darril, developed by Stormind Games. Psychology plays a huge role within the game: heroes and enemies are atypical and the line between good and evil is blurred. The plot is rich of unpredictable twists, but it is touching at the same time. [Microsoft]… Expand"}, {"name": "de Blob 2", "details_link": "https://www.metacritic.com/game/playstation-4/de-blob-2", "publisher": "THQ Nordic", "release_date": "Feb 27 2018", "developers": ["Blue Tongue Entertainment"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 68, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/22579653386ca00bb4b7e7b7b145c0bc-98.jpg", "descriptions": "In de Blob 2 Comrade Black and the Inkies are back with a whole new plot to rid the world of color. With all new help from Papa Blanc and his flock of followers the Blancs, Blob and his friends will have their work cut out for them bringing color back to the citizens of Prisma City. Set offIn de Blob 2 Comrade Black and the Inkies are back with a whole new plot to rid the world of color. With all new help from Papa Blanc and his flock of followers the Blancs, Blob and his friends will have their work cut out for them bringing color back to the citizens of Prisma City. Set off on an action-packed color adventure where custom paints, patterns and music bring the world to life. de Blob 2 is a creative evolution driven by your imagination!… Expand"}, {"name": "Nom Nom Galaxy", "details_link": "https://www.metacritic.com/game/pc/nom-nom-galaxy", "publisher": "Q-Games", "release_date": "Aug  3 2014", "developers": ["Q-Games"], "platforms": ["PlayStation 4", "PC"], "genres": ["Action", "General"], "meta_score": 68, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/b08dac7ab9b79f0ee087b92a51139cfe-98.jpg", "descriptions": "Nom Nom Galaxy is a sandbox-styled mix of platforming, base building, tower defense, and good old fashioned monster-stomping! You'll create huge factory-bases where you'll experiment with tons of ingredients, make hundreds of types of soups to feed the galaxy, and rise in the ranks of theNom Nom Galaxy is a sandbox-styled mix of platforming, base building, tower defense, and good old fashioned monster-stomping! You'll create huge factory-bases where you'll experiment with tons of ingredients, make hundreds of types of soups to feed the galaxy, and rise in the ranks of the Soup Co.! Each planet will have it's own challenges, from poisons gas to killer tomatoes. Only the most adept of Soup Meisters will succeed.… Expand"}, {"name": "Chronos Twins DX", "details_link": "https://www.metacritic.com/game/wii/chronos-twins-dx", "publisher": "EnjoyUp Games", "release_date": "Jan 11 2010", "developers": ["EnjoyUp Games"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Action", "Action Adventure", "Platformer", "General", "Platformer", "2D", "2D"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/242d04dad9fe29e3514985c6af704d97-98.jpg", "descriptions": "A giant cyclone has sucked up thousands of fish from the oceans! It’s an ecological disaster! Tanks of water are immediately assembled throughout the world, so that all the fish can be returned to the oceans. As the sea creatures start falling back to  Earth, someone must make sure they landA giant cyclone has sucked up thousands of fish from the oceans! It’s an ecological disaster! Tanks of water are immediately assembled throughout the world, so that all the fish can be returned to the oceans. As the sea creatures start falling back to  Earth, someone must make sure they land safely and quickly since they cannot survive for long out of water.… Expand"}, {"name": "Sinking Island", "details_link": "https://www.metacritic.com/game/pc/sinking-island", "publisher": "Encore Software, Inc.", "release_date": "Aug 21 2008", "developers": ["White Birds Productions"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/13f86ed1fcdd80b1a62263ed71feb2ef-98.jpg", "descriptions": "The new game by Benoît Sokal: the master of point & click adventure returns to the universe that earned him a reputation as a major comic book author: Detective stories. Sumptuous décors: from the idyllic beaches to the exaggerated proportions of this extravagant tower, discover a richThe new game by Benoît Sokal: the master of point & click adventure returns to the universe that earned him a reputation as a major comic book author: Detective stories. Sumptuous décors: from the idyllic beaches to the exaggerated proportions of this extravagant tower, discover a rich environment and great graphics. A heart-racing scenario: hate, resentment, treason and intrigue on a tropical island. A Noir novel in a video game: the game is divided into ten simple questions that you have to answer one after the other to make headway in the investigation. A full and accessible enquiry solving system: thanks to your personal assistant, you can confront the different suspects, compare their statements to evidence and move on in the enquiry by using your sense of deduction. A race against time: as a storm rages, the tower is progressively sinking into the water... You only have 3 days to clear up this affair before all clues and the guilty party disappear forever. 2 game modes: in expert mode, it’s a race against time and you won’t have a second to lose! In adventure mode, you can go through each place at your own pace, enjoying the wonderful décors. [Microids]… Expand"}, {"name": "Blitz: The League II", "details_link": "https://www.metacritic.com/game/xbox-360/blitz-the-league-ii", "publisher": "Midway", "release_date": "Oct 13 2008", "developers": ["Midway"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/509a353d68066d2486db49314eb4556d-98.jpg", "descriptions": "Blitz: The League II continues the franchise legacy as the ultimate alternative to the watered-down, licensed competition. In addition to an all-new story mode penned by Peter Egan (ESPN's Playmakers), Blitz: The League II features include: Precision-Aim Tackles, player-controlled touchdownBlitz: The League II continues the franchise legacy as the ultimate alternative to the watered-down, licensed competition. In addition to an all-new story mode penned by Peter Egan (ESPN's Playmakers), Blitz: The League II features include: Precision-Aim Tackles, player-controlled touchdown celebrations, an enhanced on-the-field Clash Mode, online multiplayer capabilities, expanded rosters with all-new personalities, and the return of a cornerstone of the Blitz franchise...Late Hits! Football legend Lawrence Taylor returns as the game's cover-athlete and star linebacker for the New York Nightmare, Quentin Sands, along with a star-studded supporting cast. [Midway]… Expand"}, {"name": "Star Wars Battlefront II", "details_link": "https://www.metacritic.com/game/playstation-4/star-wars-battlefront-ii", "publisher": "Electronic Arts", "release_date": "Nov 14 2017", "developers": ["EA DICE"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 40 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 68, "users_score": 1.7, "image": "https://static.metacritic.com/images/products/games/9/9d53c1db595dbb57fb7005b7c4fd18fc-98.jpg", "descriptions": "Star Wars Battlefront II allows players to experience the untold story of an Imperial elite special forces soldier in an all-new single player campaign. In epic multiplayer battles, players pilot a First Order TIE fighter through intense dogfights in space, and play as ground troopers orStar Wars Battlefront II allows players to experience the untold story of an Imperial elite special forces soldier in an all-new single player campaign. In epic multiplayer battles, players pilot a First Order TIE fighter through intense dogfights in space, and play as ground troopers or iconic heroes and villains, such as Yoda and Darth Maul, across all three Star Wars eras. Featuring new characters created by Motive in close partnership with the story group at Lucasfilm, the Star Wars Battlefront II single player campaign delivers a new story to the Star Wars universe. Taking place in the 30 years between the destruction of Death Star II and through the rise of the First Order, the single player story introduces Iden Versio, the leader of Inferno Squad, an elite special forces unit of the Galactic Empire, who are equally lethal on the ground and in space. In addition to Iden, players also encounter and play as other iconic Star Wars heroes and villains like Luke Skywalker and Kylo Ren during the campaign. [Electronic Arts]… Expand"}, {"name": "The Chronicles of Narnia: The Lion, The Witch and The Wardrobe", "details_link": "https://www.metacritic.com/game/playstation-2/the-chronicles-of-narnia-the-lion-the-witch-and-the-wardrobe", "publisher": "Buena Vista Games", "release_date": "Nov 14 2005", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 68, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/3e6ff5676268341b7984d837885efaf4-98.jpg", "descriptions": "The Chronicles of Narnia: The Lion, The Witch and The Wardrobe is an action adventure based on the Disney and Walden Media film capturing the book series from author C.S. Lewis. Players enter the world of Narnia, a land frozen in eternal winter by the evil powers of the malevolent and evilThe Chronicles of Narnia: The Lion, The Witch and The Wardrobe is an action adventure based on the Disney and Walden Media film capturing the book series from author C.S. Lewis. Players enter the world of Narnia, a land frozen in eternal winter by the evil powers of the malevolent and evil White Witch. In order to end this frigid captivity and free his people, the mighty lion Aslan, true ruler of Narnia, invokes an ancient prophecy. It will become the destiny of four young siblings from our world: Peter, Susan, Edmund and Lucy Pevensie to work together and use their unique combat skills, weaponry and abilities to defeat the Witch and her armies and save Narnia. These four unlikely heroes must battle the evil forces of the White Witch by waging war against a vast variety of creatures, including Centaurs, Minotaurs, Minoboars, Cyclops, Werewolves, Wraiths, Ankleslicers, Wolves, Satyrs, Boggles and more. Battle the evil forces of the White Witch by waging war against a huge variety of creatures, including Centaurs, Minotaurs, Minoboars, Cyclops, Werewolves, Wraiths, Ankleslicers, Wolves, Satyrs, Boggles and more. Utilize the unique combat skills, weaponry and special moves of each character to fight and fend off hordes of dark mythical beasts, or solve intricate puzzles and progress through the adventure. Two-player action featuring all four characters. [Disney Interactive]… Expand"}, {"name": "Kill la Kill: IF", "details_link": "https://www.metacritic.com/game/playstation-4/kill-la-kill-if", "publisher": "Arc System Works", "release_date": "Jul 26 2019", "developers": ["Studio TRIGGER", "Aplus"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "General", "Action", "Fighting", "3D"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/2b1f0d0cc5185a4a953ee52e745a239b-98.jpg", "descriptions": "You control Satsuki Kiryuin as the main\rprotagonist of this game, and proceed\ralong with the story while battling against\r\nvarious characters. All scenarios are\r\ncompletely new and fully\r\nsupervised under the watchful eyes of\r\nthe original scenario-writer,\r\nKazuki Nakashima. You will beYou control Satsuki Kiryuin as the main\rprotagonist of this game, and proceed\ralong with the story while battling against\rvarious characters. All scenarios are\rcompletely new and fully\rsupervised under the watchful eyes of\rthe original scenario-writer,\rKazuki Nakashima. You will be experiencing\rthe story unfold from the perspective of\rSatsuki Kiryuin, the rival of the original\rseries' protagonist Ryuko.… Expand"}, {"name": "Strange Brigade", "details_link": "https://www.metacritic.com/game/pc/strange-brigade", "publisher": "Rebellion", "release_date": "Aug 28 2018", "developers": ["Rebellion"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/0fe49350d24a089094758768f8d58d87-98.jpg", "descriptions": "Egypt, the 1930's. Erased from ancient history and buried in a nameless tomb for 4,000 years, Seteki the Witch Queen has risen once again. Only one troop of daring heroes can stand against the fearsome power of Seteki and her army of mummified monstrosities: The Strange Brigade!ExploreEgypt, the 1930's. Erased from ancient history and buried in a nameless tomb for 4,000 years, Seteki the Witch Queen has risen once again. Only one troop of daring heroes can stand against the fearsome power of Seteki and her army of mummified monstrosities: The Strange Brigade!Explore remarkable ruins, solve perilous puzzles and uncover tantalising treasure while blasting your way through an array of undead enemies in thrilling third-person action that's certain to bring out your inner adventurer!… Expand"}, {"name": "Koihime Enbu", "details_link": "https://www.metacritic.com/game/pc/koihime-enbu", "publisher": "Degica", "release_date": "May 19 2016", "developers": ["M2", "UNKNOWN GAMES"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Fighting", "2D"], "meta_score": 68, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/dd1c23dd63faf2f6242d9b6f4d6d0209-98.jpg", "descriptions": "Originally an arcade fighting game, Koihime Enbu features fast combat, tight controls, clean visuals, and 13 different playable characters."}, {"name": "The LEGO Movie Videogame", "details_link": "https://www.metacritic.com/game/pc/the-lego-movie-videogame", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb  7 2014", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/2820bcc3d90bbd22e6bd39bd70b72c2b-98.jpg", "descriptions": "In a scenario drawn from the film, The LEGO Movie Videogame puts LEGO kids into the role of Emmet, an ordinary, rules-following, perfectly average LEGO minifigure who is mistakenly identified as the most extraordinary person and the key to saving the world. Players guide him as he is draftedIn a scenario drawn from the film, The LEGO Movie Videogame puts LEGO kids into the role of Emmet, an ordinary, rules-following, perfectly average LEGO minifigure who is mistakenly identified as the most extraordinary person and the key to saving the world. Players guide him as he is drafted into a fellowship of strangers on an epic quest to stop an evil tyrant, a journey for which Emmet is hopelessly and hilariously underprepared.… Expand"}, {"name": "Def Jam: Icon", "details_link": "https://www.metacritic.com/game/playstation-3/def-jam-icon", "publisher": "EA Games", "release_date": "Mar  6 2007", "developers": ["EA Chicago"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 68, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/0/ec9857eb55121f80d26c391cff07687a-98.jpg", "descriptions": "Infusing hip-hop music, culture and lifestyle into the gameplay, EA Chicago and Def Jam Interactive push the boundaries of game development bringing unique and innovative content to the next generation of gaming. Music is the cornerstone of hip-hop culture so EA wanted to incorporate musicInfusing hip-hop music, culture and lifestyle into the gameplay, EA Chicago and Def Jam Interactive push the boundaries of game development bringing unique and innovative content to the next generation of gaming. Music is the cornerstone of hip-hop culture so EA wanted to incorporate music and rhythm into the actual gameplay mechanics. EA Chicago delivers star-stunning action and bone breaking beats as players live out the life of a hip hop mogul, going from rags to riches. Incorporating hip-hop culture into every aspect of the game, DEF JAM: ICON delivers the intensity of a no-holds-barred street fight but with style and rhythm. Music affects how players fight in each venue and environmental interactions and hazards become a key strategy to staying alive. The game's unique fighting gameplay controls introduce a new way for gamers to fight as they assume the role of top celebrity characters such as Ludacris, T.I. and Big Boi. Innovative controls give better feedback to players so they feel like they're actually throwing the combat moves. Gamers can now fight with the style and flash of the superstar personalities. [Electronic Arts]… Expand"}, {"name": "MotoGP 17", "details_link": "https://www.metacritic.com/game/playstation-4/motogp-17", "publisher": "Koch Media", "release_date": "Jul 11 2017", "developers": ["Koch Media", "Milestone S.r.l"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 68, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/6/59d840ab3bf4ce38e821a2d184548a92-98.jpg", "descriptions": "Prepare yourself for the adrenaline of the 2017 MotoGP. Enjoy all the bikes, teams and tracks of the official Championship. Try the new Managerial Career mode and put yourself in the shoes of a team manager, trying to make the right choices both on the track and off it."}, {"name": "Battleborn", "details_link": "https://www.metacritic.com/game/playstation-4/battleborn", "publisher": "2K Games", "release_date": "May  3 2016", "developers": ["Gearbox Software"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Sci-Fi", "Action", "Shooter", "First-Person", "Tactical", "Arcade"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/81539a463d41cb246e952fbe16f42af0-98.jpg", "descriptions": "Battleborn is a next-gen hero-shooter brought to you by the creators of the award-winning and best-selling Borderlands franchise. In Battleborn’s distant future, the only hope for the last star in a dying universe is a new breed of warriors, who must put aside their differences to drive backBattleborn is a next-gen hero-shooter brought to you by the creators of the award-winning and best-selling Borderlands franchise. In Battleborn’s distant future, the only hope for the last star in a dying universe is a new breed of warriors, who must put aside their differences to drive back an unstoppable menace. Choose from a myriad of powerful heroes and fight together alongside your friends in an intense co-operative campaign, or battle against them in fast-paced competitive multiplayer matches.… Expand"}, {"name": "60 Parsecs!", "details_link": "https://www.metacritic.com/game/pc/60-parsecs!", "publisher": "Robot Gentleman", "release_date": "Sep 18 2018", "developers": ["Robot Gentleman"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/a12dd8452bde0fbc262553a132fb8b64-98.jpg", "descriptions": "60 Parsecs! is an Atomic Space Age adventure of scavenge and survival. Keep your crew alive and ready for action. Make difficult choices, face soup shortages and other horrors of outer space. And maybe reach your destination. Or not."}, {"name": "Marvel's Guardians of the Galaxy - Episode 5: Don't Stop Believin'", "details_link": "https://www.metacritic.com/game/pc/marvels-guardians-of-the-galaxy---episode-5-dont-stop-believin", "publisher": "Telltale Games", "release_date": "Nov  7 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Adventure", "3D", "Third-Person"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/a4e35c3c64bd8553ecd539a858cde4c3-98.jpg", "descriptions": "In the aftermath of an unbearable sacrifice, the Guardians finally fracture. With her opposition in shambles, Hala renews her campaign of death and devastation, carving a path of indiscriminate destruction en route to Knowhere."}, {"name": "Masochisia", "details_link": "https://www.metacritic.com/game/pc/masochisia", "publisher": "Oldblood", "release_date": "Oct  9 2015", "developers": ["Oldblood"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/4902f0a9c04a173114146411386ae41a-98.jpg", "descriptions": "A young man discovers through a series of hallucinations that he will grow up to become a violent psychopath. How will he respond to these revelations? Can he change his fate? Can you even... change fate?"}, {"name": "MySims Racing", "details_link": "https://www.metacritic.com/game/wii/mysims-racing", "publisher": "EA Games", "release_date": "Jun 12 2009", "developers": ["EA Games"], "platforms": "Wii", "num_players": "4  Online", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart", "Automobile"], "meta_score": 68, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/96b66d39a6599601baa972a82c04532d-98.jpg", "descriptions": "Race to the finish line in MySims Racing! Face a variety of tricky MySim opponents on a huge variety of exotic tracks! Take on up to three friends in intense multiplayer racing. During your race, find awesome power-ups such as the heat-seeking jack-o-lantern pumpkin or a bubble dropper thatRace to the finish line in MySims Racing! Face a variety of tricky MySim opponents on a huge variety of exotic tracks! Take on up to three friends in intense multiplayer racing. During your race, find awesome power-ups such as the heat-seeking jack-o-lantern pumpkin or a bubble dropper that can help you wreck the competition. There are nearly endless customization options so that your car reflects your high-gear personality. You can swap bodies, change paint jobs and add tons of accessories. Not only can you change the look of your car, you can also improve power, acceleration and handling by mixing and matching engines, suspension and tires. [Electronic Arts]… Expand"}, {"name": "Brink", "details_link": "https://www.metacritic.com/game/xbox-360/brink", "publisher": "Bethesda Softworks", "release_date": "May 10 2011", "developers": ["Splash Damage"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 68, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/764cb65c51b8e922022767324213877c-98.jpg", "descriptions": "Brink is an immersive shooter that blends single-player, co-op, and multiplayer gameplay into one seamless experience, allowing you to develop your character across all modes of play. You decide the role you want to assume in the world of Brink as you fight to save yourself and mankind’sBrink is an immersive shooter that blends single-player, co-op, and multiplayer gameplay into one seamless experience, allowing you to develop your character across all modes of play. You decide the role you want to assume in the world of Brink as you fight to save yourself and mankind’s last refuge for humanity. Brink offers a compelling mix of dynamic battlefields, extensive customization options, and an innovative control system that will keep you coming back for more. A man-made floating city called the Ark, made up of hundreds of separate floating islands, is on the brink of all-out civil war. Originally built as an experimental self-sufficient and 100% \"green\" habitat, the reported rapid rise of the Earth's oceans has forced the Ark to become a refuge for humanity.  Crammed with the original Ark founders, their descendants, as well as tens of thousands of refugees, the Ark exists in total isolation from the rest of the world. With 25 years of social unrest, the inhabitants of the Ark have reached their breaking point. It's up to you to decide the future of the Ark and the human race. Blurring the Lines Between Offline and Online - Advance your character’s development across every gameplay mode: single player, co-op, and multiplayer. Gain experience points that you can spend on customizing and upgrading your skills and abilities, designing an entirely unique look and feel for your character. Brink uses the familiar shooter controls that you're used to, without frustrating, artificial constraints and takes advantage of a new feature: the SMART button.  When you press the SMART button, the game dynamically evaluates where you’re trying to get to, and makes it happen. No need to perfectly time a jump or vault, the game knows what you want to do. Objectives, communications, mission generation, and inventory selection are all dynamically generated based on your role, your status, your location, your squad-mates, and the status of the battle in all gameplay modes.  You'll always know exactly where to go, what to do when you get there, and what your reward will be for success. Brink’s proprietary technology, Virtual Texturing, breaks new ground on current-gen consoles and PCs with an even greater focus on highly detailed characters, realistic environments, lighting, effects, and atmospherics. This competitive lead on the squad-combat genre helps thrust players into the gritty reality of the Ark's epic secluded arcology. [Bethesda Softworks]… Expand"}, {"name": "Exit the Gungeon", "details_link": "https://www.metacritic.com/game/switch/exit-the-gungeon", "publisher": "Devolver Digital", "release_date": "Mar 17 2020", "developers": ["Dodge Roll"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/18d3ff6f45e787dba51c9a9db1f9fa1e-98.jpg", "descriptions": "Exit the Gungeon is a bullet hell dungeon climber immediately following the adventures of the misfit ‘Gungeoneers’ and their journey for personal absolution in Enter the Gungeon. The Gungeon has become a paradox and is collapsing! Armed with an ever-changing weapon, an insatiable need toExit the Gungeon is a bullet hell dungeon climber immediately following the adventures of the misfit ‘Gungeoneers’ and their journey for personal absolution in Enter the Gungeon. The Gungeon has become a paradox and is collapsing! Armed with an ever-changing weapon, an insatiable need to loot, and the trusty dodge roll, each of our heroes must ascend and escape via their own unique route of increasingly perilous elevators. Battle against the last and most bitter of the Gundead at a frantic pace, slowing down just long enough to chat with some familiar faces… and a few new ones. Shifting rooms, enemies, bosses, bizarre weapons and items all combine to ensure that no two attempts to Exit the Gungeon are the same.… Expand"}, {"name": "Vanguard: Saga of Heroes", "details_link": "https://www.metacritic.com/game/pc/vanguard-saga-of-heroes", "publisher": "Sony Online Entertainment", "release_date": "Jan 30 2007", "developers": ["Sigil Games Online"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/78171207b10ac2221cb72e202aa32a72-98.jpg", "descriptions": "Vanguard: Saga of Heroes will be the premier third generation massively multiplayer RPG. A vast, seamless, immersive virtual world filled with elements of familiar High Fantasy, including traditional themes and more, all depicted using cutting-edge graphics technology. Sigil's expertise andVanguard: Saga of Heroes will be the premier third generation massively multiplayer RPG. A vast, seamless, immersive virtual world filled with elements of familiar High Fantasy, including traditional themes and more, all depicted using cutting-edge graphics technology. Sigil's expertise and experience in the field will bring groundbreaking static and dynamic content to the genre. Vanguard will build upon the successes and strengths of earlier MMOGs to improve popular game mechanics and features, but also address these pioneering games' mistakes and deficiencies. Vanguard will focus heavily on interdependence, challenge, and reward, while simultaneously addressing tedious and annoying issues, including camping, excessive downtime and more. [Sigil Games]… Expand"}, {"name": "Outcast: Second Contact", "details_link": "https://www.metacritic.com/game/pc/outcast-second-contact", "publisher": "Bigben Interactive", "release_date": "Nov 14 2017", "developers": ["Appeal", "Bigben Interactive", "Bigben Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Open-World"], "meta_score": 68, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/5b7a21053349eaba7a359753cf985a22-98.jpg", "descriptions": "Outcast: Second Contact is an open world action-adventure game taking the player to an extra-terrestrial planet as dangerous as it is beautiful. You take the role of Cutter Slade, an elite soldier sent on a mission to Adelphi, home of an ancient and advanced alien civilisation. Your choicesOutcast: Second Contact is an open world action-adventure game taking the player to an extra-terrestrial planet as dangerous as it is beautiful. You take the role of Cutter Slade, an elite soldier sent on a mission to Adelphi, home of an ancient and advanced alien civilisation. Your choices and actions will determine humanity's survival.Outcast: Second Contact is the complete remaster of the cult game Outcast. The first open, 3D world in the history of video games and a true pioneer in the action-adventure genre -- the original game won over 100 awards including adventure game of the year!… Expand"}, {"name": "Valley", "details_link": "https://www.metacritic.com/game/xbox-one/valley", "publisher": "Blue Isle Studios", "release_date": "Aug 23 2016", "developers": ["Blue Isle Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action Adventure", "Open-World"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/6fe6ea696da84ba20ac1cb17f9cb762e-98.jpg", "descriptions": "Explore the vast and beautiful game world of Valley using the power of the L.E.A.F. SUIT: a fierce exoskeleton that grants exceptional speed and agility along with the phenomenal ability to manipulate the life and death of all living things."}, {"name": "Rock of Ages", "details_link": "https://www.metacritic.com/game/playstation-3/rock-of-ages", "publisher": "Atlus", "release_date": "May 15 2012", "developers": ["ACE Team"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "General", "General"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/87cec6627ef47b77b7ca4467db3a8f4e-98.jpg", "descriptions": "Rock of Ages is a combination of deep strategy and rock-rolling action, with art and music throughout history."}, {"name": "Dr. Sudoku", "details_link": "https://www.metacritic.com/game/game-boy-advance/dr-sudoku", "publisher": "Mastiff", "release_date": "May  3 2006", "developers": ["Success"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Logic"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/fa680ed0565c1a388693f01bab15be2c-98.jpg", "descriptions": "Sudoku looks like a math problem, but it's not. The rules are simple: start with a grid consisting of nine three-by-three squares in which some of the numbers are already supplied. Fill in the blank squares so that each column, row, and three-by-three grid contains a number from 1 to 9 withSudoku looks like a math problem, but it's not. The rules are simple: start with a grid consisting of nine three-by-three squares in which some of the numbers are already supplied. Fill in the blank squares so that each column, row, and three-by-three grid contains a number from 1 to 9 with none repeated. The game features hundreds of puzzle problems, a tutorial mode, help for those moments when you really are stuck, the ability to 'pencil in' possible solutions, and a puzzle problem creation mode.… Expand"}, {"name": "Somerville", "details_link": "https://www.metacritic.com/game/xbox-series-x/somerville", "publisher": "Xbox Game Studios", "release_date": "Nov 15 2022", "developers": ["Jumpship"], "platforms": ["PC", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Third-Person", "3D", "Action Adventure", "General"], "meta_score": 68, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/4/4ad2d86cd9512e697d4586453388d27d-98.jpg", "descriptions": "Jumpship’s debut title immersse players in a hand-crafted narrative set across a vivid and rural landscape. Set in the wake of a catastrophe and grounded in the intimate repercussions of large-scale conflict, players navigate through perilous terrain as they unravel the mysteries of Earth’sJumpship’s debut title immersse players in a hand-crafted narrative set across a vivid and rural landscape. Set in the wake of a catastrophe and grounded in the intimate repercussions of large-scale conflict, players navigate through perilous terrain as they unravel the mysteries of Earth’s visitors.… Expand"}, {"name": "MX vs. ATV Unleashed: On the Edge", "details_link": "https://www.metacritic.com/game/psp/mx-vs-atv-unleashed-on-the-edge", "publisher": "THQ", "release_date": "Feb 27 2006", "developers": ["Rainbow Studios"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/c1a4cf6b9635c031a273af3f1d74643e-98.jpg", "descriptions": "In MX vs. ATV Unleashed, players power through all-new environments and event types, choosing from a variety of new vehicles. A redesigned monster truck, powerful sand-rail and raised 4x4 golf karts meet ATVs, dirt bikes and bi-planes to compete in massive free-world environments featuringIn MX vs. ATV Unleashed, players power through all-new environments and event types, choosing from a variety of new vehicles. A redesigned monster truck, powerful sand-rail and raised 4x4 golf karts meet ATVs, dirt bikes and bi-planes to compete in massive free-world environments featuring hill climbs, machine challenges and short track races. The game's career mode allows gamers to choose from the top professional ATV and Motocross riders. [THQ]… Expand"}, {"name": "Rise of the Kasai", "details_link": "https://www.metacritic.com/game/playstation-2/rise-of-the-kasai", "publisher": "SCEA", "release_date": "Apr  5 2005", "developers": ["BottleRocket Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/56be7ea7ea25d5577cb361ae52e20a22-98.jpg", "descriptions": "The sequel to the highly acclaimed \"The Mark of Kri\" offers gamers artistically stylized gameplay filled with magic and mysterious spells, an innovative fighting mechanic, and online compatibility with intense collaborative combat action. The main hero, Rau, and his trusted spirit guide,The sequel to the highly acclaimed \"The Mark of Kri\" offers gamers artistically stylized gameplay filled with magic and mysterious spells, an innovative fighting mechanic, and online compatibility with intense collaborative combat action. The main hero, Rau, and his trusted spirit guide, Kuzo, return for the sequel along with new, stylized characters, including Tati (Rau?s younger, agile sister with a darker personality). Building on the proprietary combat system, two players will be able to team up (online) with the USB headset and defeat enemies together or play alone using an AI (artificial intelligence) controlled character for a unique cooperative gameplay experience. If playing alone, the second character is controlled by artificial intelligence and a cunning player will observe their actions to learn how to best approach the fighting scenarios when replaying the area as the opposite character. Rau has four weapons in his arsenal: battle axe, Taiaha (spear), broadsword and bow and arrow that now acts as a stealth weapon. Tati has twin daggers, a deadly staff with retracting blades, an axe, a proximity-based weapon and the ability to become invisible in stealth mode. Each character has his/her special skills that can be developed along the way. While Rau is able to use Kuzo the bird to scout unknown territory, distract enemies and retrieve items, Tati can \"spirit walk\" and see through the eyes of the dead. Tati also has the ability to blend seamlessly into the environment and wait undetected, furthering the strategic element of the gameplay. Satisfaction of ending a level is now by way of defeating a boss. Three imposing bosses will make full use of the \"Mark of Kri\" cinematic approach. [SCEA]… Expand"}, {"name": "NFL Street 3", "details_link": "https://www.metacritic.com/game/psp/nfl-street-3", "publisher": "EA Sports", "release_date": "Nov 14 2006", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "PSP"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/34bcfdc50fd57a96764e89afcf00dba2-98.jpg", "descriptions": "With NFL Street 3 you can play your style of football both on the ground and in the air in this newest iteration of the popular NFL Street franchise. Show off your style and boost your score by performing stunning aerial moves, jumping into the air and collecting special items and gameWith NFL Street 3 you can play your style of football both on the ground and in the air in this newest iteration of the popular NFL Street franchise. Show off your style and boost your score by performing stunning aerial moves, jumping into the air and collecting special items and game modifiers that hover above the playing field. You will also have the ability to control your Gamebreaker and pull off new Power moves that are available to both the offense and the defense. [Electronic Arts]… Expand"}, {"name": "Madden NFL 2005", "details_link": "https://www.metacritic.com/game/ds/madden-nfl-2005", "publisher": "EA Sports", "release_date": "Nov 17 2004", "developers": ["Exient Entertainment"], "platforms": ["PC", "PlayStation 2", "DS"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/a86d738a29e4a54cc37660a1f7010339-98.jpg", "descriptions": "Madden NFL 2005 is the deepest and most authentic handheld sports game ever.  Taking advantage of the unique Nintendo DS hardware feature set, Madden NFL 2005 gives players unprecedented control during gameplay. Gamers can now use the Nintendo DS touch screen to call plays, utilize the kickMadden NFL 2005 is the deepest and most authentic handheld sports game ever.  Taking advantage of the unique Nintendo DS hardware feature set, Madden NFL 2005 gives players unprecedented control during gameplay. Gamers can now use the Nintendo DS touch screen to call plays, utilize the kick meter and select audibles at the line of scrimmage. The second screen also is home to Field Radar, which allows gamers to see where all 22 players are on the field while staying in the heart of the action on the other screen. Madden NFL 2005 breaks new ground by allowing players to go head-to-head in Madden NFL 2005 via wireless play. The game delivers unprecedented 3D graphics while featuring authentic NFL uniforms for all 32 NFL teams and player portraits for each NFL player. With a full season mode and fun game modes such as Situation Mode and 2-Minute Drill, Madden NFL 2005 for the  Nintendo DS delivers its signature level of depth in the palm of your hand. [Electronic Arts]… Expand"}, {"name": "Tom Clancy's Rainbow Six 3", "details_link": "https://www.metacritic.com/game/gamecube/tom-clancys-rainbow-six-3", "publisher": "Ubisoft", "release_date": "Jun 17 2004", "developers": ["Ubisoft Shanghai"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/b8ab1d3b394e92687b9ce144df538688-98.jpg", "descriptions": "As terrorist attacks against the United States and Venezuela escalate, you are in charge of leading the last line of defense: Rainbow.  In Rainbow Six 3, you will lead this top-secret task force dedicated to combating terrorism in all its forms.  Your team consists of the best fieldAs terrorist attacks against the United States and Venezuela escalate, you are in charge of leading the last line of defense: Rainbow.  In Rainbow Six 3, you will lead this top-secret task force dedicated to combating terrorism in all its forms.  Your team consists of the best field operatives--equipped with an arsenal of no fewer than 30 weapons--that the United Nations has to offer.  You may be the last hope in the war against terror.… Expand"}, {"name": "Frantics", "details_link": "https://www.metacritic.com/game/playstation-4/frantics", "publisher": "Sony Interactive Entertainment", "release_date": "Mar  6 2018", "developers": ["Sony Interactive Entertainment", "NapNok Games"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 68, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/1c2bede75f3195f01b4d17e899736f70-98.jpg", "descriptions": "Arcade style fun and madcap mini-games are all the rage in Frantics, where you and up to three friends have to face off in a variety of challenges."}, {"name": "Deracine", "details_link": "https://www.metacritic.com/game/playstation-4/deracine", "publisher": "JapanStudio", "release_date": "Nov  6 2018", "developers": ["From Software"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/228229a4f35e8f908b490593694b97ac-98.jpg", "descriptions": "The VR debut from director Hidetaka Miyazaki and FromSoftware. Déraciné is a story adventure game from Sony Interactive Entertainment, SIE Japan Studio, FromSoftware and Hidetaka Miyazaki, known for their collaboration on Bloodborne. Taking the role as an unseen faerie in a secluded boardingThe VR debut from director Hidetaka Miyazaki and FromSoftware. Déraciné is a story adventure game from Sony Interactive Entertainment, SIE Japan Studio, FromSoftware and Hidetaka Miyazaki, known for their collaboration on Bloodborne. Taking the role as an unseen faerie in a secluded boarding school, the player moves around in frozen time, collecting various bits of information that serve to unfold an overarching mystery.  The story is a new take on classic adventure games and utilizes PS VR’s technology to take gamers on an entirely unique and personal experience.… Expand"}, {"name": "Destroy All Humans!", "details_link": "https://www.metacritic.com/game/xbox-one/destroy-all-humans!", "publisher": "THQ Nordic", "release_date": "Jul 28 2020", "developers": ["Black Forest Games"], "platforms": ["PC", "PlayStation 2", "PlayStation 4", "Stadia", "Switch", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/bed4c9db65b5d19d9aaa0daf7f973d34-98.jpg", "descriptions": "The cult-classic returns! Terrorize the people of 1950s Earth in the role of the evil alien Crypto-137. Harvest DNA and bring down the US government in the remake of the legendary alien invasion action adventure. Annihilate puny humans using an assortment of alien weaponry and psychicThe cult-classic returns! Terrorize the people of 1950s Earth in the role of the evil alien Crypto-137. Harvest DNA and bring down the US government in the remake of the legendary alien invasion action adventure. Annihilate puny humans using an assortment of alien weaponry and psychic abilities. Reduce their cities to rubble with your flying Saucer! One giant step on mankind!… Expand"}, {"name": "Hell Let Loose", "details_link": "https://www.metacritic.com/game/playstation-5/hell-let-loose", "publisher": "Team17", "release_date": "Oct  5 2021", "developers": ["Black Matter"], "platforms": ["PC", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Arcade"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/6618eac90ecd8962594d6859bf538432-98.jpg", "descriptions": "You've never played World War 2 the way it was meant to be played... with lumbering tanks dominating the battlefield, crucial supply chains fuelling the frontlines, being a cog in the machine of colossal combined arms warfare. Hell Let Loose puts you in the chaos of war, complete with deepYou've never played World War 2 the way it was meant to be played... with lumbering tanks dominating the battlefield, crucial supply chains fuelling the frontlines, being a cog in the machine of colossal combined arms warfare. Hell Let Loose puts you in the chaos of war, complete with deep player-controlled vehicles, a dynamically evolving front line, and crucial unit-focused gameplay that commands the tide of battle.Featuring sweeping maps modelled on real reconnaissance images and satellite data, the entire battlefield is divided up into large capture sectors -- allowing for emergent and constantly unique gameplay that pits two forces of fifty players in a fight to the death across fields, bridges, forests and towns on an ever-evolving front line. When a sector is captured, it will generate one of three resources for your team, creating a complex meta-game that will influence your team's march to victory.… Expand"}, {"name": "Broforce", "details_link": "https://www.metacritic.com/game/playstation-4/broforce", "publisher": "Devolver Digital", "release_date": "Mar  1 2016", "developers": ["Free Lives"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/f521e93f563ce751fd133d7214bb8f93-98.jpg", "descriptions": "A ridiculously violent platform game about being awesome action heroes from the 80s and 90s while slaying satanic terrorists and aliens while unraveling an evil plot to destroy the planet while dealing with being awesome action heroes from the 80s and 90s."}, {"name": "Runers", "details_link": "https://www.metacritic.com/game/pc/runers", "publisher": "Mastertronic", "release_date": "Sep  2 2014", "developers": ["LGK Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/85347db8cd885aa826f25ee41a4078ac-98.jpg", "descriptions": "Runers is a top-down rogue-like dungeon shooter where the player explores a vast underground labyrinth and faces fierce monsters and bosses. As the game advances further into the dungeon, she gathers Runes, which are be used to combine into 285 unique spells."}, {"name": "Picross e2", "details_link": "https://www.metacritic.com/game/3ds/picross-e2", "publisher": "Jupiter Corporation", "release_date": "Jul 25 2013", "developers": ["Jupiter Corporation"], "platforms": "3DS", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Logic", "Logic"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/bea445a1fab7dd0508e1766961dcd9c3-98.jpg", "descriptions": "The sequel to Picross e offers a new navigation feature to make gameplay even smoother. As with the previous game, this sequel has 150 new puzzles, plus an all new gameplay element known as Micross.\r Picross is a Picture Crossword Puzzle Game in which you use numbers as hints to completeThe sequel to Picross e offers a new navigation feature to make gameplay even smoother. As with the previous game, this sequel has 150 new puzzles, plus an all new gameplay element known as Micross.\r Picross is a Picture Crossword Puzzle Game in which you use numbers as hints to complete illustrations. The rules are simple and easy to understand. Anyone can do it!… Expand"}, {"name": "XG Blast!", "details_link": "https://www.metacritic.com/game/ds/xg-blast!", "publisher": "UFO Interactive", "release_date": "Jun 14 2010", "developers": ["Next Wave Team"], "platforms": "DS", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/14a4f37034a1f49727f5450e88f59270-98.jpg", "descriptions": "XG Blast! is an arcade shooter delivered in a bright and colourful retro style. Players control a spaceship with the sole purpose of destroying the invading hordes before they do the same to you. A vast array of powerful weaponry and the special eXtreme Gravity blast creates a screen full ofXG Blast! is an arcade shooter delivered in a bright and colourful retro style. Players control a spaceship with the sole purpose of destroying the invading hordes before they do the same to you. A vast array of powerful weaponry and the special eXtreme Gravity blast creates a screen full of vibrant action with intensely addictive gameplay. Your ship is controlled using the D-pad and either the action buttons or the Touch Screen, allowing simple yet varied styles of play. [Rising Star Games]… Expand"}, {"name": "Mega Man Battle Network 5: Double Team DS", "details_link": "https://www.metacritic.com/game/ds/mega-man-battle-network-5-double-team-ds", "publisher": "Capcom", "release_date": "Nov  1 2005", "developers": ["Capcom"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Miscellaneous", "Action RPG", "Action RPG", "Compilation"], "meta_score": 68, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/6bec2e31f9251b35a4d86cd5557bc18c-98.jpg", "descriptions": "One month has passed since the battle ended with the Dark Chip Syndicate for the earth's existence. Now back under the new name \"Nebula\", this evil organization is attempting to take complete control over the global internet. Now players must team up with other cyber heroes to liberate theOne month has passed since the battle ended with the Dark Chip Syndicate for the earth's existence. Now back under the new name \"Nebula\", this evil organization is attempting to take complete control over the global internet. Now players must team up with other cyber heroes to liberate the Nebula-controlled areas of the internet and stop this malevolent organization. In Mega Man Battle Network 5: Double Team, players must partake in an extensive liberating mission where they must defeat the evil organization that waits, while acquiring and using up to six Navi allies to help progress through the adventure. Each Battle Network version has a set of specialized cohorts that can be obtained including characters from \"Battle Network 4.\" Working as a team will be crucial to liberate the Nebula-controlled areas. Plug into flashbacks of stored digital data and images which will uncover information that may help resolve unanswered questions. [Capcom]… Expand"}, {"name": "Mega Man Battle Network 4 Red Sun", "details_link": "https://www.metacritic.com/game/game-boy-advance/mega-man-battle-network-4-red-sun", "publisher": "Capcom", "release_date": "Jun 29 2004", "developers": ["Capcom"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/ab7434ff77b3b92896e1153a3cc1a261-98.jpg", "descriptions": "The fourth installment in the Mega Man Battle Network series comes in two versions--Red Sun and Blue Moon--each with different enemies, battle chips, souls, and characters. Once again, you assume the role of Lan as he and his friend, Mega Man.exe, fight to rid the Internet of viruses andThe fourth installment in the Mega Man Battle Network series comes in two versions--Red Sun and Blue Moon--each with different enemies, battle chips, souls, and characters. Once again, you assume the role of Lan as he and his friend, Mega Man.exe, fight to rid the Internet of viruses and other cyberworld enemies. Unlike previous games in the series, Mega Man Battle Network 4 focuses on a tournament system where players encounter a variety of enemies that must be defeated. A new Soul Unison system lets Mega Man transform into his defeated enemies.… Expand"}, {"name": "Medal of Honor: Rising Sun", "details_link": "https://www.metacritic.com/game/gamecube/medal-of-honor-rising-sun", "publisher": "EA Games", "release_date": "Nov 11 2003", "developers": ["EA LA"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 68, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/afce2eaced37a20cf42d6cd80632c726-98.jpg", "descriptions": "The epic saga of World War II continues with Medal of Honor Rising Sun.  Play as Marine Corporal Joseph Griffin in a far-reaching tale of two brothers trying to prevent Japanese forces from dominating the Pacific.  Rising Sun features real-life historical battles like Pearl Harbor andThe epic saga of World War II continues with Medal of Honor Rising Sun.  Play as Marine Corporal Joseph Griffin in a far-reaching tale of two brothers trying to prevent Japanese forces from dominating the Pacific.  Rising Sun features real-life historical battles like Pearl Harbor and Guadalcanal, over 20 authentic WWII weapons, highly intelligent enemies, and a heroic cast of characters that fight on your side from level to level.  Battle other soldiers in ten multiplayer levels and an all-new two-player co-op mode.  … Expand"}, {"name": "Tak and the Power of Juju", "details_link": "https://www.metacritic.com/game/playstation-2/tak-and-the-power-of-juju", "publisher": "THQ", "release_date": "Oct 15 2003", "developers": ["Avalanche Software"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 68, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/853eb961b79f7dc20cc6bf0c78b19cda-98.jpg", "descriptions": "Tak and the Power of Juju is a tale of good vs. evil set in an ancient, tribal world where magic (Juju) really works! Tak, a shaman's apprentice and unlikely hero, sets off on an action-filled, yet humorous journey to save his village from an evil Juju Man. Tak will have to stretch beyondTak and the Power of Juju is a tale of good vs. evil set in an ancient, tribal world where magic (Juju) really works! Tak, a shaman's apprentice and unlikely hero, sets off on an action-filled, yet humorous journey to save his village from an evil Juju Man. Tak will have to stretch beyond his training and use his wits, his environment and the power of the Juju gods to complete his quest and reinstate peace in his mystical world. [THQ]… Expand"}, {"name": "Lost Kingdoms II", "details_link": "https://www.metacritic.com/game/gamecube/lost-kingdoms-ii", "publisher": "Activision", "release_date": "May 21 2003", "developers": ["From Software"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Role-Playing", "General"], "meta_score": 68, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/f8330c605f1a10c452aaba2a7044e870-98.jpg", "descriptions": "After the events of the original Lost Kingdoms, the Kingdom of Argwyll stands on the brink of destruction. Now you must take the role of Tara as she summons the guardian creatures to battle the invading evil force, uncover its origins, and save the kingdom. In the game's enhanced card-basedAfter the events of the original Lost Kingdoms, the Kingdom of Argwyll stands on the brink of destruction. Now you must take the role of Tara as she summons the guardian creatures to battle the invading evil force, uncover its origins, and save the kingdom. In the game's enhanced card-based battle system, you can now collect and power up more than 200 creature cards. New abilities allow you to transform into creatures and fight in different battle areas. … Expand"}, {"name": "Jazz Jackrabbit", "details_link": "https://www.metacritic.com/game/game-boy-advance/jazz-jackrabbit", "publisher": "Jaleco Entertainment", "release_date": "Jan  3 2003", "developers": ["Game Titan"], "platforms": "Game Boy Advance", "num_players": "1-5 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/5/e5452145160fb9d5b8c01a890a77bc8b-98.jpg", "descriptions": "Now our hero is jazzed up with trick new weapons and tactics, super-cool environments, and a slew of slimy opponents waiting to turn you into rabbit stew. Watch out for surprises as fantastic characters like Zoe Cottontail, Professor Lapin, Spaz and more, unite their powers to help Jazz kickNow our hero is jazzed up with trick new weapons and tactics, super-cool environments, and a slew of slimy opponents waiting to turn you into rabbit stew. Watch out for surprises as fantastic characters like Zoe Cottontail, Professor Lapin, Spaz and more, unite their powers to help Jazz kick some intergalactic butt.… Expand"}, {"name": "Ducati World Racing Challenge", "details_link": "https://www.metacritic.com/game/playstation/ducati-world-racing-challenge", "publisher": "Acclaim", "release_date": "Jan  2 2001", "developers": ["Attention To Detail"], "platforms": ["PC", "PlayStation"], "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/9b0823a863050d47b7fd009f243bb09d-98.jpg", "descriptions": "Ducati World Racing Challenge makes a good effort at providing the kind of gameplay and variety that racing fanatics desire."}, {"name": "Lost Planet 2", "details_link": "https://www.metacritic.com/game/xbox-360/lost-planet-2", "publisher": "Capcom", "release_date": "May 11 2010", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 68, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/e0e3406b5fc40f3c9b962a0d344e5f1b-98.jpg", "descriptions": "Lost Planet 2 picks up 10 years since the events of the original adventure and the landscape has evolved dramatically. With the success of terraforming activities, the planet's ice has begun to melt, giving way to lush tropical jungles and other new environments. The story has advancedLost Planet 2 picks up 10 years since the events of the original adventure and the landscape has evolved dramatically. With the success of terraforming activities, the planet's ice has begun to melt, giving way to lush tropical jungles and other new environments. The story has advanced beyond Wayne Holden as players now follow the exploits of their own customized snow pirates on their quest to seize control of E.D.N III. Players move their heroes through different stories creating a truly unique and interactive experience. With this concept, gamers have the opportunity to engage in the story in a more dynamic way as plot threads evolve from various perspectives. The strongest features from the first game returns in Lost Planet 2 making fans feel right at home. In addition to the anchor actions that made the gameplay in Lost Planet a true 3-D experience, Lost Planet 2 allows gamers to gain tactical advantage with a wide variety of new actions. The game also contains a new addition to the enormous Akrids which were a fan-favourite in the first Lost Planet. Beyond the deep single player mode, Lost Planet 2 is loaded with one the most extensive multiplayer campaign seen in a shooter to date. The intense and action packed campaign mode comes with the ability to form teams of up to 4 players online to clear mission objectives with friends. [Capcom]… Expand"}, {"name": "Earth Defense Force 2017 Portable", "details_link": "https://www.metacritic.com/game/playstation-vita/earth-defense-force-2017-portable", "publisher": "D3Publisher", "release_date": "Jan  8 2013", "developers": ["Sandlot"], "platforms": "PlayStation Vita", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/59dc9ab65ff3f76c9af48f53041b0e01-98.jpg", "descriptions": "The completely remastered Earth Defense Force 2017 Portable features seven new levels and the fan favorite Pale Wing, which allows players to soar high over buildings in her jet pack and cause destruction from above."}, {"name": "Tales of Symphonia: Dawn of the New World", "details_link": "https://www.metacritic.com/game/wii/tales-of-symphonia-dawn-of-the-new-world", "publisher": "Namco Bandai Games America", "release_date": "Nov 11 2008", "developers": ["Bandai Namco Games"], "platforms": ["PlayStation 3", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/8496bac9bf0cf29b6f025d7e49ace355-98.jpg", "descriptions": "Set two years after the events of the award-winning Tales of Symphonia for the Nintendo GameCube, Dawn of the New World follows the journey of two new young heroes, Emil Castagnier and Marta Lualdi, as they seek to uncover the mystery of why their world has fallen into ruin. In their quest,Set two years after the events of the award-winning Tales of Symphonia for the Nintendo GameCube, Dawn of the New World follows the journey of two new young heroes, Emil Castagnier and Marta Lualdi, as they seek to uncover the mystery of why their world has fallen into ruin. In their quest, their paths will cross with the original cast of Tales of Symphonia including Lloyd and Colette, as well as a summon spirit known as Ratatosk who claims to be the lord of all monsters. Advancing the combination of story, characters and real-time battles of Tales of Symphonia, Dawn of the New World introduces a new monster recruitment feature in which players can capture more than 200 unique enemies and train them to actively participate in battle. Players can then feed these monsters to make them more effective, and even evolve them into several new fearsome forms. The game also features an updated real-time battle system that lets players move freely in all directions around the battlefield, execute powerful unison attacks and take advantage of a new elemental alignment system for even more strategic depth. Dawn of the New World gives players complete control over a full roster of Tales of Symphonia characters and ally monsters, letting them customize their adventure party into hundreds of unique combinations. [Namco Bandai Games]… Expand"}, {"name": "Drawn to Life: SpongeBob SquarePants Edition", "details_link": "https://www.metacritic.com/game/ds/drawn-to-life-spongebob-squarepants-edition", "publisher": "THQ", "release_date": "Sep 15 2008", "developers": ["Altron"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action Adventure", "Adventure", "General", "General", "Sandbox"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/20ac8f8fff5fbda38d2a8005058dac40-98.jpg", "descriptions": "FINALLY fans of SpongeBob can interact with SpongeBob's world like never before! Customize your game as you puzzle, race, platform and fight your way through to defeat \"DoodleBob\". Side-scrolling platforming action. Explore unique worlds that have their own special mechanics and goals. OverFINALLY fans of SpongeBob can interact with SpongeBob's world like never before! Customize your game as you puzzle, race, platform and fight your way through to defeat \"DoodleBob\". Side-scrolling platforming action. Explore unique worlds that have their own special mechanics and goals. Over 20 levels, each with their own specific objective(s) that you need to complete before you can advance to the next stage. The action increases as you complete the objectives and conquer the levels. Puzzle, race, platform and fight your way through the game! Draw your own original character and control it. [THQ]… Expand"}, {"name": "The Guest", "details_link": "https://www.metacritic.com/game/pc/the-guest", "publisher": "505 Games", "release_date": "Mar 10 2016", "developers": ["Team Gotham"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "3D", "First-Person"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/29156a7862d23e93f92e64f56c34254c-98.jpg", "descriptions": "The Guest is a haunting and claustrophobic first person exploration game where solving puzzles, secrets and riddles is the only way to escape a gloomy hotel room and figure out who’s responsible."}, {"name": "Everyday Shooter", "details_link": "https://www.metacritic.com/game/psp/everyday-shooter", "publisher": "SCEA", "release_date": "Dec  4 2008", "developers": ["Backbone Entertainment"], "platforms": ["PC", "PlayStation 3", "PSP"], "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/2533066d4b8c6621abbbe49a9273efc0-98.jpg", "descriptions": "[Playstation Network]  Originally developed solely by Jonathan Mak, Everyday Shooter won three awards at the Independent Gaming Festival at the 2007 Game Developers Conference and was a hit on PS3. Now you can experience this unique shooter on the PSP system in this faithful port. Unlike[Playstation Network]  Originally developed solely by Jonathan Mak, Everyday Shooter won three awards at the Independent Gaming Festival at the 2007 Game Developers Conference and was a hit on PS3. Now you can experience this unique shooter on the PSP system in this faithful port. Unlike traditional arcade shooters, each level is presented as a different \"music track,\" complete with a different look and chain combo system, and typical arcade sounds of destruction are replaced with guitar riffs harmonizing over the instrumental soundtrack. [SCEA]… Expand"}, {"name": "Skylar & Plux: Adventure on Clover Island", "details_link": "https://www.metacritic.com/game/pc/skylar-plux-adventure-on-clover-island", "publisher": "Grip Games", "release_date": "May 19 2017", "developers": ["Right Nice Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/1af2f562bf70cd51d2f7e2e032f46514-98.jpg", "descriptions": "Skylar & Plux: Adventure on Clover Island sets two unlikely heroes on an adventure to prevent the villainous CRT from conquering their home and turning it into a wasteland."}, {"name": "In Between", "details_link": "https://www.metacritic.com/game/xbox-one/in-between", "publisher": "Headup Games", "release_date": "Jun  8 2016", "developers": ["Gentlymad"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/8fe175084b6ba3f8c42c3006a4143c5b-98.jpg", "descriptions": "In Between is an atmospheric, award-winning platformer where you solve mind-bending puzzles by manipulating your surroundings and gravity itself. Dive into the dense atmosphere of this hand painted game while exploring the reason why you are here. Welcome to a world In Between!"}, {"name": "Alien Breed (PS Mobile)", "details_link": "https://www.metacritic.com/game/playstation-vita/alien-breed-ps-mobile", "publisher": "Team17", "release_date": "Nov 14 2012", "developers": ["Team17"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita"], "genres": ["Action", "General", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 68, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/00ded0bacc3b73f8595cabd212b4dd70-98.jpg", "descriptions": "Alien Breed is the classic sci-fi, top-down shooter developed by Team17. Launching originally in 1991, Alien Breed has now been re-imagined for PlayStation3 system and PlayStationVita system, which can only mean one thing its time to turn down the lights, turn up the sound and encounterAlien Breed is the classic sci-fi, top-down shooter developed by Team17. Launching originally in 1991, Alien Breed has now been re-imagined for PlayStation3 system and PlayStationVita system, which can only mean one thing its time to turn down the lights, turn up the sound and encounter Alien Breed again!\r Features:\r  Story Mode  choose from 30 levels including three new level packs: Convergence, Valiance and Synergy. \r Enhanced visuals or play using the original 16-bit graphics\r  Ad Hoc and Online Multiplayer\r  Team up on either PS3 or PlayStationVita system via cross-platform play\r  Cross-Platform Continuation Play \r Leaderboards\r  21 Trophies… Expand"}, {"name": "Touken Ranbu Warriors", "details_link": "https://www.metacritic.com/game/switch/touken-ranbu-warriors", "publisher": "Omega Force", "release_date": "May 24 2022", "developers": ["Omega Force"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 68, "users_score": 9.2, "image": "https://static.metacritic.com/images/products/games/6/f624b16c6ae6bd73c080875897d5621d-98.jpg", "descriptions": "History Revisionists began attacking the past to change history.\rIn order to stop them, the Government of the Time appointed the \"Saniwa\" with protecting history.\rSaniwa can awaken tsukumogami (tools with spirits), the Touken Danshi.\r\nThey travel through time and seek to defeat the HistoryHistory Revisionists began attacking the past to change history.\rIn order to stop them, the Government of the Time appointed the \"Saniwa\" with protecting history.\rSaniwa can awaken tsukumogami (tools with spirits), the Touken Danshi.\rThey travel through time and seek to defeat the History Retrograde Army (HRA) who seek to alter history.\r The Saniwa and Touken Danshi were enjoying a peaceful life\rwhen they were suddenly attacked by the HRA.\rAfter a fierce battle, the Touken Danshi managed to overcome\rthe HRA, but the Honmaru was greatly damaged, weakening\rtheir military strength. In addition, in the midst of the battle, the\rSaniwa, who are vital to the Honmaru, disappeared.\r… Expand"}, {"name": "Tales of Symphonia Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/tales-of-symphonia-remastered", "publisher": "Bandai Namco Games", "release_date": "Feb 17 2023", "developers": ["Bandai Namco Games"], "platforms": ["Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/9/91a8824f376677b4bb986e9b64798ba5-98.jpg", "descriptions": "In a dying world, legend has it that a Chosen One will one day rise from amongst the people and the land will be reborn. The line between good and evil blurs in this epic adventure where the fate of two interlocked worlds hangs in the balance. Follow the journey of Lloyd Irving as he and hisIn a dying world, legend has it that a Chosen One will one day rise from amongst the people and the land will be reborn. The line between good and evil blurs in this epic adventure where the fate of two interlocked worlds hangs in the balance. Follow the journey of Lloyd Irving as he and his friends try to save both worlds.Dive back into Tales of Symphonia, an exciting and beloved action RPG, now with enhanced graphics and improved gameplay!… Expand"}, {"name": "Inked: A Tale of Love", "details_link": "https://www.metacritic.com/game/pc/inked-a-tale-of-love", "publisher": "Starbreeze", "release_date": "Apr 26 2018", "developers": ["Somnium Games d.o.o."], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 68, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/8b31937f2e2bdea1c57295f4d140c35b-98.jpg", "descriptions": "Inked is a tale of love and vengeance told in ink on paper. You play as the Nameless Hero who sets out on a journey in a vast landscape filled with puzzles for you to solve. Each puzzle takes you closer to your lost love, unraveling a story that will forever change you."}, {"name": "Blinx 2: Masters of Time & Space", "details_link": "https://www.metacritic.com/game/xbox/blinx-2-masters-of-time-space", "publisher": "Microsoft Game Studios", "release_date": "Nov 18 2004", "developers": ["Artoon"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 68, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/7414f9fe3354616d744182dc664be5e8-98.jpg", "descriptions": "Blinx 2: Masters of Time & Space continues the adventures of Blinx, a heroic cat with the ability to make time slow, fast-forward, rewind, or stop. In this sequel, Blinx and his squad of tough, agile cats use their time-control powers to battle menacing time monsters, outmaneuver theBlinx 2: Masters of Time & Space continues the adventures of Blinx, a heroic cat with the ability to make time slow, fast-forward, rewind, or stop. In this sequel, Blinx and his squad of tough, agile cats use their time-control powers to battle menacing time monsters, outmaneuver the criminal pig gang, and discover why time is disappearing. You can play as Blinx or his rivals--the sneaky pigs--who are equipped with the ability to morph and control space. Blinx 2 also features cooperative and competitive multiplayer modes.… Expand"}, {"name": "Steelrising", "details_link": "https://www.metacritic.com/game/pc/steelrising", "publisher": "Nacon", "release_date": "Sep  8 2022", "developers": ["Spiders"], "platforms": ["PlayStation 5", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/7b7bcda2bcf3a140e8452ccf5da80019-98.jpg", "descriptions": "Paris, 1789. The French Revolution has been suppressed with bloodshed by Louis XVI and his merciless mechanical army. Aegis, a mysterious automaton masterpiece, must confront the king's army alone to save history in this challenging action-RPG."}, {"name": "Ghostbusters: The Video Game Remastered", "details_link": "https://www.metacritic.com/game/xbox-one/ghostbusters-the-video-game-remastered", "publisher": "Saber Interactive", "release_date": "Oct  4 2019", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 68, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/e18aa9d22c6bef9cbbe71dfda8776e90-98.jpg", "descriptions": "The Ghostbusters video game is back and remastered. Strap on your proton pack once again and join the Ghostbusters on the adventure with the voice and likeness of the original crew as you battle to save New York. The game features the voices and in-game likenesses of Bill Murray, DanThe Ghostbusters video game is back and remastered. Strap on your proton pack once again and join the Ghostbusters on the adventure with the voice and likeness of the original crew as you battle to save New York. The game features the voices and in-game likenesses of Bill Murray, Dan Aykroyd, Harold Ramis, and Ernie Hudson in an original story penned by the writers of the original films - Dan Aykroyd and Harold Ramis. Experience unique ghost hunting, wrangling and trapping with upgradeable weapons in widely destructible environments. Test the team's mettle with large scale boss fights. Play through a unique storyline as the player battles and captures ghosts - both well-loved and brand new - throughout New York. [Epic]… Expand"}, {"name": "Hexyz Force", "details_link": "https://www.metacritic.com/game/psp/hexyz-force", "publisher": "Atlus", "release_date": "May 24 2010", "developers": ["Sting"], "platforms": "PSP", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/519badb4db16fcda4d4ad487b4e7cc00-98.jpg", "descriptions": "Long ago, Norvia, the Goddess of Creation, descended from the heavens.  Using the Holy Vessel, a divine chalice charged with all Force (the spiritual energy in the universe), she created life and the Divinities, shepherds of existence.  For a while, all was good.  After a time, Delgaia, theLong ago, Norvia, the Goddess of Creation, descended from the heavens.  Using the Holy Vessel, a divine chalice charged with all Force (the spiritual energy in the universe), she created life and the Divinities, shepherds of existence.  For a while, all was good.  After a time, Delgaia, the God of Destruction, brought about a great calamity known as the Gods' Remorse.  He intended to return all Force to the Holy Vessel, returning Berge to the void.  The Divinities sacrificed themselves to defeat Delgaia, delivering Berge from doom and sealing the God of Destruction away deep within the earth. As Berge lay in ruin, a result of its bitter war, Norvia made a covenant.  She would restore Berge to its former beauty on one condition.  An Hour of Judgment would eventually come to pass, and in it, the world would have to decide its ultimate path: creation or destruction. [Atlus USA]… Expand"}, {"name": "Harry Potter and the Goblet of Fire", "details_link": "https://www.metacritic.com/game/ds/harry-potter-and-the-goblet-of-fire", "publisher": "Electronic Arts", "release_date": "Nov  8 2005", "developers": ["Magic Pockets"], "platforms": ["PC", "PlayStation 2", "DS"], "num_players": "1-3 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 68, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/3/d2616296577453089074fea6405f3693-98.jpg", "descriptions": "In Harry Potter and the Goblet of Fire, Harry is mysteriously selected as the fourth competitor in the dangerous Triwizard Tournament. Each contestant in this international competition must confront a fire-breathing dragon, rescue friends from the icy depths of the Black Lake, and navigateIn Harry Potter and the Goblet of Fire, Harry is mysteriously selected as the fourth competitor in the dangerous Triwizard Tournament. Each contestant in this international competition must confront a fire-breathing dragon, rescue friends from the icy depths of the Black Lake, and navigate the twisting mysteries of a vast, dangerous maze. Players experience all the thrills of the movie - from the Quidditch World Cup campsite to a heart-stopping duel with Lord Voldemort himself. Harry, Ron, and Hermione are all playable characters, modeled after their big-screen counterparts. In this game, an all-new spell-casting system allows players to feel the magic for the first time as the controller shakes and reacts with every flick of the wand. Players can also team up with friends in co-operative play to combine their magic and produce more powerful spells than ever before. [Electronic Arts]… Expand"}, {"name": "Yooka-Laylee", "details_link": "https://www.metacritic.com/game/playstation-4/yooka-laylee", "publisher": "Team17", "release_date": "Apr 11 2017", "developers": ["Playtonic Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 68, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/92133e987732dbc3dc20c0b4f46892c6-98.jpg", "descriptions": "Yooka-Laylee is an all-new 3D platformer from the creative talent behind the Banjo-Kazooie and Donkey Kong Country games. Our new heroes, Yooka (the green bloke with no pants) and Laylee (the wisecracking lady-bat with the big nose) were conceptualised from the ground up for stellarYooka-Laylee is an all-new 3D platformer from the creative talent behind the Banjo-Kazooie and Donkey Kong Country games. Our new heroes, Yooka (the green bloke with no pants) and Laylee (the wisecracking lady-bat with the big nose) were conceptualised from the ground up for stellar platforming gameplay, created by the same character artist behind the rebooted Donkey Kong family and legendary N64 heroes Banjo and Kazooie. Using an arsenal of special moves like Yookas tongue grapple and Laylees tactical sonar blast, players will explore  and expand  gorgeous 3D worlds drawn up by esteemed environment artist Steven Hurst (Banjo-Kazooie series, Viva Pinata) and through skill discover the plethora of delicious collectibles hidden within.\r FEATURES:\r * Heroes Built for Fun: Our new buddy-duo were dreamed up specifically for entertaining platforming gameplay and exceptional colour coordination. We think we've captured the spirit of our past heroes while introducing our most inventive moves yet.\r * An Arsenal of Abilities: Sonar blasting, tongue whipping, sky soaring a move roster built for platforming fun  and unlocked with added freedom. Additionally, there may or may not be a move involving a giant fart bubble.\r * A Dream Soundtrack: David Wise (Donkey Kong Country) and Grant Kirkhope (Banjo-Kazooie) combine in what's sure to be a melodic masterpiece! Seriously, clean out your ears - they're in for a treat.\r * Collect-em-up 2.0: A roster of shiny collectibles with gameplay progression at their core (as well as other, more valuable materials). Every collectible type in our new game will expand gameplay in a meaningful way. Yes, we employ the man responsible for DK64's myriad of trinkets, but we've had a stern word. Our main collectible, Pagies, are used to unlock and expand new worlds in Yooka-Laylee.\r * Expandable Worlds: Experience more of the playgrounds you love by spending collectibles to expand your favourites into bigger, more challenging worlds.\r * A Cast to Last: A huge cast of memorable characters to meet (or beat) brought to life by the art and audio teams behind Banjo-Kazooie and destined to endure in future games as part of Playtonic Universe. Expect all manner of grunts, squeaks and squawks.\r * Introducing Play Tonics: Discover these unique gameplay modifiers and use them to customise gameplay to suit your style. Will you run faster, hit harder or fly further? Also, are they named after our studio or vice versa? We'll never know.\r * Arcade machines: Each world hides at least one secret arcade game encasing old-school gaming goodness. Complete its retro-tastic challenge to claim your Pagie!… Expand"}, {"name": "Suikoden Tactics", "details_link": "https://www.metacritic.com/game/playstation-2/suikoden-tactics", "publisher": "Konami", "release_date": "Nov  8 2005", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 68, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/64713a3f77d3ada598fae6e271efdc2b-98.jpg", "descriptions": "Suikoden Tactics is an all-new installment in the Suikoden universe. Told through the eyes of Kyril, a young adventurer investigating the sudden appearance of hideous creatures in the Island Nations, Suikoden Tactics unfolds another perspective to the events of \"Suikoden IV\" and players willSuikoden Tactics is an all-new installment in the Suikoden universe. Told through the eyes of Kyril, a young adventurer investigating the sudden appearance of hideous creatures in the Island Nations, Suikoden Tactics unfolds another perspective to the events of \"Suikoden IV\" and players will discover the secrets of the legendary Rune Cannons. Suikoden Tactics blends classic Suikoden and RPG elements with tactical strategy gameplay with a host of new features and game mechanics. Balloon Icon System reduces the complexity so players of all skill levels can pick up and play. Ground Elemental System gives attributes to surfaces that affect the outcome of battle. Real time rendered story events with full voice-overs unfold as Kyril goes through his adventure. Combine the powers of numerous characters in battle with the 'Combination Attack' system as they build friendship with one another. Over 80 controllable characters from the Suikoden world. 25 battle scenarios with highly detailed battle environments. Modify your characters' skills, upgrade weapons and trade items to customize your team members. Play mini-games and hidden modes to find rare items, battle special bosses and play through multiple side quests. [Konami]… Expand"}, {"name": "NBA Playgrounds", "details_link": "https://www.metacritic.com/game/playstation-4/nba-playgrounds", "publisher": "Saber Interactive", "release_date": "May  9 2017", "developers": ["Saber Interactive"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Team", "Basketball", "Arcade"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/0a5f91e2273ff82e63ba811eca2d58e4-98.jpg", "descriptions": "Classic NBA arcade action returns. Take your “A” game to the playground and beat the best in high-flying two-on-two basketball action. Practice your skills offline, play with up to three others on your PS4, or take your talents online to posterize your opponents with acrobatic jams andClassic NBA arcade action returns. Take your “A” game to the playground and beat the best in high-flying two-on-two basketball action. Practice your skills offline, play with up to three others on your PS4, or take your talents online to posterize your opponents with acrobatic jams and ridiculous displays of skill. [Playstation.com]… Expand"}, {"name": "Strike Suit Zero: Director's Cut", "details_link": "https://www.metacritic.com/game/playstation-4/strike-suit-zero-directors-cut", "publisher": "Born Ready Games", "release_date": "Apr  8 2014", "developers": ["Born Ready Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Simulation", "Flight", "Combat"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/982438b628eb8386d94d04af8fe3592a-98.jpg", "descriptions": "In the year 2299, an interstellar war rages on. In a bid to save Earth from destruction, you must take control of the Strike Suit  a revolutionary fighter craft with the ability to transform into a lethal suit of space armor. Immerse yourself in massive fleet battles where your dog-fightingIn the year 2299, an interstellar war rages on. In a bid to save Earth from destruction, you must take control of the Strike Suit  a revolutionary fighter craft with the ability to transform into a lethal suit of space armor. Immerse yourself in massive fleet battles where your dog-fighting skills will directly affect the fate of the cosmos. Discover a colorful and vibrant universe, with an epic story where the fate of Earth hangs in the balance and your actions will determine the outcome: preventing Earths destruction is your immediate concern but preserving its future is your ultimate goal. Engage intelligent enemy fighters and take on colossal capital ships, exploiting weak points in their super-structure to blow them apart. Upgrade your ships and customize your weapon load-outs to tailor combat to your tastes. Take advantage of four unique craft, including the Strike Suit, to experience dogfighting action as youve never seen it before.\r This Is Space Combat Reborn.… Expand"}, {"name": "Space Giraffe", "details_link": "https://www.metacritic.com/game/xbox-360/space-giraffe", "publisher": "Llamasoft", "release_date": "Aug 22 2007", "developers": ["Llamasoft"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/3b56b16fbceaecd288f16cd770607057-98.jpg", "descriptions": "[Xbox Live Arcade]  Space Giraffe features uniquely beautiful graphics and 100 levels of shoot-em-up action gameplay from the makers of Llamatronand Tempest 2000. Collect power-ups to activate Bonus Rounds and master the strategies necessary to maximize your score on every level! Enjoy the[Xbox Live Arcade]  Space Giraffe features uniquely beautiful graphics and 100 levels of shoot-em-up action gameplay from the makers of Llamatronand Tempest 2000. Collect power-ups to activate Bonus Rounds and master the strategies necessary to maximize your score on every level! Enjoy the unique graphical appearance of each level due to the use of the Neon engine. Learn special moves to increase the Bonus Multiplier, and collect power-ups to gain access to the Bonus Round. Bonus challenges: Finish all 100 levels to unlock a hidden gameplay mode. [Microsoft]… Expand"}, {"name": "Disney G-Force", "details_link": "https://www.metacritic.com/game/xbox-360/disney-g-force", "publisher": "Disney Interactive Studios", "release_date": "Jul 21 2009", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "General", "Platformer", "3D"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/7cd0a1cf97886686e2896277aa8059a6-98.jpg", "descriptions": "G-Force is a fast-paced action-platform game featuring a unique elite team of specially trained guinea pigs that use high-tech gadgets and specialized talents to complete a dangerous government mission. G-Force puts players in control of both Darwin, the guinea pig leader of the covertG-Force is a fast-paced action-platform game featuring a unique elite team of specially trained guinea pigs that use high-tech gadgets and specialized talents to complete a dangerous government mission. G-Force puts players in control of both Darwin, the guinea pig leader of the covert intelligence G-Force squad, and housefly surveillance sidekick, Mooch, as they team up with the other G-Force agents and use their gadgets, stealth mastery and pint-sized teamwork as mankinds only hope to complete a dangerous high-level government mission. G-Force uses innovative gameplay featuring a unique sense of scale, puzzle solving that requires players to manipulate environments and enemies, including diabolical waffle irons among evil household appliances. [Disney Interactive Studios]… Expand"}, {"name": "Harry Potter and the Order of the Phoenix", "details_link": "https://www.metacritic.com/game/xbox-360/harry-potter-and-the-order-of-the-phoenix", "publisher": "EA Games", "release_date": "Jun 25 2007", "developers": ["EA Games"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 68, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/6/0b2daa8b6ff49a53d08e1f66dffde37e-98.jpg", "descriptions": "In Harry Potter and the Order of the Phoenix, Harry returns for his fifth year of study at Hogwarts and discovers that much of the wizarding community has been denied the truth about the teenager’s recent encounter with the evil Lord Voldemort. Fearing that Hogwarts' venerable Headmaster,In Harry Potter and the Order of the Phoenix, Harry returns for his fifth year of study at Hogwarts and discovers that much of the wizarding community has been denied the truth about the teenager’s recent encounter with the evil Lord Voldemort. Fearing that Hogwarts' venerable Headmaster, Albus Dumbledore, is lying about Voldemort's return in order to undermine his power and take his job, the Minister for Magic, Cornelius Fudge, appoints a new Defense Against the Dark Arts teacher to keep watch over Dumbledore and the Hogwarts students. But Professor Dolores Umbridge's Ministry-approved course of defensive magic leaves the young wizards woefully unprepared to defend themselves against the dark forces threatening them and the entire wizarding community, so at the prompting of his friends Hermione and Ron, Harry takes matters into his own hands. Meeting secretly with a small group of students who name themselves \"Dumbledore’s Army,\" Harry teaches them how to defend themselves against the Dark Arts, preparing the courageous young wizards for the extraordinary battle that lies ahead. With the ability to play multiple characters, including Harry Potter, Dumbledore and Sirius Black, the videogame of Harry Potter and the Order of the Phoenix offers fans the opportunity to wield a wand, explore all around Hogwarts, and experience one of the most exciting and dangerous years in the life of the Boy Who Lived. [Electronic Arts / Warner Bros.]… Expand"}, {"name": "Way of the Passive Fist", "details_link": "https://www.metacritic.com/game/xbox-one/way-of-the-passive-fist", "publisher": "Household Games Inc.", "release_date": "Mar  7 2018", "developers": ["Household Games Inc."], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/f1fb0b028cdc003550c87bf52e604dde-98.jpg", "descriptions": "A mysterious figure known only as the Wanderer travels across the distant planet of Zircon V, a once prosperous mining colony that is now on the brink of destruction in the face of its dying star."}, {"name": "Infinite Crisis", "details_link": "https://www.metacritic.com/game/pc/infinite-crisis", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Mar 26 2015", "developers": ["Turbine Inc."], "platforms": "PC", "genres": ["MOBA", "Strategy", "Real-Time", "MOBA"], "meta_score": 68, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/d351b034729d0160c8e3239e31c47992-98.jpg", "descriptions": "Infinite Crisis is a new entrant into the MOBA genre that delivers a competitive player vs. player battle experience set in the legendary DC Multiverse - a world in which familiar DC Comics characters have been reimagined in startling ways.  Featuring a wide variety of DC Comics heroes andInfinite Crisis is a new entrant into the MOBA genre that delivers a competitive player vs. player battle experience set in the legendary DC Multiverse - a world in which familiar DC Comics characters have been reimagined in startling ways.  Featuring a wide variety of DC Comics heroes and villains, Infinite Crisis puts players in control of twisted incarnations of their characters throughout the Multiverse such as Nightmare Batman and Gaslight Catwoman, playing in league with  characters including Green Lantern and The Flash. … Expand"}, {"name": "Lost Planet 2", "details_link": "https://www.metacritic.com/game/playstation-3/lost-planet-2", "publisher": "Capcom", "release_date": "May 11 2010", "developers": ["Capcom"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/c7f0955d554c52dfa6ef51fb6396eacf-98.jpg", "descriptions": "Lost Planet 2 picks up 10 years since the events of the original adventure and the landscape has evolved dramatically. With the success of terraforming activities, the planet's ice has begun to melt, giving way to lush tropical jungles and other new environments. The story has advancedLost Planet 2 picks up 10 years since the events of the original adventure and the landscape has evolved dramatically. With the success of terraforming activities, the planet's ice has begun to melt, giving way to lush tropical jungles and other new environments. The story has advanced beyond Wayne Holden as players now follow the exploits of their own customized snow pirates on their quest to seize control of E.D.N III. Players move their heroes through different stories creating a truly unique and interactive experience. With this concept, gamers have the opportunity to engage in the story in a more dynamic way as plot threads evolve from various perspectives. The strongest features from the first game returns in Lost Planet 2 making fans feel right at home. In addition to the anchor actions that made the gameplay in Lost Planet a true 3-D experience, Lost Planet 2 allows gamers to gain tactical advantage with a wide variety of new actions. The game also contains a new addition to the enormous Akrids which were a fan-favourite in the first Lost Planet. Beyond the deep single player mode, Lost Planet 2 is loaded with one the most extensive multiplayer campaign seen in a shooter to date. The intense and action packed campaign mode comes with the ability to form teams of up to 4 players online to clear mission objectives with friends. [Capcom]… Expand"}, {"name": "Pure Pinball", "details_link": "https://www.metacritic.com/game/xbox/pure-pinball", "publisher": "XS Games", "release_date": "Aug  5 2004", "developers": ["Iridon Interactive AB"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Miscellaneous", "Parlor", "Pinball"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/32bfa017c9a723a44964c279cfd0d709-98.jpg", "descriptions": "Pure Pinball tests your pinball skills across more than 30 challenges and missions, which span four table layouts inspired by authentic American pinball designs. From the Old West to space, each table layout provides different challenges. You can view the tables in a variety of cameraPure Pinball tests your pinball skills across more than 30 challenges and missions, which span four table layouts inspired by authentic American pinball designs. From the Old West to space, each table layout provides different challenges. You can view the tables in a variety of camera setups, including a complete overview, a close-up on the ball, a traditional scrolling style, or even a setup that lets you follow the ball using a \"ball-cam.\" Share your high scores on Xbox Live with other players from around the world to prove that you're a true pinball wizard.… Expand"}, {"name": "QuickSpot", "details_link": "https://www.metacritic.com/game/ds/quickspot", "publisher": "Namco Bandai Games America", "release_date": "Mar 19 2007", "developers": ["Namco"], "platforms": "DS", "num_players": "4  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Hidden Object", "General", "Puzzle", "General"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/9836244b8046496ca02a799749e36519-98.jpg", "descriptions": "Focus. Be Quick. Spot the difference. The objective is simple. Draw a circle around what is different between two seemingly identical pictures. It is not as easy as you think. QuickSpot will have you drawing circles, rubbing and even blowing on your screen to spot differences in hundreds ofFocus. Be Quick. Spot the difference. The objective is simple. Draw a circle around what is different between two seemingly identical pictures. It is not as easy as you think. QuickSpot will have you drawing circles, rubbing and even blowing on your screen to spot differences in hundreds of pictures. Test your concentration skills and see if you can find multiple differences in seconds. Play anytime and anywhere with your friends and see whose brain is sharper. Singleplayer Modes: Rapid Play - In a series of pictures, quickly find the difference in 10 seconds or less to advance to the next stage; Focus Play – Take your time to carefully find multiple differences in a single picture; Brain Activity - Test your intuition, concentration, recognition and other activities to see how your brain measures up. Multiplayer Modes: Time Bomb – spot the difference and pass a single DS around like 'hot potato' to your friends before the time bomb explodes; Scramble – with multiple DS systems using Wi-Fi and a single DS Card, annoy and disrupt your friend’s game by changing the color of their screen or even filling it with frogs. [Namco Bandai Games]… Expand"}, {"name": "Deadly Premonition", "details_link": "https://www.metacritic.com/game/xbox-360/deadly-premonition", "publisher": "Ignition Entertainment", "release_date": "Feb 17 2010", "developers": ["Access Games"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Open-World"], "meta_score": 68, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/6949fdcae6bb11cd19e228a1d283cc2b-98.jpg", "descriptions": "A third-person survival horror action game which puts you in the role of FBI Agent Francis York Morgan. In the process of investigating a murder, you will examine a series of interlocking mysteries in a remote rural town and will encounter an array of complex characters pivotal to theA third-person survival horror action game which puts you in the role of FBI Agent Francis York Morgan. In the process of investigating a murder, you will examine a series of interlocking mysteries in a remote rural town and will encounter an array of complex characters pivotal to the unraveling of the storyline’s mystery. Suspenseful action sequences will force you to make strategic moves, gliding by enemies in the shadows or engaging them with long-range weapons or hand-to-hand melee combat. Amidst a backdrop of soaring mountains and a town filled with eccentric natives, Agent Morgan must solve the mystery of the ‘Red Seed Murders’ and stay alive in a place where supernatural creatures and a folklore killer seek to end his investigation permanently.… Expand"}, {"name": "AiRace Speed", "details_link": "https://www.metacritic.com/game/3ds/airace-speed", "publisher": "QubicGames", "release_date": "Sep 19 2013", "developers": ["QubicGames"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Arcade", "Futuristic", "Futuristic"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/88f6f47f61cac04f06a7846b92c1b170-98.jpg", "descriptions": "Take the challenge in AiRace Speed, the third sequel of the best-selling Nintendo DSi classic - AiRace, and pilot the most advanced and powerful jets as you compete to beat your best time. Experience the action as you race on stunning high-speed tracks featuring extremely difficult tunnels,Take the challenge in AiRace Speed, the third sequel of the best-selling Nintendo DSi classic - AiRace, and pilot the most advanced and powerful jets as you compete to beat your best time. Experience the action as you race on stunning high-speed tracks featuring extremely difficult tunnels, spectacular halls and hidden shortcuts.… Expand"}]