[{"name": "Fort Triumph", "details_link": "https://www.metacritic.com/game/pc/fort-triumph", "publisher": "Fort Triumph LTD", "release_date": "Apr 16 2020", "developers": ["Fort Triumph LTD"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Strategy", "Turn-Based", "Tactics"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/3551103eb7f7abc80830846360d3898c-98.jpg", "descriptions": "Fort Triumph is a tactical RPG emphasizing the use of Environmental Interactions to create rich, challenging and rewarding tactical gameplay. In the game, you command a party of chosen heroes who set out to change the world, one quest at a time."}, {"name": "Sky Force Reloaded", "details_link": "https://www.metacritic.com/game/playstation-4/sky-force-reloaded", "publisher": "Infinite Dreams", "release_date": "Nov 28 2017", "developers": ["Infinite Dreams", "Infinite Dreams Inc."], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/b60234747af3803a72fbc0c8bdfbb5b1-98.jpg", "descriptions": "The best mobile shooter is now ready to rock your iPhone!Sky Force Reloaded is an award winning and highly acclaimed vertical shooter. It features 3d interactive objects, outstanding graphics, special effects, high quality soundtrack and 100% of pure gameplay.Ever wanted to play a goodThe best mobile shooter is now ready to rock your iPhone!Sky Force Reloaded is an award winning and highly acclaimed vertical shooter. It features 3d interactive objects, outstanding graphics, special effects, high quality soundtrack and 100% of pure gameplay.Ever wanted to play a good arcade vertical shooter? This one is for you!----------------------------------------------PRESS:IGN Review:9.5/10 - Force your friend to buy this one.AppSmile.com5/5 - With its recent introduction into the App Store, Sky Force Reloaded (or perhaps re-Reloaded) is a title no arcade junkie should miss.PocketGamer:10/10 - Graphically, Sky Force: Reloaded is stunning. The whole game screams quality.PocketPlayers.deOne of the best, if not THE best shooters!----------------------------------------------FEATURES:- 8 large levels- plenty of enemies,- interactive environment elements*- upgradable weapons- dynamic weather (rain, clouds, wind)- highscoresRecommended for fans of Raiden, 1942, 1945, iFighter, Siberian Strike… Expand"}, {"name": "Tachyon Project", "details_link": "https://www.metacritic.com/game/xbox-one/tachyon-project", "publisher": "Eclipse Games", "release_date": "Jul 15 2015", "developers": ["Eclipse Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 74, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/bc52353f7c2f31a9f0076a0301e109f5-98.jpg", "descriptions": "In Tachyon Project you take control of Ada, a software program that has taken conscience and that was designed to hack into the most secure servers on Earth. After some rather mysterious events, Ada is thrown out of the test server where it was living and out into the Internet, but when sheIn Tachyon Project you take control of Ada, a software program that has taken conscience and that was designed to hack into the most secure servers on Earth. After some rather mysterious events, Ada is thrown out of the test server where it was living and out into the Internet, but when she tries to go back there she finds she's unable to. She'll then start a journey to uncover the truth behind what happened to her creators, which she considers her parents. In the process she'll find out that things were a bit more complex than she initially thought. Tachyon Project is a dual stick shooter where we've taken concepts from the classic shoot'em up genre and tried to adapt them to the dual stick shooter genre. In Tachyon Project the player will find the gameplay versatility and speed traditional to dual stick shooters but with the variability in weapons and enemies that you usually find in shoot'em ups. The variety of weapons, secondary weapons and perks allow for hundreds of combinations for your ship. [Eclipse Games]… Expand"}, {"name": "Oceanhorn: Monster of Uncharted Seas", "details_link": "https://www.metacritic.com/game/pc/oceanhorn-monster-of-uncharted-seas", "publisher": "Cornfox & Bros.", "release_date": "Mar 17 2015", "developers": ["Cornfox & Bros."], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/e58820c9959ef2011a4f74933105b2b0-98.jpg", "descriptions": "Oceanhorn: Monster of Uncharted Seas melds provocative storytelling, 3D visuals and gameplay into one epic action-adventure experience. In the game you explore the islands of Uncharted Seas, a world chock full of dangers, puzzles and secrets."}, {"name": "F.E.A.R. 3", "details_link": "https://www.metacritic.com/game/playstation-3/fear-3", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 21 2011", "developers": ["Day 1 Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Modern", "Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/ad545c42ae2dd2132054c6d3a5c0dfc6-98.jpg", "descriptions": "Alma returns in F.E.A.R. 3 but this time her sons Point Man and Paxton Fettel introduce divergent co-op, giving players distinctly different abilities affecting their own play as well as the experience of their co-op partner. Gamers participate in single player or co-op modes as Point Man, aAlma returns in F.E.A.R. 3 but this time her sons Point Man and Paxton Fettel introduce divergent co-op, giving players distinctly different abilities affecting their own play as well as the experience of their co-op partner. Gamers participate in single player or co-op modes as Point Man, a genetically enhanced super soldier originally introduced in F.E.A.R., or they can play cooperatively as his conniving brother Paxton Fettel, whose incredible telekinetic power has given him life beyond the grave.… Expand"}, {"name": "The Dark Pictures Anthology: House of Ashes", "details_link": "https://www.metacritic.com/game/xbox-series-x/the-dark-pictures-anthology-house-of-ashes", "publisher": "Bandai Namco Games", "release_date": "Oct 22 2021", "developers": ["Supermassive Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "2 ", "genres": ["Action Adventure", "Survival"], "meta_score": 74, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/e09026e1ad28cda888543f5a04334543-98.jpg", "descriptions": "From the creators of Until DawnSwitch between the perspective of 5 playable characters - All can live or die in your version of the story\n\nMultiple ways to play including 2 player online coop mode\n\nHugely branching storyline that changes based on the decisions you make\n\nEach game in TheFrom the creators of Until DawnSwitch between the perspective of 5 playable characters - All can live or die in your version of the storyMultiple ways to play including 2 player online coop modeHugely branching storyline that changes based on the decisions you makeEach game in The Dark Pictures Anthology is a complete and original story in its own rightTHREE WAYS TO PLAYIntroducing multiplayer to The Dark Pictures Anthology! 1. SOLO STORYThe complete terrifying story as a single player experience 2. MOVIE NIGHT MODEYou and up to 4 friends will play the story together on the couch, each controlling a different characterAnd:3. SHARED STORY2 player online co-operative mode. Play the whole story online with a friend, making choices that affect you both.… Expand"}, {"name": "Unplugged (Vertigo Games)", "details_link": "https://www.metacritic.com/game/pc/unplugged-vertigo-games", "publisher": "Koch Media", "release_date": "Oct 21 2021", "developers": ["Vertigo Games"], "platforms": "PC", "genres": ["Action", "Rhythm", "Music"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/77d9c230390915e4239471ea09069cf8-98.jpg", "descriptions": "Play air guitar and write rock history in VR! Unplugged lets you rock out hard to some of the biggest rock songs, including The Offspring, Weezer & Ozzy Osbourne, using just your hands. Become a rock legend with Steel Panther’s Satchel as your mentor. Are you ready to ROCK?!"}, {"name": "Giana Sisters: Twisted Dreams - Owltimate Edition", "details_link": "https://www.metacritic.com/game/switch/giana-sisters-twisted-dreams---owltimate-edition", "publisher": "Black Forest Games", "release_date": "Sep 25 2018", "developers": ["Black Forest Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/603c8ac3c50ed59d5157934c5d7bd60c-98.jpg", "descriptions": "Dash through tricky levels and transform the whole world at will in this fast-paced award-winning platformer. Giana Sisters: Twisted Dreams  Directors Cut combines graphics that pack a visual punch and tight controls with the challenge of retro era platforming. Fluidly morph between twoDash through tricky levels and transform the whole world at will in this fast-paced award-winning platformer. Giana Sisters: Twisted Dreams  Directors Cut combines graphics that pack a visual punch and tight controls with the challenge of retro era platforming. Fluidly morph between two dynamically different dream worlds to solve puzzles and combat grueling enemies and bosses. Key Features\r-Blaze through 33 levels including a brand new Rise of the Owlverlord adventure.\r-Each level transforms between two contrasting dreamworlds!\r-Easy and hard difficulty modes for all levels and bosses.\r-Intuitive controls and smooth game flow; master the tight controls and defeat the devious trials ahead.\r-Full HD 1080p with a smooth framerate: Gianas dreamworlds leap off the screen with gorgeous 3D graphics that morph before your very eyes.\r-Experience a dual crossfading soundtrack by Chris Huelsbeck and Machinae Supremacy.\r-Rich extras: Halloween- and Christmas-themed levels accessible from the start.\rThe downloadable version of this game supports English, French, Italian, German, Spanish, Polish, Russian, Japanese.… Expand"}, {"name": "Wolfenstein", "details_link": "https://www.metacritic.com/game/pc/wolfenstein", "publisher": "Activision", "release_date": "Aug 18 2009", "developers": ["id Software", "Raven Software"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/ac4bc39f0be7807c70bae06c3daecdeb-98.jpg", "descriptions": "Set within a near-fictional, historical WWII setting, players take on the role of the heroic OSA agent BJ Blazkowicz as they are thrust into the unknown and unexpected to battle against combat troops, otherworldly forces, and the dark science created by a supernatural Nazi force hell-bent onSet within a near-fictional, historical WWII setting, players take on the role of the heroic OSA agent BJ Blazkowicz as they are thrust into the unknown and unexpected to battle against combat troops, otherworldly forces, and the dark science created by a supernatural Nazi force hell-bent on world domination.  Wolfenstein offers players an action-packed experience as they investigate the powers of a dark parallel dimension, join with resistance forces, and employ an arsenal of conventional and otherworldly weapons in attempts to annihilate the Nazi war machine. Ensuring a deep variety of action, Wolfenstein provides gamers with an assortment of interlinked missions that drive an intense, story-driven combat experience; while the Wolfenstein multiplayer experience continues the world-renowned tradition of class-based team objective gameplay with a full arsenal of conventional and supernatural weapons for addictive online warfare. [Activision]… Expand"}, {"name": "The Lord of the Rings: The Third Age", "details_link": "https://www.metacritic.com/game/gamecube/the-lord-of-the-rings-the-third-age", "publisher": "EA Games", "release_date": "Nov  2 2004", "developers": ["EA Games"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "In The Lord of the Rings: The Third Age, you can travel in the wake of the Fellowship while exploring your own path and periodically intersecting the major events of the film trilogy. Through both familiar and new locations, you must fight to save or destroy Middle-earth in an epicIn The Lord of the Rings: The Third Age, you can travel in the wake of the Fellowship while exploring your own path and periodically intersecting the major events of the film trilogy. Through both familiar and new locations, you must fight to save or destroy Middle-earth in an epic adventure. Encounter the demonic Balrog in the Mines of Moria, defend the fallen city of Osgiliath, or try to destroy Helm's Deep. These choices and many more will confront you as you align yourself with the people of Middle-earth or undertake missions on behalf of Sauron.… Expand"}, {"name": "Amplitude", "details_link": "https://www.metacritic.com/game/playstation-4/amplitude", "publisher": "Harmonix Music Systems", "release_date": "Jan  5 2016", "developers": ["Harmonix Music Systems"], "platforms": ["PlayStation 3", "PlayStation 4"], "genres": ["Miscellaneous", "Action", "Rhythm", "Music"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/f7edfd74fc88bbeb2c2bee1fc1cbe871-98.jpg", "descriptions": "Amplitude features over twenty songs composed for an optimal beatmatching experience by Harmonix with contributions from Freezepop, Danny B, Jim Guthrie, and more. Many of the developers from the original game worked on this reboot."}, {"name": "Just Dance 2", "details_link": "https://www.metacritic.com/game/wii/just-dance-2", "publisher": "Ubisoft", "release_date": "Oct 12 2010", "developers": ["Ubisoft"], "platforms": "Wii", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/5ff09bd5f844c7664049789872d5860d-98.jpg", "descriptions": "The sequel to last year's hit dance party game returns."}, {"name": "The Secret World", "details_link": "https://www.metacritic.com/game/pc/the-secret-world", "publisher": "Electronic Arts", "release_date": "Jul  3 2012", "developers": ["Funcom"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Modern", "Modern"], "meta_score": 74, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/33a3df1c7275373908c968aa31a27145-98.jpg", "descriptions": "The Secret World is a massively multiplayer online role–playing game. Taking place on our earth, in our times, The Secret World is inspired by history and mythology, modern conspiracy theories and ancient mysteries. For there really is a world within ours, a secret world, where magic exists,The Secret World is a massively multiplayer online role–playing game. Taking place on our earth, in our times, The Secret World is inspired by history and mythology, modern conspiracy theories and ancient mysteries. For there really is a world within ours, a secret world, where magic exists, monsters roam and ancient forces are fighting for the dominance of earth. It is a world of legendary stories, ageless conflicts and powerful cabals. In this world, even modern cities hide secrets. In this world, players can take part in the greatest conspiracies of our age, and battle the forces of darkness across the world and throughout time. [Funcom]… Expand"}, {"name": "Army of Two: The 40th Day", "details_link": "https://www.metacritic.com/game/playstation-3/army-of-two-the-40th-day", "publisher": "Electronic Arts", "release_date": "Jan 12 2010", "developers": ["EA Montreal"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/333fb8ab64c90fffe1751fe226696ed3-98.jpg", "descriptions": "When a disaster of epic proportions strikes Shanghai, China, Rios and Salem find themselves right in the middle of it all - the wrong place, the wrong time, but the right team. A carefully orchestrated series of mysterious catastrophes is dragging Shanghai to the brink of ruin, and now theWhen a disaster of epic proportions strikes Shanghai, China, Rios and Salem find themselves right in the middle of it all - the wrong place, the wrong time, but the right team. A carefully orchestrated series of mysterious catastrophes is dragging Shanghai to the brink of ruin, and now the Army of Two must fight their way through ravaged city districts as they try to beat the odds and uncover the secret of the 40th Day. ARMY OF TWO: THE 40th DAY features a bigger playbook of new co-op moves that either player can use at any time, opening up new strategies and countless choices for both players. The result is a bigger, better, more organic and immersive co-op experience that lets gamers put their best two-man tactics to use whenever and wherever they want. [Electronic Arts]… Expand"}, {"name": "Sonic Chronicles: The Dark Brotherhood", "details_link": "https://www.metacritic.com/game/ds/sonic-chronicles-the-dark-brotherhood", "publisher": "Sega", "release_date": "Sep 30 2008", "developers": ["BioWare"], "platforms": "DS", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 74, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/e0e59645d12d98ac8b3e20f799d93305-98.jpg", "descriptions": "Sonic and friends have banded together with leading RPG developer BioWare to create a stylish blend of strategy and speed for Sonic's first RPG, Sonic Chronicles: The Dark Brotherhood. The game mixes a rich story, hand-painted visuals, fast-paced team combat, and wireless collectible tradingSonic and friends have banded together with leading RPG developer BioWare to create a stylish blend of strategy and speed for Sonic's first RPG, Sonic Chronicles: The Dark Brotherhood. The game mixes a rich story, hand-painted visuals, fast-paced team combat, and wireless collectible trading into a uniquely compelling adventure. Players customize their party and characters, choosing from Sonic, Tails, Amy Rose, Knuckles,Shadow, Rouge, and more, and prepare to defeat a menacing new enemy. Rhythmically tapping anddragging with the stylus in Sonic-style battles, players level up and use Rings to buy new specialattacks as they progress through 20 different and beautifully hand-drawn areas including new andclassic Sonic locales. With an engaging storyline, lightning fast attacks, high production values, and impeccable visuals, Sonic Chronicles allows gamers to experience Sonic in a whole new way. [Sega]… Expand"}, {"name": "Soul Hackers 2", "details_link": "https://www.metacritic.com/game/playstation-5/soul-hackers-2", "publisher": "Sega", "release_date": "Aug 24 2022", "developers": ["Atlus"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/49379b0942fabf8a9a3f9795d5583abb-98.jpg", "descriptions": "Explore a supernatural RPG with stylish summoners and dark dangers lurking under the neon lights of a cyberpunk Japan. It is up to Ringo, an agent of Aion, to save the world from apocalypse."}, {"name": "Guilty Gear XX Accent Core Plus", "details_link": "https://www.metacritic.com/game/xbox-360/guilty-gear-xx-accent-core-plus", "publisher": "Arc System Works", "release_date": "Oct 24 2012", "developers": ["Arc System Works"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 74, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/893ad4d6933cf4b78803b94ecca4c369-98.jpg", "descriptions": "Network Battle Mode is now available on Xbox LIVE Arcade for the all new GUILTY GEAR XX ΛCORE PLUS from the best-selling 2D fighting game series. It all started from Story Mode, and now there's a wide variety of Modes to play. Choose from among 25 fighters and engage in high-speed combat."}, {"name": "SOCOM: U.S. Navy SEALs Fireteam Bravo 3", "details_link": "https://www.metacritic.com/game/psp/socom-us-navy-seals-fireteam-bravo-3", "publisher": "SCEA", "release_date": "Feb 16 2010", "developers": ["Slant Six"], "platforms": "PSP", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/891c0e3b779456b79fcc489343ab877c-98.jpg", "descriptions": "Lead a fireteam of friends on an action-packed military hunt for weapons of mass destruction and an ex-KGB agent in SOCOM U.S. Navy SEALs: Fireteam Bravo 3. SOCOM: Fireteam Bravo 3 lets you join forces with like-minded players to tackle an adventure of realistic military action, tactics andLead a fireteam of friends on an action-packed military hunt for weapons of mass destruction and an ex-KGB agent in SOCOM U.S. Navy SEALs: Fireteam Bravo 3. SOCOM: Fireteam Bravo 3 lets you join forces with like-minded players to tackle an adventure of realistic military action, tactics and teamwork wherever and whenever you want. Created with the support of the U.S. Naval Special Warfare Command, the SOCOM series is renowned for its real-world situations and attention to detail. Join the ominous world of ex-secret operatives as you lead a special operation to track and interrogate former KGB agent, Alexander Gozorov who is believed to be withholding information on a forthcoming attack with weapons of mass destruction. It's up to you and your squad to track Gozorov in a series of customisable missions, using your skills, stealth and swift thinking. While the SOCOM name has long been synonymous with multiplayer tactical gaming, SOCOM U.S. Navy SEALs: Fireteam Bravo 3 takes it a step further allowing players to choose which mission to attempt and tackle with teamwork and firepower. Players can also compete online, communicate via voice chat, battling for Medals and a place on SOCOM's online leaderboards. With an extensive and realistic single-player mode as well, the action in SOCOM U.S. Navy Seals: Fireteam Bravo 3 never ends. [SCEA]… Expand"}, {"name": "Bomberman Land Touch! 2", "details_link": "https://www.metacritic.com/game/ds/bomberman-land-touch!-2", "publisher": "Hudson Entertainment", "release_date": "Jan 29 2008", "developers": ["Hudson Soft"], "platforms": "DS", "num_players": "8  Online", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "General", "Action"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/36583f44f881cf79e69523d7a69e2042-98.jpg", "descriptions": "Bomberman Land Touch! 2 brings together 3 exciting game modes into one. The series introduces a bevy of mini-games, where most can be played in multiplayer mode. The PSP system and the DS versions both allow gamers to share one game cartridge and network with friends to create the ultimateBomberman Land Touch! 2 brings together 3 exciting game modes into one. The series introduces a bevy of mini-games, where most can be played in multiplayer mode. The PSP system and the DS versions both allow gamers to share one game cartridge and network with friends to create the ultimate party game. [Hudson Soft]… Expand"}, {"name": "Gran Turismo: The Real Driving Simulator", "details_link": "https://www.metacritic.com/game/psp/gran-turismo-the-real-driving-simulator", "publisher": "SCEA", "release_date": "Sep 30 2009", "developers": ["Polyphony Digital"], "platforms": "PSP", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/f0b22bb7e55cf1f3c68f9a54409512bf-98.jpg", "descriptions": "Gran Turismo makes its highly anticipated debut exclusively on the PSP system, introducing the most ultra-realistic racing experience ever on a handheld. Buckle up as you prove your driving skills on 35 tracks and trade and share over 800 cars. Slick Visuals --Runs on a new graphics engineGran Turismo makes its highly anticipated debut exclusively on the PSP system, introducing the most ultra-realistic racing experience ever on a handheld. Buckle up as you prove your driving skills on 35 tracks and trade and share over 800 cars. Slick Visuals --Runs on a new graphics engine designed for the PSP system that delivers visuals at a crisp 60 frames per second. Depth and Variety -- Collect over 800 licensed vehicles from international automakers. Expand Your Collection -- Trade and share cars with friends to expand your collection via Ad Hoc wireless. Hit the Road -- Race on 35 licensed and fictional tracks, with 60 track layouts total. Compete in time trials, races, or drift mode challenges. Test Your Driving Skills -- Complete over 100 challenges to hone your driving skills and learn new cornering, braking and other driving techniques. Bragging Rights -- Prove your driving skills in four-player races using Ad Hoc mode. [SCEA]… Expand"}, {"name": "The Dark Pictures Anthology: House of Ashes", "details_link": "https://www.metacritic.com/game/playstation-4/the-dark-pictures-anthology-house-of-ashes", "publisher": "Bandai Namco Games", "release_date": "Oct 22 2021", "developers": ["Supermassive Games"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "Survival"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/e8448455ee1f5973e5001567090de8d9-98.jpg", "descriptions": "From the creators of Until Dawn\r Switch between the perspective of 5 playable characters - All can live or die in your version of the story\r\n\r\nMultiple ways to play including 2 player online coop mode\r\n\r\nHugely branching storyline that changes based on the decisions you make\r\n\r\nEach gameFrom the creators of Until Dawn\r Switch between the perspective of 5 playable characters - All can live or die in your version of the story\r Multiple ways to play including 2 player online coop mode\r Hugely branching storyline that changes based on the decisions you make\r Each game in The Dark Pictures Anthology is a complete and original story in its own right\r THREE WAYS TO PLAY\rIntroducing multiplayer to The Dark Pictures Anthology! \r\r1. SOLO STORY\rThe complete terrifying story as a single player experience \r\r2. MOVIE NIGHT MODE\rYou and up to 4 friends will play the story together on the couch, each controlling a different character\r And:\r 3. SHARED STORY\r2 player online co-operative mode. Play the whole story online with a friend, making choices that affect you both.… Expand"}, {"name": "Yesterday Origins", "details_link": "https://www.metacritic.com/game/pc/yesterday-origins", "publisher": "Microids", "release_date": "Nov 10 2016", "developers": ["Pendulo Studios"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/6c13de6245c25f9e0054c324ffded968-98.jpg", "descriptions": "In Yesterday Origins, the main protagonists John Yesterday and his partner Pauline, immortals who own an antiques store in Paris, travel across the globe through multiple periods. The story takes place across the current and medieval eras, through a series of flashbacks. At the beginning ofIn Yesterday Origins, the main protagonists John Yesterday and his partner Pauline, immortals who own an antiques store in Paris, travel across the globe through multiple periods. The story takes place across the current and medieval eras, through a series of flashbacks. At the beginning of the game, a young John is imprisoned by the Spanish Inquisition for witchcraft, just prior to the sequence of events that will change his life/lives forever. Although not yet able to resurrect at that point of his life, he has already attracted the attention and fallen foul of Church authorities due to his unusual ability to understand and speak every language he encounters.… Expand"}, {"name": "Luigi's Mansion", "details_link": "https://www.metacritic.com/game/3ds/luigis-mansion", "publisher": "Nintendo", "release_date": "Oct 12 2018", "developers": ["Nintendo", "GREZZO"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/64fa62e7fc49d20c7135b8c2d87c1d2f-98.jpg", "descriptions": "Luigi steps out from the shadow of his brother Mario and into the gloomy shadows of a very haunted house in this, his first-ever starring role.  Armed with a flashlight and a customized vacuum cleaner, Luigi must rid the mansion of Boos and ghouls--and find his missing brother to boot.  AsLuigi steps out from the shadow of his brother Mario and into the gloomy shadows of a very haunted house in this, his first-ever starring role.  Armed with a flashlight and a customized vacuum cleaner, Luigi must rid the mansion of Boos and ghouls--and find his missing brother to boot.  As Luigi, you'll search for the keys that open the many locked doors; vacuum coins, cash, and gold bars; and explore vases, bookcases, and drawers.  From the brick-walled basement to the gloomy grounds, Luigi's Mansion is packed with chills, thrills, and creepy surprises.… Expand"}, {"name": "Zeno Clash: Ultimate Edition", "details_link": "https://www.metacritic.com/game/xbox-360/zeno-clash-ultimate-edition", "publisher": "Atlus", "release_date": "May  5 2010", "developers": ["ACE Team"], "platforms": "Xbox 360", "num_players": "2 ", "genres": ["Action", "Shooter", "Shooter", "Beat-'Em-Up", "First-Person", "3D", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/5f525372b925b010f5aed919016ab782-98.jpg", "descriptions": "[Xbox Live Arcade]  In the land of Zenozoik, the city of Halstedom is ruled by a powerful clan, one which Ghat has betrayed by killing Father-Mother, the clan's leader. As Ghat, fight your way through your former brothers and sisters, crazed individualists, and worse in order to escape in[Xbox Live Arcade]  In the land of Zenozoik, the city of Halstedom is ruled by a powerful clan, one which Ghat has betrayed by killing Father-Mother, the clan's leader. As Ghat, fight your way through your former brothers and sisters, crazed individualists, and worse in order to escape in the unique first-person puncher Zeno Clash: Ultimate Edition. The bare-knuckled brawl to reach the truth has just begun. [Ace Team]… Expand"}, {"name": "Assassin's Creed Rogue", "details_link": "https://www.metacritic.com/game/pc/assassins-creed-rogue", "publisher": "Ubisoft", "release_date": "Mar  9 2015", "developers": ["Ubisoft", "Ubisoft Sofia"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Historic", "Action Adventure", "Open-World"], "meta_score": 74, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/d81f93c5f28fec8a188001775bf947d4-98.jpg", "descriptions": "18th century, North America. Within the chaos and violence of the French and Indian War, Shay Patrick Cormac, a courageous member of the Brotherhood of Assassin’s, undergoes a dark transformation that forever shapes the future of the American colonies. After a perilous mission gone18th century, North America. Within the chaos and violence of the French and Indian War, Shay Patrick Cormac, a courageous member of the Brotherhood of Assassin’s, undergoes a dark transformation that forever shapes the future of the American colonies. After a perilous mission gone tragically wrong, Shay turns his back on the Assassins who, in response, attempt to kill him. Spurned by those he once called brothers, Shay sets out on a mission to wipe out all who turned against him and ultimately become the most feared Assassin hunter in history. … Expand"}, {"name": "Pathfinder: Kingmaker - Definitive Edition", "details_link": "https://www.metacritic.com/game/playstation-4/pathfinder-kingmaker---definitive-edition", "publisher": "THQ Nordic", "release_date": "Aug 18 2020", "developers": ["Owlcat Games"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Western-Style"], "meta_score": 74, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/3/9d539feaf8bd906ed4561c21c8d9a6a3-98.jpg", "descriptions": "Pathfinder: Kingmaker is the first single-player isometric CRPG set in the world of a top-selling D&D type role-playing game by Paizo. Being a tribute to such classics as Baldur's Gate and Neverwinter Nights, it brings back memories of beloved gameplay mechanics and embarks the player on aPathfinder: Kingmaker is the first single-player isometric CRPG set in the world of a top-selling D&D type role-playing game by Paizo. Being a tribute to such classics as Baldur's Gate and Neverwinter Nights, it brings back memories of beloved gameplay mechanics and embarks the player on a hand-crafted, story-driven adventure. Become introduced to the rich universe of Pathfinder as a newcomer or explore famous locations familiar to any fan of the original tabletop game. Walk your path through the legendary Stolen Lands and meet iconic characters, ready to accompany you on your arduous journey. Gather the perfect party, dive into a great variety of dungeons, and defeat some of the deadliest creatures this world has ever seen. Witness how your decisions affect the environment and the people inhabiting it.Establish your kingdom to bring peace, hope, and prosperity to the land or take everything for yourself and drive it into darkness. The choice is only yours! THE MAJOR FEATURES:COMPANION FOCUSED STORYExperience the adventure alongside living and breathing companions, each with deep stories and decisions of their own. Love them, adore them or hate them for who they are.CHARACTER DEVELOPMENTCustomize your character and companions with a multitude of options available in Pathfinder to make the perfect party capable of overcoming insurmountable challenges.KINGDOMEstablish your kingdom in Stolen Lands, claim new territories, and build towns and cities. Be a wise ruler or a heavy-handed tyrant.… Expand"}, {"name": "Pikuniku", "details_link": "https://www.metacritic.com/game/pc/pikuniku", "publisher": "Devolver Digital", "release_date": "Jan 24 2019", "developers": ["Sectordub"], "platforms": ["Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/23dce192dacaaa66a9e3e475522fc842-98.jpg", "descriptions": "Pikuniku is a puzzle-exploration game that takes place in a strange but playful world where not everything is as happy as it seems. Help peculiar characters overcome struggles, uncover a deep state conspiracy, and start a fun little revolution in this delightful dystopian adventure."}, {"name": "Action Henk", "details_link": "https://www.metacritic.com/game/pc/action-henk", "publisher": "RageSquid", "release_date": "May 11 2015", "developers": ["RageSquid"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Platformer", "2D", "3D"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/e378cea4a1bbc546cf068c00ed1e5b36-98.jpg", "descriptions": "Become a master of momentum and defy physics as you race against a band of ragged 90s action figures to once and for all prove that Action Henk is the fastest of them all."}, {"name": "IL-2 Sturmovik: Battle of Stalingrad", "details_link": "https://www.metacritic.com/game/pc/il-2-sturmovik-battle-of-stalingrad", "publisher": "Excalibur Publishing Limited", "release_date": "Aug 14 2014", "developers": ["1C Game Studios"], "platforms": "PC", "genres": ["WWI", "Simulation", "Flight", "WWII", "Combat"], "meta_score": 74, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/bec53616bcea2deb69f033fcdfbbeb9e-98.jpg", "descriptions": "IL-2 Sturmovik: Battle of Stalingrad is the continuation of the legendary IL-2 Sturmovik series that has set the standard for PC combat flight games for more than ten years. This new entry into the series offers virtual pilots an even more accurate simulation of the most famous air battlesIL-2 Sturmovik: Battle of Stalingrad is the continuation of the legendary IL-2 Sturmovik series that has set the standard for PC combat flight games for more than ten years. This new entry into the series offers virtual pilots an even more accurate simulation of the most famous air battles of World War II. … Expand"}, {"name": "Cloud Chamber", "details_link": "https://www.metacritic.com/game/pc/cloud-chamber", "publisher": "Investigate North Aps", "release_date": "Aug  7 2014", "developers": ["Investigate North Aps"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Miscellaneous", "Adventure", "General", "Massively Multiplayer", "Application"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/3c0a291b1f4936af71fb2716d02e1b2c-98.jpg", "descriptions": "Navigate a strange 3D database and work with other players to determine what happened when a secret signal from another appears. Discuss your way through fragments of found footage films, journals and documentary clips about space."}, {"name": "UEFA Euro 2004: Portugal", "details_link": "https://www.metacritic.com/game/xbox/uefa-euro-2004-portugal", "publisher": "Electronic Arts", "release_date": "May  4 2004", "developers": ["EA Canada"], "platforms": ["PC", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/a3e60614d6c9473aadaa228afb7fdce1-98.jpg", "descriptions": "UEFA Euro 2004 boasts only a fraction of the teams and features found in FIFA 2004, but it's sufficiently different to make it a worthwhile purchase."}, {"name": "Shining Soul II", "details_link": "https://www.metacritic.com/game/game-boy-advance/shining-soul-ii", "publisher": "Atlus Co.", "release_date": "Apr 20 2004", "developers": ["Grasshopper Manufacture"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/ecb9ab2b3c3717b75b7c646e7baa87ef-98.jpg", "descriptions": "As monsters begin to appear in the kingdom Klantol, King Marcel announces a grand tournament at the coliseum to find a hero that can protect the country. Now, as a mighty Brawler, Priestess, Dark Wizard, or Ninja, you must accept the king's challenge. Each character has certain strengths andAs monsters begin to appear in the kingdom Klantol, King Marcel announces a grand tournament at the coliseum to find a hero that can protect the country. Now, as a mighty Brawler, Priestess, Dark Wizard, or Ninja, you must accept the king's challenge. Each character has certain strengths and weaknesses that can mean the difference between victory and defeat in single-player, multiplayer, or cooperative multiplayer modes. In addition to valuable weapons and armor, you can equip your party with Force Links, which, when combined, create a Shining Force--a powerful weapon capable of decimating the enemy forces.… Expand"}, {"name": "Romance of the Three Kingdoms IX", "details_link": "https://www.metacritic.com/game/playstation-2/romance-of-the-three-kingdoms-ix", "publisher": "Koei", "release_date": "Feb 24 2004", "developers": ["Koei"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Strategy", "Turn-Based", "Historic"], "meta_score": 74, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/11921f975bd7c322e6bbc7ebd3fbedb5-98.jpg", "descriptions": "With Ancient China as the backdrop, the game chronicles the dramatic events of the 2nd and 3rd centuries when the once grand empire fell into civil war. While retaining many of the features that have become hallmarks of the Romance series, RTK IX (Romance of the Three Kingdoms IX) is vastlyWith Ancient China as the backdrop, the game chronicles the dramatic events of the 2nd and 3rd centuries when the once grand empire fell into civil war. While retaining many of the features that have become hallmarks of the Romance series, RTK IX (Romance of the Three Kingdoms IX) is vastly different from previous games in the series. Most notable is that players immediately take the rank of a Ruler. Traditionally reserved as the highest rank in the series, the role of Ruler will test any player?s leadership, management and strategy skills. As a Ruler, one of the keys to maintaining authority is a strong corps of loyal officers, so RTK IX?s Officer Development System has been enhanced with a new point and item system. With the new point system, players earn points to increase officer abilities and skills. With the item system, certain items can further an officer?s development, heighten intelligence or improve his abilities in war. Players can now use save data from Dynasty Warriors 4, Dynasty Warriors 4 Xtreme Legends or Dynasty Tactics 2 to obtain a new officer. [KOEI]… Expand"}, {"name": "Pro Race Driver", "details_link": "https://www.metacritic.com/game/pc/pro-race-driver", "publisher": "Codemasters", "release_date": "Apr 15 2003", "developers": ["Codemasters"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-8 ", "genres": ["Driving", "Racing", "Simulation", "Formula One", "Automobile"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/993e0c5a58362a8b6627e91e12824803-98.jpg", "descriptions": "[Also known as \"TOCA Race Driver\"] Ryan McKane, a test driver with gasoline running in his veins, spends his life struggling against his father's disappointment, while his brother's phenomenal racetrack success overshadows every minor victory he achieves. When his father perishes in an[Also known as \"TOCA Race Driver\"] Ryan McKane, a test driver with gasoline running in his veins, spends his life struggling against his father's disappointment, while his brother's phenomenal racetrack success overshadows every minor victory he achieves. When his father perishes in an octane-fuelled blaze of fire on the asphalt that he loved, Ryan's frustrated ambition galvanizes into a unrelenting determination to triumph over all opposition and become first a touring car champion, then maybe even World Champion. Petrolheads and mass market gamers alike slam the pedal to the metal to guide the actions of our hero through the hairpins and chicanes of a career in global racing. Features 42 licensed touring & race cars including Holden Commodore, Ford Falcon, Mercedes CLK, Alfa Romeo GTV and Viper GTS; 38 international circuits recreated under licence including Bathurst, Hockenheim and Silverstone; and 13 global Championships including official series: DTM from Germany, V8 Supercars from Australia and the Britsh Touring Car Championship. [Codemasters]… Expand"}, {"name": "Armored Core 3", "details_link": "https://www.metacritic.com/game/playstation-2/armored-core-3", "publisher": "Agetec Inc.", "release_date": "Sep  5 2002", "developers": ["From Software"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 74, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/d37a0c636e334a1eebf23662f2c1c193-98.jpg", "descriptions": "It's been 20 years since the Earth Government and the Corporations battled for supremacy. The majority of humanity lives beneath the surface of the planet, relatively safe from the continuing struggle. A new and mysterious entity has entered the picutre, however, snapping up all theIt's been 20 years since the Earth Government and the Corporations battled for supremacy. The majority of humanity lives beneath the surface of the planet, relatively safe from the continuing struggle. A new and mysterious entity has entered the picutre, however, snapping up all the available Ravens for intense missions that only their custom-built Armored Core Units can handle. As a Raven, you know there's always another mission waiting for you - does it really matter who, or what, hires you? For all the new parts and weapons out there for you to earn in battle - we didn't think so. But just the same, keep your back covered, Raven. [Agetec]… Expand"}, {"name": "Way of the Samurai", "details_link": "https://www.metacritic.com/game/playstation-2/way-of-the-samurai", "publisher": "Bam Entertainment", "release_date": "May 31 2002", "developers": ["Acquire"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action Adventure", "Historic"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/fda5dcffe035d980c3eca29ac985e42f-98.jpg", "descriptions": "Sword-based combat is at the heart of Way of the Samurai. As the adventure begins, the player has his own sword and basic knowledge of its use in battle. As he moves through the game, the player become more adept at using his sword and learns new attacks. The player also has the ability toSword-based combat is at the heart of Way of the Samurai. As the adventure begins, the player has his own sword and basic knowledge of its use in battle. As he moves through the game, the player become more adept at using his sword and learns new attacks. The player also has the ability to pick up dozens of different sword, each representing a different fighting style. With attacks specific to each sword, it requires a true samurai to master all the swords and their individual attacks. Additionally, sword combat is not simply a matter of hacking and slashing. Timing, blocking and balance all play equally important roles. [BAM! Entertaiment]… Expand"}, {"name": "Spider-Man 2: Enter: Electro", "details_link": "https://www.metacritic.com/game/playstation/spider-man-2-enter-electro", "publisher": "Activision", "release_date": "Oct 19 2001", "developers": ["Vicarious Visions"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 74, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/8df4ba25fb3911a98203e4cfaabf1a21-98.jpg", "descriptions": "The city is at risk, and only you can save it from the evil clutches of an old enemy: the powerful Electro. He has a mysterious new device that will make his million volts of destruction even more deadly. But, with Spider-Man on the job, Electro is in for the shock of his life."}, {"name": "4x4 Evolution", "details_link": "https://www.metacritic.com/game/dreamcast/4x4-evolution", "publisher": "Gathering", "release_date": "Oct 30 2000", "developers": ["Terminal Reality"], "platforms": ["PC", "PlayStation 2", "Dreamcast"], "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/19edc161f2a41c3f7c5f0d8b88cf2375-98.jpg", "descriptions": "4x4 Evolution takes gamers for a rough ride through 15 off-road courses, each with its own distinctive design, music score, and difficulty level. In addition to contending with the other vehicles, you'll face challenges such as gates, trees, and tractors in junkyards or oncoming traffic in4x4 Evolution takes gamers for a rough ride through 15 off-road courses, each with its own distinctive design, music score, and difficulty level. In addition to contending with the other vehicles, you'll face challenges such as gates, trees, and tractors in junkyards or oncoming traffic in construction zones. Win cash in a series of off-road races to upgrade your truck. You can even stop, rewind, and view an entire race again from multiple camera angles and different racers' perspectives.… Expand"}, {"name": "AeroWings 2: Air Strike", "details_link": "https://www.metacritic.com/game/dreamcast/aerowings-2-air-strike", "publisher": "Crave", "release_date": "Aug 27 2000", "developers": ["CRI"], "platforms": "Dreamcast", "genres": ["Simulation", "Flight", "Modern Jet"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/2a7f19df102a945bc771e03433aa4581-98.jpg", "descriptions": "As an elite fighter pilot, you're in command of the swiftest and deadliest military jets available. Build and hone your skills to razor sharpness. Then unleash them upon an unsuspecting foe in this ultimate test of fully."}, {"name": "TrackMania (2003)", "details_link": "https://www.metacritic.com/game/pc/trackmania-2003", "publisher": "Enlight Software", "release_date": "Jul  8 2004", "developers": ["Nadeo"], "platforms": "PC", "num_players": "1-10 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/58e88ee14af668376f7db79297580763-98.jpg", "descriptions": "A cutting edge blend of arcade, SIM and puzzle games, TrackMania is set to be the first in a new and unique genre of racing game that will truly bring the game back in to gameplay. Using the simple and intuitive editor, players can let their imaginations run wild and build their own crazyA cutting edge blend of arcade, SIM and puzzle games, TrackMania is set to be the first in a new and unique genre of racing game that will truly bring the game back in to gameplay. Using the simple and intuitive editor, players can let their imaginations run wild and build their own crazy tracks, modifying them block-by-block, to create complex and spectacular tracks. Then, when the tracks are completed, players can test their creations in real-time, and experience all the fun and excitement of high-speed racing. [Nadeo]… Expand"}, {"name": "SD Gundam Battle Alliance", "details_link": "https://www.metacritic.com/game/playstation-5/sd-gundam-battle-alliance", "publisher": "Bandai Namco Games", "release_date": "Aug 25 2022", "developers": ["Bandai Namco Games", "Artdink"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 3 ", "genres": ["Role-Playing", "Simulation", "Action RPG", "Vehicle", "Combat"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/f68664bda6a8fb586f904fceb4e083cf-98.jpg", "descriptions": "In SD Gundam Battle Alliance, Mobile Suits and characters from across Mobile Suit Gundam history take center stage in this all-new action RPG. A Battle Alliance to Correct a False World\nThe story takes place in G: Universe, a world where Gundam canon twists and turns in ways no one canIn SD Gundam Battle Alliance, Mobile Suits and characters from across Mobile Suit Gundam history take center stage in this all-new action RPG. A Battle Alliance to Correct a False WorldThe story takes place in G: Universe, a world where Gundam canon twists and turns in ways no one can predict. To correct this world's distorted history, the player leads a 3-unit squadron consisting of Mobile Suits and pilots from across Gundam history - a true Battle Alliance.What Awaits Beyond False History... Combo action with stunning visuals and dynamic animationIndulge in a wide array of Mobile Suit weaponry to crush many foes with! Control Mobile Suits portrayed with realistic weathering that showcases them as weapons of war as they tear across the battlefield with dynamic animations. Strange phenomena known as Breaks are twisting legendary moments from Gundam history, and you're in charge to fix them.Experience Gundam history's most famous scenes as you develop new Mobile Suits to add to your arsenal. Gather Capital and expansion parts to transform your favorite machine into the ultimate MS. Tackle missions with friends in multiplayer!Launch into battle with 2 partners to back you up. In multiplayer, you can play through the game with up to 2 other players in a 3-person team. Enjoy this new SD Gundam action RPG solo, or with friends.… Expand"}, {"name": "Wild Guns Reloaded", "details_link": "https://www.metacritic.com/game/playstation-4/wild-guns-reloaded", "publisher": "Natsume", "release_date": "Dec 20 2016", "developers": ["Natsume", "NATSUME ATARI Inc."], "platforms": ["PC", "Switch", "PlayStation 4"], "genres": ["Action", "Platformer", "Shooter", "2D", "Light Gun"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/f28e13f194c34a7914a9f7fae8ce2cd6-98.jpg", "descriptions": "In Wild Guns: Reloaded, Annie has tracked down the famed bounty hunter Clint to get revenge on the Kid gang. With eight stages, each with three zones, there's plenty of bad robots to blast away"}, {"name": "Naruto Shippuden: Ultimate Ninja Storm 2", "details_link": "https://www.metacritic.com/game/xbox-360/naruto-shippuden-ultimate-ninja-storm-2", "publisher": "Namco Bandai Games", "release_date": "Oct 19 2010", "developers": ["CyberConnect2"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox One", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 74, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2//images/products/games/2/65f39b3-98.jpg", "descriptions": "Developed by CyberConnect2, NARUTO SHIPPUDEN: Ultimate Ninja STORM 2 faithfully recreates the anime series and fully immerses players in the mythical ninja world with new expansive environments, missions, battle systems and gameplay modes. Taking players through the NARUTO SHIPPUDEN storyDeveloped by CyberConnect2, NARUTO SHIPPUDEN: Ultimate Ninja STORM 2 faithfully recreates the anime series and fully immerses players in the mythical ninja world with new expansive environments, missions, battle systems and gameplay modes. Taking players through the NARUTO SHIPPUDEN story arc, daring ninja warriors must strategically recruit the right support characters to ensure victory against any and all opponents.  With the winning combination, players can easily unleash bigger and more explosive Team Special Techniques to obliterate enemies who stand in the way.  … Expand"}, {"name": "Yumi's Odd Odyssey", "details_link": "https://www.metacritic.com/game/3ds/yumis-odd-odyssey", "publisher": "Natsume", "release_date": "Mar 20 2014", "developers": ["Studio Saizensen"], "platforms": "3DS", "genres": ["Platformer", "2D", "Action", "Platformer", "2D"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/c5ce6c135fd046ac9bed8e8b9e63a4ab-98.jpg", "descriptions": "(Also known as \"Sayonara Umihara Kawase\") Using her fishing hook, Yumi must make her way through a variety of levels by running, jumping, and throwing her coveted fishing line. Yumi can use her fishing line to swing between platforms, lower herself down to other ledges, and even catapult(Also known as \"Sayonara Umihara Kawase\") Using her fishing hook, Yumi must make her way through a variety of levels by running, jumping, and throwing her coveted fishing line. Yumi can use her fishing line to swing between platforms, lower herself down to other ledges, and even catapult herself great distances by stretching the line to its breaking point.… Expand"}, {"name": "Custom Robo Arena", "details_link": "https://www.metacritic.com/game/ds/custom-robo-arena", "publisher": "Nintendo", "release_date": "Mar 19 2007", "developers": ["Noise Inc."], "platforms": "DS", "num_players": "2  Online", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 74, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/fc2fc97b79e949677de9e662f896cd9c-98.jpg", "descriptions": "Custom Robo: The sport of tomorrow. In the not-too-distant future, competitors battle customized robot warriors in holographic battle arenas. Victory is determined not only by fighting skill but also by how well Robo Commanders design their robot gladiators, so players need both brawn andCustom Robo: The sport of tomorrow. In the not-too-distant future, competitors battle customized robot warriors in holographic battle arenas. Victory is determined not only by fighting skill but also by how well Robo Commanders design their robot gladiators, so players need both brawn and brains to survive. Explore a sci-fi landscape as you fight toward the Custom Robo championship, powering up your Robos with tons of unique parts There are literally millions of possible Custom Robo combinations, giving you complete control over how you fight your battles. Players can challenge their friends to one-on-one Robo battles anytime and anywhere using either Nintendo Wi-Fi Connection, Multi-Card Play or DS Download Play. Outside of the battle arenas, Custom Robo Arena plays like a role-playing game in which players walk through the futuristic city setting and interact with other characters as they struggle to win the Custom Robo championship. [Nintendo]… Expand"}, {"name": "Ooblets", "details_link": "https://www.metacritic.com/game/switch/ooblets", "publisher": "Glumberland", "release_date": "Sep  1 2022", "developers": ["Glumberland"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Trainer"], "meta_score": 74, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/7ba18d37decfb9efe3fde29839672a73-98.jpg", "descriptions": "Ooblets is a farming, creature collection, and town life game where you build up your farm, befriend townsfolk, grow ooblets, and have dance-offs."}, {"name": "TT Isle of Man: Ride On The Edge 2", "details_link": "https://www.metacritic.com/game/playstation-4/tt-isle-of-man-ride-on-the-edge-2", "publisher": "Bigben Interactive", "release_date": "Mar 19 2020", "developers": ["KT Racing"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 74, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/5/f9ec7828de19ab5e3275854b109dea2d-98.jpg", "descriptions": "Racing across an over 60 km long ultra-technical track at breakneck speed requiring realistic riding skills… that is the challenge that awaits in TT2! Lots of new features lie ahead: open world, reworked physics, classic motorbikes, and more. Fine-tune your motorbike, upgrade its performanceRacing across an over 60 km long ultra-technical track at breakneck speed requiring realistic riding skills… that is the challenge that awaits in TT2! Lots of new features lie ahead: open world, reworked physics, classic motorbikes, and more. Fine-tune your motorbike, upgrade its performance and monitor its data in real time to stay competitive.… Expand"}, {"name": "Prinny Presents NIS Classics Vol. 2", "details_link": "https://www.metacritic.com/game/switch/prinny-presents-nis-classics-vol-2", "publisher": "NIS America", "release_date": "May 10 2022", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/9dac4daff2ce1d92afb4816ae2ebfc7f-98.jpg", "descriptions": "NIS Classics strikes again with Vol. 2, dude. After over 10 years, two action-packed RPGs‒Makai Kingdom: Reclaimed and Rebound, and Z.H.P.: Unlosing Ranger vs. Darkdeath Evilman‒will be making their appearance on Nintendo Switch. Makai Kingdom: Reclaimed and Rebound centers around LordNIS Classics strikes again with Vol. 2, dude. After over 10 years, two action-packed RPGs‒Makai Kingdom: Reclaimed and Rebound, and Z.H.P.: Unlosing Ranger vs. Darkdeath Evilman‒will be making their appearance on Nintendo Switch. Makai Kingdom: Reclaimed and Rebound centers around Lord Zetta, a master of tactical warfare, and his pursuit to invade and reclaim the Netherworld‒as a book. Using cunning strategies, ultra-powerful magic, and a vast range of crazy deadly weapons, Lord Zetta aims to take control of his enemies' lands. Using a feature unique to this battle system, you can summon your army via the INVITE system to do your bidding on the battlefield and dominate your foes! When your thirst for new lands is quenched, ZHP: Unlosing Ranger vs. Darkdeath Evilman will have you coming back for more with the ultimate character customization system allowing you to make your character your own from the toes to the nose, dood! Custom-made to kick enemies to the curb, your character will also establish a base and work their way through a myriad of maps, each randomly generated and all part of your own unique story! … Expand"}, {"name": "Attack on Titan 2", "details_link": "https://www.metacritic.com/game/xbox-one/attack-on-titan-2", "publisher": "Koei Tecmo Games", "release_date": "Mar 20 2018", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Action", "Action Adventure", "General"], "meta_score": 74, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/a61ae2c66a477d2975fe2a8662f1e46d-98.jpg", "descriptions": "Based on the anime series and building on the fast-paced action the series is famous for, ATTACK ON TITAN 2 is the sequel to 2016's action game and features new gameplay mechanics. Players once again don the renowned Omni-Directional Manoeuver Gear as they fight and repel the fearsome TitansBased on the anime series and building on the fast-paced action the series is famous for, ATTACK ON TITAN 2 is the sequel to 2016's action game and features new gameplay mechanics. Players once again don the renowned Omni-Directional Manoeuver Gear as they fight and repel the fearsome Titans that threaten humanity, to restore peace within the walls. … Expand"}, {"name": "Roundabout", "details_link": "https://www.metacritic.com/game/xbox-one/roundabout", "publisher": "No Goblin", "release_date": "Feb 20 2015", "developers": ["No Goblin"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One"], "genres": ["Driving", "Racing", "Arcade", "Mission-based", "Automobile"], "meta_score": 74, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/d0b79fea4e93c5884300673391364426-98.jpg", "descriptions": "Roundabout is an open world driving puzzle game where you control a constantly rotating limousine! Pick up passengers, find secret collectables, take on dangerous missions, and fall in love while reliving the 1977 rise to fame story of Georgio Manos."}, {"name": "Shin Megami Tensei: Devil Summoner - Soul Hackers", "details_link": "https://www.metacritic.com/game/3ds/shin-megami-tensei-devil-summoner---soul-hackers", "publisher": "Atlus", "release_date": "Apr 16 2013", "developers": ["Atlus"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 74, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/e5a5e3108aee37d8afe7017b9538b658-98.jpg", "descriptions": "Soul Hackers delivers a first-person, dungeon-crawling RPG experience set in a future where technology and otherworldly forces meet in a macabre fusion of cyberpunk futurism and gothic horror."}, {"name": "TRI", "details_link": "https://www.metacritic.com/game/pc/tri", "publisher": "Rising Star Games", "release_date": "Jul  8 2012", "developers": ["Rat King Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Action", "General"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/ff963b5b432efb5aa82a4fb18f01f66a-98.jpg", "descriptions": "In the world of the Odd Gods players experience a mind-bending first-person adventure like no other as they discover the magical power of the TRI. By creating triangles that can be used to solve puzzles and traverse the landscape, adventurers hunt for mystical totems and master a wide rangeIn the world of the Odd Gods players experience a mind-bending first-person adventure like no other as they discover the magical power of the TRI. By creating triangles that can be used to solve puzzles and traverse the landscape, adventurers hunt for mystical totems and master a wide range of abilities such as reflecting light, scaling sheer heights and even defying gravity! With every twist of a corridor, every raised gantry, every new floor of towers and dungeons in the Odd Gods' world, TRI challenges gamers to think outside the box and find new ways to overcome seemingly impossible obstacles.… Expand"}, {"name": "Baseball Mogul 2008", "details_link": "https://www.metacritic.com/game/pc/baseball-mogul-2008", "publisher": "Enlight Software", "release_date": "Mar 20 2007", "developers": ["Sports Mogul"], "platforms": "PC", "num_players": "44  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Management", "Sim"], "meta_score": 74, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/888ecb9ecd2279503abc71d2ba81657d-98.jpg", "descriptions": "New features in the 2008 edition include: Baseball Mogul Encyclopedia - Outputs over 30,000 interlinked HTML pages. Historical leaders tracked in over 70 stats by team and season; hitting, pitching, and fielding stats at every level; annual financial records. Pitch-by-Pitch Mode - FullyNew features in the 2008 edition include: Baseball Mogul Encyclopedia - Outputs over 30,000 interlinked HTML pages. Historical leaders tracked in over 70 stats by team and season; hitting, pitching, and fielding stats at every level; annual financial records. Pitch-by-Pitch Mode - Fully interactive pitch-by-pitch mode puts you in complete control of the game. Ticker Tape - Shows updated scores, stats, leaders and headlines, even in the middle of each at-bat. Lefty-Righty Stats. Expanded Scouting Report - More stats like OPS, GDP, intentional walks, ground ball percent, and DICE. User Interface - Improves the visual appeal of each screen while also putting more stats at your fingertips. 2007 Rosters. Exclusive licensee of the Sean Lahman Baseball Database, including complete stats and data for over 18,000 players going back to the 19th century. [Sports Mogul Inc.]… Expand"}, {"name": "RIDE 4", "details_link": "https://www.metacritic.com/game/playstation-4/ride-4", "publisher": "Milestone S.r.l", "release_date": "Oct  5 2020", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 74, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/f046241bd91528f44e4b7597a2f58111-98.jpg", "descriptions": "Are you ready to live the best gaming experience that a motorcycle fan can get? RIDE 4 will spark your competitive soul with hundreds of bikes, dozens of tracks and a whole new level of realism."}, {"name": "ArmA: Combat Operations", "details_link": "https://www.metacritic.com/game/pc/arma-combat-operations", "publisher": "Atari", "release_date": "May  4 2007", "developers": ["Bohemia Interactive"], "platforms": "PC", "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern", "Arcade"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/60efc7f9446e9acc2a3d45343fe58ca5-98.jpg", "descriptions": "(Also known as \"ArmA: Armed Assault\")  ArmA is a first person tactical military shooter with large elements of realism and simulation. This game features a blend of large-scale military conflict spread over large areas alongside the more closed quarters battle. The player will find himself(Also known as \"ArmA: Armed Assault\")  ArmA is a first person tactical military shooter with large elements of realism and simulation. This game features a blend of large-scale military conflict spread over large areas alongside the more closed quarters battle. The player will find himself thrust in the midst of an engaging and expanding storyline, fighting against smart, aggressive enemies who will continually provide a challenge over a massive landscape. [Bohemia Interactive]… Expand"}, {"name": "Mini Ninjas", "details_link": "https://www.metacritic.com/game/pc/mini-ninjas", "publisher": "Eidos Interactive", "release_date": "Sep  8 2009", "developers": ["Io Interactive"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "General", "Fantasy"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/3ab36d75930a3b8b28bcbac57f69fda9-98.jpg", "descriptions": "Prepare yourself for a Ninja adventure like you have never seen before! Join Hiro, the smallest hero on the biggest adventure, as he embarks on an epic and electrifying quest to restore harmony to a world on the brink of chaos. Use your skills and mighty Ninja training to battle a magicalPrepare yourself for a Ninja adventure like you have never seen before! Join Hiro, the smallest hero on the biggest adventure, as he embarks on an epic and electrifying quest to restore harmony to a world on the brink of chaos. Use your skills and mighty Ninja training to battle a magical army of evil Samurai. Harness the power of your Kuji magic and utilise the special skills of your Mini Ninja friends as you travel through a perilous world to reach the final confrontation with the Evil Samurai Warlord in his Fortress of Doom.… Expand"}, {"name": "Shin Megami Tensei: Devil Summoner - Raidou Kuzunoha vs. the Soulless Army", "details_link": "https://www.metacritic.com/game/playstation-2/shin-megami-tensei-devil-summoner---raidou-kuzunoha-vs-the-soulless-army", "publisher": "Atlus Co.", "release_date": "Oct 10 2006", "developers": ["Atlus Co."], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "General"], "meta_score": 74, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/9/7496997feff96702bc5270edd086030d-98.jpg", "descriptions": "(Known in Japan as \"Devil Summoner: Kuzunoha Raidou\")   Raidou Kuzunoha is a private detective in Japan's Taishou Period of the 1910s and 1920s, but he's much more than just a well-dressed crime scene investigator; he also has the power to capture and conjure demons to do his bidding. Take(Known in Japan as \"Devil Summoner: Kuzunoha Raidou\")   Raidou Kuzunoha is a private detective in Japan's Taishou Period of the 1910s and 1920s, but he's much more than just a well-dressed crime scene investigator; he also has the power to capture and conjure demons to do his bidding. Take control of Raidou and his otherworldly companions, guide them through thrilling episodes of action and intrigue, and learn the incredible secrets of the Soulless Army. Detailed real-time combat sequence with swords, guns, combo attacks, and devilish helpers. Photorealistic graphics that transport the player to 1920s Japan. Puzzle-solving with the use of carefully chosen demonic powers. Character design by legendary illustrator Kazuma Kaneko. [Atlus]… Expand"}, {"name": "Comic Jumper: The Adventures of Captain Smiley", "details_link": "https://www.metacritic.com/game/xbox-360/comic-jumper-the-adventures-of-captain-smiley", "publisher": "Twisted Pixel Games", "release_date": "Oct  6 2010", "developers": ["Twisted Pixel Games"], "platforms": "Xbox 360", "genres": ["Action", "General", "General"], "meta_score": 74, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/bb15d734e8f86c2dbae5cbd1dbd0a6de-98.jpg", "descriptions": "Twisted Pixel Games is working on its third original title, Comic Jumper: The Adventures of Captain Smiley."}, {"name": "Sacred", "details_link": "https://www.metacritic.com/game/pc/sacred", "publisher": "Encore Software, Inc.", "release_date": "Mar 25 2004", "developers": ["Ascaron Entertainment GmbH", "Ascaron Entertainment"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/da1fde65192b7d0b0e1d4c27dfb976ea-98.jpg", "descriptions": "Sacred's Dynamic World of Exploration. Unlike any other fantasy action RPG, Sacred offers players an enormous world comprised of 16 regions with virtually unlimited opportunities for exploration. This world contains highly detailed landscapes, complete with villages and towns and even aSacred's Dynamic World of Exploration. Unlike any other fantasy action RPG, Sacred offers players an enormous world comprised of 16 regions with virtually unlimited opportunities for exploration. This world contains highly detailed landscapes, complete with villages and towns and even a day/night cycle with varying weather systems. Regions vary from forests and mountains to deserts, catacombs and ice-covered landmasses. More than three quarters of the world are open to the players from the very start - no unlocks needed. [Encore Software]… Expand"}, {"name": "Attack on Titan", "details_link": "https://www.metacritic.com/game/playstation-4/attack-on-titan", "publisher": "Koei Tecmo Games", "release_date": "Aug 30 2016", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/f274deac194c77ccd16052642cbfc51c-98.jpg", "descriptions": "Also known as \"Attack on Titan: Wings of Freedom\". Fight on a violent battlefield in which the game changes from moment to moment. Utilizing the \"Omni-directional mobility gear\" created specifically for battle with Titans allows you to fly freely across and above the battlefield. It'sAlso known as \"Attack on Titan: Wings of Freedom\". Fight on a violent battlefield in which the game changes from moment to moment. Utilizing the \"Omni-directional mobility gear\" created specifically for battle with Titans allows you to fly freely across and above the battlefield. It's incumbent upon the Scout Regiment, to which Eren belongs, to travel beyond the Wall and expand the territories of mankind.… Expand"}, {"name": "Cursed to Golf", "details_link": "https://www.metacritic.com/game/playstation-5/cursed-to-golf", "publisher": "Thunderful", "release_date": "Aug 18 2022", "developers": ["Chuhai Labs"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/822d335cdbc4fccbd9ce59989ed1c190-98.jpg", "descriptions": "Cursed to Golf is a golf-like adventure where every shot counts. Players are tasked with making it out of Golf Purgatory to become a Golfing Legend.\r With insane hazards, otherworldly power-ups and tons of replayability, will you make it back alive or will you forever be... Cursed to Golf!?"}, {"name": "Frogun", "details_link": "https://www.metacritic.com/game/switch/frogun", "publisher": "Top Hat Studios Inc", "release_date": "Aug  2 2022", "developers": ["Molegato"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/231ad7b612e695cf8b102667f7834041-98.jpg", "descriptions": "Join Renata as she adventures across a world of mystical ruins with the titular FROGUN! Frogun is an old-school platformer with the soul of the PS1/N64 era, in which your frog-shaped grappling hook is a your best friend!. Renata's parents are world-renown explorers, archeologists andJoin Renata as she adventures across a world of mystical ruins with the titular FROGUN! Frogun is an old-school platformer with the soul of the PS1/N64 era, in which your frog-shaped grappling hook is a your best friend!. Renata's parents are world-renown explorers, archeologists and inventors that travel all over the world uncovering the secrets of the past, bringing her with them in their expeditions. However, in their latest adventure, they decide to leave her at the base camp - the Beelzebub ruins are said to be too dangerous. For three whole days she waits, her pride hurt and bored out of her mind, until she realized: if they haven't returned yet, something must have happened to them! In a hurry she grabs her parents' last invention, the Frogun, and heads to the ruins to rescue them, and prove that she's as capable as them!\r… Expand"}, {"name": "Slipstream", "details_link": "https://www.metacritic.com/game/playstation-4/slipstream", "publisher": "BlitWorks", "release_date": "Apr  7 2022", "developers": ["ansdor"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/adbe48987f5427f1b45d9daa8f3bfce5-98.jpg", "descriptions": "It's 199X, you're in the driver seat. As you turn the key and hear the engine starting, a cassette plays on the stereo. The clear blue sky invites you to escape, to explore a world of exotic landscapes and thrilling races. Step on the gas, choose your path, drive across cities, mountains,It's 199X, you're in the driver seat. As you turn the key and hear the engine starting, a cassette plays on the stereo. The clear blue sky invites you to escape, to explore a world of exotic landscapes and thrilling races. Step on the gas, choose your path, drive across cities, mountains, deserts, forests, beaches — places from all over the world and beyond. Slipstream is a racing game influenced and inspired by the OutRun series, SEGA games in general, Initial D, Vaporwave & Synthwave aesthetics and the spirit of 90s arcades. It uses a real pseudo3D engine to provide an authentic retro experience in a modern shell. After being funded via kickstarter in 2016 and delayed more times than the developer would like to admit, it was released independently for PC in 2018.… Expand"}, {"name": "WindJammers 2", "details_link": "https://www.metacritic.com/game/playstation-4/windjammers-2", "publisher": "DotEmu", "release_date": "Jan 20 2022", "developers": ["DotEmu"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Individual", "Other"], "meta_score": 74, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/a70c280b4a2d85ac3a44fb202d5be7f3-98.jpg", "descriptions": "The best flying disc game of all time is back! With amazing hand-drawn graphics, crazy new moves, gameplay mechanics and awesome new characters and stages, Windjammers 2 is the sequel you've been dreaming of."}, {"name": "Dice Legacy", "details_link": "https://www.metacritic.com/game/switch/dice-legacy", "publisher": "Koch Media", "release_date": "Sep  9 2021", "developers": ["DESTINYbit"], "platforms": ["PC", "Switch"], "genres": ["Strategy", "General"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/62ce184663ed468e09773f5d86276be4-98.jpg", "descriptions": "Dice Legacy is a dice-based survival city builder set on a mysterious ringworld. Your ship has reached the shore of an uncharted continent. Roll and use your dice to gather resources, expand and defend your settlement, survive the winter and interact with the strange inhabitants of this Dice Legacy is a dice-based survival city builder set on a mysterious ringworld. Your ship has reached the shore of an uncharted continent. Roll and use your dice to gather resources, expand and defend your settlement, survive the winter and interact with the strange inhabitants of this eerie world. … Expand"}, {"name": "HyperParasite", "details_link": "https://www.metacritic.com/game/xbox-one/hyperparasite", "publisher": "HoundPicked Games", "release_date": "Apr  3 2020", "developers": ["Troglobytes Games", "S.L."], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/1e2e7c37ac4a7f8cd94ab593142402c7-98.jpg", "descriptions": "A rogue-lite twin-stick shooter/brawler that never plays the same twice. Collect and control 60 different characters as the body-snatching alien Parasite with a grudge against humanity. Fight to the top of the food chain: possess the President, push the Big Red Button and one-up the human race."}, {"name": "One Step From Eden", "details_link": "https://www.metacritic.com/game/switch/one-step-from-eden", "publisher": "Thomas Moon Kang", "release_date": "Mar 26 2020", "developers": ["Thomas Moon Kang"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/a6e08bb35806c879aa1296a864cf577e-98.jpg", "descriptions": "Build a powerful deck, cast spells on the fly, battle evolving enemies, find game-changing artifacts, make friends or make enemies, just make it to Eden."}, {"name": "Coffee Talk", "details_link": "https://www.metacritic.com/game/switch/coffee-talk", "publisher": "Toge Productions", "release_date": "Jan 29 2020", "developers": ["Toge Productions"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/dfe5c41cc6201eb54be1a9d4721bfa74-98.jpg", "descriptions": "Coffee Talk is a coffee brewing and heart-to-heart talking simulator about listening to fantasy-inspired modern peoples’ problems, and helping them by serving up a warm drink or two."}, {"name": "Vasara Collection", "details_link": "https://www.metacritic.com/game/switch/vasara-collection", "publisher": "QUByte Interactive", "release_date": "Aug 15 2019", "developers": ["QUByte Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/92663cc62c3e71c16ca23223e8d7bad0-98.jpg", "descriptions": "For the very first time, highly acclaimed Japanese Arcade Shoot’em Ups, Vasara and Vasara 2, are made available to the whole world via this package: VASARA Collection. Science Fiction meets History in these arcade classics which take place in an alternate timelime Feudal Japan whereFor the very first time, highly acclaimed Japanese Arcade Shoot’em Ups, Vasara and Vasara 2, are made available to the whole world via this package: VASARA Collection. Science Fiction meets History in these arcade classics which take place in an alternate timelime Feudal Japan where technologically advanced weaponry and equipment are a reality, and heroes use flying motorcycles with amazing firepower and fierce melee weapons to destroy their enemies. … Expand"}, {"name": "198X", "details_link": "https://www.metacritic.com/game/playstation-4/198x", "publisher": "Hi-Bit Studios", "release_date": "Jul 16 2019", "developers": ["Hi-Bit Studios"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Platformer", "Party / Minigame", "2D"], "meta_score": 74, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/b13b05331402184970852b5f161d8184-98.jpg", "descriptions": "Over-the-top arcade action meets coming-of-age drama, blurring the lines between game and reality...Welcome to Suburbia, just outside the City, sometime in 198X. This is the journey of Kid, a teenager stuck between the limitations of innocent youth and the obligations of inevitableOver-the-top arcade action meets coming-of-age drama, blurring the lines between game and reality...Welcome to Suburbia, just outside the City, sometime in 198X. This is the journey of Kid, a teenager stuck between the limitations of innocent youth and the obligations of inevitable adulthood. The story unfolds when Kid discovers the local arcade – finding new worlds, and new meaning, in video games…… Expand"}, {"name": "Out There: Omega The Alliance", "details_link": "https://www.metacritic.com/game/switch/out-there-omega-the-alliance", "publisher": "Raw Fury", "release_date": "Apr  9 2019", "developers": ["Mi-Clos Studio"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/9b69cd39088e763478f55e6c17c93466-98.jpg", "descriptions": "Out There is an award-winning space exploration game where you try to survive alone in a distant and unknown part of the galaxy by upgrading your spaceship and managing your resources. Space is a hostile place; dangerous and mysterious adventures will mark each step of your travel. You willOut There is an award-winning space exploration game where you try to survive alone in a distant and unknown part of the galaxy by upgrading your spaceship and managing your resources. Space is a hostile place; dangerous and mysterious adventures will mark each step of your travel. You will not only meet insidious intelligent species, but also deal with ancient powers linked to your destiny and the fate of mankind itself. … Expand"}, {"name": "Turok", "details_link": "https://www.metacritic.com/game/switch/turok", "publisher": "Night Dive Studios", "release_date": "Mar 18 2019", "developers": ["Night Dive Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/1e2c95fbc40c6753b9deaa19394df5ee-98.jpg", "descriptions": "A world where time has no meaning and evil knows no bounds. Torn from a world long gone, the time traveling warrior Turok has found himself thrust into a savage land torn by conflict. Turok is back and no dinosaur is safe! When it was first released in 1997, Turok introduced gamers to aA world where time has no meaning and evil knows no bounds. Torn from a world long gone, the time traveling warrior Turok has found himself thrust into a savage land torn by conflict. Turok is back and no dinosaur is safe! When it was first released in 1997, Turok introduced gamers to a world teeming with cunning enemies, traps, puzzles and deadly weapons all within a vast 3D environment ready to explore. Now the classic game has been restored and enhanced with a new visual engine and exciting new features to sink your teeth into.… Expand"}, {"name": "Implosion - Never Lose Hope", "details_link": "https://www.metacritic.com/game/switch/implosion---never-lose-hope", "publisher": "Flyhigh Works", "release_date": "Jul  6 2017", "developers": ["Rayark Inc."], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/387431a7a18a04b57ad65d816b36da8b-98.jpg", "descriptions": "IMPLOSION is a Sci-Fi Hack and Slash game where the protagonist fights against enemies known as XADA using WM-III (WarMech-3) battle suits."}, {"name": "Sakura Samurai: Art of the Sword", "details_link": "https://www.metacritic.com/game/3ds/sakura-samurai-art-of-the-sword", "publisher": "Nintendo", "release_date": "Feb  2 2012", "developers": ["Grounding Inc."], "platforms": "3DS", "num_players": "1 Player", "genres": ["Action", "General", "General"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/f3e5c528c46dd3cd7b103c688dcd02ce-98.jpg", "descriptions": "Also known as Hana Samurai: Art of the Sword in the UK/EU. Skill meets style in this precision sword-fighting game. Leave button mashing behind. Sakura Samurai: Art of the Sword is about precision swordplay, battlefield finesse, and martial-arts style. As the heroic title character, youllAlso known as Hana Samurai: Art of the Sword in the UK/EU. Skill meets style in this precision sword-fighting game. Leave button mashing behind. Sakura Samurai: Art of the Sword is about precision swordplay, battlefield finesse, and martial-arts style. As the heroic title character, youll travel a world rife with cherry-blossom beautyand deadly dangerto rescue the legendary Princess Cherry Blossom. Her kidnapper has set dozens of blade-wielding henchmen in your path, and youll have to exercise your best battle senses to defeat them and save her. Learn to predict your foes moves, deftly dodge their attacks, and create opportunities for devastating counterattacks.\r Start with the Sakura Sword, a little health, and some basic training from your water-spirit guide. Make your way from battleground to battleground fighting wave after wave of increasingly cunning enemies. Fight through huge castles to duel epic bosses. And dont forget to stop at small villages along the way to get help, gear, encouragement (and distraction) from the quirky townsfolk. \r\rProve that you truly are the Sakura Samurai!… Expand"}, {"name": "Fight Night Round 3", "details_link": "https://www.metacritic.com/game/psp/fight-night-round-3", "publisher": "EA Sports", "release_date": "Feb 20 2006", "developers": ["EA Chicago"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/93bc10d7de7f1300215767b6d2f556a2-98.jpg", "descriptions": "Go toe-to-toe with greats such as Ali, De La Hoya, Joe Frazier, Bernard Hopkins and Roy Jones. Outside of the ring, gamers can establish intense rivalries through pre-fight events putting purpose and passion behind every hit. Three new Impact Punches a la the EA Sports Haymaker keep gamersGo toe-to-toe with greats such as Ali, De La Hoya, Joe Frazier, Bernard Hopkins and Roy Jones. Outside of the ring, gamers can establish intense rivalries through pre-fight events putting purpose and passion behind every hit. Three new Impact Punches a la the EA Sports Haymaker keep gamers at the edge of their seat as players are only one punch away from the entire dynamic of the fight changing. Land a perfectly timed Flash KO or jump into a quick mid-fight mini-game to land a humiliating knockdown punch. Thrown using EA Sports Fight Night's innovative analog punch system, Impact Punches are high risk and high reward - put down your opponent or get knocked on the canvas. Boxing's Greatest Rivalries - Watch ESPN Classic footage of real-life bouts or re-create the greatest fights from past and present including Arturo Gatti vs. Mickey Ward, Marco Antonio Barrera vs. Eric Morales, and Ali vs. Frasier. Establish intense rivalries of your own by intimidating opponents before the big fight with heated press conferences full of hype, trash talkin', and fights at weigh-ins. Relive the best rivalries of your career in ESPN's Instant Classics! Create a style of your own, then see how you match up against the authentic signature styles from the world's best fighters. Licensed boxers use tactics and strategies that match their real life counterparts. Self Determinant AI adapts its style to match user strengths and to exploit weaknesses. [Electronic Arts]… Expand"}, {"name": "Rocky", "details_link": "https://www.metacritic.com/game/gamecube/rocky", "publisher": "Ubisoft", "release_date": "Nov 17 2002", "developers": ["Rage Software"], "platforms": ["iPhone/iPad", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/8608bef833dc6386f8cde92144d74c10-98.jpg", "descriptions": "Jump into the ring as Rocky Balboa and go head-to-head against 29 tough opponents, including Apollo Creed, Clubber Lang, Ivan Drago, and Tommy Gunn. Mickey and company train you from the streets of Philadelphia to the world heavyweight championship bout. Master Rocky's powerful punch combosJump into the ring as Rocky Balboa and go head-to-head against 29 tough opponents, including Apollo Creed, Clubber Lang, Ivan Drago, and Tommy Gunn. Mickey and company train you from the streets of Philadelphia to the world heavyweight championship bout. Master Rocky's powerful punch combos and fast flurries. Practices your skills in Sparring mode and then test them out in the Knockout Tournament against 15 other players. Based on the movie trilogy, Rocky tests your dedication, skill, and heart through various gameplay modes.… Expand"}, {"name": "Fatal Frame", "details_link": "https://www.metacritic.com/game/playstation-2/fatal-frame", "publisher": "Tecmo", "release_date": "Mar  4 2002", "developers": ["Tecmo"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 74, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/1/4e850fa43a096c238be6e274c51e5593-98.jpg", "descriptions": "Immerse yourself in a world full of supernatural spirits and sheer terror. Guided by her sixth sense and armed only with an antique camera, Miku sets to solve the mystery of her brother's sudden disappearance. He was a journalist on a quest to gather research about the mansion's hauntedImmerse yourself in a world full of supernatural spirits and sheer terror. Guided by her sixth sense and armed only with an antique camera, Miku sets to solve the mystery of her brother's sudden disappearance. He was a journalist on a quest to gather research about the mansion's haunted history. As the story unfolds, Miku discovers gruesome details about the Himura mansion's troubled past. The property and surroundng area have a dark history involving grisly murders, and evil cult and restless spirits. [Tecmo]… Expand"}, {"name": "de Blob 2", "details_link": "https://www.metacritic.com/game/playstation-3/de-blob-2", "publisher": "THQ", "release_date": "Feb 22 2011", "developers": ["Blue Tongue Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PlayStation 3"], "genres": ["Action", "Adventure", "General", "Platformer", "3D"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/643bda83bdbf3dfd05a76fb8b2553abe-98.jpg", "descriptions": "This is the follow-up title to 2008's popular hit, de Blob."}, {"name": "Madden NFL 06", "details_link": "https://www.metacritic.com/game/xbox-360/madden-nfl-06", "publisher": "EA Sports", "release_date": "Nov 16 2005", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 74, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/2/e628778dcb6584d2d4b92c8cf368c3fc-98.jpg", "descriptions": "With enhancements to the passing game, defensive improvements, and expanded online options, Madden NFL 06 takes you onto the field and into the locker room like never before. The new \"QB Vision Control\" lets you scan the field, look off defenders, and make perfect throws withing yourWith enhancements to the passing game, defensive improvements, and expanded online options, Madden NFL 06 takes you onto the field and into the locker room like never before. The new \"QB Vision Control\" lets you scan the field, look off defenders, and make perfect throws withing your quarterbacks unique field of vision. \"QB Precision Placement\" allows you to put the ball exactly where you want it. Lead the receiver to an open area, throw it behind him so he can come back to it or throw a jump ball and let him go get it. [Electronic Arts]… Expand"}, {"name": "Dead Rising 4", "details_link": "https://www.metacritic.com/game/pc/dead-rising-4", "publisher": "Microsoft Game Studios", "release_date": "Dec  6 2016", "developers": ["Capcom", "Capcom Vancouver"], "platforms": ["Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 74, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/3/42387620939ec7b47957f9a7df21a753-98.jpg", "descriptions": "This is the holiday season in Willamette, Colorado. A mysterious outbreak has overrun the Willamette Memorial Megaplex Mall and surrounding town with dangerous and deadly predators. Join Frank West as you explore a vast, open world sandbox filled with dangerous new zombies and a myriad waysThis is the holiday season in Willamette, Colorado. A mysterious outbreak has overrun the Willamette Memorial Megaplex Mall and surrounding town with dangerous and deadly predators. Join Frank West as you explore a vast, open world sandbox filled with dangerous new zombies and a myriad ways to kill them as you seek to uncover the truth behind the outbreak - or die trying. … Expand"}, {"name": "Call of Duty: Black Ops II", "details_link": "https://www.metacritic.com/game/pc/call-of-duty-black-ops-ii", "publisher": "Activision", "release_date": "Nov 12 2012", "developers": ["Treyarch"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Modern", "Arcade"], "meta_score": 74, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/6/a8521c43bec13b9aaa3799eb92096df8-98.jpg", "descriptions": "Black Ops 2's multiplayer unveils a new Create-a-Class, introducing players to a new \"pick-10\" allocation system that allows for a combination of any ten items, making almost anything possible. The new Score Streak system rewards players who play to the objective and help their team win.Black Ops 2's multiplayer unveils a new Create-a-Class, introducing players to a new \"pick-10\" allocation system that allows for a combination of any ten items, making almost anything possible. The new Score Streak system rewards players who play to the objective and help their team win. League Play, CODcasting and Live Streaming combine to make Call of Duty more enjoyable to watch by providing players with the tools to commentate games and broadcast those games to the world.… Expand"}, {"name": "Darwin Project", "details_link": "https://www.metacritic.com/game/pc/darwin-project", "publisher": "Scavengers Studio", "release_date": "Jan 13 2020", "developers": ["Scavengers Studio"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 10 ", "genres": ["Action", "General", "Shooter", "Third-Person", "Tactical"], "meta_score": 74, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/7e15eb5d086ec4d0282cc22e2de7b38c-98.jpg", "descriptions": "In Darwin Project, ten inmates must survive the elements, track each other, fight, craft tools, and use their social skills to be the last one standing. It's a unique take on battle royale with a Show Director to influence the match and Spectator Interactions to create a one-of-a-kind game show."}, {"name": "Act of War: High Treason", "details_link": "https://www.metacritic.com/game/pc/act-of-war-high-treason", "publisher": "Atari", "release_date": "May 30 2006", "developers": ["Eugen Systems"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/96138333fb2579711f2a116bf681e72d-98.jpg", "descriptions": "On the eve of the U.S. Presidential election, terror strikes again in the worst possible way - as both candidates are attacked, the sitting president is assassinated. As America tumbles into turmoil, confusion and chaos, only one man can save the nation from a threat that's growing moreOn the eve of the U.S. Presidential election, terror strikes again in the worst possible way - as both candidates are attacked, the sitting president is assassinated. As America tumbles into turmoil, confusion and chaos, only one man can save the nation from a threat that's growing more frightening by the day. In this expansion pack we follow major Jason Richter and his Task Force Talon on a desperate race against time to unravel a gigantic plot to cripple the world's only super-power, with connections back to the Consortium, the shadowy organization we got to know in Direct Action. Aside from theathers of war ranging from New York and Manhattan to Cuba, Mexico and Florida, in this installment we also take the fight to the murky waters inbetween - as we're introduced to modern naval combat in the same ultra-realistic style as we did on land in Direct Action. [Atari]… Expand"}, {"name": "Plants vs. Zombies: Battle for Neighborville - Complete Edition", "details_link": "https://www.metacritic.com/game/switch/plants-vs-zombies-battle-for-neighborville---complete-edition", "publisher": "Electronic Arts", "release_date": "Mar 19 2021", "developers": ["PopCap"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/1b7fef2fe9b02c056c807984ee804c83-98.jpg", "descriptions": "Time to shake up the neighborhood block party.Welcome to Neighborville, where all is well. Except that a crazy new coniferous conflict between brain-less and botanicals is brewing! What are you gonna do call the crops? Soil your plants? Prepare to kick some grass in a plant-on-zombieTime to shake up the neighborhood block party.Welcome to Neighborville, where all is well. Except that a crazy new coniferous conflict between brain-less and botanicals is brewing! What are you gonna do call the crops? Soil your plants? Prepare to kick some grass in a plant-on-zombie conflict that will take you to the outer edges of Neighborville and back again.KEY FEATURES* Customize Every Character for Battle - Join the newest bloom in the age-old battle between plants and zombies with 20 fully customizable classes at launch, including a Team Play class for each faction. Bring the unique abilities of each character class to 6 PvP modes including the new Battle Arena and experience the unbeleafable thrills of combat.* Venture to the Outer Edges of Neighborville - The tension across the terra has expanded with 3 free-roam regions and one PvE mode that extend beyond the town of Neighborville. Squad up with up to 3 friends in the Giddy Park social region and take back Weirding Woods, Mount Steep and Neighborville Town Centre. It's grow time!* Play with Your Favorite People in Every Mode - Connect with up to 3 players and battle through flourishing free-roam regions, or jump into the fray with up to 24 players in online multiplayer across a gigantic suburban skirmish.… Expand"}, {"name": "In Other Waters", "details_link": "https://www.metacritic.com/game/pc/in-other-waters", "publisher": "Fellow Traveller", "release_date": "Apr  3 2020", "developers": ["Jump Over The Age"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 74, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/24c9982899a886a507e88cd0334dc5ec-98.jpg", "descriptions": "Play as an Artificial Intelligence guiding a stranded xenobiologist through a beautiful and mysterious alien ocean. A non-violent sci-fi story, enter a world of wonder, fear and vulnerability, unraveling the history and ecology of an impossible planet. What will you discover together?"}, {"name": "Anarcute", "details_link": "https://www.metacritic.com/game/xbox-one/anarcute", "publisher": "Anarteam", "release_date": "Jul 12 2016", "developers": ["Anarteam"], "platforms": ["PC", "Switch", "Xbox One"], "genres": ["Action", "Strategy", "Real-Time", "General", "Command"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/9a8a6255cad278b76e3bfbb9e2d394cb-98.jpg", "descriptions": "These are dark times. A group of evil corporations has taken over the world's major cities. They've taken over the media, brainwashed the police and are now shamelessly running citizens' lives from the security of their skyscrapers. It is time to act. Assume control of the revolution toThese are dark times. A group of evil corporations has taken over the world's major cities. They've taken over the media, brainwashed the police and are now shamelessly running citizens' lives from the security of their skyscrapers. It is time to act. Assume control of the revolution to confront the terrible Brainwash Patrol who are dominating the world. [Xbox.com]… Expand"}, {"name": "Neon Chrome", "details_link": "https://www.metacritic.com/game/pc/neon-chrome", "publisher": "10tons Entertainment", "release_date": "Apr 28 2016", "developers": ["10tons Entertainment", "10tons"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "PlayStation Vita", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/def40a8ba7b1fb433de378680fe0935e-98.jpg", "descriptions": "Neon Chrome is a ruthless top-down cyberpunk shooter with rogue-like elements including procedural levels and ruthless gameplay. Blast your way through walls with guns and cybernetic abilities and try alternate approaches with different roles like the Assassin or the Cyber Psycho."}, {"name": "Transformers: Devastation", "details_link": "https://www.metacritic.com/game/pc/transformers-devastation", "publisher": "Activision", "release_date": "Oct  6 2015", "developers": ["PlatinumGames"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/17f0ede14ed850e0b6245d4936a67278-98.jpg", "descriptions": "The TRANSFORMERS are in the hands of acclaimed developer PlatinumGames, who have combined their brawler action with comic book inspired art to create a TRANSFORMERS game."}, {"name": "Ion Assault", "details_link": "https://www.metacritic.com/game/xbox-360/ion-assault", "publisher": "Microsoft Game Studios", "release_date": "Sep 23 2009", "developers": ["Black Inc."], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/006fcdd197c9eee675de9e4718325880-98.jpg", "descriptions": "[Xbox Live Arcade]  Experience Ion Assault, an action-packed arcade-style space adventure with an unprecedented particle physics engine. Fight alone or cooperatively through four different modes and more than 20 exciting levels. Instead of conventional weapons, use the free energy particles[Xbox Live Arcade]  Experience Ion Assault, an action-packed arcade-style space adventure with an unprecedented particle physics engine. Fight alone or cooperatively through four different modes and more than 20 exciting levels. Instead of conventional weapons, use the free energy particles that are abundant in space to fend off swarms of aliens. Space adventure: Battle aliens with a unique fluid and particle system. Variety of play: Explore more than 20 levels in four diverse settings with lavish graphics. Upgrades: Earn upgrades for your spaceships, such as augmented speed or increased radius for collecting surrounding particles. Multiplayer action: Enjoy various multiplayer modes like Cooperative, Arena, or Harvest with up to four players. Power-ups: Collect special power-ups, usable for a limited time, such as Black Hole. International flavor: Ion Assault is the first Xbox LIVE Arcade game developed in Germany. [RTL]… Expand"}, {"name": "Pro Evolution Soccer 2008", "details_link": "https://www.metacritic.com/game/playstation-3/pro-evolution-soccer-2008", "publisher": "Konami", "release_date": "Mar 11 2008", "developers": ["Konami"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 74, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/5075682d2933bb5aca0cf1fe6a605812-98.jpg", "descriptions": "PES 2008 features a brand new intelligence system, called Teamvision, that adapts and reacts to players own gameplay styles to ensure that the computer controlled opponents are always challenging and forcing the player to think and chance their style of play to avoid being out-thought by thePES 2008 features a brand new intelligence system, called Teamvision, that adapts and reacts to players own gameplay styles to ensure that the computer controlled opponents are always challenging and forcing the player to think and chance their style of play to avoid being out-thought by the game. It learns counter attacks that target your weaknesses and look to exploit any repetitive tactics players use. Defenders react better to danger, closing down the ball and charging at shots and the goalkeepers hold shots that are closer to them as well. Teammates make more intelligent runs into space and the close control has been sharpened to ensure quick and fluid passing and speedy attacks can be built. The next gen versions also feature extensive edit modes so players can completely customise their PES 2008 experience. [Konami]… Expand"}, {"name": "Midnight Club 3: DUB Edition", "details_link": "https://www.metacritic.com/game/psp/midnight-club-3-dub-edition", "publisher": "Rockstar Games", "release_date": "Jun 27 2005", "developers": ["Rockstar San Diego", "Rockstar Leeds"], "platforms": ["PlayStation 2", "PSP"], "num_players": "1-6 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/1f14a81aa0ce85e8741ad0b495da81af-98.jpg", "descriptions": "The open, living cities of San Diego, Detroit, and Atlanta are available in the PSP version, with all of the shortcuts, secrets and side streets. Rockstar Leeds has rebuilt each environment in its entirety. Whether you're just exploring in Cruise mode, looking to shave a few second in anThe open, living cities of San Diego, Detroit, and Atlanta are available in the PSP version, with all of the shortcuts, secrets and side streets. Rockstar Leeds has rebuilt each environment in its entirety. Whether you're just exploring in Cruise mode, looking to shave a few second in an ordered race, or trying to pick the ultimate route in an unordered free for all, figuring out the intimate secrets of these complex maps is a treat that translates perfectly to the PSP. Race the cars you've built in 6-player wi-fi multiplayer action. Prove your driving skills or just show off your creation in a deep selection of Arcade modes. [Rockstar]… Expand"}, {"name": "Mafia II", "details_link": "https://www.metacritic.com/game/xbox-360/mafia-ii", "publisher": "2K Games", "release_date": "Aug 24 2010", "developers": ["2K Czech"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic", "Open-World"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/300a58d556465e9bb4b0bbd44f17e02a-98.jpg", "descriptions": "Featuring a deep mobster-driven narrative packed with both behind-the-wheel and on-foot action, Mafia 2 is the sequel fans have been clamoring for. Like the original Mafia title, Mafia 2 immerses players in the mob underworld of a fictitious late 1940's-early 1950's scenario. Players easilyFeaturing a deep mobster-driven narrative packed with both behind-the-wheel and on-foot action, Mafia 2 is the sequel fans have been clamoring for. Like the original Mafia title, Mafia 2 immerses players in the mob underworld of a fictitious late 1940's-early 1950's scenario. Players easily become engaged in the game's cinematic Hollywood movie experience with strong, believable characters in a living, breathing city. [2K Games]… Expand"}, {"name": "WRC 10 The Official Game", "details_link": "https://www.metacritic.com/game/pc/wrc-10-the-official-game", "publisher": "Nacon", "release_date": "Sep  2 2021", "developers": ["KT Racing"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 74, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/3/5d08588d8b7c89d05d85971efdeb6b11-98.jpg", "descriptions": "Reach the 2021 season podium, and to celebrate the 50th anniversary of the competition, relive the highlights at the wheel of legendary cars."}, {"name": "Eagle Flight", "details_link": "https://www.metacritic.com/game/pc/eagle-flight", "publisher": "Ubisoft", "release_date": "Oct 13 2016", "developers": ["Ubisoft Montreal", "FunHouse"], "platforms": ["PlayStation 4", "PC"], "num_players": "Up to 6 ", "genres": ["Action", "Simulation", "Flight", "General", "Combat"], "meta_score": 74, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/7bdaf50b304f4c9ddd4bcb578d0c322e-98.jpg", "descriptions": "50 years after humans vanished from the face of the Earth, nature reclaimed the city of Paris, leaving a breathtaking playground. As an eagle, you soar past iconic landmarks, dive through narrow streets, and engage in aerial dog fights to protect your territory from opponents. With intuitive50 years after humans vanished from the face of the Earth, nature reclaimed the city of Paris, leaving a breathtaking playground. As an eagle, you soar past iconic landmarks, dive through narrow streets, and engage in aerial dog fights to protect your territory from opponents. With intuitive controls, you quickly learn to perform impressive aerial maneuvers in the blink of an eye. Eagle Flight sends you to the skies to experience the freedom of flying and explore Paris from a never-before seen perspective.… Expand"}, {"name": "Shadow Warrior", "details_link": "https://www.metacritic.com/game/xbox-one/shadow-warrior", "publisher": "Majesco Games", "release_date": "Oct 21 2014", "developers": ["Flying Wild Hog"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/20f5c7c6aacc825969f42361c3007914-98.jpg", "descriptions": "Shadow Warrior is bold reimagining of 3D Realms' cult classic shooter from developer Flying Wild Hog (Hard Reset) and independent game label Devolver Digital (Serious Sam 3: BFE, Hotline Miami, LUFTRAUSERS) for PC and next-gen consoles.  Blending the viciously over-the-top gunplay of itsShadow Warrior is bold reimagining of 3D Realms' cult classic shooter from developer Flying Wild Hog (Hard Reset) and independent game label Devolver Digital (Serious Sam 3: BFE, Hotline Miami, LUFTRAUSERS) for PC and next-gen consoles.  Blending the viciously over-the-top gunplay of its predecessor with the elegant precision of the powerful katana, Shadow Warrior is an imaginative take on the classic arcade-style shooter.… Expand"}, {"name": "Atelier Firis: The Alchemist and the Mysterious Journey", "details_link": "https://www.metacritic.com/game/playstation-4/atelier-firis-the-alchemist-and-the-mysterious-journey", "publisher": "Koei Tecmo Games", "release_date": "Mar  7 2017", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/8fff1ae0443c0776a20e78288ab71dea-98.jpg", "descriptions": "The second entry in the Mysterious saga follows the adventures of the enthusiastic Firis Mistlud and her loving older sister Liane Mistlud. The sisters have lived their entire lives in the isolated town of Ertona, where Firis uses her unique ability to see where crystals are buried. By wayThe second entry in the Mysterious saga follows the adventures of the enthusiastic Firis Mistlud and her loving older sister Liane Mistlud. The sisters have lived their entire lives in the isolated town of Ertona, where Firis uses her unique ability to see where crystals are buried. By way of a fateful encounter, Firis learns of the Alchemy Exam and decides to take her first step into the outside world, setting off on a grand journey to become a certified alchemist and discover the mysteries that life has to offer. [Playstation.com]… Expand"}, {"name": "NHL 22", "details_link": "https://www.metacritic.com/game/xbox-series-x/nhl-22", "publisher": "Electronic Arts", "release_date": "Oct 12 2021", "developers": ["Electronic Arts"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "genres": ["Sports", "Team", "Ice Hockey", "Sim"], "meta_score": 74, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/0/9943f83cc52256f00b31d8075fbb0415-98.jpg", "descriptions": "Powered by Frostbite, EA SPORTS™NHL®22 gets the superstar treatment. For the first time ever, experience EA SPORTS NHL on one of the industry’s most powerful game engines bringing visual detail to every hit, deke and shot. Superstar X-Factors lets you feel the personality and power of NHLPowered by Frostbite, EA SPORTS™NHL®22 gets the superstar treatment. For the first time ever, experience EA SPORTS NHL on one of the industry’s most powerful game engines bringing visual detail to every hit, deke and shot. Superstar X-Factors lets you feel the personality and power of NHL superstars with an all-new ability system that unlocks the unique skills of the league’s most elite players. Authentic to real player skill and style, the stars of the NHL truly come to life in EA SPORTS NHL 22 making their time on ice more influential than ever . From HUT to World of Chel, Superstar X-Factors brings new class based strategy to every game mode. EA SPORTS NHL 22is an all new game for a new generation, giving you more ways to play and compete than ever before.… Expand"}, {"name": "Attack on Titan 2: Final Battle", "details_link": "https://www.metacritic.com/game/xbox-one/attack-on-titan-2-final-battle", "publisher": "Koei Tecmo Games", "release_date": "Jul  5 2019", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Action", "Action Adventure", "General"], "meta_score": 74, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/fa8c6f3a39b36b6d9c9ce77ff3d6d9a9-98.jpg", "descriptions": "Battle through the gripping narrative of Season 1 and 2 of the anime from a new perspective! Players can also enjoy original stories supervised by series creator Hajime Isayama."}, {"name": "Contra Anniversary Collection", "details_link": "https://www.metacritic.com/game/playstation-4/contra-anniversary-collection", "publisher": "Konami", "release_date": "Jun 11 2019", "developers": ["Konami", "M2"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 74, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/db7d53af31dcd707da985359feb1f482-98.jpg", "descriptions": "The Contra Anniversary Collection brings this classic Run and Gun franchise back to modern platforms and a new generation of players. Grab power ups and blast your way through waves of menacing enemies and bosses that will put your reaction skills to the test. Also included is a digitalThe Contra Anniversary Collection brings this classic Run and Gun franchise back to modern platforms and a new generation of players. Grab power ups and blast your way through waves of menacing enemies and bosses that will put your reaction skills to the test. Also included is a digital Bonus Book with tons of concept documents and sketches, the official chronology of the franchise, an exclusive interview with the veteran producer of the series, and more.… Expand"}, {"name": "2064: Read Only Memories INTEGRAL", "details_link": "https://www.metacritic.com/game/switch/2064-read-only-memories-integral", "publisher": "MidBoss", "release_date": "Jul 26 2018", "developers": ["MidBoss"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 74, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/ad6cb1ae57fdc6ab78789122fdf0c6c4-98.jpg", "descriptions": "2064: Read Only Memories INTEGRAL features all of the original content featured in previous releases, enhanced and expanded with a host of brand new content and features exclusive to Nintendo Switch. When Turing, the world’s first sapient machine, teams up with a struggling journalist, the2064: Read Only Memories INTEGRAL features all of the original content featured in previous releases, enhanced and expanded with a host of brand new content and features exclusive to Nintendo Switch. When Turing, the world’s first sapient machine, teams up with a struggling journalist, the unlikely duo find themselves drawn into the shadows behind the dazzling lights of Neo-San Francisco. The secrets they uncover could shake the very foundations of society, and some powerful people would stop at nothing to keep them quiet. … Expand"}]