[{"name": "Tacoma", "details_link": "https://www.metacritic.com/game/xbox-one/tacoma", "publisher": "The Fullbright Company", "release_date": "Aug  2 2017", "developers": ["The Fullbright Company", "Fullbright"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Adventure", "General"], "meta_score": 79, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/f6d513ae2a7a7553a8e68839d2bb4eb3-98.jpg", "descriptions": "Tacoma is a narrative-driven adventure set aboard a high-tech space station in the year 2088. Explore every detail of how the station’s crew lived and worked, finding clues that add up to a gripping story of trust, fear, and resolve in the face of disaster."}, {"name": "Sphinx and the Cursed Mummy", "details_link": "https://www.metacritic.com/game/gamecube/sphinx-and-the-cursed-mummy", "publisher": "THQ", "release_date": "Nov 10 2003", "developers": ["Eurocom Entertainment Software"], "platforms": ["PC", "PlayStation 2", "Switch", "Xbox 360", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 79, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/9846d8aff80b075b174ca82bed8d720e-98.jpg", "descriptions": "Ancient Egyptian mythology comes to life in the Sphinx and the Cursed Mummy. You play the role of Sphinx, a headstrong demigod who travels the world via portals to foil the evil plans of Set. Equipped with a magical sword and a blowpipe, you'll need all your wits, agility, and special powersAncient Egyptian mythology comes to life in the Sphinx and the Cursed Mummy. You play the role of Sphinx, a headstrong demigod who travels the world via portals to foil the evil plans of Set. Equipped with a magical sword and a blowpipe, you'll need all your wits, agility, and special powers to overcome powerful enemies. When being inconspicuous is the only solution, control Sphinx's reluctant hero friend, The Mummy. By finding the stolen magical crowns of Egypt, Sphinx can stop Set and save the world.… Expand"}, {"name": "Gears of War: Judgment", "details_link": "https://www.metacritic.com/game/xbox-360/gears-of-war-judgment", "publisher": "Microsoft Game Studios", "release_date": "Mar 19 2013", "developers": ["Epic Games"], "platforms": "Xbox 360", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 79, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/205f40d98e3ae8ef6842a9f1314c5dc0-98.jpg", "descriptions": "The events of Gears of War: Judgment take place fourteen years before the original Gears and just after the essential event of the Gears of War universe, Emergence Day. In the story of Judgment you fight to save the city of Halvo Bay from a horrifying new enemy in a campaign that strips awayThe events of Gears of War: Judgment take place fourteen years before the original Gears and just after the essential event of the Gears of War universe, Emergence Day. In the story of Judgment you fight to save the city of Halvo Bay from a horrifying new enemy in a campaign that strips away the extraneous and returns to the basics, capturing the true essence of Gears combat, and introduces a new style of gameplay that is faster-paced and more action-packed than what came before.… Expand"}, {"name": "Halo Wars 2", "details_link": "https://www.metacritic.com/game/xbox-one/halo-wars-2", "publisher": "Microsoft Game Studios", "release_date": "Feb 17 2017", "developers": ["Creative Assembly"], "platforms": ["PC", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 79, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/c7a344249ff5b2a49917c70d765dfdf6-98.jpg", "descriptions": "Halo Wars 2 is a strategy game packed with fast-paced action, massive battles, and an all-new Halo story. Developed by Creative Assembly, a SEGA company and the creators of the popular “Total War™” series, in partnership with 343 Industries."}, {"name": "Anarcute", "details_link": "https://www.metacritic.com/game/pc/anarcute", "publisher": "Plug In Digital", "release_date": "Jul 12 2016", "developers": ["Anarteam"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Real-Time", "General", "Command"], "meta_score": 79, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/fe1e0e971e8bec2bdfc62ea4cbca40fe-98.jpg", "descriptions": "These are dark times. A group of evil corporations has taken over the world's major cities. They've taken over the media, brainwashed the police and are now shamelessly running citizens' lives from the security of their skyscrapers. It is time to act. Assume control of the revolution toThese are dark times. A group of evil corporations has taken over the world's major cities. They've taken over the media, brainwashed the police and are now shamelessly running citizens' lives from the security of their skyscrapers. It is time to act. Assume control of the revolution to confront the terrible Brainwash Patrol who are dominating the world.… Expand"}, {"name": "Pool Nation", "details_link": "https://www.metacritic.com/game/xbox-360/pool-nation", "publisher": "Mastertronic", "release_date": "Oct 31 2012", "developers": ["Cherry Pop Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation 5", "Xbox 360"], "genres": ["Sports", "Miscellaneous", "Parlor", "Individual", "Billiards", "Billiards"], "meta_score": 79, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/5474c7bcc5ad798bdbe1dc07679913ff-98.jpg", "descriptions": "Slow down and rewind time with the replay system which lets you review the action close up. Take on skilled virtual opponents in the career modes, unlocking new balls, locations, and cues. Play other users around the world on Xbox LIVE, with single matches and tournaments. Get hooked on theSlow down and rewind time with the replay system which lets you review the action close up. Take on skilled virtual opponents in the career modes, unlocking new balls, locations, and cues. Play other users around the world on Xbox LIVE, with single matches and tournaments. Get hooked on the challenging Endurance mode, a frantic pot-against-the clock game which promises to keep you coming back for more.… Expand"}, {"name": "Free Realms", "details_link": "https://www.metacritic.com/game/pc/free-realms", "publisher": "Sony Online Entertainment", "release_date": "Apr 29 2009", "developers": ["Sony Online Entertainment"], "platforms": ["PlayStation 3", "PC"], "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 79, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/23496df99810e42e1efa3054c95c436d-98.jpg", "descriptions": "Free Realms is a free 3D virtual world where you can do whatever you want, whenever you want! Jump in straight from your web browser! Once you create your character, you'll be in and playing in just a few minutes. Battle enemies as you search for lost treasure or duel other players. TeachFree Realms is a free 3D virtual world where you can do whatever you want, whenever you want! Jump in straight from your web browser! Once you create your character, you'll be in and playing in just a few minutes. Battle enemies as you search for lost treasure or duel other players. Teach your pet a new trick, mine for gold, cook up a meal, or race your car! When youre ready for a different kind of challenge, play a wide variety of fun minigames, jump into the trading card game or check up with your friends on your profile page. Free Realms is the place to join up with your friends to discover, explore, compete, chat, share achievements and just have fun! In Free Realms, YOU RULE. [Sony Online Entertainment]… Expand"}, {"name": "Homeworld: Deserts of Kharak", "details_link": "https://www.metacritic.com/game/pc/homeworld-deserts-of-kharak", "publisher": "Gearbox Software", "release_date": "Jan 20 2016", "developers": ["Blackbird Interactive"], "platforms": "PC", "num_players": "Up to 6 ", "genres": ["Strategy", "Real-Time", "Command"], "meta_score": 79, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/aea76530709b7686dd65992b55f246f5-98.jpg", "descriptions": "A ground-based RTS prequel to the classic Homeworld games. Assemble your fleet and lead them to victory on the shifting sands of Kharak in this strategy game for PC from Blackbird Interactive."}, {"name": "L.A. Noire", "details_link": "https://www.metacritic.com/game/switch/la-noire", "publisher": "Rockstar Games", "release_date": "Nov 14 2017", "developers": ["Team Bondi", "Virtuos"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Open-World", "Third-Person"], "meta_score": 79, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/5a566b00d0ad5a7db69cf9b4cf086333-98.jpg", "descriptions": "Amid the post-war boom of Hollywood's Golden Age, Cole Phelps, an LAPD detective is thrown headfirst into a city drowning in its own success. Corruption is rampant, the drug trade is exploding, and murder rates are at an all-time high. In his fight to climb the ranks and do what's right,Amid the post-war boom of Hollywood's Golden Age, Cole Phelps, an LAPD detective is thrown headfirst into a city drowning in its own success. Corruption is rampant, the drug trade is exploding, and murder rates are at an all-time high. In his fight to climb the ranks and do what's right, Phelps must unravel the truth behind a string of arson attacks, racketeering conspiracies and brutal murders, battling the L.A. underworld and even members of his own department to uncover a secret that could shake the city to its rotten core. Using groundbreaking new animation technology that captures every nuance of an actor's facial performance in astonishing detail, L.A. Noire is a violent crime thriller that blends breathtaking action with true detective work to deliver an unprecedented interactive experience. Search for clues, chase down suspects and interrogate witnesses as you struggle to find the truth in a city where everyone has something to hide.… Expand"}, {"name": "Don't Starve", "details_link": "https://www.metacritic.com/game/pc/dont-starve", "publisher": "Klei Entertainment", "release_date": "Apr 23 2013", "developers": ["Klei Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Sandbox"], "meta_score": 79, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/79f89e7d61fb1df8d12f1cd54dcd38d3-98.jpg", "descriptions": "Assume the role of Wilson, an intrepid Gentleman Scientist who has been trapped by a demon and transported to a mysterious wilderness world. Wilson must learn to utilize his environment and its inhabitants if he ever hopes to escape and find his way back home. Enter a strange and unexploredAssume the role of Wilson, an intrepid Gentleman Scientist who has been trapped by a demon and transported to a mysterious wilderness world. Wilson must learn to utilize his environment and its inhabitants if he ever hopes to escape and find his way back home. Enter a strange and unexplored world full of strange creatures, dangers, and surprises. Collect resources to craft items and structures that match your survival style. Play your way as you unravel the mysteries of this strange land.… Expand"}, {"name": "Crysis Remastered Trilogy", "details_link": "https://www.metacritic.com/game/pc/crysis-remastered-trilogy", "publisher": "Crytek", "release_date": "Oct 15 2021", "developers": ["Crytek"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 79, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/b02d00b1ab713bd69f494408baa61204-98.jpg", "descriptions": "The classic first person shooter from Crytek is back with the action packed gameplay, sandbox world, and thrilling epic battles you loved the first time around. Crysis Remastered Trilogy includes each of the single player campaigns from the legendary first person shooters Crysis, Crysis 2,The classic first person shooter from Crytek is back with the action packed gameplay, sandbox world, and thrilling epic battles you loved the first time around. Crysis Remastered Trilogy includes each of the single player campaigns from the legendary first person shooters Crysis, Crysis 2, and Crysis 3, optimized for today's hardware. Relive the adventure in this great value all in one bundle.Features:* Crysis Remastered: What begins as a simple rescue mission becomes the battleground of a new war as alien invaders swarm over a chain of Lingshan islands. Playing as super soldier Nomad, you are armed with a powerful Nanosuit equipped with Speed, Strength, Armor, and Cloaking abilities. Use avast arsenal of modular weaponry and adapt your tactics and gear to dominate enemies in an enormous sandbox world.* Crysis 2 Remastered: Aliens have returned to a world ravaged by climate disasters. As the invaders lay waste to New York and begin an assault that threatens the total annihilation of humankind, only you have the technology to lead the fightback. Equipped with the upgraded Nanosuit 2.0, customize your suit and weapons in real time and unlock powerful new abilities in the battle for humanity's survival.* Crysis 3 Remastered: Returning to the fight as super soldier Prophet, the search for the alien Alpha Ceph continues, but now you must also expose the truth behind the C.E.L.L. corporation, which has turned New York City into a sprawling urban rainforest sheltered by a giant nanodome. Fight through seven distinct districts and decimate your opponents in a blaze of brute force using the Nanosuit's superior technology, or use stealth to achieve your goals and become humanity's silent savior. Equipped with your powerful and deadly new Predator Bow, there's no wrong way to save the world.… Expand"}, {"name": "Golf Club: Wasteland", "details_link": "https://www.metacritic.com/game/pc/golf-club-wasteland", "publisher": "Untold Tales", "release_date": "Sep  3 2021", "developers": ["Demagog Studio"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Puzzle", "Action", "General"], "meta_score": 79, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/6f47e31c05216f6dcfd58af701ddc596-98.jpg", "descriptions": "Human life is wiped out. Earth is now a golf course for the ultra-rich. The rich fled to Mars but venture back to a desolate Earth for a round of golf. Each hole in the wasteland offers its own little story and possible puzzle to sink the perfect shot. Play through destroyed brutalistHuman life is wiped out. Earth is now a golf course for the ultra-rich. The rich fled to Mars but venture back to a desolate Earth for a round of golf. Each hole in the wasteland offers its own little story and possible puzzle to sink the perfect shot. Play through destroyed brutalist monuments, crumbling shopping malls, and abandoned museums as neon signs and poignant graffiti take swings at current events, Silicon Valley culture and humanity. Piece together the full story of how humanity fell through three distinct sources. Details from the lone golfer’s story, who's come back to Earth for one last game. The Radio Nostalgia From Mars broadcast that gives a glimpse into the lives of those who escaped. And the narration of a “secret spectator” watching from a distance...Be accompanied by a purposefully composed soundtrack as well as personal stories broadcasted on Radio Nostalgia From Mars. The station caters to citizens of Mars, nostalgic for Earth as they listen to music from the 2020s, and dial in to share their memories of the planet. A smooth-voiced radio DJ keeps the show flowing with updates and announcements hinting at a not-so-glamorous life on Mars. Three distinct modes mean every golfer can find something for their tastes. Casual players can focus just on the story and a relaxing scenic round of golf in Story Mode. Those looking for an extra challenge can beat each hole under par using skill and puzzle solving through Challenge Mode. While the total pros can try Iron Mode, where there’s almost zero room for error. Easy-to grasp controls and a minimalist UI underpin the whole game so anyone can easily pick up and play at their own pace. … Expand"}, {"name": "Road 96", "details_link": "https://www.metacritic.com/game/pc/road-96", "publisher": "Digixart Entertainment", "release_date": "Aug 16 2021", "developers": ["Digixart Entertainment", "Omen"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 79, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/9dbb2a0c0735cfbdd463403dd7e2d667-98.jpg", "descriptions": "Summer 1996, Today is the day! You hit the road. Adventure. Freedom. Escape. Run. Flee the Regime. Try to survive. On this risky road trip to the border, you’ll meet incredible characters, and discover their intertwined stories and secrets in an ever-evolving adventure.\rBut every mile opensSummer 1996, Today is the day! You hit the road. Adventure. Freedom. Escape. Run. Flee the Regime. Try to survive. On this risky road trip to the border, you’ll meet incredible characters, and discover their intertwined stories and secrets in an ever-evolving adventure.\rBut every mile opens up a choice to make. Your decisions will change your adventure, change the people you meet, maybe even change the world. There are thousands of roads across the authoritarian nation of Petria.\rWhich one will you take?… Expand"}, {"name": "Bleed 2", "details_link": "https://www.metacritic.com/game/playstation-4/bleed-2", "publisher": "Digerati Distribution", "release_date": "Feb  6 2018", "developers": ["BootdiskRevolution"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 79, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/645fe4fc12db85b125971e767b127b4d-98.jpg", "descriptions": "Bleed 2 is a relentless arcade action game featuring air-dodging, bullet-reflecting, and tons of bosses."}, {"name": "Hue", "details_link": "https://www.metacritic.com/game/pc/hue", "publisher": "Curve Digital", "release_date": "Aug 30 2016", "developers": ["Fiddlesticks Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 79, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/d782119f10dd43155def1a53f6d44f98-98.jpg", "descriptions": "Hue is a puzzle-adventure, where you alter the world by changing its background colour."}, {"name": "Assault Android Cactus", "details_link": "https://www.metacritic.com/game/pc/assault-android-cactus", "publisher": "Witch Beam", "release_date": "Sep 23 2015", "developers": ["Witch Beam"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "General", "Scrolling", "Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 79, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/8295256f8472d6bdeec8e70a43554940-98.jpg", "descriptions": "Assault Android Cactus is a twin stick shoot 'em up with an emphasis on high pressure and stylish action. Expect screens full of enemies, buckets of bullets and high scoring combo chains! Take on the role of Cactus, an enthusiastic police android, who responds to a stranded space freighterAssault Android Cactus is a twin stick shoot 'em up with an emphasis on high pressure and stylish action. Expect screens full of enemies, buckets of bullets and high scoring combo chains! Take on the role of Cactus, an enthusiastic police android, who responds to a stranded space freighter only to discover it under siege by its... … Expand"}, {"name": "Chessmaster", "details_link": "https://www.metacritic.com/game/xbox/chessmaster", "publisher": "Ubisoft", "release_date": "Oct 26 2004", "developers": ["Ubisoft"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Miscellaneous", "Board Games"], "meta_score": 79, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/fe1230299629440d982806e94b450c1e-98.jpg", "descriptions": "Chessmaster includes plenty of features to improve your chess skills, no matter what level you are. In Chess School, you can learn basic and advanced tactics before challenging computer-controlled opponents in single-player or multiplayer modes. The game includes a variety of gameplay modes,Chessmaster includes plenty of features to improve your chess skills, no matter what level you are. In Chess School, you can learn basic and advanced tactics before challenging computer-controlled opponents in single-player or multiplayer modes. The game includes a variety of gameplay modes, such as Quick Game, Rated Play, Handicap, Setup Position, and Puzzle. Watch as each piece attacks each other on the checkered battlefield. This immersive environment also features information about your opponent, tournament notifications, and evolving chess personalities.… Expand"}, {"name": "All-Star Baseball 2003", "details_link": "https://www.metacritic.com/game/xbox/all-star-baseball-2003", "publisher": "Acclaim", "release_date": "Feb 25 2002", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 79, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/9fd7f225dc719e109bc606590667a46f-98.jpg", "descriptions": "The best of both worlds! All-Star Baseball 2003 offers the perfect blend of simulation-style hardball for the baseball fanatic, with the pick-up-and-play ease for the casual sports gamer. The game features all 30 Major League Baseball (MLB) teams and more than 900 professional players. TenThe best of both worlds! All-Star Baseball 2003 offers the perfect blend of simulation-style hardball for the baseball fanatic, with the pick-up-and-play ease for the casual sports gamer. The game features all 30 Major League Baseball (MLB) teams and more than 900 professional players. Ten modes of play include Exhibition, Season, and Career, and the specialty modes include Batting Practice and Home Run Derby. The new Expansion mode allows gamers to create custom teams--with unique cities, stadiums, and logos--to add to the Major League schedule. The Cooperstown Hall of Fame team lets fans play with greats like Mike Schmidt, Reggie Jackson, and Yogi Berra. Games are called by Bob Brenly, Thom Brennaman, and Steve Lyons.… Expand"}, {"name": "Trainz", "details_link": "https://www.metacritic.com/game/pc/trainz", "publisher": "Strategy First", "release_date": "Feb 10 2002", "developers": ["Auran"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 79, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/08ae156db4e9bd50f3e97c2ad430e8c5-98.jpg", "descriptions": "Trainz is a complete virtual model railroad experience that allows you to collect, create and control, the many aspects of a working railroad. Start by building up your collection of locomotives, rolling stock, objects, buildings, flora and fauna, then create the ultimate railroad layoutTrainz is a complete virtual model railroad experience that allows you to collect, create and control, the many aspects of a working railroad. Start by building up your collection of locomotives, rolling stock, objects, buildings, flora and fauna, then create the ultimate railroad layout using the simplest and best landscape editing tool available before jumping into the driver's seat for a whole new perspective. [Strategy First]… Expand"}, {"name": "NHL Hitz 20-02", "details_link": "https://www.metacritic.com/game/xbox/nhl-hitz-20-02", "publisher": "Midway", "release_date": "Nov 14 2001", "developers": ["Black Box"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Arcade"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/73c5a7b08b3d97f6e48e82ff25ca3307-98.jpg", "descriptions": "NHL® Hitz 20-02 is an all-new adrenaline-style, 4-on-4 hockey videogame. In true NHL® fashion, players skate full-speed into the boards to retrieve a loose puck, sacrifice their bodies by sliding in front of a 125MPH slapshot and throw down their gloves to defend their team. NHL®NHL® Hitz 20-02 is an all-new adrenaline-style, 4-on-4 hockey videogame. In true NHL® fashion, players skate full-speed into the boards to retrieve a loose puck, sacrifice their bodies by sliding in front of a 125MPH slapshot and throw down their gloves to defend their team. NHL® Hitz 20-02 features an interactive 3D crowd that reacts based on the action on the ice - crowds will bang on the glass, throw hats on ice and walk out on bad games.… Expand"}, {"name": "Super Dodge Ball Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/super-dodge-ball-advance", "publisher": "Atlus Co.", "release_date": "Jun 10 2001", "developers": ["Atlus Co."], "platforms": "Game Boy Advance", "genres": ["Sports", "Alternative", "Other"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/88b7d8f944010e9c646b764066c776a8-98.jpg", "descriptions": "The year is 20XX and dodge ball has become the number one sport in the world. Teams from all over the world now compete in dodge ball tournaments to prove once and for all who is the best dodge ball team ever."}, {"name": "Super Smash Bros.", "details_link": "https://www.metacritic.com/game/nintendo-64/super-smash-bros", "publisher": "Nintendo", "release_date": "Apr 26 1999", "developers": ["HAL Labs"], "platforms": "Nintendo 64", "num_players": "1-4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 79, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/dd792d3cdbfb1c1c04444063c200230c-98.jpg", "descriptions": "It's a Bumpin', Bruisin', Brawlin' Bash! The many worlds of Nintendo collide in the ultimate showdown of strength and skill! Up to four players can choose their favorite characters - complete with signature attacks - and go at it in Team Battles and Free-For-Alls. Or venture out on your ownIt's a Bumpin', Bruisin', Brawlin' Bash! The many worlds of Nintendo collide in the ultimate showdown of strength and skill! Up to four players can choose their favorite characters - complete with signature attacks - and go at it in Team Battles and Free-For-Alls. Or venture out on your own to conquer the 14 stages in single-player mode. Either way, Super Smash Bros. is a no-holds-barred action-fest that will keep you coming back for more!… Expand"}, {"name": "Observation", "details_link": "https://www.metacritic.com/game/pc/observation", "publisher": "Devolver Digital", "release_date": "May 21 2019", "developers": ["No Code"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 79, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/4449b0327535b4e295ac47fa717c3f4d-98.jpg", "descriptions": "Observation is a sci-fi thriller uncovering what happened to Dr. Emma Fisher, and the crew of her mission, through the lens of the station’s artificial intelligence S.A.M. Players assume the role of S.A.M. by operating the station’s control systems, cameras, and tools to assist Emma inObservation is a sci-fi thriller uncovering what happened to Dr. Emma Fisher, and the crew of her mission, through the lens of the station’s artificial intelligence S.A.M. Players assume the role of S.A.M. by operating the station’s control systems, cameras, and tools to assist Emma in discovering what is happening to the station, the vanished crew, and S.A.M. himself.… Expand"}, {"name": "Atelier Escha & Logy: Alchemists of the Dusk Sky", "details_link": "https://www.metacritic.com/game/playstation-3/atelier-escha-logy-alchemists-of-the-dusk-sky", "publisher": "Tecmo Koei America Corp.", "release_date": "Mar 11 2014", "developers": ["Gust"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "General", "Japanese-Style"], "meta_score": 79, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/a2d4b7053551c0c37fd75dbcc1ed165e-98.jpg", "descriptions": "For the first time on PlayStation 3, Atelier series players can choose if they will follow the story of Escha or Logy, a novelty that offers a unique story perspective and gameplay experience. Escha's story is a delightful tale of the everyday adventures of an alchemist that Atelier series'For the first time on PlayStation 3, Atelier series players can choose if they will follow the story of Escha or Logy, a novelty that offers a unique story perspective and gameplay experience. Escha's story is a delightful tale of the everyday adventures of an alchemist that Atelier series' fans love, whereas Logy's story follows a darker approach filled with traditional RPG elements and focused on world exploration.… Expand"}, {"name": "Pro Evolution Soccer 2015", "details_link": "https://www.metacritic.com/game/xbox-one/pro-evolution-soccer-2015", "publisher": "Konami", "release_date": "Nov 11 2014", "developers": ["Konami"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 22 ", "genres": ["Action", "General", "Sports", "Traditional", "Team", "Soccer", "Sim"], "meta_score": 79, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/d607b325038580ed9acd6df2f114fe85-98.jpg", "descriptions": "Master a renewed array of dribbling techniques and use your speed, runs and responsive sprints to outdo your opponents. Accost defenders using each player’s dribbling skills, as opposed to relying on gimmick moves. Gamers now have full control over when to close down, tackle, or hold upMaster a renewed array of dribbling techniques and use your speed, runs and responsive sprints to outdo your opponents. Accost defenders using each player’s dribbling skills, as opposed to relying on gimmick moves. Gamers now have full control over when to close down, tackle, or hold up play. Successful defending is based solely on the decisions the gamer makes. PES 2015 now reflects the atmosphere of a top-tier match. Fan animations have been enhanced, and the ebb and flow of a match is met with context-sensitive crowd effects and movements. … Expand"}, {"name": "The Lord of the Rings: The Two Towers", "details_link": "https://www.metacritic.com/game/xbox/the-lord-of-the-rings-the-two-towers", "publisher": "EA Games", "release_date": "Dec 30 2002", "developers": ["Stormfront Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 79, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/5d23fdfd2972800f3f253c700ac67fc7-98.jpg", "descriptions": "The second chapter in the epic story of Middle-earth pits you against Sauron and the evil forces of Mordor.  In The Lord of the Rings: The Two Towers, you'll battle an army of 10,000 Uruk-Hai on the walls of Helm's Deep, hordes of Orcs on the plains of Rohan, and even the monstrous CaveThe second chapter in the epic story of Middle-earth pits you against Sauron and the evil forces of Mordor.  In The Lord of the Rings: The Two Towers, you'll battle an army of 10,000 Uruk-Hai on the walls of Helm's Deep, hordes of Orcs on the plains of Rohan, and even the monstrous Cave Troll in Balin's Tomb.  Guide Aragorn, Gimli, or Legolas through 13 interactive environments, using each character's unique moves, skills, and weaponry to complete your quest.… Expand"}, {"name": "Tiger Woods PGA Tour 11", "details_link": "https://www.metacritic.com/game/xbox-360/tiger-woods-pga-tour-11", "publisher": "Electronic Arts", "release_date": "Jun  8 2010", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/8d4f02b37163fe12f8a1b3c146399e28-98.jpg", "descriptions": "One of the most prestigious tournaments in golf, The Ryder Cup, is featured in Tiger Woods PGA TOUR 11. Gamers select a team and square off to try and bring home The Ryder Cup for their squad. The Ryder Cup is one of the last great sporting events to be founded in prestige rather than prizeOne of the most prestigious tournaments in golf, The Ryder Cup, is featured in Tiger Woods PGA TOUR 11. Gamers select a team and square off to try and bring home The Ryder Cup for their squad. The Ryder Cup is one of the last great sporting events to be founded in prestige rather than prize money.  Choose from the U.S. or European squad and participate in the various competition formats – foursomes where players hit alternate shots, fourballs and singles which traditionally bring the biennial event to a close with players going head to head. When playing The Ryder Cup mode offline, gamers have the option to swap matches, thus giving you the ultimate control over the outcomes of other matches. [Electronic Arts]… Expand"}, {"name": "River City Girls", "details_link": "https://www.metacritic.com/game/playstation-4/river-city-girls", "publisher": "Arc System Works", "release_date": "Sep  5 2019", "developers": ["WayForward"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 79, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/ea7236cfd03bdbea50a5515ac82503b2-98.jpg", "descriptions": "Kick butt, take names, and pound punks in this all-new installment of the classic co-op beat-'em-up series!River City Girls stars Kyoko and Misako, two street-tough high-schoolers who must fight their way through the six regions of River City to rescue their kidnapped boyfriends, seriesKick butt, take names, and pound punks in this all-new installment of the classic co-op beat-'em-up series!River City Girls stars Kyoko and Misako, two street-tough high-schoolers who must fight their way through the six regions of River City to rescue their kidnapped boyfriends, series mainstays Kunio and Riki. Along the way, they'll utilize an arsenal of combos, counters, throws, and special attacks; battle an assortment of enemies; accept numerous side quests; level up with experience points; interact with NPCs (including guest stars from past River City games); and shop for a variety of items, food, and gear to boost stats and unlock new abilities. The girls can even wield weapons and recruit defeated foes to join them in combat!The one- or local two-player bare-knuckle brawling is complemented by spectacular 16-bit-style graphics and an epic synth-pop soundtrack (featuring NateWantsToBattle, Chipzel, Christina Vee, and Megan McDuffee!), while the story roars to life via glorious anime cutscenes and manga-style intermissions.Key Features:-Furious beat-'em-up action for one or two players!-Stunning pixel-art graphics plus anime and manga cutscenes!-Fantastic soundtrack featuring NateWantsToBattle, Chipzel, Christina Vee, and Megan McDuffee!-Six large city regions to fight through, complete with shops and side quests!-Loads of weapons, items, and abilities to power-up your heroines!-Guest appearances by classic River City characters!… Expand"}, {"name": "Overwatch 2", "details_link": "https://www.metacritic.com/game/pc/overwatch-2", "publisher": "Blizzard Entertainment", "release_date": "Oct  4 2022", "developers": ["Blizzard Entertainment"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 79, "users_score": 1.6, "image": "https://static.metacritic.com/images/products/games/4/b814dbab04f6d3db442c30f7b01b4b3d-98.jpg", "descriptions": "THE DAWN OF A NEW OVERWATCH - Reunite and stand together in a new age of heroes. Overwatch® 2 builds on an award-winning foundation of epic competitive play, and challenges the world's heroes to team up, power up, and take on an overwhelming outbreak of threats around the globe. A VISUALTHE DAWN OF A NEW OVERWATCH - Reunite and stand together in a new age of heroes. Overwatch® 2 builds on an award-winning foundation of epic competitive play, and challenges the world's heroes to team up, power up, and take on an overwhelming outbreak of threats around the globe. A VISUAL EVOLUTION: Overwatch 2 evolves the look and feel of the world, with more dynamic environments, larger scale battles, additional in-game storytelling events, and improved atmospheric effects and shadows. Heroes in Overwatch 2 will also have a brand-new look, with greater detail and higher fidelity.\r A NEW ERA OF EPIC COMPETITION\rIn Push, a new, symmetrical map type that will launch with Overwatch 2, teams battle to take control of a robot that begins in a central location, then push it toward the enemy base. Either team may take control of the robot at any time. The team that pushes the robot furthest onto the enemy side wins the game.\r POWER UP AND SAVE THE WORLD\rPlay an active role in the next chapter of the Overwatch saga through a series of intense four-player missions. Fight back against Null Sector, uncover the motives behind the omnic attacks, and confront a rising wave of new threats.\r YOUR MISSION CONTINUES\rYour accomplishments and loot collections will be carried forward to Overwatch 2. That means you'll keep your skins, player icons, sprays, emotes, and more!\r NEW MAPS AND HEROES\rCurrent Overwatch players will battle side-by-side with Overwatch 2 players in PvP multiplayer; they'll also be able to play Overwatch 2 heroes and maps.… Expand"}, {"name": "Paper Beast", "details_link": "https://www.metacritic.com/game/playstation-4/paper-beast", "publisher": "Pixel Reef", "release_date": "Mar 24 2020", "developers": ["Pixel Reef"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Action Adventure", "Sandbox"], "meta_score": 79, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/6afc44b9af83b980188fe44cc7b76a4e-98.jpg", "descriptions": "Experience a dreamlike odyssey through a wild and simulated ecosystem. Take off on an adventure! Connect with exotic and surprising creatures. Shape the environment to solve puzzles. Or let your imagination guide you through an immersive sandbox."}, {"name": "Alan Wake Remastered", "details_link": "https://www.metacritic.com/game/playstation-5/alan-wake-remastered", "publisher": "Epic Games", "release_date": "Oct  5 2021", "developers": ["Remedy Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 79, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/fb1270ef72623dfbf526fb90a7e6e926-98.jpg", "descriptions": "In this cinematic action-thriller, troubled author Alan Wake embarks on a desperate search for his missing wife, Alice. Following her mysterious disappearance from the Pacific Northwest town of Bright Falls, he discovers pages of a horror story he has supposedly written, but he has no memoryIn this cinematic action-thriller, troubled author Alan Wake embarks on a desperate search for his missing wife, Alice. Following her mysterious disappearance from the Pacific Northwest town of Bright Falls, he discovers pages of a horror story he has supposedly written, but he has no memory of. Wake is soon forced to question his sanity, as page by page, the story comes true before his eyes: a hostile presence of supernatural darkness is taking over everyone it finds, turning them against him. He has no choice but to confront the forces of darkness armed only with his flashlight, a handgun and what remains of his shredded mind. His nightmarish journey to find answers to the mind-bending mystery he faces will lead him into the terrifying depths of the night. Alan Wake Remastered offers the complete experience, with the main game and its two story expansions - The Signal and The Writer - in stunning new 4K visuals. The tense, episodic story is packed with unexpected twists, heart-stopping cliff hangers, and intense bursts of combat where it takes more than bullets to banish the darkness. The game’s cutscenes, quirky cast of characters, and the majestic Pacific Northwest vistas have been enhanced for an experience that delivers as much on its visual impact as its unnerving atmosphere.… Expand"}, {"name": "Twisted Metal: Head-On", "details_link": "https://www.metacritic.com/game/psp/twisted-metal-head-on", "publisher": "SCEA", "release_date": "Mar 24 2005", "developers": ["Incognito Inc."], "platforms": "PSP", "num_players": "Up to 6 ", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 79, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/874ea3656815c33bdbbe325b00abad7e-98.jpg", "descriptions": "Complete with all the fast-paced vehicular combat and destruction that gamers have come to know and love, Twisted Metal: Head-On allows gamers to take destruction anywhere, anytime as they strap themselves into one of 14 lethal machines on wheels, equipped with machine guns, turbo boost andComplete with all the fast-paced vehicular combat and destruction that gamers have come to know and love, Twisted Metal: Head-On allows gamers to take destruction anywhere, anytime as they strap themselves into one of 14 lethal machines on wheels, equipped with machine guns, turbo boost and a special attack, unique to each vehicle. Once a vehicle is selected, gamers can take their road rage out on opponents in 12 unworldly arenas filled with numerous items of chaos including rockets, missiles and more. In addition, multiplayer gameplay is available for to eight players through Wireless multiplayer connectivity. [SCEA]… Expand"}, {"name": "Capcom Fighting Collection", "details_link": "https://www.metacritic.com/game/playstation-4/capcom-fighting-collection", "publisher": "Capcom", "release_date": "Jun 24 2022", "developers": ["Capcom"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 9 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 79, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/2/c41332ac8dccb93b1c7d6d953af77c41-98.jpg", "descriptions": "Features 10 classic titles, including two Darkstalkers games never before released in North America! Take on all challengers in online play with rollback netcode for all ten games, and enjoy additional features including a gallery of official art, a music player with hundreds of tracks, andFeatures 10 classic titles, including two Darkstalkers games never before released in North America! Take on all challengers in online play with rollback netcode for all ten games, and enjoy additional features including a gallery of official art, a music player with hundreds of tracks, and more:\r Darkstalkers: The Night Warriors\r  Night Warriors: Darkstalkers’ Revenge\r  Vampire Savior: The Lord of Vampire\r  Vampire Hunter 2: Darkstalkers’ Revenge (Japanese version, first official release in North America)\r  Vampire Savior 2: The Lord of Vampire (Japanese version, first official release in North America)\r  Red Earth (First release outside of arcades)\r  Cyberbots: Fullmetal Madness\r  Super Gem Fighter Mini Mix\r  Super Puzzle Fighter II Turbo\r  Hyper Street Fighter II… Expand"}, {"name": "Geometry Wars: Galaxies", "details_link": "https://www.metacritic.com/game/ds/geometry-wars-galaxies", "publisher": "Sierra Entertainment", "release_date": "Nov 27 2007", "developers": ["Bizarre Creations", "Kuju Entertainment"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Static", "Third-Person", "Static", "Shoot-'Em-Up", "Sci-Fi", "Top-Down"], "meta_score": 79, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/7fcb75941b348ba573d2a4ee067eda2e-98.jpg", "descriptions": "Geometry Wars: Galaxies delivers an all new mission-based campaign where players blast-off on action-paced quests across the galaxy, defending solar systems one by one, defeating waves of alien enemies on new and classic Battle Grids. The controls have been optimized for Nintendo systems,Geometry Wars: Galaxies delivers an all new mission-based campaign where players blast-off on action-paced quests across the galaxy, defending solar systems one by one, defeating waves of alien enemies on new and classic Battle Grids. The controls have been optimized for Nintendo systems, allowing gamers to use the Wii Remote and Nunchuk controller or DS touch screen to execute hotshot moves as never before. For the first time ever, the Geometry Wars videogame lets players battle via hot seat, co-op, simultaneous and versus in multiplayer mode. Those that own both the Nintendo DS and Wii can link the game together using Wi-Fi to unlock bonus content. Elite players can challenge the universe by posting high scores on the Wii's online leader board. Geometry Wars: Galaxies videogame also includes the full version of \"Geometry Wars: Retro Evolved\". [Sierra Entertainment]… Expand"}, {"name": "Pharaoh: A New Era", "details_link": "https://www.metacritic.com/game/pc/pharaoh-a-new-era", "publisher": "DotEmu", "release_date": "Feb 15 2023", "developers": ["Triskell Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Strategy", "Management", "Government"], "meta_score": 79, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/1/29b51bbc6f163c296a608bafef8fbeb0-98.jpg", "descriptions": "The legendary city-builder returns. Lead the creation of one of the greatest civilizations the world has ever seen in this 4K remake with modernized UI. Build monuments, manage your population through hundred of hours of gameplay and explore 4,000 years of history through more than 50 missions."}, {"name": "Wayward Strand", "details_link": "https://www.metacritic.com/game/playstation-5/wayward-strand", "publisher": "Ghost Pattern", "release_date": "Jul 21 2022", "developers": ["Ghost Pattern"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 79, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/b50fa618ccb492556799f96b868d9511-98.jpg", "descriptions": "Welcome to the Hospital - It’s the summer of 1978, and Casey Beaumaris is trying to make the most of her holidays, when her mum asks her to spend a long weekend helping out at the airborne hospital where she works. Casey prefers the company of books to people, but she agrees, secretlyWelcome to the Hospital - It’s the summer of 1978, and Casey Beaumaris is trying to make the most of her holidays, when her mum asks her to spend a long weekend helping out at the airborne hospital where she works. Casey prefers the company of books to people, but she agrees, secretly planning to write an article about her visit for the school newspaper. With her trusty notebook at the ready, Casey arrives on board the airship. The staff are overworked as they prepare for the visit of an important official, while the patients react to grief, or deal with active trauma. In the midst of these and many other interlocking and overlapping stories, Casey spends time with the patients, learning about their lives, and, as the stories unfold, discovering what she can do to help.… Expand"}, {"name": "Neon Abyss", "details_link": "https://www.metacritic.com/game/switch/neon-abyss", "publisher": "Veewo Games", "release_date": "Jul 14 2020", "developers": ["Veewo Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 79, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/83cc9cf536eb47b3a37bbf3909a9134d-98.jpg", "descriptions": "Neon Abyss is a frantic, roguelike action-platformer where you run ‘n’ gun your way into the Abyss as part of the Hades formed ‘Grim Squad’.\r Featuring unlimited item synergies and a unique dungeon evolution system, each run diversifies the experience and makes it so every choice altersNeon Abyss is a frantic, roguelike action-platformer where you run ‘n’ gun your way into the Abyss as part of the Hades formed ‘Grim Squad’.\r Featuring unlimited item synergies and a unique dungeon evolution system, each run diversifies the experience and makes it so every choice alters the ruleset.\r As you explore the underworld and face the modern gods of Neon Abyss you will craft your own upgrade path but also change multiple aspects of the game’s experience including bosses, rulesets, items, and even access new endings.… Expand"}, {"name": "Wildfire", "details_link": "https://www.metacritic.com/game/pc/wildfire", "publisher": "Sneaky Bastards", "release_date": "May 25 2020", "developers": ["Sneaky Bastards"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/3087492e89ea8801a7299abd6edb7765-98.jpg", "descriptions": "Master the elements in this stealth game where everything burns. Start fires, freeze water, and move earth itself to outsmart superstitious enemies who fear your power. Rescue captive villagers and reclaim your home by turning the environment against the army sent to hunt you down."}, {"name": "Arise: A Simple Story", "details_link": "https://www.metacritic.com/game/pc/arise-a-simple-story", "publisher": "Techland", "release_date": "Dec  3 2019", "developers": ["Piccolo"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 79, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/cae88e36155d1c4fa05e246953fe6f3d-98.jpg", "descriptions": "Set out on an emotional journey through the bittersweet lives of two people where memories come alive and time bends to your will. Lose yourself in moments of happiness and overcome every hardship as you relive your life’s story. A story of joy and sorrow. A simple story."}, {"name": "Captain Toad: Treasure Tracker", "details_link": "https://www.metacritic.com/game/3ds/captain-toad-treasure-tracker", "publisher": "Nintendo", "release_date": "Jul 13 2018", "developers": ["Nintendo EAD Tokyo ", "Nintendo Software Technology"], "platforms": ["Switch", "Wii U", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "Platformer", "3D"], "meta_score": 79, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/7a4bdcc498deffb4e666f930b1da6bf9-98.jpg", "descriptions": "The intrepid Captain Toad sets off on his own adventure for the very first time through a wide variety of tricky, enemy-infested, maze-like stages to find hidden gems and nab elusive gold stars."}, {"name": "Heat Signature", "details_link": "https://www.metacritic.com/game/pc/heat-signature", "publisher": "Tom Francis", "release_date": "Sep 21 2017", "developers": ["Tom Francis"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 79, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/ad84b3deb55138b777af27ef5b3bd2be-98.jpg", "descriptions": "Heat Signature is a game about randomised space ships that you can sneak aboard. These ships have a randomly generated interior of connected rooms and corridors, and crew that patrol those rooms."}, {"name": "Wonder Boy: The Dragon's Trap", "details_link": "https://www.metacritic.com/game/switch/wonder-boy-the-dragons-trap", "publisher": "DotEmu", "release_date": "Apr 18 2017", "developers": ["Lizardcube"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "Metroidvania"], "meta_score": 79, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/f5c921cd69c4d4b8b97e4b22012435c1-98.jpg", "descriptions": "Boasting beautiful, hand-drawn animations and a re-orchestrated soundtrack, the cult classic returns with a unique blend of exploration, action, and adventure!\r Cursed into a half-human, half-lizard monstrosity by the Meka-Dragon, you are in search for a cure! The only way you can returnBoasting beautiful, hand-drawn animations and a re-orchestrated soundtrack, the cult classic returns with a unique blend of exploration, action, and adventure!\r Cursed into a half-human, half-lizard monstrosity by the Meka-Dragon, you are in search for a cure! The only way you can return to human form is to find the Salamander Cross, a magical item with the power to remove curses...\r With each dragon slain, the curse intensifies, transforming you into different animals! Explore large, interconnected locations populated with grumpy monsters and exotic dragons!\r Play as the games classic character, Hu-Man, or as his brand-new, long-awaited co-star Hu-Girl. You can also inhabit Lizard-Man, Mouse-Man, Piranha-Man, Lion-Man, and Hawk-Man, and use their unique abilities to uncover the lands deepest secrets.\rEnjoy 3 difficulty levels catering to players of all types, and switch from modern graphics and sound to 8-bit graphics/audio at any time - even during gameplay!… Expand"}, {"name": "Tales of Monkey Island Chapter 2: The Siege of Spinner Cay", "details_link": "https://www.metacritic.com/game/wii/tales-of-monkey-island-chapter-2-the-siege-of-spinner-cay", "publisher": "Telltale Games", "release_date": "Aug 31 2009", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Wii"], "num_players": "1 Player", "genres": ["Adventure", "General", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 79, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/8efe5125d51258083a70d1a9b03c5018-98.jpg", "descriptions": "[WiiWare]  Guybrush's adventures continue on the high seas as pox-plagued pirates lay siege to the innocent Mer-People. In between defending the Mer-People and dodging the persistent pirate hunter hot on his trail, Guybrush manages to catch up to his beloved wife and despised arch-nemesis --[WiiWare]  Guybrush's adventures continue on the high seas as pox-plagued pirates lay siege to the innocent Mer-People. In between defending the Mer-People and dodging the persistent pirate hunter hot on his trail, Guybrush manages to catch up to his beloved wife and despised arch-nemesis -- but their reunion is short-lived. Now Guybrush must focus on eradicating the Pox of LeChuck before more harm can be done. And as the Mighty Pirate draws closer to a cure, the waters will only grow murkier in this thrilling chapter of the epic saga. [Nintendo]… Expand"}, {"name": "FIFA Soccer 08", "details_link": "https://www.metacritic.com/game/psp/fifa-soccer-08", "publisher": "EA Sports", "release_date": "Oct  8 2007", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 79, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/24e39c59826ed4ebb85fdfe8ddf6d027-98.jpg", "descriptions": "FIFA Soccer 08  challenges players to master the skills required to play like a pro soccer player. Fans around the world can experience the same highs and lows of real-world players and tackle the challenges they face on a daily basis. FIFA Soccer 08 puts you on the pitch to defy the odds,FIFA Soccer 08  challenges players to master the skills required to play like a pro soccer player. Fans around the world can experience the same highs and lows of real-world players and tackle the challenges they face on a daily basis. FIFA Soccer 08 puts you on the pitch to defy the odds, perfect your skills, elevate your game and rise up to win glory for your club. [Electronic Arts]… Expand"}, {"name": "Sonic Advance 3", "details_link": "https://www.metacritic.com/game/game-boy-advance/sonic-advance-3", "publisher": "THQ", "release_date": "Jun  7 2004", "developers": ["Dimps Corporation"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 79, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/91bd875b97e3989ef65867e496545b6f-98.jpg", "descriptions": "Sonic is back, and this time, he needs the help of all of his friends to defeat the evil Dr. Eggman. In Sonic Advance 3, Sonic and Tails must reunite with their friends Cream, Knuckles, and Amy. Team up with any of the five characters to gain special attack moves: Sonic increases your speed,Sonic is back, and this time, he needs the help of all of his friends to defeat the evil Dr. Eggman. In Sonic Advance 3, Sonic and Tails must reunite with their friends Cream, Knuckles, and Amy. Team up with any of the five characters to gain special attack moves: Sonic increases your speed, Tails increases your jump power, Knuckles increases your attack power, Amy offers the Piko Piko hammer attack, and Cream lets you perform a homing attack. With a Game Boy Advance link, you and three of your friends can battle it out in multiplayer modes.… Expand"}, {"name": "Observer: System Redux", "details_link": "https://www.metacritic.com/game/xbox-series-x/observer-system-redux", "publisher": "Aspyr", "release_date": "Nov 10 2020", "developers": ["Bloober Team"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 79, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/98b47e3699ab125108b2510826f9540c-98.jpg", "descriptions": "The year is 2084. In a dark cyberpunk world shattered by plagues and wars, become a neural police detective and hack into the jagged minds of others. Make use of anything they felt, thought, or remembered to solve the case and catch the elusive killer."}, {"name": "Chivalry: Medieval Warfare", "details_link": "https://www.metacritic.com/game/pc/chivalry-medieval-warfare", "publisher": "Torn Banner Studios", "release_date": "Oct 16 2012", "developers": ["Torn Banner Studios"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "Up to 32 ", "genres": ["Action", "Strategy", "General", "General", "General", "Beat-'Em-Up", "3D"], "meta_score": 79, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/4920c7f621d0a6dd72c40c43f09db64a-98.jpg", "descriptions": "CHIVALRY: Medieval Warfare is a first-person medieval combat game that seeks to deliver the intensity of epic hollywood medieval block busters to the hands of a gamer. CHIVALRY hurls the player into a fictional yet realistic medieval world where the Agathian Knights are battling against theCHIVALRY: Medieval Warfare is a first-person medieval combat game that seeks to deliver the intensity of epic hollywood medieval block busters to the hands of a gamer. CHIVALRY hurls the player into a fictional yet realistic medieval world where the Agathian Knights are battling against the newly formed Mason Order for control of the lands of Agatha.… Expand"}, {"name": "de Blob 2", "details_link": "https://www.metacritic.com/game/wii/de-blob-2", "publisher": "THQ", "release_date": "Feb 22 2011", "developers": ["Blue Tongue Entertainment"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "Wii"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 79, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/68c9d723f4c96a53b6f85675c46f9560-98.jpg", "descriptions": "This is the follow-up title to 2008's popular hit, de Blob."}, {"name": "Wolfenstein II: The New Colossus", "details_link": "https://www.metacritic.com/game/switch/wolfenstein-ii-the-new-colossus", "publisher": "Bethesda Softworks", "release_date": "Jun 29 2018", "developers": ["Panic Button", "MachineGames"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 79, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/edda690997df4ce3a8e533264ef4ba29-98.jpg", "descriptions": "Wolfenstein II: The New Colossus is the highly anticipated sequel to the critically acclaimed, Wolfenstein: The New Order developed by the award-winning studio MachineGames. An exhilarating adventure brought to life by the industry-leading id Tech 6, Wolfenstein II sends players toWolfenstein II: The New Colossus is the highly anticipated sequel to the critically acclaimed, Wolfenstein: The New Order developed by the award-winning studio MachineGames. An exhilarating adventure brought to life by the industry-leading id Tech 6, Wolfenstein II sends players to Nazi-controlled America on a mission to recruit the boldest resistance leaders left. Fight the Nazis in iconic American locations, equip an arsenal of badass guns, and unleash new abilities to blast your way through legions of Nazi soldiers in this definitive first-person shooter. America, 1961. The Nazis maintain their stranglehold on the world. You are BJ Blazkowicz, aka Terror-Billy, member of the Resistance, scourge of the Nazi empire, and humanitys last hope for liberty. Only you have the guts, guns, and gumption to return stateside, kill every Nazi in sight, and spark the second American Revolution.… Expand"}, {"name": "World of Final Fantasy Maxima", "details_link": "https://www.metacritic.com/game/switch/world-of-final-fantasy-maxima", "publisher": "Square Enix", "release_date": "Nov  6 2018", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 79, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/cda80efaf7e4e77bd78ebc3865eb3f3c-98.jpg", "descriptions": "POWERED UP AND REBORN!Expanding the horizons of FINAL FANTASY! A tale of many encounters and the birth of a new world.\n\nOriginally released in October 2016, WORLD OF FINAL FANTASY has just been powered up and reborn as WORLD OF FINAL FANTASY Maxima! New characters from FF lore (Champions)POWERED UP AND REBORN!Expanding the horizons of FINAL FANTASY! A tale of many encounters and the birth of a new world.Originally released in October 2016, WORLD OF FINAL FANTASY has just been powered up and reborn as WORLD OF FINAL FANTASY Maxima! New characters from FF lore (Champions) and monsters (Mirages) add even more fun and excitement to this unique adventure. This new and enhanced version of WORLD OF FINAL FANTASY also features the Avatar Change system, which allows the protagonists, Reynn and Lann, to fight as Champions. Fight your way through exhilarating battles as legendary FINAL FANTASY heroes!… Expand"}, {"name": "FIFA 20", "details_link": "https://www.metacritic.com/game/playstation-4/fifa-20", "publisher": "Electronic Arts", "release_date": "Sep 24 2019", "developers": ["Electronic Arts"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 79, "users_score": 1.4, "image": "https://static.metacritic.com/images/products/games/1/dc9eb63b37b0d1f05239219b909ccb20-98.jpg", "descriptions": "Enjoy more control over the Decisive Moments that determine the outcome of every match in FIFA 20. Pick your target and time it right from the spot. Add curl, dip, or knuckle to free kicks. A new aiming mechanic gives you more creativity from dead balls. Move with more agility. Lure theEnjoy more control over the Decisive Moments that determine the outcome of every match in FIFA 20. Pick your target and time it right from the spot. Add curl, dip, or knuckle to free kicks. A new aiming mechanic gives you more creativity from dead balls. Move with more agility. Lure the defender in. Beat them with speed or skill. New strafe dribbling adds new dimensions for attacking play in FIFA 20. Take back possession with Active Touch Tackling and new animations that reward you for well-timed defensive play. More clinical finishing when one-on-one. More risk with volleys and long shots. Overhauled shooting creates more realism in front of goal in FIFA 20. [Electronic Arts]… Expand"}, {"name": "Wonder Boy: The Dragon's Trap", "details_link": "https://www.metacritic.com/game/playstation-4/wonder-boy-the-dragons-trap", "publisher": "DotEmu", "release_date": "Apr 18 2017", "developers": ["Lizardcube"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "Metroidvania"], "meta_score": 79, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/99fd2d67a2fc110632227fb47d94d7ea-98.jpg", "descriptions": "Boasting hand-drawn animations and a re-orchestrated soundtrack, the cult classic returns with a unique blend of exploration, action, and adventure."}, {"name": "Overlord II", "details_link": "https://www.metacritic.com/game/pc/overlord-ii", "publisher": "Codemasters", "release_date": "Jun 23 2009", "developers": ["Triumph Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 79, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/d42c0134ff2ecb6ef26484d5b472b722-98.jpg", "descriptions": "Overlord II is the sequel to the warped fantasy action adventure that had players being delightfully despotic. In Overlord II, a new Overlord and a more powerful army of Minions take on an entire empire in a truly epic adventure, inspired by the rise of the Roman Empire. As the GloriousOverlord II is the sequel to the warped fantasy action adventure that had players being delightfully despotic. In Overlord II, a new Overlord and a more powerful army of Minions take on an entire empire in a truly epic adventure, inspired by the rise of the Roman Empire. As the Glorious Empire conquers kingdoms and destroys any sign of magic it finds, it's time to go Minion Maximus and send in the horde. The Minions return smarter, deadlier (and funnier) and are ready to fight in large scale battles that will see their wild pack mentality squaring up to the organised legions of the Glorious Empire. As ever, they'll do anything and everything the Overlord commands of them, especially now that they can run ravage and wreck buildings and scenery. They've also learned how to ride: In Overlord II Minions mount up and ride wolves and other magical creatures around the landscape and take them into battle, making our band of merry fighters faster and fiercer than ever before. [Codemasters]… Expand"}, {"name": "Capcom Fighting Collection", "details_link": "https://www.metacritic.com/game/pc/capcom-fighting-collection", "publisher": "Capcom", "release_date": "Jun 24 2022", "developers": ["Capcom"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 9 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 79, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/1/efa7c5aff9c242830c6aa01a575d3726-98.jpg", "descriptions": "Features 10 classic titles, including two Darkstalkers games never before released in North America! Take on all challengers in online play with rollback netcode for all ten games, and enjoy additional features including a gallery of official art, a music player with hundreds of tracks, andFeatures 10 classic titles, including two Darkstalkers games never before released in North America! Take on all challengers in online play with rollback netcode for all ten games, and enjoy additional features including a gallery of official art, a music player with hundreds of tracks, and more:\r Darkstalkers: The Night Warriors\r  Night Warriors: Darkstalkers’ Revenge\r  Vampire Savior: The Lord of Vampire\r  Vampire Hunter 2: Darkstalkers’ Revenge (Japanese version, first official release in North America)\r  Vampire Savior 2: The Lord of Vampire (Japanese version, first official release in North America)\r  Red Earth (First release outside of arcades)\r  Cyberbots: Fullmetal Madness\r  Super Gem Fighter Mini Mix\r  Super Puzzle Fighter II Turbo\r  Hyper Street Fighter II… Expand"}, {"name": "A Musical Story", "details_link": "https://www.metacritic.com/game/switch/a-musical-story", "publisher": "Digerati Distribution", "release_date": "Mar  3 2022", "developers": ["Glee-Cheese Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 79, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/f761c7fe49c64c4a3e87860504708ebd-98.jpg", "descriptions": "A Musical Story is a rhythm game set against a 70s backdrop. Explore the memories of Gabriel, a young man trying to come to terms with his situation through the connections to his musical memory."}, {"name": "Astrologaster", "details_link": "https://www.metacritic.com/game/switch/astrologaster", "publisher": "Nyamyam", "release_date": "Feb 18 2021", "developers": ["Nyamyam"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 79, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/77b96bae0c0aeb4ff3666d67a2af6540-98.jpg", "descriptions": "Play as ‘Doctor’ Simon Forman - unlicensed medical professional and astrologer - and help him win a medical licence. Astrologaster is a narrative-based comedy game. Explore Forman’s life, his work, and his relationships with his clients. Make story choices by performing astrologicalPlay as ‘Doctor’ Simon Forman - unlicensed medical professional and astrologer - and help him win a medical licence. Astrologaster is a narrative-based comedy game. Explore Forman’s life, his work, and his relationships with his clients. Make story choices by performing astrological readings. Choose strategically or make decisions just for fun - but be aware that your choices will have consequences (and unpredictable side effects!) 13 clients come to see you 5-7 times seeking advice for personal, professional and medical problems. By examining the stars in the sky, you diagnose and determine answers for your clients’ problems. As well as affecting the storyline, these choices will alter your clients’ satisfaction levels. Satisfied clients will write you letters of recommendation, and with enough of these letters you can obtain a medical licence from the University of Cambridge.\r So-called “real” (licensed) doctors call Forman a quack and fraud. Help Forman prove these medical establishment elitists wrong!… Expand"}, {"name": "World End Syndrome", "details_link": "https://www.metacritic.com/game/switch/world-end-syndrome", "publisher": "Arc System Works", "release_date": "May  2 2019", "developers": ["Arc System Works", "TOYBOX"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 79, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/3a5184630278e0df280eb1680964830c-98.jpg", "descriptions": "Mixing romance with murders and the living dead, World End Syndrome is a gripping story that will make you shiver but ask for more! Arrive in a beautiful seaside town and join the local school's clubs, before a dead body drifts on the shores of the river and it's up to you and your friendsMixing romance with murders and the living dead, World End Syndrome is a gripping story that will make you shiver but ask for more! Arrive in a beautiful seaside town and join the local school's clubs, before a dead body drifts on the shores of the river and it's up to you and your friends to figure out if the legend of the Yomibito is true and what it means for the town...… Expand"}, {"name": "Victor Vran: Overkill Edition", "details_link": "https://www.metacritic.com/game/xbox-one/victor-vran-overkill-edition", "publisher": "Wired Productions", "release_date": "May 30 2017", "developers": ["Haemimont Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 79, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/5b35f30187b69826f796b19ff61028a9-98.jpg", "descriptions": "Become Victor, hunter of demons. Forge your own hero on a quest to liberate the cursed city of Zagoravia. Explore ‘Motörhead: Through the Ages’ - a wild tour through the mythos of the loudest band in the world, and enter the Fractured Worlds, a dimension formed from the fragments of brokenBecome Victor, hunter of demons. Forge your own hero on a quest to liberate the cursed city of Zagoravia. Explore ‘Motörhead: Through the Ages’ - a wild tour through the mythos of the loudest band in the world, and enter the Fractured Worlds, a dimension formed from the fragments of broken realms.… Expand"}, {"name": "NHL 06", "details_link": "https://www.metacritic.com/game/xbox/nhl-06", "publisher": "EA Sports", "release_date": "Sep  6 2005", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "8  Online", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 79, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/979475293c43b27dec796772a7bf63ca-98.jpg", "descriptions": "The EA Sports hockey franchise returns with a host of new features in NHL 06. You can carefully place your shots and time your dekes with the new \"skill stick\" system. More-realistic physics have you adjust to a player's speed and size as you navigate the ice. In addition to NHLThe EA Sports hockey franchise returns with a host of new features in NHL 06. You can carefully place your shots and time your dekes with the new \"skill stick\" system. More-realistic physics have you adjust to a player's speed and size as you navigate the ice. In addition to NHL stars, you can create your own player or team from the ground up and lead them through an NHL season. NHL 06 also includes both online and offline multiplayer game modes.… Expand"}, {"name": "OutRun Online Arcade", "details_link": "https://www.metacritic.com/game/xbox-360/outrun-online-arcade", "publisher": "Sega", "release_date": "Apr 15 2009", "developers": ["Sumo Digital"], "platforms": "Xbox 360", "num_players": "6  Online", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 79, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/e90110d37ece834b962efdafc75818a6-98.jpg", "descriptions": "[Xbox Live Arcade]  Experience the mayhem and action of OutRun Online Arcade as you test your time, speed, and handling ability, bringing your next-gen skills online with this coin-op classic. Feel the kick as you put your foot to the floor in one of 10 high-performance Ferraris racing your[Xbox Live Arcade]  Experience the mayhem and action of OutRun Online Arcade as you test your time, speed, and handling ability, bringing your next-gen skills online with this coin-op classic. Feel the kick as you put your foot to the floor in one of 10 high-performance Ferraris racing your way across the U.S. with an open top and a girl by your side. Winding roads, beautiful beaches and big city lights - it's mile after mile of unrelenting acceleration through 15 action-packed courses, all visually enhanced in stunning high definition. Jump behind the wheel for the ultimate arcade racing experience and push yourself on the road as you race up to six others with online multiplayer. OutRun Online Arcade - it's a beautiful journey! Competition: OutRun delivers online multiplayer for up to six players for the first time on Xbox LIVE Arcade. Courses and cars: Race through 15 glorious courses in 10 licensed Ferrari cars for the ultimate OutRun ride. Arcade modes: The fast-paced arcade action thrills with heart attack and time attack modes. Classic tracks: Catch the cool sounds of OutRun as these smashing tracks feature alongside stunning new visuals. [Sega]… Expand"}, {"name": "Band Hero", "details_link": "https://www.metacritic.com/game/wii/band-hero", "publisher": "Activision", "release_date": "Nov  3 2009", "developers": ["Vicarious Visions"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 79, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/3313162d4f702ff9313e8dbd92c8140c-98.jpg", "descriptions": "Family and friends come together to ascend the virtual stage and rock their way to superstardom with Band Hero, which features the hottest chart-topping hits from everyone's favorite acts including No Doubt, Lily Allen, The All-American Rejects, Snow Patrol and The Jackson 5. Headlined byFamily and friends come together to ascend the virtual stage and rock their way to superstardom with Band Hero, which features the hottest chart-topping hits from everyone's favorite acts including No Doubt, Lily Allen, The All-American Rejects, Snow Patrol and The Jackson 5. Headlined by some of the biggest names in music as in-game artists and playable characters, Band Hero is the ultimate party game where players of all ages can create the band they have always dreamed of by using any combination of guitar or drum controllers and vocals, providing rockers and performers of all ages the chance to experience and interact with their favorite music. [Activision]… Expand"}, {"name": "GRID Autosport", "details_link": "https://www.metacritic.com/game/switch/grid-autosport", "publisher": "Codemasters", "release_date": "Sep 19 2019", "developers": ["Codemasters", "Feral Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 79, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/030b23cac4a3a436e03daa1f3569ea8e-98.jpg", "descriptions": "Its all about the teams, the rivals & the race in an intense world of professional motorsport. Racing alongside a teammate, overcome key rivals & satisfy team sponsors in ferocious races where every pass & position counts. In a huge career, specialise in your favourite racingIts all about the teams, the rivals & the race in an intense world of professional motorsport. Racing alongside a teammate, overcome key rivals & satisfy team sponsors in ferocious races where every pass & position counts. In a huge career, specialise in your favourite racing discipline or conquer them all feel the aggression of the pack in Touring Cars, race Open-Wheel cars with precision, manage tyre wear in Endurance events, show car control in Tuner events & react on the fly in Street races. Each category features series for different classes, including Touring Cars, Hypercars, Prototypes, Single-Seaters, Drift cars & many, many more. GRID Autosport features over 100 routes across 22 locations & the worlds most exciting high-performance racing cars. Development has been driven by Community feedback to include the return of in-car view, authentic handling & multiplayer racing powered by RaceNet to deliver new weekly challenges & all-new Racing Clubs for online team competition.… Expand"}, {"name": "Hearthstone: Heroes of Warcraft - Journey to Un'Goro", "details_link": "https://www.metacritic.com/game/pc/hearthstone-heroes-of-warcraft---journey-to-ungoro", "publisher": "Blizzard Entertainment", "release_date": "Apr  6 2017", "developers": ["Blizzard Entertainment"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 79, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/3/3943162577f2da915bd2187203044cc5-98.jpg", "descriptions": "Travel to the forbidding jungles of Un’Goro Crater, where primordial creatures from the dawn of time roam. Here, giant dinosaurs infused with raw magical power mercilessly hunt their prey, prehistoric fauna and flora abound, and unchained elementals run wild with primitive magic. PrepareTravel to the forbidding jungles of Un’Goro Crater, where primordial creatures from the dawn of time roam. Here, giant dinosaurs infused with raw magical power mercilessly hunt their prey, prehistoric fauna and flora abound, and unchained elementals run wild with primitive magic. Prepare your decks for the expedition of a lifetime.… Expand"}, {"name": "Frostpunk: The Last Autumn", "details_link": "https://www.metacritic.com/game/pc/frostpunk-the-last-autumn", "publisher": "11 bit studios", "release_date": "Jan 21 2020", "developers": ["11 bit studios"], "platforms": "PC", "genres": ["Strategy", "Action Adventure", "Management", "Survival", "Government"], "meta_score": 79, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/9de55878377faec5e15bb1f3877e784b-98.jpg", "descriptions": "Learn about the tragic turn of events that lead to the grim world of Frostpunk in the prequel expansion, The Last Autumn. Vastly expanding upon the Frostpunk universe by introducing a brand new scenario, the expansion content also introduces game-changing new mechanics, unique architecture,Learn about the tragic turn of events that lead to the grim world of Frostpunk in the prequel expansion, The Last Autumn. Vastly expanding upon the Frostpunk universe by introducing a brand new scenario, the expansion content also introduces game-changing new mechanics, unique architecture, and broaden's the game's deep lore and narrative.… Expand"}, {"name": "The Darkness II", "details_link": "https://www.metacritic.com/game/playstation-3/the-darkness-ii", "publisher": "2K Games", "release_date": "Feb  7 2012", "developers": ["Digital Extremes"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/cbaa31a73a54fc16f5ebedbafad464e2-98.jpg", "descriptions": "Inspired by the comic book series, The Darkness II is a first-person shooter that thrusts you into the role of Jackie Estacado, don of a New York crime family and wielder of an ancient chaotic force known as The Darkness. It has been 2 years since Jackie used his power to kill the guysInspired by the comic book series, The Darkness II is a first-person shooter that thrusts you into the role of Jackie Estacado, don of a New York crime family and wielder of an ancient chaotic force known as The Darkness. It has been 2 years since Jackie used his power to kill the guys responsible for his girlfriend’s murder. He has been unable to free himself of the  memory of Jenny’s death since bottling up The Darkness and now it wants out. A botched attempt to end Jackie’s life opens the door for The Darkness to reemerge and sets Jackie on a brutal journey as he unravels the mystery behind the attack and the motives of The Darkness. [2K Games]… Expand"}, {"name": "Scram Kitty and His Buddy on Rails", "details_link": "https://www.metacritic.com/game/wii-u/scram-kitty-and-his-buddy-on-rails", "publisher": "Dakko Dakko", "release_date": "May 15 2014", "developers": ["Dakko Dakko"], "platforms": ["PlayStation 4", "PlayStation Vita", "Wii U"], "genres": ["General", "Action", "General"], "meta_score": 79, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/88666040702352c6f0bd668c775c13f2-98.jpg", "descriptions": "Take control of a rail-riding, laser-shooting young hero on a perilous quest to find his kidnapped pet cat! With a unique control system that allows for 360 degree platforming action and exciting 2D shooting, Scram Kitty and his Buddy on Rails pits players against an army of intelligent,Take control of a rail-riding, laser-shooting young hero on a perilous quest to find his kidnapped pet cat! With a unique control system that allows for 360 degree platforming action and exciting 2D shooting, Scram Kitty and his Buddy on Rails pits players against an army of intelligent, mechanized rodents. Glide along glowing rails, leap across chasms and leave arcing streams of shots as you rid each stage of the rodent aggressors and locate the keys to the numerous cat cages. Keys are attached to specific objectives, adding a multi-layered design to stages and adding replay value for completionists who won't rest until every cat is free!… Expand"}, {"name": "F.E.A.R. 2: Project Origin", "details_link": "https://www.metacritic.com/game/pc/fear-2-project-origin", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb 10 2009", "developers": ["Monolith Productions"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 79, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/f85b2e474be331ee5656608674c75347-98.jpg", "descriptions": "The sequel to F.E.A.R. continues the original game's spine-tingling supernatural suspense story of an escalating paranormal crisis that threatens to destroy a major American city. At the center of the calamity is the mysterious Alma, whose rage against those who wronged her triggered a chainThe sequel to F.E.A.R. continues the original game's spine-tingling supernatural suspense story of an escalating paranormal crisis that threatens to destroy a major American city. At the center of the calamity is the mysterious Alma, whose rage against those who wronged her triggered a chain of events that have spiraled completely out of control. Now that she has free reign, the consequences will be unimaginable. [Warner Bros.]… Expand"}, {"name": "Lego Star Wars", "details_link": "https://www.metacritic.com/game/gamecube/lego-star-wars", "publisher": "Eidos Interactive", "release_date": "Oct 25 2005", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/37bfdfdbd830ab00aa02404729305b14-98.jpg", "descriptions": "Lego Star Wars blends Lego toys with the characters, stories, and vehicles from the prequel eras of the Star Wars universe. Now you can experience scenes from The Phantom Menace, Attack of the Clones, and Revenge of the Sith while controlling characters such as Obi-Wan Kenobi, Yoda, andLego Star Wars blends Lego toys with the characters, stories, and vehicles from the prequel eras of the Star Wars universe. Now you can experience scenes from The Phantom Menace, Attack of the Clones, and Revenge of the Sith while controlling characters such as Obi-Wan Kenobi, Yoda, and Anakin Skywalker. Use the Jedi \"force\" to solve puzzles and manipulate environments. During your journey, you'll do everything from pod racing on Mos Espa to repelling the droid onslaught in the Genosian arena. Your friend can even join the action to help you at any time during your game.… Expand"}, {"name": "F1 Manager 2022", "details_link": "https://www.metacritic.com/game/pc/f1-manager-2022", "publisher": "Frontier Developments", "release_date": "Aug 25 2022", "developers": ["Frontier Developments"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Simulation", "Other"], "meta_score": 79, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/461023c75b73a41c0a2eaeea97aea242-98.jpg", "descriptions": "Make your mark on Formula 1 in the officially licensed F1 Manager 2022. Be the boss of your chosen constructor and pick from a roster of 2022 drivers and staff."}, {"name": "MLB Power Pros 2008", "details_link": "https://www.metacritic.com/game/wii/mlb-power-pros-2008", "publisher": "2K Sports", "release_date": "Jul 29 2008", "developers": ["Konami"], "platforms": ["PlayStation 2", "Wii"], "genres": ["Sports", "Traditional", "Team", "Baseball", "Arcade", "Arcade"], "meta_score": 79, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/8/a159954c50acc05d49ad351b8e4e6b94-98.jpg", "descriptions": "With over ten different exciting game modes including the traditional Practice, Exhibition, League and Home Run Challenge modes, MLB Power Pros 2008 brings fans closer to the action than ever before. Gamers also get the opportunity to act as general manager and control the destiny of theirWith over ten different exciting game modes including the traditional Practice, Exhibition, League and Home Run Challenge modes, MLB Power Pros 2008 brings fans closer to the action than ever before. Gamers also get the opportunity to act as general manager and control the destiny of their own franchise in Season mode, or engage in entertaining role-playing story modes such as Success and MLB Life modes. As general manager, gamers can trade, sign free agents, coordinate practice schedules, purchase new equipment, call up and send down players from the Minor Leagues, along with other management options to bring in fans, win playoff games and eventually, earn the title of World Series champion. In Success mode, fans can participate in a story-based career of rising players in the Double-A Minor League system trying to improve their baseball skills and make an impression on baseball scouts while also having to balance various situations in their personal lives. Through a variety of amusing training and game challenges, players who complete Success mode can take their created player files into MLB Life as well, or also play as either an existing Major League Baseball player in Dream Mode, or start as a rookie in Major League Career mode. As a new feature in MLB Power Pros 2008, MLB Life is another story-based mode that allows fans the possibility to simulate the exciting life and experience of being a Major League Baseball player over the course of a 20-year career. While continuing to play in games through the regular baseball season, players also participate in a number of realistic situations such as signing contracts, purchasing houses and cars, making charitable donations, building up relationships with friends and teammates, picking up hobbies and much more. [2K Sports]… Expand"}, {"name": "Major League Baseball 2K7", "details_link": "https://www.metacritic.com/game/xbox-360/major-league-baseball-2k7", "publisher": "2K Sports", "release_date": "Feb 26 2007", "developers": ["Kush Games"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 79, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/26646166fd5ebb3318ae75ff8afcd6de-98.jpg", "descriptions": "It's a whole new ballgame! Major League Baseball 2K7 redefines the pure baseball video game experience with true, Next-Gen details, all-new throwing mechanics and a revolutionary presentation system. Signature Style - Batting stances, waggles, home run celebrations, step-ins and step-outsIt's a whole new ballgame! Major League Baseball 2K7 redefines the pure baseball video game experience with true, Next-Gen details, all-new throwing mechanics and a revolutionary presentation system. Signature Style - Batting stances, waggles, home run celebrations, step-ins and step-outs bring each player to life. True Fielding – Fielder positioning, relay and cutoff A.I. has been redesigned to allow for better, more authentic Major League defensive play. Defensive alignments are now based on who is at the plate. Dynamic Throwing System - Responsive throwing mechanics coupled with unique animations for infield, outfield and situational throws brings your command of the ball to a new level. Inside Edge - Updated for the 2007 season, Inside Edge data is now tied into USER control at the plate. Playing into your pitcher's or hitter's strengths will now reward you with a boost in hitting power. [2K Sports]… Expand"}, {"name": "Agent A: A Puzzle In Disguise", "details_link": "https://www.metacritic.com/game/switch/agent-a-a-puzzle-in-disguise", "publisher": "Yak & Co", "release_date": "Aug 29 2019", "developers": ["Yak & Co"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 79, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/f8b54ead900a9d3b1ccbb4efff64265e-98.jpg", "descriptions": "Agent A is a spy themed puzzle game for Smartphones, Tablets and erm, Shoephones?! Your mission (should you choose to accept of course) is to infiltrate enemy spy Ruby La Rouge's secret hideaway and catch her! Uncover a stylish 60s themed world full of hidden contraptions and clever logicAgent A is a spy themed puzzle game for Smartphones, Tablets and erm, Shoephones?! Your mission (should you choose to accept of course) is to infiltrate enemy spy Ruby La Rouge's secret hideaway and catch her! Uncover a stylish 60s themed world full of hidden contraptions and clever logic based puzzles. Oh and do be careful, Miss La Rouge has a taste for dismissing agents such as yourself!… Expand"}, {"name": "World to the West", "details_link": "https://www.metacritic.com/game/xbox-one/world-to-the-west", "publisher": "Rain Games", "release_date": "May  5 2017", "developers": ["Rain Games", "Soedesco"], "platforms": ["PC", "PlayStation 4", "Switch", "Wii U", "Xbox One"], "genres": ["Action Adventure", "Linear"], "meta_score": 79, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/56e5c8a98b7af72ce4d7fb6c0d73b4c1-98.jpg", "descriptions": "A young Teslamancer, an optimistic underdog, a seasoned explorer and a strongman aristocrat out of his depth find themselves flung into an adventure none of them signed up for. In a land that holds secrets best left forgotten, the four heroes must use their unique abilities to find glory,A young Teslamancer, an optimistic underdog, a seasoned explorer and a strongman aristocrat out of his depth find themselves flung into an adventure none of them signed up for. In a land that holds secrets best left forgotten, the four heroes must use their unique abilities to find glory, get revenge, and for some, simply find a way home. [XBox.com]… Expand"}, {"name": "Atelier Rorona Plus: The Alchemist of Arland", "details_link": "https://www.metacritic.com/game/playstation-vita/atelier-rorona-plus-the-alchemist-of-arland", "publisher": "Tecmo Koei America Corp.", "release_date": "Jul 22 2014", "developers": ["Gust"], "platforms": ["PlayStation 3", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 79, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/25baa9f0372a22515a198c42cdfe830f-98.jpg", "descriptions": "The alchemic RPG franchise from Gust carries on the tradition of the Atelier series, using alchemy as the main focal point. Atelier Rorona Plus focuses on the exploits of Rorolina Frixell, one the most beloved characters of the Arland trilogy (Ateliers Meruru/ Totori/ Rorona), a young girlThe alchemic RPG franchise from Gust carries on the tradition of the Atelier series, using alchemy as the main focal point. Atelier Rorona Plus focuses on the exploits of Rorolina Frixell, one the most beloved characters of the Arland trilogy (Ateliers Meruru/ Totori/ Rorona), a young girl who is assigned to complete alchemy tasks over 3 years in order to keep her alchemy workshop and not be banished from the kingdom of Arland. Players can craft new items and also battle enemies using the power of alchemy. As all games in the Atelier series, this title is set against an anime-like background with 3D graphics and is characterized by an elaborate crafting and synthesis system. … Expand"}, {"name": "Space Channel 5 Special Edition", "details_link": "https://www.metacritic.com/game/playstation-2/space-channel-5-special-edition", "publisher": "Agetec Inc.", "release_date": "Nov 18 2003", "developers": ["UGA"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 79, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/603e0a9460dc05c1e2f795185e5522af-98.jpg", "descriptions": "It's the 25th century and our intergalactic space reporter dives into an adventure where she must battle with a series of dastardly villains! Are you ready to save the universe through the medium of dance? You must first battle wicked space nasties, the Morolians, who have attacked andIt's the 25th century and our intergalactic space reporter dives into an adventure where she must battle with a series of dastardly villains! Are you ready to save the universe through the medium of dance? You must first battle wicked space nasties, the Morolians, who have attacked and subdued innocent Earthlings with their dance-inflicting ray guns. In order to break the Morolian's hypnotic grasp, Ulala must mimic the aliens' exact dance moves by keeping the beat with pauses timed to perfection. But the adventure isn't over just yet; Ulala must also face another group of intergalactic terrorists who have designs on world domination. What is Ulala to do but to kick-up some pretty funky dance moves against these evil invaders who are bent on taking over the world. Ulala is the Earth's only hope! [Agetec] - Contains both the original SC5 and the sequel, SC5: Part II, previously available only in Japan.… Expand"}, {"name": "Emergency Fire Response", "details_link": "https://www.metacritic.com/game/pc/emergency-fire-response", "publisher": "DreamCatcher Interactive", "release_date": "Jul 30 2003", "developers": ["Monte Cristo Multimedia", "Monte Cristo"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 79, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/1565d81e34508799b160b42158b2372d-98.jpg", "descriptions": "In Emergency Fire Response, experience what life is really like for firefighters. Control an entire team of firefighters and their various support vehicles! As captain of your station, train up your team, teach them the basics of the profession and how to manage in emergencies, develop theirIn Emergency Fire Response, experience what life is really like for firefighters. Control an entire team of firefighters and their various support vehicles! As captain of your station, train up your team, teach them the basics of the profession and how to manage in emergencies, develop their resistance to stress... and most importantly, get your team through their missions successfully! The spread of the fire, poisonous fumes, the number of people in danger, their location... all this has to be taken into account upon arrival at the scene. If you think your guys can't handle it, call for backup from the specialists who will be able to handle the most difficult and deadly situations. [DreamCatcher]… Expand"}, {"name": "Downhill Domination", "details_link": "https://www.metacritic.com/game/playstation-2/downhill-domination", "publisher": "SCEA", "release_date": "Jul 23 2003", "developers": ["Incognito Inc."], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Other"], "meta_score": 79, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/4/1de27137be261fe97329f6c94dd0ee4d-98.jpg", "descriptions": "Downhill Domination is based on the extreme sport of downhill mountain bike racing and puts players in control of a customizable mountain bike to race down vertical mountainsides and urban environments while performing stunts at speeds in excess of 60 miles per hour. Playable in first- andDownhill Domination is based on the extreme sport of downhill mountain bike racing and puts players in control of a customizable mountain bike to race down vertical mountainsides and urban environments while performing stunts at speeds in excess of 60 miles per hour. Playable in first- and third-person perspectives, players will be able to select from one of 14 riders, including five pro-riders in an intense race to gain corporate sponsorship and a chance at the coveted Downhill Domination Championship.… Expand"}, {"name": "Lunar Legend", "details_link": "https://www.metacritic.com/game/game-boy-advance/lunar-legend", "publisher": "Ubisoft", "release_date": "Dec  8 2002", "developers": ["Magic Rings"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/841dfa837e17d427f4a8b4169fd791c1-98.jpg", "descriptions": "When One Legend Falls, ANOTHER MUST RISE!  Embark on a desperate struggle to realize one hero's dream to become a legend."}, {"name": "2002 FIFA World Cup", "details_link": "https://www.metacritic.com/game/xbox/2002-fifa-world-cup", "publisher": "EA Sports", "release_date": "Apr 22 2002", "developers": ["Software Creations"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 79, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/fcc58e57c58a69de30a7280fbcc34df8-98.jpg", "descriptions": "Kick off the FIFA World Cup season with 2002 FIFA World Cup, which captures every moment of glory, every emotion, and every sound of the global event. The game boasts licenses from the official FIFA World Cup, insignia, mascots, and the 20 new World Cup stadiums in Japan and Korea. AnotherKick off the FIFA World Cup season with 2002 FIFA World Cup, which captures every moment of glory, every emotion, and every sound of the global event. The game boasts licenses from the official FIFA World Cup, insignia, mascots, and the 20 new World Cup stadiums in Japan and Korea. Another enhancement includes Air Play, a new control scheme that delivers intuitive one-button headers, volleys, scissors kicks, juggling, and more. Choose your team and then compete in a seven-game series beginning with round-robin play, followed by playoffs that lead to the final match. … Expand"}, {"name": "Breath of Fire", "details_link": "https://www.metacritic.com/game/game-boy-advance/breath-of-fire", "publisher": "Capcom", "release_date": "Dec 13 2001", "developers": ["Capcom"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 79, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/71fd088c84ff84eba2bd5312bb8b3b2a-98.jpg", "descriptions": "Long ago in the days of darkness and magic, a young wanderer comes face to face with his destiny.  You control the fate of Ryu, a young warrior and descendant of the Light Dragon Clan.  Together, with your mystical friend, Nina, you must search for magic spells and mysterious secrets.  AlongLong ago in the days of darkness and magic, a young wanderer comes face to face with his destiny.  You control the fate of Ryu, a young warrior and descendant of the Light Dragon Clan.  Together, with your mystical friend, Nina, you must search for magic spells and mysterious secrets.  Along the way, gain experience and skill as you battle against strange monsters.  Uncover valuable secrets that will help you on your adventure and unlock the secrets of the Dragon Clan.… Expand"}, {"name": "Sky Odyssey", "details_link": "https://www.metacritic.com/game/playstation-2/sky-odyssey", "publisher": "Activision", "release_date": "Nov 15 2000", "developers": ["CAProduction"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Flight", "WWII"], "meta_score": 79, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/d17dd8af03b8575cad7cfcce92faea6d-98.jpg", "descriptions": "Take to the sky in addictive, action-packed missions, flying authentic planes and jets-even experimental aircraft. Attempt to refuel from a moving train, fly through underground tunnels, and touch down on an aircraft carrier at sea. From the thrill of barnstorming to the challenge ofTake to the sky in addictive, action-packed missions, flying authentic planes and jets-even experimental aircraft. Attempt to refuel from a moving train, fly through underground tunnels, and touch down on an aircraft carrier at sea. From the thrill of barnstorming to the challenge of rescues, your piloting skills and nerves will be tested to their adrenaline-screaming limits.… Expand"}, {"name": "Mario Party", "details_link": "https://www.metacritic.com/game/nintendo-64/mario-party", "publisher": "Nintendo", "release_date": "Feb  8 1999", "developers": ["Hudson"], "platforms": "Nintendo 64", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party"], "meta_score": 79, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/475f3229807b58e1cf9a3de7d7ad2595-98.jpg", "descriptions": "Tensions mount for Mario and pals as each declares himself to be the one true Super Star of Marioland. Face your friends and family in a contest of strength, wits and agility as you explore 6 thriling Adventure Boards. Reveal new levels of gaming excitement as you customize your boards withTensions mount for Mario and pals as each declares himself to be the one true Super Star of Marioland. Face your friends and family in a contest of strength, wits and agility as you explore 6 thriling Adventure Boards. Reveal new levels of gaming excitement as you customize your boards with speed blocks, warp blocks and other specialty items. Jam-packed with all the electricity of an entire arcade, the action comes alive for up to 4 players. So grab your friends and get ready for a wild ride because this party never ends!… Expand"}, {"name": "N+", "details_link": "https://www.metacritic.com/game/psp/n+", "publisher": "Atari", "release_date": "Aug 26 2008", "developers": ["Metanet Software Inc.", "SilverBirch Studios"], "platforms": ["PC", "Xbox 360", "PSP"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/c057434995e310f3878f863b4b9244f3-98.jpg", "descriptions": "You are a ninja in N+. Your god-like speed, dexterity, jumping power, and reflexes are all the result of an amazingly fast metabolism; sadly, so is your natural lifespan of 1.5 minutes. Like all Ninjas, you have an unquenchable thirst for gold and a natural propensity for exploring roomsYou are a ninja in N+. Your god-like speed, dexterity, jumping power, and reflexes are all the result of an amazingly fast metabolism; sadly, so is your natural lifespan of 1.5 minutes. Like all Ninjas, you have an unquenchable thirst for gold and a natural propensity for exploring rooms infested by increasingly lethal Ninja-killing robots. N emphasizes pacifism, humility, and the need to traverse 5 rooms before the end of your lifetime; a feat known only as ‘beating an episode’. In accordance with the teachings of N, it is your profound hope that one day you will develop your platforming skills, intelligence, and inexplicable ability to reincarnate to achieve total mastery of all 300 levels. [Atari]… Expand"}, {"name": "Spider-Man 3", "details_link": "https://www.metacritic.com/game/ds/spider-man-3", "publisher": "Activision", "release_date": "May  4 2007", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "General", "Platformer", "3D", "3D"], "meta_score": 79, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/4b2eb2c82bf92817e23c0f8a5d13b278-98.jpg", "descriptions": "Spider-Man 3 for the Nintendo DS is set in a 3D side scrolling world and delivers complete touch screen handling, in which players must draw upon Spider-Man's vast array of moves, attacks and upgrades as they choose their path and embark on a wide variety of city-based missions and multipleSpider-Man 3 for the Nintendo DS is set in a 3D side scrolling world and delivers complete touch screen handling, in which players must draw upon Spider-Man's vast array of moves, attacks and upgrades as they choose their path and embark on a wide variety of city-based missions and multiple movie-based and original story arcs. Additionally, Spider-Man 3 for the Nintendo DS features local wireless multiplayer gameplay featuring with a variety of modes enabling awesome two-player head-to-head challenges like Brawler, Hot Potato, Target Practice, and Combo Challenge. [Activision]… Expand"}, {"name": "Untitled Goose Game", "details_link": "https://www.metacritic.com/game/pc/untitled-goose-game", "publisher": "Panic Inc.", "release_date": "Sep 20 2019", "developers": ["House House"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Action Adventure", "General", "Open-World"], "meta_score": 79, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/3d1ea947bc9e0952f4434b908728d8e4-98.jpg", "descriptions": "It's a lovely morning in the village and you are a horrible goose. Untitled Goose Game is a slapstick-stealth-sandbox, where you are a goose let loose on an unsuspecting village. Make your way around town, from peoples' back gardens to the high street shops to the village green, setting upIt's a lovely morning in the village and you are a horrible goose. Untitled Goose Game is a slapstick-stealth-sandbox, where you are a goose let loose on an unsuspecting village. Make your way around town, from peoples' back gardens to the high street shops to the village green, setting up pranks, stealing hats, honking a lot, and generally ruining everyone’s day.… Expand"}, {"name": "Silent Hill: Shattered Memories", "details_link": "https://www.metacritic.com/game/wii/silent-hill-shattered-memories", "publisher": "Konami", "release_date": "Dec  8 2009", "developers": ["Climax Group", "Climax Studios"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 79, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/cf118b9540553f0799afbc5c67e66f82-98.jpg", "descriptions": "While the game shares its twisting plot with the original PlayStation game, Silent Hill: Shattered Memories takes a different path in many, many ways. Characters can be approached but offer different responses and be found in different places, while new clues and gameplay paths can beWhile the game shares its twisting plot with the original PlayStation game, Silent Hill: Shattered Memories takes a different path in many, many ways. Characters can be approached but offer different responses and be found in different places, while new clues and gameplay paths can be followed. The title follows Harry Mason, as he attempts to unravel the mystery of his missing daughter, Cheryl. A broken man, Mason’s investigations lead him to the mist-shrouded, snowy streets of Silent Hill: a malevolent town where the shadows play host to a wealth of evil, misshapen creatures. Designed to make full use of the Wii's unique controllers, Silent Hill: Shattered Memories uses the Wii Remote as a torch and cell phone as Mason looks for clues. The torch is vital for scouring the darkened, abandoned buildings of Silent Hill, while the phone acts as a secondary user interface, allowing the player to access maps via its GPS capabilities and take pictures of interesting elements. Likewise, the Wii Remote also can be used to pick up, examine and manipulate items to solve puzzles along the journey. Such technology was not available when the original Silent Hill was released in 1999, and its inclusion showcases Konami’s determination to enhance the playing experience with new, available technology. Also new to Shattered Memories is a psyche profile element, which monitors every aspect of player’s reactions - from where they explore first, items that have been examined, and their reaction to those they meet. Small visual elements will also be altered slightly, adding to the oppressing atmosphere where nothing is what it seems. The psyche profile will adapt Harry’s actions as and when he meets normal-looking people or the game's many inhuman denizens. [Konami]… Expand"}, {"name": "Marble Blast Ultra", "details_link": "https://www.metacritic.com/game/xbox-360/marble-blast-ultra", "publisher": "GarageGames", "release_date": "Jan 23 2006", "developers": ["GarageGames"], "platforms": "Xbox 360", "num_players": "8  Online", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 79, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/7bd1028ac60a62010acc705479e22a73-98.jpg", "descriptions": "[Xbox Live Arcade]  Marble Blast Ultra is the latest in the classic Marble Blast series. Suitable for players of any age, Marble Blast Ultra transports you to a futuristic 'astrolab' arena suspended high in the clouds. Compete against each other by navigating your marbles through moving[Xbox Live Arcade]  Marble Blast Ultra is the latest in the classic Marble Blast series. Suitable for players of any age, Marble Blast Ultra transports you to a futuristic 'astrolab' arena suspended high in the clouds. Compete against each other by navigating your marbles through moving platforms and dangerous hazards, while collecting rare gems and power-up enhancements, in an effort to complete each course in record time. Compete head to head in Xbox Live ultra blast multiplayer mode.  [Xbox.com]… Expand"}, {"name": "echochrome ii", "details_link": "https://www.metacritic.com/game/playstation-3/echochrome-ii", "publisher": "SCEA", "release_date": "Dec 21 2010", "developers": ["SCE Japan Studio"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "Puzzle", "General"], "meta_score": 79, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/2670148fb86394eebfb372ae5328308c-98.jpg", "descriptions": "Utilizing the PlayStation Move motion controller and the PlayStation Eye camera, players can rotate levels and control light and shadows to change the way objects are viewed and the shadows they cast.  The ultimate goal is to lead your character through the path from beginning to end, whileUtilizing the PlayStation Move motion controller and the PlayStation Eye camera, players can rotate levels and control light and shadows to change the way objects are viewed and the shadows they cast.  The ultimate goal is to lead your character through the path from beginning to end, while learning how a variety of different objects can be combined with perspectives, angles and the use of light can be used to help solve the puzzle.  Beware … much like echochrome, the possibilities are infinite and there is always more than meets the eye as every person can view each puzzle differently!… Expand"}, {"name": "Sega Ages: Puyo Puyo 2", "details_link": "https://www.metacritic.com/game/switch/sega-ages-puyo-puyo-2", "publisher": "Sega", "release_date": "Feb 20 2020", "developers": ["M2", "Compile"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Matching"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/043599b1098ac5cbec2aa73f070f5384-98.jpg", "descriptions": "The object of this head-to-head puzzle game is to clear your grid of falling patterns called puyos by forming chains of four or more same-colored puyos in a straight line or one of several geometric patterns. What makes this a challenging two-player contest is the fact that when you clear aThe object of this head-to-head puzzle game is to clear your grid of falling patterns called puyos by forming chains of four or more same-colored puyos in a straight line or one of several geometric patterns. What makes this a challenging two-player contest is the fact that when you clear a chain of puyos from your grid, it drops a random piece of filler onto your opponent's grid. The more puyos you clear, the more you fill your opponent's grid, and if you can clutter up his grid enough to fill it to the top, you've won the game.… Expand"}, {"name": "The Metronomicon", "details_link": "https://www.metacritic.com/game/pc/the-metronomicon", "publisher": "Kasedo Games", "release_date": "Sep  1 2016", "developers": ["Puuba"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 79, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/d28cc952c08e9a8b26fd9f2d9f66fc86-98.jpg", "descriptions": "Packing in a fully-fledged story mode with a colourful cast of musically-empowered heroes and villains, The Metronomicon sees you take control a party of eight newly graduated masters of the “rhythmic combat arts” to wage musical warfare against a multitude of dance-mongering fiends. ByPacking in a fully-fledged story mode with a colourful cast of musically-empowered heroes and villains, The Metronomicon sees you take control a party of eight newly graduated masters of the “rhythmic combat arts” to wage musical warfare against a multitude of dance-mongering fiends. By switching between four concurrent hero-controlled tracks on-the-fly, you’ll select and activate a wide array of abilities and spells, buffs and nukes, with your performance and timing all-important in ensuring the effectiveness of your moves. In the RPG spirit, you’ll need to improve your characters’ stats, hunt down powerful equipment, and combine a multitude of newly-learned abilities – switching between tanking, healing, buffing, and damage-dealing classes as required in real time. … Expand"}, {"name": "Pro Evolution Soccer 2011", "details_link": "https://www.metacritic.com/game/xbox-360/pro-evolution-soccer-2011", "publisher": "Konami", "release_date": "Oct 19 2010", "developers": ["Konami"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 79, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/2271166526d8f2057a72b4786a7939b7-98.jpg", "descriptions": "The PRO EVOLUTION SOCCER franchise has long been regarded as offering incredible realism and control, however PRO EVOLUTION SOCCER 2011 will reinvigorate the series with the most advanced set of improved gameplay additions, control options and to catch up with the evolution of the real-lifeThe PRO EVOLUTION SOCCER franchise has long been regarded as offering incredible realism and control, however PRO EVOLUTION SOCCER 2011 will reinvigorate the series with the most advanced set of improved gameplay additions, control options and to catch up with the evolution of the real-life soccer. Central to its total freedom of play, PRO EVOLUTION SOCCER 2011 introduces a power bar for each player that allows the user to determine the exact strength and placement of every pass and shot. Balls can now be spread absolutely anywhere with surgical precision, with long balls into space, short passes to feet, and intricate one-twos allowing the player to dictate play and control the tempo of a match. … Expand"}, {"name": "LEGO Marvel Super Heroes", "details_link": "https://www.metacritic.com/game/switch/lego-marvel-super-heroes", "publisher": "Warner Bros. Games", "release_date": "Oct  5 2021", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "Switch"], "genres": ["Action Adventure", "Open-World"], "meta_score": 79, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/3775a724a67b668363ca2e00596639e9-98.jpg", "descriptions": "LEGO Marvel Super Heroes features an original story crossing the entire Marvel Universe. Players take control of Iron Man, Spider-Man, the Hulk, Captain America, Wolverine and many more Marvel characters as they unite to stop Loki and a host of other Marvel villains from assembling aLEGO Marvel Super Heroes features an original story crossing the entire Marvel Universe. Players take control of Iron Man, Spider-Man, the Hulk, Captain America, Wolverine and many more Marvel characters as they unite to stop Loki and a host of other Marvel villains from assembling a super-weapon capable of destroying the world. Players will chase down Cosmic Bricks as they travel across LEGO Manhattan and visit key locations from the Marvel Universe, such as Stark Tower, Asteroid M, a Hydra base and the X-Mansion.… Expand"}, {"name": "Blizzard Arcade Collection", "details_link": "https://www.metacritic.com/game/pc/blizzard-arcade-collection", "publisher": "Activision", "release_date": "Feb 19 2021", "developers": ["Blizzard Entertainment", "Digital Eclipse"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 79, "users_score": 2.6, "image": "https://static.metacritic.com/images/products/games/6/166a642cdb2d97fccb378e0d1ce87dac-98.jpg", "descriptions": "Relive the Legacy: Experience a blast from Blizzard's past! The Blizzard® Arcade Collection brings three of our classic console games to modern platforms and new audiences. INCLUDED GAMES:\r • Blackthorne®: As mercenary captain Kyle Blackthorne, traverse an alien planet, liberate theRelive the Legacy: Experience a blast from Blizzard's past! The Blizzard® Arcade Collection brings three of our classic console games to modern platforms and new audiences. INCLUDED GAMES:\r • Blackthorne®: As mercenary captain Kyle Blackthorne, traverse an alien planet, liberate the Androthi people, and claim your destiny.\r • The Lost Vikings®: Help three Vikings—Erik, Baleog, and Olaf—overcome challenging platforms and puzzles to find their way back home.\r • Rock N Roll Racing®: Rock out in the raddest vehicular destruction derby this side of 1993. RNRR is back with original rock and metal soundtrack hits plus a few new surprises.\r LEVEL UP THE LEGACY:\r The Blizzard Arcade Collection contains two different Original Editions of each game plus a new Definitive Edition!\r • The Original Editions are the games as you remember them but with new quality of life improvements included—like the ability to set custom keybindings, rewind your gameplay up to 10 seconds, save and load your game as well as watch playthroughs of Blackthorne and The Lost Vikings (and then jump in to play at any point). Improvements may vary by game and game edition.… Expand"}, {"name": "Spellbreak", "details_link": "https://www.metacritic.com/game/pc/spellbreak", "publisher": "Proletariat, Inc.", "release_date": "Sep  3 2020", "developers": ["Proletariat", "Inc."], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 79, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/9b4fa5109ebf68efdf10b1a972661141-98.jpg", "descriptions": "Spellbreak is an epic fantasy action spellcasting game where players choose a class, weave spectacular spell combinations and fight other players to become an all-powerful battlemage."}, {"name": "Wasteland 3", "details_link": "https://www.metacritic.com/game/playstation-4/wasteland-3", "publisher": "InXile Entertainment", "release_date": "Aug 28 2020", "developers": ["InXile Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 79, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/cdf2359ad5145260958cd7599d4a7427-98.jpg", "descriptions": "In Wasteland 3 you take command of a squad of Desert Rangers, lawmen and women in a post-nuclear world, trying to rebuild society from the ashes. More than a century after the bombs fell, you’re fighting a losing battle to keep your beloved Arizona alive. Then the self-proclaimed PatriarchIn Wasteland 3 you take command of a squad of Desert Rangers, lawmen and women in a post-nuclear world, trying to rebuild society from the ashes. More than a century after the bombs fell, you’re fighting a losing battle to keep your beloved Arizona alive. Then the self-proclaimed Patriarch of Colorado radios, promising aid if you'll do a job he can only entrust to an outsider—rescue his land from the ambitions of his three bloodthirsty children. You’re dispatched on a desperate quest from the scorching deserts to the snowy mountains to start from scratch, building a new base, finding a snow-worthy vehicle, training new recruits, and fighting your way through hostile frozen wastes. All the while, you'll have to decide who to trust in this land torn apart by corruption, intrigue, warring factions, crazed cultists, cutthroat gangs, and bitter sibling rivalries. Build a reputation for yourself by making decisions that will profoundly impact Colorado, its inhabitants and the story you experience. Will you be Colorado’s savior or its worst nightmare? Wasteland 3 is a squad-based RPG from inXile entertainment, featuring challenging tactical turn-based combat and a deep, reactive story full of twists, turns, and brutal ethical decisions that will keep you hooked whether you’re a Wasteland veteran or new to the series. Create a squad of up to six Rangers and customize them with perks and abilities geared to your playstyle. You even get your own battle truck, which you can upgrade into a hardened war beast, bristling with weapons, to help mow down your enemies. … Expand"}, {"name": "Rival Megagun", "details_link": "https://www.metacritic.com/game/playstation-4/rival-megagun", "publisher": "Spacewave Software", "release_date": "Nov 29 2018", "developers": ["Spacewave Software"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 79, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/5e5c37f82a06092176a0bb78afb31557-98.jpg", "descriptions": "Transform into your Mega Gunship boss form to blast your rival head-on in this unique shooting game with a competitive twist."}, {"name": "The Book of Unwritten Tales 2", "details_link": "https://www.metacritic.com/game/xbox-one/the-book-of-unwritten-tales-2", "publisher": "Nordic Games Publishing", "release_date": "Sep 18 2015", "developers": ["KING Art"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One"], "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 79, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/8f59736a7f62e4bdc360774599a6a3ff-98.jpg", "descriptions": "Join Wilbur, Ivo, Nate and Critter in another classic point-and-click adventure in the wicked world of Aventasia."}, {"name": "Tom Clancy's Rainbow Six Siege", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-rainbow-six-siege", "publisher": "Ubisoft", "release_date": "Dec  1 2015", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "genres": ["Modern", "Action", "Shooter", "First-Person", "Tactical"], "meta_score": 79, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/80b34e3548f1768ea4d5c24ad2239fba-98.jpg", "descriptions": "Tom Clancy’s Rainbow Six Siege is inspired by real world counter-terrorist organizations, and inserts players in the middle of lethal close-quarters engagements. For the first time in a Tom Clancy’s Rainbow Six game, players can choose from a variety of unique Counter Terrorist Operators andTom Clancy’s Rainbow Six Siege is inspired by real world counter-terrorist organizations, and inserts players in the middle of lethal close-quarters engagements. For the first time in a Tom Clancy’s Rainbow Six game, players can choose from a variety of unique Counter Terrorist Operators and engage in tangible sieges, a new style of assault in which enemies have the means to transform their environments into modern strongholds while Rainbow Six teams lead the assault to breach the enemy’s position.… Expand"}, {"name": "The Settlers 7: Paths to a Kingdom", "details_link": "https://www.metacritic.com/game/pc/the-settlers-7-paths-to-a-kingdom", "publisher": "Ubisoft", "release_date": "Mar 23 2010", "developers": ["Blue Byte"], "platforms": "PC", "genres": ["Strategy", "City Building", "Management", "Historic", "Historic", "Government"], "meta_score": 79, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/b173a7feb07c207ce9db799b38c6eb41-98.jpg", "descriptions": "The Settlers: Paths to a Kingdom is the latest game from the award-winning kingdom building strategy series. Created in 1993, The Settlers franchise is one of the best selling strategy brands with over 500,000 units sold in the US and over 7MM units worldwide LTD. In Paths to a Kingdom, theThe Settlers: Paths to a Kingdom is the latest game from the award-winning kingdom building strategy series. Created in 1993, The Settlers franchise is one of the best selling strategy brands with over 500,000 units sold in the US and over 7MM units worldwide LTD. In Paths to a Kingdom, the military, economic, and research systems are richer than ever. This allows players to play and win the way they want. Beyond the game campaign, fully customizable pre-designed maps, downloadable expansions and anticipated player-generated content will guarantee wide-ranging experiences. The innovation does not stop at the game content. The Settlers: Paths to a Kingdom will integrate the player’s social networks contacts on Facebook and Twitter. By allowing consumers to play the way they want and share their progress with their friends, this is truly the most accessible and innovative Settlers title to date. [Ubisoft]… Expand"}, {"name": "RollerCoaster Tycoon 3: Soaked!", "details_link": "https://www.metacritic.com/game/pc/rollercoaster-tycoon-3-soaked!", "publisher": "Atari", "release_date": "Jun 23 2005", "developers": ["Frontier Developments"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 79, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/1/2cd564eb15b2dcb61adcb4bff107e9a7-98.jpg", "descriptions": "With RollerCoaster Tycoon 3: Soaked! the park guests catch rays and ride the waves on more than fifty new rides and coasters including super-splash flume rides, massive water slides, wave pools and more. Players are also able to create aquatic spectaculars with performing dolphins, killerWith RollerCoaster Tycoon 3: Soaked! the park guests catch rays and ride the waves on more than fifty new rides and coasters including super-splash flume rides, massive water slides, wave pools and more. Players are also able to create aquatic spectaculars with performing dolphins, killer whale shows and customizable aquariums as well as to design dazzling laser light water shows and synch them to music with the H20 MixMaster. A new Swimming Pool Designer and Waterfall Designer let players add hundreds of new park enhancements to create the ultimate summer fun experience as well as other new features that extend and enhance the original game. [Atari]… Expand"}]