[{"name": "Shadow the Hedgehog", "details_link": "https://www.metacritic.com/game/xbox/shadow-the-hedgehog", "publisher": "Sega", "release_date": "Nov 15 2005", "developers": ["Sega"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 49, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/e802a95a94801bf6e9d9f04981d78b12-98.jpg", "descriptions": "The world is in peril as forces, both good and evil, make a play for the powerful Chaos Emeralds. In Shadow the Hedgehog, you can control Shadow and choose which side to fight for. This 3D platformer lets you use weapons, vehicles, environmental objects, and time and space manipulation toThe world is in peril as forces, both good and evil, make a play for the powerful Chaos Emeralds. In Shadow the Hedgehog, you can control Shadow and choose which side to fight for. This 3D platformer lets you use weapons, vehicles, environmental objects, and time and space manipulation to combat your foes.… Expand"}, {"name": "Saints Row: The Third - Genki Bowl VII", "details_link": "https://www.metacritic.com/game/xbox-360/saints-row-the-third---genki-bowl-vii", "publisher": "THQ", "release_date": "Jan 17 2012", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Action Adventure", "General", "Modern", "Open-World"], "meta_score": 49, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/7/8ed5d99e9531bd2b56f3397999554645-98.jpg", "descriptions": "A genius in entertainment and mayhem, the man-cat Professor Genki has put together the most watched game show event on TV, Genkibowl VII. But every game show needs a star contestant, and Professor Genki has chosen the leader of the Saints. With the Saints' reputation for excessive murder andA genius in entertainment and mayhem, the man-cat Professor Genki has put together the most watched game show event on TV, Genkibowl VII. But every game show needs a star contestant, and Professor Genki has chosen the leader of the Saints. With the Saints' reputation for excessive murder and carnage Steelport's own Zach and Bobby will give the play-by-play commentary with their newest colleague, Tammy Tolliver.… Expand"}, {"name": "Naruto Shippuden: Ninja Council 4", "details_link": "https://www.metacritic.com/game/ds/naruto-shippuden-ninja-council-4", "publisher": "Tomy Corporation", "release_date": "Jun  2 2009", "developers": ["Aspect", "Takara Tomy"], "platforms": "DS", "num_players": "Up to 4 ", "genres": ["Action", "General", "General", "Platformer", "2D"], "meta_score": 49, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/5/b0b8c037eded7bc777de37f6fb4e875e-98.jpg", "descriptions": "Set two and a half years after the events of the classic NARUTO series, Naruto fans are introduced to older characters as the storyline advances and unfolds with copious plot twists. NARUTO Shippuden: Ninja Council 4 also allows gamers to follow an older Naruto and his friends on the questSet two and a half years after the events of the classic NARUTO series, Naruto fans are introduced to older characters as the storyline advances and unfolds with copious plot twists. NARUTO Shippuden: Ninja Council 4 also allows gamers to follow an older Naruto and his friends on the quest to save Gaara from the sinister Akatsuki organization. Players are able to choose their allies and form a three-man squad with special jutsu techniques to ward off looming danger. Dedicated franchise fans and new Naruto fighters alike can utilize the touch screen to unleash their unique jutsu attacks and take on anyone that gets in their way. As an added bonus, unlockable jutsu allow aspiring ninja to explore previously unreachable areas. [Tomy Corporation]… Expand"}, {"name": "Heatseeker", "details_link": "https://www.metacritic.com/game/psp/heatseeker", "publisher": "Codemasters", "release_date": "May  8 2007", "developers": ["IR Gurus"], "platforms": ["PlayStation 2", "PSP"], "num_players": "Up to 4 ", "genres": ["Simulation", "Flight", "Modern Jet", "Modern Jet", "Combat"], "meta_score": 49, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/69aa722a85132717c0a2e6239a2f73b9-98.jpg", "descriptions": "Designed to be an incredible lock-on/shake-off experience, Heatseeker reinvents missile combat to give gamers a massive rush of destruction. Featuring collection of current and near-future military fighter jets, Heatseeker's arsenal includes the stealthy F-22 Raptor, the classic F-15 Eagle,Designed to be an incredible lock-on/shake-off experience, Heatseeker reinvents missile combat to give gamers a massive rush of destruction. Featuring collection of current and near-future military fighter jets, Heatseeker's arsenal includes the stealthy F-22 Raptor, the classic F-15 Eagle, the cutting-edge F35 Lightening II, and the aerodynamically advanced Russian SU-47 Berkut. Heatseeker straps players into the pilot's seat and deliver a white-knuckle ride that'll have them clutching the joypad as they engage in face-melting 6G turns and fight against a seemingly-impossible amount of airborne enemies. And when gamers launch a strike, they follow their missiles as they ruthlessly hone in on their targets via the Impact Cam. Delivering cinematic 3rd-person camera cutaway scenes, the Impact Cam reveals the results of attacks in all their devastating glory from all kinds of dynamic angles, complete with jaw-dropping explosions and smoke trails. With missions across the U.S., down to the Caribbean, across Antarctica and into the Far East, it's high-velocity combat all the way that'll see players constantly switching from predator to prey as an enemy missiles lock on. [Codemasters]… Expand"}, {"name": "Digimon All-Star Rumble", "details_link": "https://www.metacritic.com/game/playstation-3/digimon-all-star-rumble", "publisher": "Bandai Namco Games", "release_date": "Nov 11 2014", "developers": ["Prope"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "3D"], "meta_score": 49, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/b8e4219f24b1d6138fa300550351bfe3-98.jpg", "descriptions": "Digimon must battle to Digivolve, so the restless Digimon propose to hold their first ever “Digimon Evolution Tournament” to determine who is the strongest of them all."}, {"name": "Animal Paradise", "details_link": "https://www.metacritic.com/game/ds/animal-paradise", "publisher": "Atari", "release_date": "Sep 23 2008", "developers": ["Empire Interactive"], "platforms": "DS", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 49, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/9c47a795dc8de76e63f251ff8db7edac-98.jpg", "descriptions": "Feed, clean, walk and play with them, but above all make them happy to earn their love. This exciting title will thrill animal lovers of all ages with its exciting mix of pets, including everything from dogs and cats to hamsters and pigs. [Empire Interactive]"}, {"name": "Nitrobike", "details_link": "https://www.metacritic.com/game/wii/nitrobike", "publisher": "Ubisoft", "release_date": "Jan 15 2008", "developers": ["Left Field Productions"], "platforms": ["PlayStation 2", "Wii"], "num_players": "Up to 6 ", "genres": ["Driving", "Racing", "Arcade", "Motorcycle", "Other", "Motocross", "Motocross"], "meta_score": 49, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/68bffaebb1a9ae8fd1bb9bc2b7b2b3a7-98.jpg", "descriptions": "Players navigate rocket-propelled motorcycles in this arcade-style game. Players can choose to race against the clock or against worthy opponents in Nitrobike's exciting multiplayer game mode and unique online mode. [Ubisoft]"}, {"name": "Ninja Reflex", "details_link": "https://www.metacritic.com/game/wii/ninja-reflex", "publisher": "Electronic Arts", "release_date": "Mar  4 2008", "developers": ["Sanzaru Games"], "platforms": ["PC", "Wii"], "genres": ["Action", "General", "General"], "meta_score": 49, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/5ec552bd50e42a16facbf0db8ec23ce8-98.jpg", "descriptions": "Ninja Reflex uses a series of martial arts challenges to test gamers' reflexes and measure their reaction times with millisecond precision.  As players develop their ninja skills, they will strive to earn a black belt from their own personal Sensei.  Players can also compete for ninjaNinja Reflex uses a series of martial arts challenges to test gamers' reflexes and measure their reaction times with millisecond precision.  As players develop their ninja skills, they will strive to earn a black belt from their own personal Sensei.  Players can also compete for ninja supremacy against their friends in fierce multiplayer battles with up to four players. [Electronic Arts]… Expand"}, {"name": "Pokemon Rumble U", "details_link": "https://www.metacritic.com/game/wii-u/pokemon-rumble-u", "publisher": "Nintendo", "release_date": "Aug 29 2013", "developers": ["Ambrella"], "platforms": "Wii U", "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 49, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/8/94fe209e1441fff8b406a21eb7e621e9-98.jpg", "descriptions": "Pokemon Rumble U is the tale of a great adventure featuring Toy Pokemon, beginning when a delivery of Toy Pokemon is swept down a river and washes up on a strange riverbank. Our bewildered Pokemon heroes set out to find their way back to the Toy Pokemon Shop. Along the way they discover allPokemon Rumble U is the tale of a great adventure featuring Toy Pokemon, beginning when a delivery of Toy Pokemon is swept down a river and washes up on a strange riverbank. Our bewildered Pokemon heroes set out to find their way back to the Toy Pokemon Shop. Along the way they discover all is not right. Players will learn why some of the Toy Pokemon are fighting each other, and what the enemy Pokemon are plotting.… Expand"}, {"name": "Asphalt: Injection", "details_link": "https://www.metacritic.com/game/playstation-vita/asphalt-injection", "publisher": "Ubisoft", "release_date": "Feb 15 2012", "developers": ["Ubisoft"], "platforms": "PlayStation Vita", "genres": ["Driving", "Racing", "General", "General", "Arcade", "Automobile"], "meta_score": 49, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/7/47e65a12ca12ef0593979957482a85ff-98.jpg", "descriptions": "Asphalt comes to the PS Vita with new and exclusive dual-stick, gyroscope and back panel controls. Master 10 different types of events to rule a full-featured Career mode with more than 100 races. Collect over 50 world-class luxury cars and drive them through exotic and beautiful locales inAsphalt comes to the PS Vita with new and exclusive dual-stick, gyroscope and back panel controls. Master 10 different types of events to rule a full-featured Career mode with more than 100 races. Collect over 50 world-class luxury cars and drive them through exotic and beautiful locales in magnificent next-gen graphics. Discover new social features and share your best performances with your friends. Add more fuel to the fire with Asphalt: Injection! [Sony]… Expand"}, {"name": "Carnival Games for Nintendo Switch", "details_link": "https://www.metacritic.com/game/switch/carnival-games-for-nintendo-switch", "publisher": "2K Games", "release_date": "Nov  6 2018", "developers": ["Mass Media"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 49, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/5/c9ecefe7940881f846d50b051a4d6783-98.jpg", "descriptions": "Carnival Games brings the party back for the entire family -- now for the first time on Nintendo Switch! Hit home runs, pile the highest stack of cakes, and take your horse to the finish line. With 20 exciting mini-games inspired by the fun of a county fair, you and your friends will beCarnival Games brings the party back for the entire family -- now for the first time on Nintendo Switch! Hit home runs, pile the highest stack of cakes, and take your horse to the finish line. With 20 exciting mini-games inspired by the fun of a county fair, you and your friends will be stepping right up to win again and again! Through the power of the Nintendo Switch, Carnival Games can be played alone or with up to four players simultaneously wherever and whenever!… Expand"}, {"name": "Lucha Libre AAA Heroes del Ring", "details_link": "https://www.metacritic.com/game/xbox-360/lucha-libre-aaa-heroes-del-ring", "publisher": "Konami", "release_date": "Oct 12 2010", "developers": ["Immersion Software & Graphics"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 49, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/850bddd48ce2241dfa9a0ffd2e102748-98.jpg", "descriptions": "Lucha Libre AAA 2011 - Heroes of the Ring is a wrestling video game based on the popular Mexican \"Lucha Libre\" style of wrestling."}, {"name": "Eragon", "details_link": "https://www.metacritic.com/game/xbox/eragon", "publisher": "Sierra Entertainment", "release_date": "Nov 14 2006", "developers": ["Stormfront Studios"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Xbox"], "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 49, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/f71286b4721b7f8ffbea67b3ea63b8e0-98.jpg", "descriptions": "Play as Eragon and his dragon as they set out to fulfill their destiny. Endure perilous travels, adventure and heart-pounding combat as you live the epic events of the movie. Disable and dispatch enemies with the unparalleled skills of a true Dragon Ride. Eragon's combat system features aPlay as Eragon and his dragon as they set out to fulfill their destiny. Endure perilous travels, adventure and heart-pounding combat as you live the epic events of the movie. Disable and dispatch enemies with the unparalleled skills of a true Dragon Ride. Eragon's combat system features a variety of blistering attacks and defences, including a unique degradable block system. Extensive Dragon Combat - Ride Saphira and blast your enemies with bursts of fire, and call in devastating dragon attacks during melee battles. Eragon features multiplayer co-op with team attack bonuses and dragon fight/flight combo gameplay. Full cooperation from the film production team provides faithful implementation of the movie's look-and-feel. As Eragon discovers the powers hidden within him he learns to unleash magical attacks to decimate his foes.… Expand"}, {"name": "Dungeons & Dragons: Daggerdale", "details_link": "https://www.metacritic.com/game/pc/dungeons-dragons-daggerdale", "publisher": "Atari", "release_date": "May 25 2011", "developers": ["Bedlam Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Role-Playing", "Strategy", "Action RPG", "General", "Action RPG"], "meta_score": 49, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/1/23f760d00b1df3906cbda71b72527c21-98.jpg", "descriptions": "Dungeons & Dragons Daggerdale centers on the desperate struggle to defeat the evil Rezlus and his Zhentarim in their attempt to invade and conquer the Dalelands.  Dungeons & Dragons Daggerdale is an engaging multi-player experience that introduces a riveting narrative and treacherousDungeons & Dragons Daggerdale centers on the desperate struggle to defeat the evil Rezlus and his Zhentarim in their attempt to invade and conquer the Dalelands.  Dungeons & Dragons Daggerdale is an engaging multi-player experience that introduces a riveting narrative and treacherous new characters.  Players are charged with the task of restoring order to Nentir Vale by unlocking the secrets of the Mines of Tethyamar, defeating the evil within the treacherous Tower of the Void, leading to the final confrontation with Rezlus himself.… Expand"}, {"name": "Pac-Man and the Ghostly Adventures", "details_link": "https://www.metacritic.com/game/xbox-360/pac-man-and-the-ghostly-adventures", "publisher": "Namco Bandai Games", "release_date": "Oct 29 2013", "developers": ["Namco Bandai Games", "Monkey Bar Games"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360"], "genres": ["Action", "Platformer", "3D"], "meta_score": 49, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/7/f597651d2f1068f67ae061ab9617724d-98.jpg", "descriptions": "Pac-Man and the Ghostly Adventures has players take the role of Pac and his 2 best friends, Spiral and Cylindria, as they must rise to the challenge of protecting their homeland from the menacing ghosts that have escaped from the Netherworld."}, {"name": "Toxic Grind", "details_link": "https://www.metacritic.com/game/xbox/toxic-grind", "publisher": "THQ", "release_date": "Oct 27 2002", "developers": ["Blue Shift"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 49, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/b4ee5cbb55b8da791adb6d79d0d38f66-98.jpg", "descriptions": "In the year 2097, BMX riding has been outlawed and a twisted reality game show is the showcase for public execution of these fugitives. The maniacal host of the show, Dixon Von Blass, has eliminated all but a handful of these riders and resorted to injecting his contestants with a powerfulIn the year 2097, BMX riding has been outlawed and a twisted reality game show is the showcase for public execution of these fugitives. The maniacal host of the show, Dixon Von Blass, has eliminated all but a handful of these riders and resorted to injecting his contestants with a powerful toxin before the show. Injected with the deadly toxin, you were chosen to compete through famous locations and time periods. The only way to survive is to complete objectives, avoid deadly obstacles, and pull off insane tricks--all the while avoiding Dixon's henchmen. … Expand"}, {"name": "Stunt GP", "details_link": "https://www.metacritic.com/game/playstation-2/stunt-gp", "publisher": "Titus Software", "release_date": "Nov 13 2001", "developers": ["Team17"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 49, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/802872444160264f632c379a48bdcd86-98.jpg", "descriptions": "Race one of 15 different souped-up radio-controlled cars, each with unique stunt, grip, and power ratings, around 24 different tracks."}, {"name": "Beyblade: Evolution", "details_link": "https://www.metacritic.com/game/3ds/beyblade-evolution", "publisher": "Rising Star Games", "release_date": "Oct 22 2013", "developers": ["SIMS", "Rising Star Games"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 49, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/6/923deb93fc8db243f3e87b389ed0d9eb-98.jpg", "descriptions": "Developed to take advantage of the unique capabilities of the Nintendo 3DS, BEYBLADE: Evolution lets players launch their in-game BEYBLADE, using the gyro and motion sensors and manipulating the viewing angle with the Augmented Reality camera for precise control and adjustment. PlayersDeveloped to take advantage of the unique capabilities of the Nintendo 3DS, BEYBLADE: Evolution lets players launch their in-game BEYBLADE, using the gyro and motion sensors and manipulating the viewing angle with the Augmented Reality camera for precise control and adjustment. Players engage in real-time multiplayer battles or follow the Story Mode campaign unlocking new parts and information to fine-tune their tops in the Bey Factory.… Expand"}, {"name": "Yu-Gi-Oh! GX: The Beginning of Destiny", "details_link": "https://www.metacritic.com/game/playstation-2/yu-gi-oh!-gx-the-beginning-of-destiny", "publisher": "Konami", "release_date": "Jan  8 2008", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Card Battle"], "meta_score": 49, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/c29a75d8d161d0781c55ebb800816e7d-98.jpg", "descriptions": "Continuing its tradition of events, the Duel Academy has decided to hold a “Tag Duel Tournament” this year. All the students are running about trying to find the right Tag Partner to ensure they’ll win! You take on the role of a transfer student who has just joined in the midst of all theContinuing its tradition of events, the Duel Academy has decided to hold a “Tag Duel Tournament” this year. All the students are running about trying to find the right Tag Partner to ensure they’ll win! You take on the role of a transfer student who has just joined in the midst of all the excitement. Players must duel the best duelists in Duel Academy, building trust and friendship in order to find the right partner for the “Tag Duel Tournament”. In this tournament, whether or not you will find true friendship and “unity” depends on their compatibility with your partner and your dueling spirit! [Konami]… Expand"}, {"name": "Over G Fighters", "details_link": "https://www.metacritic.com/game/xbox-360/over-g-fighters", "publisher": "Ubisoft", "release_date": "Jun 27 2006", "developers": ["Taito Corporation"], "platforms": "Xbox 360", "num_players": "Up to 8 ", "genres": ["Simulation", "Flight", "Modern Jet", "Modern Jet", "Combat"], "meta_score": 49, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/ee81182c7f5366f2a3ab80e0522cad99-98.jpg", "descriptions": "In Over G Fighters, a terrorist organization threatens the world's peace and security as players take to the skies in a united world air force. Players command more than 30 of the most powerful jet fighters ever conceived and battle for air superiority in massive dogfights in the skies aboveIn Over G Fighters, a terrorist organization threatens the world's peace and security as players take to the skies in a united world air force. Players command more than 30 of the most powerful jet fighters ever conceived and battle for air superiority in massive dogfights in the skies above Europe, Asia, Africa and North America. Players combat enemies in the air and on the ground with challenging and dangerous strike missions against well defended targets deep in the heart of hostile territory. Fly the world's most powerful fighters: Fly every modern jet fighter in the Western arsenal including the F-22A Raptor, the US air superiority fighter of the 21st century. Face more than 90 Western and former Soviet enemies and get in the cockpit of the F-15E Strike Eagle, F-16C Fighting Falcon, F/A-18C Hornet, Su-27 Flanker, MiG-29A Fulcrum, and F-117A Nighthawk. Attempt more than 80 intense missions in a modern-day global conflict: Players take the fight to the enemy in aerial battles all over the world and face massive, challenging missions with interlocking sub-missions. After successfully completing the sub-missions, players will attack the most challenging primary mission objective. [Ubisoft]… Expand"}, {"name": "Homefront: The Revolution", "details_link": "https://www.metacritic.com/game/xbox-one/homefront-the-revolution", "publisher": "Deep Silver", "release_date": "May 17 2016", "developers": ["Deep Silver Dambuster Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Modern", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 49, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/1/afd69b278fce4bdb2edc0c0b382fb4de-98.jpg", "descriptions": "Coming to Xbox One, the all-in-one games and entertainment system from Microsoft, PlayStation 4, PC, Mac and Linux in 2015, Homefront: The Revolution throws players into a near future dystopia. Catastrophic events have brought the United States to its knees and enabled the Korean People'sComing to Xbox One, the all-in-one games and entertainment system from Microsoft, PlayStation 4, PC, Mac and Linux in 2015, Homefront: The Revolution throws players into a near future dystopia. Catastrophic events have brought the United States to its knees and enabled the Korean People's Army forces to impose a brutal military occupation. Trapped in this American nightmare, Philadelphia has become a police state, where surveillance drones and armored patrols keep her once-proud citizens at heel, crushing any dissent with totalitarian force.… Expand"}, {"name": "Blue Estate", "details_link": "https://www.metacritic.com/game/playstation-4/blue-estate", "publisher": "Focus Home Interactive", "release_date": "Jun 24 2014", "developers": ["HeSaw"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "Light Gun", "Rail"], "meta_score": 49, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/a1e9036c39c43f23fc18cdb5683eaa52-98.jpg", "descriptions": "Blue Estate is a darkly funny rail shooter based on comic books of the same name. Assume the role of Tony Luciano, the homicidal maniac son of LA’s crime boss Don Luciano, and Clarence, a broke ex-navy seal who has been hired to clean up Tony’s mess. While Tony wages war with the Sik gang inBlue Estate is a darkly funny rail shooter based on comic books of the same name. Assume the role of Tony Luciano, the homicidal maniac son of LA’s crime boss Don Luciano, and Clarence, a broke ex-navy seal who has been hired to clean up Tony’s mess. While Tony wages war with the Sik gang in an attempt to get back his kidnapped “Helen of Troy,” Clarence has to try to end that war against increasing odds. … Expand"}, {"name": "Just Dance", "details_link": "https://www.metacritic.com/game/wii/just-dance", "publisher": "Ubisoft", "release_date": "Nov 17 2009", "developers": ["Ubisoft Paris"], "platforms": "Wii", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 49, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/2e1bc146d45bc56ccc8cc7d85a91a625-98.jpg", "descriptions": "Requiring only one Wii Remote per player, up to four people can break it down at a time, as they follow on-screen choreographed moves set to classic dance tracks, covering a wide variety of musical genres and bringing everyone to the dance floor. Whether it's a group of 15 year-old girls whoRequiring only one Wii Remote per player, up to four people can break it down at a time, as they follow on-screen choreographed moves set to classic dance tracks, covering a wide variety of musical genres and bringing everyone to the dance floor. Whether it's a group of 15 year-old girls who just want to have fun, a high school reunion dance from the class of '92 needing to pump up the jam, or Generation X who truly believe the groove is in the heart, Just Dance is the ultimate dance game for everyone. The game features more than 30 licensed tracks, ranging from iconic dance hits such as \"U Can't Touch This\" by MC Hammer to modern day pop with \"Hot N Cold (Rock Version)\" by Katy Perry. With more songs to be revealed soon, this game will easily be one of the most diverse video game soundtracks ever assembled. [Ubisoft]… Expand"}, {"name": "Dragon Ball Z for Kinect", "details_link": "https://www.metacritic.com/game/xbox-360/dragon-ball-z-for-kinect", "publisher": "Namco Bandai Games", "release_date": "Oct  9 2012", "developers": ["Spike", "Spike Chunsoft"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 49, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/8/0d5a02a9a98780766be9943e978ab5ab-98.jpg", "descriptions": "Get ready to enter the Dragon Ball Z universe in an entirely new way. Featuring iconic characters, famous attacks and epic battles authentically created from the original manga series, Dragon Ball Z for Kinect lets you unleash your inner Super Saiyan - with no controller in the way! FansGet ready to enter the Dragon Ball Z universe in an entirely new way. Featuring iconic characters, famous attacks and epic battles authentically created from the original manga series, Dragon Ball Z for Kinect lets you unleash your inner Super Saiyan - with no controller in the way! Fans will also be treated to new anime footage debuting in US and Europe for the first time, over 50 playable characters and an entirely new character. Leveraging the Kinect sensor, Dragon Ball Z for Kinect supports QR code functionality, allowing you to hold up special QR codes to unlock content in the game.… Expand"}, {"name": "Zorro: The Chronicles", "details_link": "https://www.metacritic.com/game/playstation-5/zorro-the-chronicles", "publisher": "Maximum Games", "release_date": "Jun 16 2022", "developers": ["Bkom"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 49, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/94c1e04ff32ceace9f284a384c03c728-98.jpg", "descriptions": "Zorro The Chronicles is an exciting and humorous action game that includes combat and exploration scenarios inspired by the TV series. Explore 18 levels and adapt your approach according to the situation and enemies. Use cunning to surprise your opponents, sneak around them and explore theZorro The Chronicles is an exciting and humorous action game that includes combat and exploration scenarios inspired by the TV series. Explore 18 levels and adapt your approach according to the situation and enemies. Use cunning to surprise your opponents, sneak around them and explore the surroundings, or take them on in action-filled sword fights.Protect vulnerable and innocent people from the evil general and his army. Restore justice in 19th century Spanish California.… Expand"}, {"name": "YesterMorrow", "details_link": "https://www.metacritic.com/game/switch/yestermorrow", "publisher": "Blowfish Studios", "release_date": "Nov  5 2020", "developers": ["Bitmap Galaxy"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "2D"], "meta_score": 49, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/60e7cd7b98c32e628fa1d84a094b88fa-98.jpg", "descriptions": "YesterMorrow is a single-player time travelling 2D platformer, mixing action sequences with puzzle elements. Follow the engaging story of Yui, who travels back into the past to save her family and the remnants of a world now trapped in Never-ending Night."}, {"name": "Rugby 20", "details_link": "https://www.metacritic.com/game/playstation-4/rugby-20", "publisher": "Bigben Interactive", "release_date": "Jan 23 2020", "developers": ["Bigben Interactive"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Team", "Rugby"], "meta_score": 49, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/7/daebd2eee23728fb539173f16c8b917b-98.jpg", "descriptions": "Play with the best national teams and biggest leagues in intense single-player and multiplayer matches, local or online: Top 14, Pro D2, Gallagher Premiership and Pro 14. Experience tactical depth that recreates all the intricacies of the modern game. On the pitch, you can tweak your gamePlay with the best national teams and biggest leagues in intense single-player and multiplayer matches, local or online: Top 14, Pro D2, Gallagher Premiership and Pro 14. Experience tactical depth that recreates all the intricacies of the modern game. On the pitch, you can tweak your game plan, manage your line-out, initiate set moves, find spaces and give your side the winning edge.… Expand"}, {"name": "Fallout 76", "details_link": "https://www.metacritic.com/game/xbox-one/fallout-76", "publisher": "Bethesda Softworks", "release_date": "Nov 14 2018", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 24 ", "genres": ["Role-Playing", "Western-Style"], "meta_score": 49, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/2/cbea52fb7d6f1a0b20becb7d59c946ee-98.jpg", "descriptions": "Fallout 76 is the online prequel where every surviving human is a real person. Work together – or not – to survive. Under the threat of nuclear annihilation, you’ll experience the largest, most dynamic world ever created in the legendary Fallout universe. Reclamation Day, 2102. 25 yearsFallout 76 is the online prequel where every surviving human is a real person. Work together – or not – to survive. Under the threat of nuclear annihilation, you’ll experience the largest, most dynamic world ever created in the legendary Fallout universe. Reclamation Day, 2102. 25 years after the bombs fall, you and your fellow Vault Dwellers – chosen from the nation’s best and brightest – emerge into post-nuclear America. Play alone or band together as you explore, quest, build and triumph against the wasteland’s greatest threats. Multiplayer finally comes to the epic open-world RPGs of Bethesda Game Studios. Create your character with the S.P.E.C.I.A.L. system and forge your own path in a new and untamed wasteland with hundreds of locations. Whether you journey alone or with friends, a new and unique Fallout adventure awaits. Use the all-new Construction and Assembly Mobile Platform (C.A.M.P.) to build and craft anywhere in the world. Your C.A.M.P. will provide much-needed shelter, supplies and safety. You can even set up shop to trade goods with other survivors. But beware, not everyone will be quite so neighborly. [Bethesda]\r… Expand"}, {"name": "De-formers", "details_link": "https://www.metacritic.com/game/xbox-one/de-formers", "publisher": "GameTrust", "release_date": "Mar 24 2017", "developers": ["Ready at Dawn"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Action", "Arcade"], "meta_score": 49, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/0f1d84829f70883ae79e6aeab88cb4b3-98.jpg", "descriptions": null}, {"name": "Space Invaders Revolution", "details_link": "https://www.metacritic.com/game/ds/space-invaders-revolution", "publisher": "Mastiff", "release_date": "Sep 20 2005", "developers": ["Marvelous Entertainment"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Vertical"], "meta_score": 49, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/2/226416f0d8c9ad2c02c366fcdb9a5c55-98.jpg", "descriptions": "Space Invaders Revolution is a new take on the series, which marks a true progression over any version before it:  New types of invaders, new rules and new ways to destroy them. Contains a faithful reproduction of the original arcade machine in Classic Mode. New Era mode: the simple rules ofSpace Invaders Revolution is a new take on the series, which marks a true progression over any version before it:  New types of invaders, new rules and new ways to destroy them. Contains a faithful reproduction of the original arcade machine in Classic Mode. New Era mode: the simple rules of Space Invaders are expanded and twisted into a revolutionary step for the classic franchise. New Era mode takes the form of a world tour, with the player confronting the Space Invaders at 20 recognisable geographical locations. In total there are 60 levels to defend and 13 different types of invader to battle. Power-ups include protective shields, additional support craft, rapid-fire shots and column-clearing laser beams – essential aides as the action becomes progressively more intense. Power-ups can be used in combination: using support craft with laser results in three laser beams, decimating multiple waves of invaders with every press of the fire button. [Rising Star Games]… Expand"}, {"name": "Pro Cast Sports Fishing", "details_link": "https://www.metacritic.com/game/xbox/pro-cast-sports-fishing", "publisher": "Capcom", "release_date": "Aug 27 2003", "developers": ["Capcom"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Sports", "Nature", "Fishing"], "meta_score": 49, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/d9cdd006c19af742e08e4c1ac893d90c-98.jpg", "descriptions": "Get back to nature and experience the struggle of man versus fish in a comprehensive bass-fishing simulation game. Pro Cast Sports Fishing re-creates the in-depth angler strategy involved in landing the biggest fish. Become the top angler in tournament fishing, customize your weather andGet back to nature and experience the struggle of man versus fish in a comprehensive bass-fishing simulation game. Pro Cast Sports Fishing re-creates the in-depth angler strategy involved in landing the biggest fish. Become the top angler in tournament fishing, customize your weather and time settings, and earn points to gather valuable fishing tips and buy the best fishing gear. As you progress, you'll discover hidden secrets that may lead you to the legendary big mouth bass that has spawned fish tales for years.… Expand"}, {"name": "RTX Red Rock", "details_link": "https://www.metacritic.com/game/playstation-2/rtx-red-rock", "publisher": "LucasArts", "release_date": "Jun 17 2003", "developers": ["LucasArts"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 49, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/4/08f29041d5297d87733296b3bdd182a6-98.jpg", "descriptions": "Welcome to the Battlefield of the Future. 2103 A.D.  Mars needs you.  You're E.Z. Wheeler - a biomechanically enhanced soldier built to wage a one-man war. Your equipment: an arsenal built into your steel arm, an electronic eye and a robotic sidekick named IRIS.  And you're going to need it.Welcome to the Battlefield of the Future. 2103 A.D.  Mars needs you.  You're E.Z. Wheeler - a biomechanically enhanced soldier built to wage a one-man war. Your equipment: an arsenal built into your steel arm, an electronic eye and a robotic sidekick named IRIS.  And you're going to need it.  Alien invaders have overrun the colony on Mars and we're sending you to stop them.  Your mission: Save the future! [LucasArts]… Expand"}, {"name": "NCAA Final Four 2001", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-final-four-2001", "publisher": "SCEA", "release_date": "Dec 18 2000", "developers": ["989 Sports"], "platforms": "PlayStation 2", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 49, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/0f31d4867a5920cc2e85bdc5f3308e34-98.jpg", "descriptions": "The only college basketball game on the PlayStation 2 computer entertainment system in 2001, and the only basketball game to bring you real, live, 3D rendered cheerleaders! Take that to the bank, with your pressure D and jive-talking inside moves -- this game is calling those who say they'reThe only college basketball game on the PlayStation 2 computer entertainment system in 2001, and the only basketball game to bring you real, live, 3D rendered cheerleaders! Take that to the bank, with your pressure D and jive-talking inside moves -- this game is calling those who say they're \"keeping it real,\" phony chumps. Some of the new features in the game include reworked player models, 3D backgrounds and animated crowds, a plethora of options, updated controls, enhanced artificial intelligence and all-new play-by-play commentary by announcer Quinn Buckner. In addition, the game engine is closely related to 989's other b-ball title, NBA Shootout. And of course, college hoops fans can play through an entire stat-filled season or head straight to the big tournament in hopes of winning the championship.… Expand"}, {"name": "Red Faction: Battlegrounds", "details_link": "https://www.metacritic.com/game/playstation-3/red-faction-battlegrounds", "publisher": "THQ", "release_date": "Apr  5 2011", "developers": ["THQ", "THQ Digital Studios UK"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Simulation", "Shooter", "Shooter", "Vehicle", "Third-Person", "Combat", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 49, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/3cef0b81fcea0745556017bd908075b4-98.jpg", "descriptions": "The signature destructive gameplay from Red Faction: Guerrilla comes to the downloadable arcade with Red Faction: Battlegrounds! Jump into your favorite tank or mech using your Gauss Cannons, Rocket Launchers and Singularity Bombs to destroy the competition, and environment along with it.The signature destructive gameplay from Red Faction: Guerrilla comes to the downloadable arcade with Red Faction: Battlegrounds! Jump into your favorite tank or mech using your Gauss Cannons, Rocket Launchers and Singularity Bombs to destroy the competition, and environment along with it. Battle your way through treacherous Martian deserts, terraformed enclaves and more in a variety of different multiplayer modes and single player challenges. Rank up by defeating the competition and unlock new content including maps, vehicles, weapons and even items for the upcoming Xbox 360, PlayStation 3 system and PC game, Red Faction: Armageddon. … Expand"}, {"name": "Super Rub a Dub", "details_link": "https://www.metacritic.com/game/playstation-3/super-rub-a-dub", "publisher": "SCEA", "release_date": "May  2 2007", "developers": ["Sumo Digital"], "platforms": "PlayStation 3", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 49, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/3c02d5b2171d1157958278b9614309ea-98.jpg", "descriptions": "[Downloadable Game]  Super Rub-A-Dub brings rubber ducklings to life. Fully controlled by the SIXAXIS wireless controller motion sensors, guide your ducklings in colorful water filled tubs to clear each stage safely away from sharks. Tip and toss those sharks overboard. Create a duckling[Downloadable Game]  Super Rub-A-Dub brings rubber ducklings to life. Fully controlled by the SIXAXIS wireless controller motion sensors, guide your ducklings in colorful water filled tubs to clear each stage safely away from sharks. Tip and toss those sharks overboard. Create a duckling line and win bonus time. Includes over 60 ducktastic stages – Enjoy colorful and vibrant themed stages with varied difficulty. High definition graphics brings realistic water simulation with whirpools, currents and flow. 1-4P Turn-based Multiplayer - Select a stage from three difficulty groups - Fun, Tricky and Tough - and try to beat the fastest times. Global Online Ranking - Compare online records with friends and world-wide leaderboards and download replays to watch the world’s top Rubadubbers in action. [SCEA]… Expand"}, {"name": "LA Cops", "details_link": "https://www.metacritic.com/game/xbox-one/la-cops", "publisher": "Team17", "release_date": "Mar 13 2015", "developers": ["Modern Dream"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 49, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/fd180d120798ca367b5c5f54b597ad49-98.jpg", "descriptions": "LA Cops is an action-packed 3D top down shooter set in 1970s LA with police trying to do a tough job in a tough town."}, {"name": "Vane", "details_link": "https://www.metacritic.com/game/playstation-4/vane", "publisher": "Friend & Foe", "release_date": "Jan 15 2019", "developers": ["Friend & Foe"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 49, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/73ff83539571c2e1d2825d3ad3465032-98.jpg", "descriptions": "In a ruined desert, a strange golden dust transforms a free-spirited bird into a determined young child, setting off a chain of events that will reshape the world itself. From the team at Friend & Foe Games, Vane is a stunning, emotional and unnerving experience."}, {"name": "Namco Museum Remix", "details_link": "https://www.metacritic.com/game/wii/namco-museum-remix", "publisher": "Namco Bandai Games", "release_date": "Oct 23 2007", "developers": ["TOSE"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 49, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/562a3385fe31342a474c971489425c2f-98.jpg", "descriptions": "Namco Museum Remix revitalizes popular Namco games, recreating them from the ground up with intuitive controls utilizing the Wii Controller and with new visuals in terms of both graphics and presentation. \"Pac’n Roll Remix\" - Pac-Man ROLLS his way to victory instead of chomping his wayNamco Museum Remix revitalizes popular Namco games, recreating them from the ground up with intuitive controls utilizing the Wii Controller and with new visuals in terms of both graphics and presentation. \"Pac’n Roll Remix\" - Pac-Man ROLLS his way to victory instead of chomping his way through. Players navigate Pac-Man by rolling him through worlds where he will face deadly obstacles, roll-up classic pac pellets and use awesome power-ups. \"Galaga Remix\" – With Galaga invaders arriving from the far reaches of space, players must try to shoot down the invading forces and save Pac-Man from ultimate destruction.  Up to four-players are able to challenge the oncoming invaders, and scores are tallied for each player. \"Pac-Motos Remix\" - The ability to destroy a planet is insignificant next to knocking your opponents off a series of unique and colorful stages all while using the Wii Controller to move, dash and power-up your Pac-Man! Players engage in a small arena where the goal is to knock opponents off while grabbing power-ups and navigating through challenging environments. \"Rally-X Remix\" – With up to 4 players capable of taking the screen at once, this classic Namco title is brought new life with slick graphics, power-ups and a new intuitive control scheme using the Wii Remote to steer. \"Gator Panic Remix\" – Gators pose a serious problem and Pac-Man is here to solve it.  Players use Pac-Man to whack at emerging gators that appear on screen. The player with the most gator whacks at the end of a match wins! Also included in Namco Museum Remix are nine faithful classic Namco arcade games to experience again or for the first time.  These arcade games include: Galaxian, \"Dig Dug, Mappy, Xevious, Gaplus, Super Pac-Man, Pac & Pal, Pac-Mania and Cutie Q. [Namco Bandai Games]… Expand"}, {"name": "One Piece: Pirates' Carnival", "details_link": "https://www.metacritic.com/game/gamecube/one-piece-pirates-carnival", "publisher": "Namco Bandai Games America", "release_date": "Sep 12 2006", "developers": ["h.a.n.d. Inc."], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 49, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/0966fbb4803ac1b7181a0e30b78ed25b-98.jpg", "descriptions": "Different from the previous One Piece games, Pirates Carnival is a party game featuring over forty mini games. The mini games feature simple controls and promise to recreate well-known scenes from the original One Piece body of work. The game features support for four players, with someDifferent from the previous One Piece games, Pirates Carnival is a party game featuring over forty mini games. The mini games feature simple controls and promise to recreate well-known scenes from the original One Piece body of work. The game features support for four players, with some games featuring split screen play and others placing all four players in the same area.… Expand"}, {"name": "Corpse of Discovery", "details_link": "https://www.metacritic.com/game/pc/corpse-of-discovery", "publisher": "Phosphor Games Studio, LLC", "release_date": "Aug 25 2015", "developers": ["Phosphor Games Studio", "LLC", "Phosphor Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 49, "users_score": 1.9, "image": "https://static.metacritic.com/images/products/games/1/aa1d63bedd1c8b9202d5eca28ebceab6-98.jpg", "descriptions": "Corpse of Discovery is a first-person surreal exploration game located on a myriad of planetary landscapes. As the astronaut searching for answers while completing missions on uncharted worlds, players will work to uncover the truth about what happened and why they're there."}, {"name": "Warriors of Might and Magic", "details_link": "https://www.metacritic.com/game/playstation-2/warriors-of-might-and-magic", "publisher": "3DO", "release_date": "Mar 17 2001", "developers": ["3DO"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 49, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/ff47a0543b477b3ab04f77b4c273eb98-98.jpg", "descriptions": "Wrenched from the life he knew by unknown forces bent on his destruction, one man embarks upon a fateful journey of legendary proportions. Forced to wear a mask of shame, this renegade warrior sets out to learn the truth about himself and the world he is destined to save. As his nemesisWrenched from the life he knew by unknown forces bent on his destruction, one man embarks upon a fateful journey of legendary proportions. Forced to wear a mask of shame, this renegade warrior sets out to learn the truth about himself and the world he is destined to save. As his nemesis draws ever closer, Alleron finds that hhe is the only one with the power to save his world from certain destruction.… Expand"}, {"name": "Supremacy MMA", "details_link": "https://www.metacritic.com/game/xbox-360/supremacy-mma", "publisher": "505 Games", "release_date": "Sep 20 2011", "developers": ["Kung Fu Factory"], "platforms": ["PlayStation 3", "PlayStation Vita", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "3D", "3D", "Combat", "Boxing / Martial Arts"], "meta_score": 49, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/957eef9745bdfca2afd2a0279c1acf0b-98.jpg", "descriptions": "Supremacy MMA takes the sport back to its founding roots with M-Rated combat that's not for the faint of heart."}, {"name": "Canvaleon", "details_link": "https://www.metacritic.com/game/wii-u/canvaleon", "publisher": "OXiAB Game Studio", "release_date": "Jul 23 2015", "developers": ["OXiAB Game Studio"], "platforms": "Wii U", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 49, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/b531804be5d15901b19f9594fa3f23bf-98.jpg", "descriptions": "Canvaleon is a platform and stealth game in which you will step into the shoes of Canvas, a friendly white chameleon, and help him using your abilities and the environment in order to overcome some really dangerous enemies and threats."}, {"name": "LIGHT (2014)", "details_link": "https://www.metacritic.com/game/pc/light-2014", "publisher": "Team17", "release_date": "Jul 14 2014", "developers": ["Just A Pixel"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 49, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/0/19694d532a299880e763ffb5ec591ae8-98.jpg", "descriptions": "A note from 'Synthesis Futuristics' suggests that you are part of a scientific study, and the procedure may have left you feeling disorientated and with short term memory loss. Further investigation of your surroundings reveals the existence of a mysterious 'Project Light' and leads you toA note from 'Synthesis Futuristics' suggests that you are part of a scientific study, and the procedure may have left you feeling disorientated and with short term memory loss. Further investigation of your surroundings reveals the existence of a mysterious 'Project Light' and leads you to the conclusion that all is not well. You must search for the answers that will help you piece together the fragmented memories of your past.\r Featuring stylised graphics and a compelling soundtrack' Light is a minimalist stealth infiltration game with a strong narrative that drives the action.\r Use stealth skills to sneak past guards and avoid the gaze of on looking cameras, as you search the environment for the intel that will help you piece together the events of your past.\r Opponents can be killed or stunned; and their bodies dragged out of the way to a safe hiding place. Bodies left in plain sight will attract attention and alert security, making your task even harder!\r You'll find yourself hacking computers and security systems in a bid to locate the vital intelligence that will reveal the motive behind the sinister 'Project Light'.… Expand"}, {"name": "Fist of the North Star: Ken's Rage 2", "details_link": "https://www.metacritic.com/game/playstation-3/fist-of-the-north-star-kens-rage-2", "publisher": "Koei Tecmo Games", "release_date": "Feb  5 2013", "developers": ["Koei", "Omega Force"], "platforms": ["Wii U", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 49, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/0c15e8a7a26b363ba2d15a692bff21ef-98.jpg", "descriptions": "Fist of the North Star: Ken's Rage 2 continues the storyline of the entire manga and offers players a variety of modes, epic battles and new features."}, {"name": "Dynasty Warriors: Gundam 2", "details_link": "https://www.metacritic.com/game/xbox-360/dynasty-warriors-gundam-2", "publisher": "Namco Bandai Games America", "release_date": "Apr 21 2009", "developers": ["Omega Force"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 49, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/da9bc95aabe6392d06bd27d884a1c079-98.jpg", "descriptions": "In the future, rebel space colonies launch a brutal war of independence with a series of coordinated orbital strikes against Earth. The chaotic assault signals the dawn of a new age of combat and the ultimate instrument of warfare is born, the Mobile Suit. Dynasty Warriors: Gundam 2 combinesIn the future, rebel space colonies launch a brutal war of independence with a series of coordinated orbital strikes against Earth. The chaotic assault signals the dawn of a new age of combat and the ultimate instrument of warfare is born, the Mobile Suit. Dynasty Warriors: Gundam 2 combines the devastating power of the Mobile Suit, the rich legacy of the Gundam universe and the furious Tactical Action game play of the Dynasty Warriors series. The game thrusts players into incredible battles against legions of enemy Mobile Suits on distant planetary surfaces and in the far reaches of outer space. For the first time, Dynasty Warriors: Gundam 2 lets players engage in melee battles against colossal enemies such as the Psycho Gundam. The massive Psycho Gundam can quickly reconfigure their bodies into titanic mobile fortresses which can move with remarkable speed. However, highly-trained pilots can utilize their own Mobile Suit’s speed, agility, and of course firepower to defeat these deadly juggernauts. Dynasty Warriors: Gundam 2 also includes new stories featuring mecha from the latest Gundam anime, plus mecha from Char’s Counter Attack and more. With mecha parts collected throughout the course of the game, players can adapt a Mobile Suit which can be piloted into combat. [Namco Bandai Games]… Expand"}, {"name": "Garshasp: The Monster Slayer", "details_link": "https://www.metacritic.com/game/pc/garshasp-the-monster-slayer", "publisher": "Dead Mage Studio", "release_date": "May  9 2011", "developers": ["Dead Mage Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General"], "meta_score": 49, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/bf689681a10bdb4966168e2bb3541309-98.jpg", "descriptions": "The treasure trove of Persian mythology contains within it some of humanity's oldest and most profound myths. They recount a rich and ancient culture, meaningful literature, and exciting legends that bring to life the excitement of Iranian civilization in all its glory-an experience oftenThe treasure trove of Persian mythology contains within it some of humanity's oldest and most profound myths. They recount a rich and ancient culture, meaningful literature, and exciting legends that bring to life the excitement of Iranian civilization in all its glory-an experience often lost in the daily travails of modern life.… Expand"}, {"name": "The Dukes of Hazzard: Return of the General Lee", "details_link": "https://www.metacritic.com/game/xbox/the-dukes-of-hazzard-return-of-the-general-lee", "publisher": "Ubisoft", "release_date": "Sep 28 2004", "developers": ["Ratbag"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 49, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/cba38f74c32c4a5bfc588aa7c8f99a71-98.jpg", "descriptions": "Step into the shoes of Bo and Luke Duke as they race to win prize money to save the local orphanage from Boss Hogg's latest crooked scheme. With the help of Daisy Duke, Uncle Jesse, and Cooter, you'll go up against the evil Boss Hogg and his cohorts in the Hazzard County Derby. Choose from aStep into the shoes of Bo and Luke Duke as they race to win prize money to save the local orphanage from Boss Hogg's latest crooked scheme. With the help of Daisy Duke, Uncle Jesse, and Cooter, you'll go up against the evil Boss Hogg and his cohorts in the Hazzard County Derby. Choose from a variety of vehicles, including the General Lee, the Black Charger, Uncle Jesse's Pickup, and more, and then perform wild stunts in both single-player and multiplayer modes.… Expand"}, {"name": "Pirates of the Caribbean: The Legend of Jack Sparrow", "details_link": "https://www.metacritic.com/game/pc/pirates-of-the-caribbean-the-legend-of-jack-sparrow", "publisher": "Bethesda Softworks", "release_date": "Jun 28 2006", "developers": ["7 Studios"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-2 ", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 49, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/2/d522252865997d5ba26fd5a4633a5fcc-98.jpg", "descriptions": "A sequel to the original Pirates of the Caribbean, Pirates of the Caribbean: The Legend of Jack Sparrow features a blend of fast-paced action and adventure that captures the entertaining characters, settings, and spirit of the first movie. Piracy, smuggling, buried treasure (not to mentionA sequel to the original Pirates of the Caribbean, Pirates of the Caribbean: The Legend of Jack Sparrow features a blend of fast-paced action and adventure that captures the entertaining characters, settings, and spirit of the first movie. Piracy, smuggling, buried treasure (not to mention kidnapping, sword fighting looting, pilfering, and other acts of villainy)...what's not to love about Captain Jack Sparrow?  Jack Sparrow is the ultimate video game character - with his cocky swagger and his offbeat personality - and players are be able to experience his adventures first hand in this action game. Gamers slash and hack their way through a dozen locations, with fully interactive levels and varied gameplay.  The action takes place in a variety of lush, immersive settings, including burning buildings, wrecked ships, and misty moonlit caves. The gameplay experience finds gamers fighting hordes of their enemies one minute, while in the next they're evading capture by the Royal Navy. Gamers learn new moves and combos as the game progresses, allowing even more spectacular, and deadly attacks during combat. [Bethesda Softworks]… Expand"}, {"name": "Blade II", "details_link": "https://www.metacritic.com/game/playstation-2/blade-ii", "publisher": "Activision", "release_date": "Sep  2 2002", "developers": ["Mucky Foot Productions"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 49, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/e2eaf7224c353e22d0fca6243fcf4e29-98.jpg", "descriptions": "Armed with an arsenal of deadly weapons and over-the-top martial arts moves, you must stop the vampire underworld from farming humans for their soul's by exploiting Blade's vampire abilities to defeat enemies with extreme authority."}, {"name": "Shrek", "details_link": "https://www.metacritic.com/game/xbox/shrek", "publisher": "TDK Mediactive", "release_date": "Nov 14 2001", "developers": ["Digital Illusions"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 49, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/46259ac67e478a9df274fd850434bef8-98.jpg", "descriptions": "Every Ogre needs some peace and quiet, even Shrek!   Now that Shrek is the newly discovered hero to all of the fairy tale characters, they have over-run his\"home sweet swamp\" and are begging for his help ... after all, he is the strongest, meanest, and greenest ogre around. In anEvery Ogre needs some peace and quiet, even Shrek!   Now that Shrek is the newly discovered hero to all of the fairy tale characters, they have over-run his\"home sweet swamp\" and are begging for his help ... after all, he is the strongest, meanest, and greenest ogre around. In an effort to live happily ogre after, Shrek embarks on 36 missions in four never-before-seen worlds.… Expand"}, {"name": "RC Revenge Pro", "details_link": "https://www.metacritic.com/game/playstation-2/rc-revenge-pro", "publisher": "Acclaim", "release_date": "Jan 16 2001", "developers": ["Acclaim"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 49, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/a4ca47a84df5dddb8abbc79f17b8d771-98.jpg", "descriptions": "rab the controls and hold on for dear life with the most electrifying, high-speed racing experience available.\rRace and wreck in enchanting movie-theme worlds, kick it into overdrive with over 30 super-flying vehicles, and blow away the competition with outrageous weapons in the mostrab the controls and hold on for dear life with the most electrifying, high-speed racing experience available.\rRace and wreck in enchanting movie-theme worlds, kick it into overdrive with over 30 super-flying vehicles, and blow away the competition with outrageous weapons in the most electrifying racing experience available!\rPreviously known as Revolt 2: Pocket Rockets, this RC vehicle racer graces the 128-bit system with all the slick track designs, great weapons balance, and dead-on control that made the PC and Dreamcast versions such a hit. Luckily, developers from Acclaim's Cheltenham Studios have taken full advantage of the PlayStatation 2 hardware--no longer will tracks be confined to suburban neighborhoods and museums. RC Revenge goes all out to deliver the goods with environments like desert islands and villages wrapped nighttime slumber. And the best part of it all? A level editor for the creative gamer is set to keep the replay value on high.… Expand"}, {"name": "The Amazing Spider-Man 2", "details_link": "https://www.metacritic.com/game/playstation-4/the-amazing-spider-man-2", "publisher": "Activision", "release_date": "Apr 29 2014", "developers": ["Beenox"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action", "Action Adventure", "General", "General", "Open-World"], "meta_score": 49, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/5/cd42f29e52467a2c82c70b07c2357acd-98.jpg", "descriptions": "The Amazing Spider-Man, this all-new third-person action-adventure video game builds on the story of the previous game with an alternative take on the events of the upcoming movie, while also giving players an enhanced, free-roaming web-slinging experience through a greatly expanded New York City."}, {"name": "PixelJunk Raiders", "details_link": "https://www.metacritic.com/game/stadia/pixeljunk-raiders", "release_date": "Mar  1 2021", "developers": ["Q-Games"], "platforms": "Stadia", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 49, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/99cd4799bc04840a7aaf41268851accb-98.jpg", "descriptions": "PixelJunk Raiders is the latest creation from the folks at Q-Games. Planet Tantal is under attack by fiendish aliens bent on harvesting the population’s life force! Shake off that hypersleep and slash, smash, raid, and rescue your way through hundreds of unique missions, all while unravelingPixelJunk Raiders is the latest creation from the folks at Q-Games. Planet Tantal is under attack by fiendish aliens bent on harvesting the population’s life force! Shake off that hypersleep and slash, smash, raid, and rescue your way through hundreds of unique missions, all while unraveling the mystery of the enigmatic Keepers. … Expand"}, {"name": "Dragon Ball Z: Sagas", "details_link": "https://www.metacritic.com/game/playstation-2/dragon-ball-z-sagas", "publisher": "Atari", "release_date": "Mar 22 2005", "developers": ["Avalanche Software"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 49, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/3b293ffdf58f39b86ab56b79fbe2f790-98.jpg", "descriptions": "Recreate the most exciting elements of the Saiyan-Cell Games Sagas, and experience all-new elements from the show that have never been seen before. It is a journey worthy of a Saiyan. Features action/adventure style gameplay; Six playable heroes, including Goku, Gohan, and Piccolo, completeRecreate the most exciting elements of the Saiyan-Cell Games Sagas, and experience all-new elements from the show that have never been seen before. It is a journey worthy of a Saiyan. Features action/adventure style gameplay; Six playable heroes, including Goku, Gohan, and Piccolo, complete with their Super Saiyan/Super Namek forms as appropriate; Six extended missions covering the major plot points from the Saiyan Saga through the Cell Games Saga; Fight the big Boss enemies, including Raditz, Nappa, Captain Ginyu, Frieza, and Cell; Destructible environments that can be smashed apart; Authentic DBZ combat system, including Ki attacks, smash attacks, and tactical teleporting; Numerous secret areas, unlockable characters, and never-before-seen parts of the DBZ story; Upgradeable characters; Multiple game modes including Single player Adventure mode, Arena Arcade mode, and Team-based cooperative mode. [Atari]… Expand"}, {"name": "Madden NFL Football", "details_link": "https://www.metacritic.com/game/3ds/madden-nfl-football", "publisher": "Electronic Arts", "release_date": "Mar 22 2011", "developers": ["EA Tiburon"], "platforms": "3DS", "num_players": "6  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 49, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/60d5a45f5ca7f8a537ccdbb7f0b09f2b-98.jpg", "descriptions": "Madden NFL 11 redefines the way you experience the game of football. Simpler: from 350 plays down to 1, the all-new GameFlow system puts you in the helmet of an NFL quarterback, to execute an authentic, situational game plan, one play at a time. Quicker: with 60-minute game times reduced toMadden NFL 11 redefines the way you experience the game of football. Simpler: from 350 plays down to 1, the all-new GameFlow system puts you in the helmet of an NFL quarterback, to execute an authentic, situational game plan, one play at a time. Quicker: with 60-minute game times reduced to 30, spend more time on the field and less in the playbook. Same drama, half the time. Deeper: Madden NFL 11 is feature-rich, with improved animations and control options, enhanced online functionality, and new broadcast and audio presentation that delivers the NFL experience fans have come to expect. Madden NFL 11 - Simpler. Quicker. Deeper. … Expand"}, {"name": "Immortal: Unchained", "details_link": "https://www.metacritic.com/game/playstation-4/immortal-unchained", "publisher": "Sold Out", "release_date": "Sep  7 2018", "developers": ["Toadman Interactive"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 49, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/0293575cf7397e47683a4e938118c29f-98.jpg", "descriptions": "You are a living weapon. Unwillingly unchained by the Warden, the player's skills are put to the test, given only the instruction that they must stop the end of the world. With a story the player must piece together themselves, the central character sets off with no memory of their past.You are a living weapon. Unwillingly unchained by the Warden, the player's skills are put to the test, given only the instruction that they must stop the end of the world. With a story the player must piece together themselves, the central character sets off with no memory of their past.Other characters in the game may shed light on the situation, but the reality is not always clear, as characters are always operating on their own agendas. Use your diverse arsenal of ranged and melee weapons to clear your path as you explore dark sci-fi interconnected worlds in your quest for truth and salvation.… Expand"}, {"name": "Theatre of War 3: Korea", "details_link": "https://www.metacritic.com/game/pc/theatre-of-war-3-korea", "publisher": "Battlefront.com", "release_date": "Mar 24 2011", "developers": ["1C", "1C Entertainment"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "General", "Historic"], "meta_score": 49, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/6/2d150cbd0bf934465e1f5e6053fda676-98.jpg", "descriptions": "Theatre of War 3 Korea begins where World War II ended. Replay the events of the first hot war of the Cold War era – the Korean War, also known as the Forgotten War! The players are involved in two campaigns, both set in 1950: the North Korean campaign spans June 25 - August 20 and theTheatre of War 3 Korea begins where World War II ended. Replay the events of the first hot war of the Cold War era – the Korean War, also known as the Forgotten War! The players are involved in two campaigns, both set in 1950: the North Korean campaign spans June 25 - August 20 and the American campaign from September 15 - October 8.… Expand"}, {"name": "Deca Sports 2", "details_link": "https://www.metacritic.com/game/wii/deca-sports-2", "publisher": "Hudson", "release_date": "Sep 29 2009", "developers": ["CAProduction"], "platforms": "Wii", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 49, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/f0d621a4045578de8de4cc11d2b3c8cf-98.jpg", "descriptions": "(Also known as \"Sports Island 2\" in the UK/EU)  Use the Wii Remote and Nunchuk to dive right into the action in this sport-o-rama extravaganza! SPORTS ISLAND 2 features a completely new line-up of 10 intuitively controlled sports. So get ready, the sports festival is about to begin. Play by(Also known as \"Sports Island 2\" in the UK/EU)  Use the Wii Remote and Nunchuk to dive right into the action in this sport-o-rama extravaganza! SPORTS ISLAND 2 features a completely new line-up of 10 intuitively controlled sports. So get ready, the sports festival is about to begin. Play by yourself or with others in a variety of modes. Whether you fancy taking on all ten sports with your 5-member team in League Mode, vying over a single sport in Tournament Mode, or configuring the game rules as you please in Open Match Mode, SPORTS ISLAND 2 has a game mode for you. Depending on the sport, you can play with or against up to three other players, making for great family & friend entertainment. New Team & player creation features. SPORTS ISLAND 2 allows you to create not only your own original teams, but your own original characters as well. Simply piece together a face outline, eyes, a nose and a couple other parts and--voila! It's your own in-game persona. [Hudson]… Expand"}, {"name": "The Fridge is Red", "details_link": "https://www.metacritic.com/game/pc/the-fridge-is-red", "publisher": "tinyBuild", "release_date": "Sep 27 2022", "developers": ["CO5MONAUT", "5WORD Team"], "platforms": "PC", "genres": ["First-Person", "Adventure", "General", "3D"], "meta_score": 49, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/10ac04b5b77a39e258561a354e809364-98.jpg", "descriptions": "What is inside the Red Fridge? Collection of six episodes of psychological analog horror. Tour through liminal spaces filled with surreal events and uncanny strangers. Inspired by retro horrors of the PSX era."}, {"name": "Milanoir", "details_link": "https://www.metacritic.com/game/playstation-4/milanoir", "publisher": "Good Shepherd Entertainment", "release_date": "May 31 2018", "developers": ["Italo Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 49, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/be2b3bedd01f50d2cc8b1323b57237fd-98.jpg", "descriptions": "Hunt for the truth and escape the ones who are chasing you through an unforgiving city."}, {"name": "Bad Bots", "details_link": "https://www.metacritic.com/game/pc/bad-bots", "publisher": "Digital Tribe", "release_date": "May 17 2013", "developers": ["Point 5 Projects"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Platformer", "2D"], "meta_score": 49, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/4/e8a9b5e8fbc71dd25e8cf7576758047e-98.jpg", "descriptions": "As Sam McRae, last surviving member of the \"Titan Hauler\" crew, you must hack and blast your way through an onslaught of truly bad 'bots to find a way to prevent a potential planet-destroying catastrophe."}, {"name": "World Championship Poker: Featuring Howard Lederer - All In", "details_link": "https://www.metacritic.com/game/xbox-360/world-championship-poker-featuring-howard-lederer---all-in", "publisher": "Crave", "release_date": "Aug 29 2006", "developers": ["Crave"], "platforms": "Xbox 360", "num_players": "Up to 16 ", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 49, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/15f6e2fe3308af3aba58308e81fe8ef1-98.jpg", "descriptions": "All In features some of the most recognizable and successful poker stars in the world, including Howard Lederer, his sister Annie Duke, Greg Raymer, Amir Vahidi, Paul Darden, and Robert Williamson III. Joining the roster for this year's edition are noted international poker superstars MarcelAll In features some of the most recognizable and successful poker stars in the world, including Howard Lederer, his sister Annie Duke, Greg Raymer, Amir Vahidi, Paul Darden, and Robert Williamson III. Joining the roster for this year's edition are noted international poker superstars Marcel Luske, Thomas Bihl, and Erin Ness, who parlayed a victory at a Maxim Magazine office tournament into a seat at the 2004 World Series of Poker. Features 18 types of poker, including Texas Hold'em, Five Card Draw, Seven Card Stud Omaha and More. Multi-Table Online Tournaments. Scenario Mode: Players are presented with a series of poker \"puzzle\" challenges that gradually increase in difficulty. Lucky Charms: Players can improve their luck through this Career Mode skill. Mixed Games: Play two or more variations of poker during a single game, with the game changing every time the dealer button makes it around the table. [Crave Entertainment]… Expand"}, {"name": "Iron Sky: Invasion", "details_link": "https://www.metacritic.com/game/pc/iron-sky-invasion", "publisher": "TopWare Interactive", "release_date": "Dec 13 2012", "developers": ["Reality Pump"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 49, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/5ed8165d9085eb4d7ddcce6465b80ab3-98.jpg", "descriptions": "\"Iron Sky: Invasion\" puts the player in the pilot seat of defending Earth from a sudden Nazi invasion - from space. The player has at their disposal a variety of experimental, secretly manufactured space fighters, and are tasked with keeping these Moon Nazis off our beloved Planet\"Iron Sky: Invasion\" puts the player in the pilot seat of defending Earth from a sudden Nazi invasion - from space. The player has at their disposal a variety of experimental, secretly manufactured space fighters, and are tasked with keeping these Moon Nazis off our beloved Planet Earth. \"Iron Sky: Invasion\" will bear the major underlying theme of politics: everything, even defending your planet from \"luna-r-tic\" villains, requires skillful political maneuvers. You will need to know who you are fighting for, whose boots you are stepping on, and choose your friends, or more importantly, enemies carefully.… Expand"}, {"name": "Castlevania Judgment", "details_link": "https://www.metacritic.com/game/wii/castlevania-judgment", "publisher": "Konami", "release_date": "Nov 18 2008", "developers": ["Eighting"], "platforms": "Wii", "num_players": "2  Online", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 49, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/74dce1e3dcad30eb20a7e61e3ee6f7a1-98.jpg", "descriptions": "Developed by legendary Castlevania series producer Koji \"Iga\" Igarashi, Castlevania Judgment bridges the past with the present as it pits several generations of the Belmont clan against a host of characters that span the franchise's 22-year history. With 3D environments rendered on Wii,Developed by legendary Castlevania series producer Koji \"Iga\" Igarashi, Castlevania Judgment bridges the past with the present as it pits several generations of the Belmont clan against a host of characters that span the franchise's 22-year history. With 3D environments rendered on Wii, players can choose sides in an epic battle of good versus evil using iconic Castlevania characters designed by famed manga artist Takeshi Obata. Using the motion-sensing controls of the Nunchuk and Wii Remote, players can slash, stab and whip their way across a variety of stages and environmental elements with various surrounding objects as weapons. Select characters can also set traps and make use of monsters on the field to achieve victory in a clash of epic proportions. As an added bonus, players are also able to compete head-to-head using the Nintendo Wi-Fi Connection and connect with Castlevania: Order of Ecclesia on the Nintendo DS to unlock bonus gameplay content. [Konami]… Expand"}, {"name": "Calling", "details_link": "https://www.metacritic.com/game/wii/calling", "publisher": "Hudson Entertainment", "release_date": "Mar  9 2010", "developers": ["Hudson Entertainment"], "platforms": "Wii", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 49, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/10603345f9624f584e88c24b4bfe799e-98.jpg", "descriptions": "Step into the world of Calling, an all new horror adventure on Wii that takes you into the depths of your own imagination and fears. When tales of \"The Black Page\" start circling, curiosity gets the best of you. Although \"The Black Page\" is just an ink black website with an ominous hitStep into the world of Calling, an all new horror adventure on Wii that takes you into the depths of your own imagination and fears. When tales of \"The Black Page\" start circling, curiosity gets the best of you. Although \"The Black Page\" is just an ink black website with an ominous hit counter, rumor has it that if you see \"something\", you'll die within a matter of time of visiting and you'll be added to the death count. Some say the site is a hoax, a prank, or a marketing ploy, but others say the site is a bridge to something sinister. But you've seen \"something\" and now you're trapped in \"The Black Page,\" the in-between of life and death. Can you escape from your fate or will you become another number on the death toll? [Hudson]… Expand"}, {"name": "The Legend of Korra", "details_link": "https://www.metacritic.com/game/xbox-one/the-legend-of-korra", "publisher": "Activision", "release_date": "Oct 22 2014", "developers": ["PlatinumGames"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "General", "Fantasy", "Linear"], "meta_score": 49, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/c5b699088f20a6aae96e915312127704-98.jpg", "descriptions": "Only one human born every generation, the Avatar, can bend the four elements of nature to their will. The Legend of Korra is a third-person action game that follows the current reincarnation of the Avatar – Korra – a headstrong teenage girl chosen by fate to bring balance to the powers ofOnly one human born every generation, the Avatar, can bend the four elements of nature to their will. The Legend of Korra is a third-person action game that follows the current reincarnation of the Avatar – Korra – a headstrong teenage girl chosen by fate to bring balance to the powers of the world.… Expand"}, {"name": "Iron Man 2", "details_link": "https://www.metacritic.com/game/psp/iron-man-2", "publisher": "Sega", "release_date": "May  3 2010", "developers": ["High Voltage Software"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 49, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/5b47a49b1e401c5d5b4a4c713e1577fb-98.jpg", "descriptions": "Packed with favorites from the movie and comic book worlds, Iron Man 2: The Video Game offers gamers a chance to choose between Iron Man and War Machine, as they battle through hugely destructible indoor and outdoor environments. Tony and Rhodey both come equipped with their own distinctPacked with favorites from the movie and comic book worlds, Iron Man 2: The Video Game offers gamers a chance to choose between Iron Man and War Machine, as they battle through hugely destructible indoor and outdoor environments. Tony and Rhodey both come equipped with their own distinct assortments of fully customizable, earth-shattering weapons, as well as vicious melee combat moves, all of which will come in handy against the likes of Crimson Dynamo and other classic Marvel foes. [Sega]… Expand"}, {"name": "Pirates of the Caribbean: The Curse of the Black Pearl", "details_link": "https://www.metacritic.com/game/game-boy-advance/pirates-of-the-caribbean-the-curse-of-the-black-pearl", "publisher": "TDK Mediactive", "release_date": "Jul  1 2003", "developers": ["Pocket Studios"], "platforms": ["PC", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 49, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/39edbc991dade59bf05461b0b9e2909f-98.jpg", "descriptions": "The ruthless Captain Barbossa rules the high seas with treasures beyond your wildest dreams.  As rogue pirate Jack Sparrow, your mission is to collect enough wealth to lead an attack against the dark captain and his band of undead.  Fight, cheat, and steal your way through 20 missions filledThe ruthless Captain Barbossa rules the high seas with treasures beyond your wildest dreams.  As rogue pirate Jack Sparrow, your mission is to collect enough wealth to lead an attack against the dark captain and his band of undead.  Fight, cheat, and steal your way through 20 missions filled with hidden treasures.  Among the weapons you'll have to fight your foes are cannons, artillery, and swords.  If you have what it takes, you'll soon unravel the mystery of the treacherous skeleton crew.  … Expand"}, {"name": "RollerCoaster Tycoon 2: Wacky Worlds", "details_link": "https://www.metacritic.com/game/pc/rollercoaster-tycoon-2-wacky-worlds", "publisher": "Atari", "release_date": "May  8 2003", "developers": ["Frontier Developments"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Business / Tycoon"], "meta_score": 49, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/5/e87317e94cf75a1f235163cb7690fc66-98.jpg", "descriptions": "Find your passport and pack your bags! RollerCoaster Tycoon 2 is taking you on the ultimate trip around the globe in the all-new expansion pack, RollerCoaster Tycoon 2: Wacky Worlds! All new rides, scenery and attractions based on Earth's seven continents. Fill your parks with famousFind your passport and pack your bags! RollerCoaster Tycoon 2 is taking you on the ultimate trip around the globe in the all-new expansion pack, RollerCoaster Tycoon 2: Wacky Worlds! All new rides, scenery and attractions based on Earth's seven continents. Fill your parks with famous landmarks, including the Eiffel Tower, Big Ben, Great Wall of China, Leaning Tower of Pisa, Tal Mahal, Mount Rushmore and more! 21 new scenarios based on real-world locations. Over 50 new ride types from around the world to thrill your park guests. 250 new game elements that integrate into RollerCoaster Tycoon 2. [Infogrames]… Expand"}, {"name": "ShadowFlare", "details_link": "https://www.metacritic.com/game/pc/shadowflare", "publisher": "EmuraSoft", "release_date": "Nov 29 2002", "developers": ["Den-Yu-Sha"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 49, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/204245b538a038a2cbaa15fc7bd7f15c-98.jpg", "descriptions": "A mission-based PC action/role-playing game that consists of 4 episodes.  You start your journey as a hired mercenary working for gold, precious items, and fighting experience in a demon-ruled land. As you adventure through the vast ruins of what's left of the world, you'll deduce whatA mission-based PC action/role-playing game that consists of 4 episodes.  You start your journey as a hired mercenary working for gold, precious items, and fighting experience in a demon-ruled land. As you adventure through the vast ruins of what's left of the world, you'll deduce what happened and who's responsible for the devastation. Once you've reached a certain skill level in the game, you'll be able to choose a new profession for your character as a warrior, wizard/witch, or hunter. [Emurasoft - Available to Download at Official Site]… Expand"}, {"name": "Platoon: The 1st Airborne Cavalry Division in Vietnam", "details_link": "https://www.metacritic.com/game/pc/platoon-the-1st-airborne-cavalry-division-in-vietnam", "publisher": "Strategy First", "release_date": "Nov 21 2002", "developers": ["Digital Reality"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Military", "General"], "meta_score": 49, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/9da8f167b0e713c411c167a78342713b-98.jpg", "descriptions": "Thundering helicopters tear through the skies overhead, wet muddy terrain sinks under your feet and tragic casualties cover the ground you crawl along. All the excitement of the big screen is finally coming to the small screen in Platoon, the first action RTS set during the Vietnam War.Thundering helicopters tear through the skies overhead, wet muddy terrain sinks under your feet and tragic casualties cover the ground you crawl along. All the excitement of the big screen is finally coming to the small screen in Platoon, the first action RTS set during the Vietnam War. Control an entire platoon through missions based on historical events such as Operation \"Shiny Bayonet\" and the Pleiku Campaign and take part in one of the world's most groundbreaking wars and its most legendary war movie - Platoon! [Strategy First]… Expand"}, {"name": "Evil Dead: Hail to the King", "details_link": "https://www.metacritic.com/game/dreamcast/evil-dead-hail-to-the-king", "publisher": "THQ", "release_date": "Dec 17 2000", "developers": ["Heavy Iron Studios"], "platforms": ["PC", "Dreamcast"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 49, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/274b624b3c1434a07f9586c9e2c1a961-98.jpg", "descriptions": "Chainsaws, boomsticks, and Deadites, oh my! Slice and dice the undead with a weapon in each hand. Fight evil across the spans of time: from the infamous cabin to ancient Damascus. Over 20 evil, grisly Deadites attempt to swallow your soul! Best of all... Bruce Campbell as Ash!"}, {"name": "Ghost Rider", "details_link": "https://www.metacritic.com/game/psp/ghost-rider", "publisher": "2K Games", "release_date": "Feb 13 2007", "developers": ["Climax Group", "Climax Studios"], "platforms": ["PlayStation 2", "PSP"], "num_players": "1-4 ", "genres": ["Action", "General", "General", "Beat-'Em-Up", "3D"], "meta_score": 49, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/aa78ed6c9ebf37cca3e5ce483c935bb6-98.jpg", "descriptions": "The Ghost Rider feature film follows superstar motorcycle stunt rider Johnny Blaze as he strikes a deal with the vile Mephistopheles for the most precious of commodities – his immortal soul. Now Johnny Blaze is forever destined to ride night after night as the host to the powerfulThe Ghost Rider feature film follows superstar motorcycle stunt rider Johnny Blaze as he strikes a deal with the vile Mephistopheles for the most precious of commodities – his immortal soul. Now Johnny Blaze is forever destined to ride night after night as the host to the powerful supernatural entity known as the Ghost Rider. The video game continues the storyline, dropping players into the role of Blaze as he is transformed into a super hero with powers to avenge any evil he encounters.  Featuring many of the characters and motorcycles from the comic book and movie, Ghost Rider engages gamers in an immersive, supernatural third person world with a seamless blend of hand-to-hand combat and high-speed motorcycle action. [2K Games]… Expand"}, {"name": "Disney/Pixar Toy Story Mania!", "details_link": "https://www.metacritic.com/game/wii/disneypixar-toy-story-mania!", "publisher": "Disney Interactive Studios", "release_date": "Sep 15 2009", "developers": ["Papaya Studios", "Papaya Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 49, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/85bf6ee01099c731125d185ad0a03a60-98.jpg", "descriptions": "In Toy Story Mania!, players experience the fast-paced, zany fun of the Toy Story Mania! theme park attraction, which is an interactive experience requiring 3D glasses and involving rapid or quick-firing shooting galleries. In addition to galleries adapted from the attraction, the gameIn Toy Story Mania!, players experience the fast-paced, zany fun of the Toy Story Mania! theme park attraction, which is an interactive experience requiring 3D glasses and involving rapid or quick-firing shooting galleries. In addition to galleries adapted from the attraction, the game includes new and original galleries and a series of mini games, all hosted by beloved characters from the movies. The thematically-connected levels are designed for up to four players of all ages with competitive and co-operative multiplayer options. Toy Story Mania! also includes bonus 3D features, transforming the game experience with eye-popping visuals. [Disney]… Expand"}, {"name": "Ace of Spades: Battle Builder", "details_link": "https://www.metacritic.com/game/pc/ace-of-spades-battle-builder", "publisher": "Jagex Games Studio", "release_date": "Dec 12 2012", "developers": ["Jagex Games Studio"], "platforms": "PC", "genres": ["Action", "General", "General"], "meta_score": 49, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/3d998c6c5011d66f1588ace3f216fde0-98.jpg", "descriptions": "Ace of Spades is a unique and retro-looking, intelligent shooter which deftly blends all the imagination and creative freedom of voxel-based gaming with the mayhem and excitement of competitive, team-based multiplayer first person shooters.\r \rThe game offers players complete strategic andAce of Spades is a unique and retro-looking, intelligent shooter which deftly blends all the imagination and creative freedom of voxel-based gaming with the mayhem and excitement of competitive, team-based multiplayer first person shooters.\r \rThe game offers players complete strategic and creative freedom over a constantly evolving battlefield which, when combined with an extensive and ever growing weapon set, four diverse classes, a host of destructible maps and endless multiplayer experiences for 8 to 32 players, promises to breathe new life into the first person shooter genre.… Expand"}, {"name": "Puzzle Arcade", "details_link": "https://www.metacritic.com/game/xbox-360/puzzle-arcade", "publisher": "Eidos Interactive", "release_date": "Dec 24 2008", "developers": ["Ctxm/Say Design"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 49, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/69782e17c33a1a2a59f2204d57275614-98.jpg", "descriptions": "[Xbox Live Arcade]  Players are invited to test their jigsaw genius and solve their way through the extensive Puzzle Arcade library, complete with more than 35 jigsaw puzzles, a variety of downloadable picture packs, and 20 puzzle challenges. With three levels of difficulty, as well as[Xbox Live Arcade]  Players are invited to test their jigsaw genius and solve their way through the extensive Puzzle Arcade library, complete with more than 35 jigsaw puzzles, a variety of downloadable picture packs, and 20 puzzle challenges. With three levels of difficulty, as well as Classic and Turbo modes, players are sure to have a brain-busting experience. Challenge your friends to interactive puzzle game play, showcase your cleverly completed puzzles in the Puzzle Gallery, and share it all through your Xbox LIVE vision camera. Go ahead, put your mind to a monumental test and become the Master of the Jigsaw Universe.… Expand"}, {"name": "NFL Tour", "details_link": "https://www.metacritic.com/game/xbox-360/nfl-tour", "publisher": "Electronic Arts", "release_date": "Jan  8 2008", "developers": ["EA Tiburon"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade"], "meta_score": 49, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/3/47cf92135d416a92ff02dfd6ccc01d4c-98.jpg", "descriptions": "NFL Tour brings the spectacle of a traveling NFL road show alive, with intuitive controls, fast-paced gameplay, and visually stunning graphics - NFL Tour is action-packed. NFL Tour is an NFL licensed video game that offers players a fun and engaging experience with the NFL and its talentedNFL Tour brings the spectacle of a traveling NFL road show alive, with intuitive controls, fast-paced gameplay, and visually stunning graphics - NFL Tour is action-packed. NFL Tour is an NFL licensed video game that offers players a fun and engaging experience with the NFL and its talented players. Gamers embark on a fictional NFL road show. With real NFL players as teammates, players travel across the country to play against each of the NFL teams in newly designed stadiums.  As players defeat each of the NFL squads, they come one step closer to winning an NFL contract. [Electronic Arts]… Expand"}, {"name": "Whirlwind Over Vietnam", "details_link": "https://www.metacritic.com/game/pc/whirlwind-over-vietnam", "publisher": "Evolved Games", "release_date": "Apr 13 2007", "developers": ["G5 Software"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Flight", "Helicopter", "Helicopter", "Combat", "Civilian"], "meta_score": 49, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/2/ed9a987364ec2e2f022fa7b22c982baa-98.jpg", "descriptions": "Delve into the darkness and challenges of the Vietnam War in the epic title Whirlwind Over Vietnam. As a helicopter pilot your missions will take you through the toughest and most dangerous campaigns of the Ia Drang Valley, 1965. The War in Vietnam has become one of the most significantDelve into the darkness and challenges of the Vietnam War in the epic title Whirlwind Over Vietnam. As a helicopter pilot your missions will take you through the toughest and most dangerous campaigns of the Ia Drang Valley, 1965. The War in Vietnam has become one of the most significant political events of the sixties. After World War II military technologies started developing quickly. One of the most noticeable changes was the all-round usage of military helicopters. Even now, after 40 years, the image of a Huey helicopter is one of the most typical associations with the War in Vietnam and almost every movie dedicated to this topic features these machines. Whirlwind Over Vietnam is a helicopter sim that depicts the most famous episodes of the war in a movie-style way. The main events of the game are well-known to the audience due to famous books and movies dedicated to the War such as We Were Soldiers, Apocalypse Now, Hamburger Hill and many others. The game features all the major weapons and military equipment of that period, both air and land - from firearms, grenade launchers and artillery to planes and vehicles on either side of the conflict. And of course, the main focus is on helicopters. The game contains all major American helicopters with modifications for both US Army and Marine Corps. The game is flexible and has a lot of settings which allow varied flight behavior for the helicopter from realistic to arcade. [Evolved Games]… Expand"}, {"name": "Terminator Salvation", "details_link": "https://www.metacritic.com/game/pc/terminator-salvation", "publisher": "Evolved Games", "release_date": "May 19 2009", "developers": ["GRIN"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 49, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/e69bff56c1e7b4352e919f5194648212-98.jpg", "descriptions": "Assume the role of John Connor and battle for survival against the far superior forces of Skynet."}, {"name": "Fuzion Frenzy 2", "details_link": "https://www.metacritic.com/game/xbox-360/fuzion-frenzy-2", "publisher": "Microsoft Game Studios", "release_date": "Jan 30 2007", "developers": ["Hudson Soft"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 49, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/f70d06ba706aa6197c5a9984b2d2d844-98.jpg", "descriptions": "With huge prize money and a chance to save the planet on the line, its your turn to appear on the worldwide hit TV sensation Fuzion Frenzy. Spanning seven planets across the galaxy, you compete in 40 different mini-games - from sports challenges to thrilling battles - in your quest to becomeWith huge prize money and a chance to save the planet on the line, its your turn to appear on the worldwide hit TV sensation Fuzion Frenzy. Spanning seven planets across the galaxy, you compete in 40 different mini-games - from sports challenges to thrilling battles - in your quest to become the ultimate victor. Frenetic social entertainment with 40 different challenges on one disc. Jump-in easy-to-play controls and fun filled game play reward all levels of gamer from the casual to the advanced player. Now on Xbox Live and packed with Xbox Live features such as head-to-head muliplayer, tournament customization and much, much more. Includes new variations of the favorite games from the original Fuzion Frenzy revamped and improved for the Xbox 360. [Microsoft]… Expand"}, {"name": "Twin Sector", "details_link": "https://www.metacritic.com/game/pc/twin-sector", "publisher": "Got Game Entertainment", "release_date": "Dec  5 2009", "developers": ["DNS Development"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern", "Linear"], "meta_score": 49, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/d321f268b84dbaafb85ea4a8c2952cb6-98.jpg", "descriptions": "The story of Twin Sector takes place in a post-apocalyptic future where the remains of mankind have been put to artificial sleep in cryogenic chambers deep under the contaminated surface of earth - until the planet becomes habitable again. You as the player must take the role of AshleyThe story of Twin Sector takes place in a post-apocalyptic future where the remains of mankind have been put to artificial sleep in cryogenic chambers deep under the contaminated surface of earth - until the planet becomes habitable again. You as the player must take the role of Ashley Simms, the protagonist of Twin Sector. Suddenly awakened by the station's security A.I. system O.S.C.A.R., you face the imminent extinction of all other still sleeping survivors due to an unknown failure in the life support system. According to O.S.C.A.R., you are the only person who was able to be woken and therefore the only individual capable of saving mankind. Within the next ten hours you will need to repair the broken main generator of the subterranean bunker system in order to reestablish the station's functionality. But there are yet unknown forces trying to prevent you from succeeding at all costs. Twin Sector is a thrilling physics-based action-adventure which allows players free interaction with their environment. Using the advantages of the powerful HAVOK-Engine, innumerable puzzles, challenges and enemies await the players in a hostile and threatening futuristic environment. Featuring more than 15 missions alongside a thrilling story line unfolding over the course of action. [Steam]… Expand"}, {"name": "Duke Nukem Forever", "details_link": "https://www.metacritic.com/game/xbox-360/duke-nukem-forever", "publisher": "2K Games", "release_date": "Jun 14 2011", "developers": ["Gearbox Software", "3D Realms"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 49, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/5/f9490c2eefcc5ec93fa678a3af5a0a96-98.jpg", "descriptions": "The king is back, baby! Duke Nukem Forever will meld 3D Realms' memorable hero with the latest 3D graphics technology."}, {"name": "Star Trek: Conquest", "details_link": "https://www.metacritic.com/game/wii/star-trek-conquest", "publisher": "Bethesda Softworks", "release_date": "Nov 20 2007", "developers": ["4J Studios"], "platforms": ["PlayStation 2", "Wii"], "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 49, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/8/3186fb41a0c907a81a3b5ef5b0415778-98.jpg", "descriptions": "Star Trek: Conquest is a single-player game of galactic conquest featuring a blend of strategy and action set in The Next Generation era. Players take control of Federation, Klingon, Romulan, Cardassian, Dominion, and Breen forces and lead them in a campaign to control the galaxy, one planetStar Trek: Conquest is a single-player game of galactic conquest featuring a blend of strategy and action set in The Next Generation era. Players take control of Federation, Klingon, Romulan, Cardassian, Dominion, and Breen forces and lead them in a campaign to control the galaxy, one planet at a time. Players must build and manage their growing empires in turn-based strategy, and then engage in all out starship combat in real-time action. Strategically, players must effectively manage their limited resources to expand their empire. Players can decide how to best achieve objectives by managing fleets, admirals, building support structures, researching technology and engaging enemies in combat. Once battle is initiated, the game switches to a ship level tactical view allowing players to take direct command of their ships and engage in real-time combat. Strategy game set in The Next Generation era - Planets held by Next Generation era races are set in a large galactic map, where turn-based strategy allows you to build and expand your empire. Real-time Starship combat - Take direct control of any ship and experience intense action as you engage in real-time combat. Resource Management - Wise spending on starbases, factories, research facilities, and starships determines success. Six Playable Races - Choose to command the Federation, Klingon, Romulan, Cardassian, Dominion, or Breen race, each with their own unique set of strengths and weaknesses. [Bethesda Softworks]… Expand"}, {"name": "Necromunda: Hired Gun", "details_link": "https://www.metacritic.com/game/playstation-4/necromunda-hired-gun", "publisher": "Focus Home Interactive", "release_date": "Jun  1 2021", "developers": ["Focus Home Interactive", "Streum On Studio"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Turn-Based", "Shooter", "First-Person", "Tactics", "Arcade"], "meta_score": 49, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/8/dd42e4ab1df1b8b251c733b6d2a20e80-98.jpg", "descriptions": "The Hunter’s Bounty pack, available with all pre-orders of Necromunda: Hired Gun! Take down marks in style, with a unique knife, stub gun, and outfit skin, as well as a new look for your mastiff’s toy. This product entitles you to download both the digital PS4™ version and the digital PS5™The Hunter’s Bounty pack, available with all pre-orders of Necromunda: Hired Gun! Take down marks in style, with a unique knife, stub gun, and outfit skin, as well as a new look for your mastiff’s toy. This product entitles you to download both the digital PS4™ version and the digital PS5™ version of this game. Navigate an ocean of crime and corruption to balance the bloody ecosystem of Necromunda as a merciless hired gun. The money’s good, the dog’s loyal, and the gun’s reliable – but can you survive the hunt? Necromunda: Hired Gun is an indie fast-paced, violent, and thrilling FPS set in the darkest reaches of Warhammer 40,000’s most infamous hive city.\r For the right price, eliminate the most notorious gangers and mutants. Your armory is a sprawling arsenal. Your body is enhanced with a dozen customizable augments to run on walls and leap over chasms. Your cyber-mastiff will sniff out and kill enemies for you, while your grappling hook allows quick, agile traversal of the massive environments.\r - An indie fast-paced FPS in the Warhammer 40,000 universe\r- Upgrade and fight alongside your loyal cyber-mastiff\r- Endless weapon and augment customisation\r- Upgrade, advance, and level up as you collect bounties… Expand"}, {"name": "Nickelodeon Kart Racers", "details_link": "https://www.metacritic.com/game/xbox-one/nickelodeon-kart-racers", "publisher": "GameMill Entertainment", "release_date": "Oct 23 2018", "developers": ["Bamtang", "GameMill Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 49, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/3f11a6ed8e7776a638e958c851553794-98.jpg", "descriptions": "A new multi-player console racing game, Nickelodeon Kart Racers! Select a racer from one of your favorite Nickelodeon series, including SpongeBob, Patrick, and Sandy from SpongeBob SquarePants, Leonardo, Raphael, Michelangelo, and Donatello from Teenage Mutant Ninja Turtles, Arnold and HelgaA new multi-player console racing game, Nickelodeon Kart Racers! Select a racer from one of your favorite Nickelodeon series, including SpongeBob, Patrick, and Sandy from SpongeBob SquarePants, Leonardo, Raphael, Michelangelo, and Donatello from Teenage Mutant Ninja Turtles, Arnold and Helga from Hey Arnold!, & Angelica, Tommy and Reptar from Rugrats. Race your friends in up to 4-player local multiplayer or check out the Battle Arena for a variety of challenges.Features:* Choose a racer from 12 of the most iconic Nickelodeon series: SpongeBob SquarePants, Teenage Mutant Ninja Turtles, Hey Arnold!, Rugrats and MORE!!!* Race on 24 different Slimed-filled tracks including Bikini Bottom, NYC sewers, Tommy Pickle's house, Arnold's school and more!* Awesome Co-Op and Local Multi-Player for non-stop action the entire family will love!* Customizable Karts with multiple power-ups and special attacks!* Team-based co-op multiplayer, players can perform devastating fused attack for TONS of FUN!* Slime overload will have you turning you Karts into jet-ski racers!… Expand"}, {"name": "Spitfire Heroes: Tales of the Royal Air Force", "details_link": "https://www.metacritic.com/game/ds/spitfire-heroes-tales-of-the-royal-air-force", "publisher": "Destineer", "release_date": "Mar  5 2008", "developers": ["Big John Games"], "platforms": "DS", "num_players": "4  Online", "genres": ["Action", "Flight", "Flight"], "meta_score": 49, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/71d660d7d655aeff8eb7de2ec81da488-98.jpg", "descriptions": "German forces occupy Europe and prepare to invade England. Britain's survival depends on the courage of a handful of men: the pilots of the Royal Air Force. Join the squadron and scramble your Spitfire on thrilling missions to shift the balance of power in World War II in Spitfire Heroes.German forces occupy Europe and prepare to invade England. Britain's survival depends on the courage of a handful of men: the pilots of the Royal Air Force. Join the squadron and scramble your Spitfire on thrilling missions to shift the balance of power in World War II in Spitfire Heroes. This exciting air combat shooter brings the heroic actions of the RAF to the DS with intuitive flight mechanics, devious enemy pilots, and wireless support for up to four players. Players fly for the Royal Air Force through missions based on real events that shaped the outcome of the war. Fast-Paced Air Combat: Roll, shoot, bomb, and maneuver your way through some of the toughest opponents ever to take to the skies. Earn medals and ranks as you progress through the course of World War II – if you survive. Exciting Mission-Based Gameplay: Enter into frenzied dogfights with German fighters, strafe columns of enemy tanks, cover the evacuation of Allied troops, knock buzz bombs out of the sky with a tip of your wing and more in an expansive campaign that recreates some of the most famous battles of the war. [Destineer]… Expand"}, {"name": "Double Dragon IV", "details_link": "https://www.metacritic.com/game/playstation-4/double-dragon-iv", "publisher": "Arc System Works", "release_date": "Jan 30 2017", "developers": ["Arc System Works"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 49, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/7bfdcda9c0cb29c27c80adeeba804df2-98.jpg", "descriptions": "The story picks up after the elimination of the Shadow Warriors in Double Dragon II."}, {"name": "MagNets: Fully Charged", "details_link": "https://www.metacritic.com/game/xbox-one/magnets-fully-charged", "publisher": "Total Monkery", "release_date": "Mar 11 2016", "developers": ["Total Monkery"], "platforms": ["PC", "Xbox One"], "genres": ["Action", "General"], "meta_score": 49, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/8/f0072f5dc2ac681c0fbdf80b190885cd-98.jpg", "descriptions": null}, {"name": "DreamWorks Shrek-N-Roll", "details_link": "https://www.metacritic.com/game/xbox-360/dreamworks-shrek-n-roll", "publisher": "Activision", "release_date": "Nov 14 2007", "developers": ["Backbone Entertainment"], "platforms": "Xbox 360", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 49, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/6dd85f83ec8a192787767da1eba126d6-98.jpg", "descriptions": "[Xbox Live Arcade]  Join Shrek, Fiona, Donkey, Puss in Boots, and 20 other twisted fairy tale friends in Shrek-N-Roll, an addictive and hilarious puzzle game designed for ogres of all ages. Navigate through 16 challenging mazes across four unique evironments in Far Far Away's newest[Xbox Live Arcade]  Join Shrek, Fiona, Donkey, Puss in Boots, and 20 other twisted fairy tale friends in Shrek-N-Roll, an addictive and hilarious puzzle game designed for ogres of all ages. Navigate through 16 challenging mazes across four unique evironments in Far Far Away's newest competitive tournament. Test your tilting and rolling skills in Single Player mode, challenge others in Versus mode, work together with friends and family in Co-op mode, or gain bragging rights with the highest points in Score Attack mode. Adventure through Shrek's world: Start rolling at Worcestershire Academy, venture forth onto the Pirate's ship, visit Shrek's Swamp and brave the Evil Queen's Castle. Mastering each of the 16 levels allows you to move on to more fun and challenging puzzles. Play the whole Shrek gang: Play with 24 twisted fairy tale characters, including Shrek, Fiona, Donkey, Puss in Boots and other unlockable heroes and villains. Enjoy signature Shrek humor: From fast-talking Donkey to sword-fighting Puss in Boots, the animation, dialogue and environments throughout the game bring the humor of Shrek alive! Experience multiple game modes: Test your tilting and rolling skills in Single Player mode, challenge others in Versus mode, work together with friends and family in Co-op mode, or gain bragging rights with the highest points in Score Attack mode. [Microsoft]… Expand"}, {"name": "Damage Inc.: Pacific Squadron WWII", "details_link": "https://www.metacritic.com/game/xbox-360/damage-inc-pacific-squadron-wwii", "publisher": "Mad Catz", "release_date": "Aug 28 2012", "developers": ["Mad Catz"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["WWII", "Action", "Simulation", "Flight", "Flight", "WWII", "Combat"], "meta_score": 49, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/cab60d385be01bf7b3319bb4c0e4fb8b-98.jpg", "descriptions": "Damage Inc.: Pacific Squadron WWII is a flight-combat simulation game in which players pilot military aircraft across the Pacific Theater during World War II."}, {"name": "Dollar Dash", "details_link": "https://www.metacritic.com/game/xbox-360/dollar-dash", "publisher": "Kalypso", "release_date": "Mar  6 2013", "developers": ["Candygun Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 49, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/9/7bbe469f3e099fb4c10ef506a5f7a722-98.jpg", "descriptions": "Grab the cash in this fast and frenetic top down multiplayer versus game. Dollar Dash will have you shouting for joy, as you make a dash with the cash. You must attack, defend, or outrun your competitors in any of the three game modes (Dollar Dash, Save the Safe or Hit'n'Run using unique andGrab the cash in this fast and frenetic top down multiplayer versus game. Dollar Dash will have you shouting for joy, as you make a dash with the cash. You must attack, defend, or outrun your competitors in any of the three game modes (Dollar Dash, Save the Safe or Hit'n'Run using unique and comedic tactics.… Expand"}, {"name": "Zombie Wranglers", "details_link": "https://www.metacritic.com/game/xbox-360/zombie-wranglers", "publisher": "Sierra Online", "release_date": "May  6 2009", "developers": ["Frozen Codebase"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 49, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/f3a21e3e1c017632c806a12fc148504d-98.jpg", "descriptions": "[Xbox Live Arcade]  Be very, very quiet ... we're wrangling Zombies! Save the city of Potters Field from an infestation of zany zombies in the quirky and comical Zombie Wranglers. Armed with a trustworthy Wrangler-Pack and your own unique special abilities, play as one of the four gallant[Xbox Live Arcade]  Be very, very quiet ... we're wrangling Zombies! Save the city of Potters Field from an infestation of zany zombies in the quirky and comical Zombie Wranglers. Armed with a trustworthy Wrangler-Pack and your own unique special abilities, play as one of the four gallant apprentice Wranglers and rescue your neighborhood before it's too late. Engrossing humor: The many laugh-out-loud moments enhance the game play. Distinct Wranglers: The four powerful Wranglers have unique upgradeable abilities, powerful weapons, and screwball personalities. Co-op play: Join up with up to three of your friends, either on one console or over Xbox LIVE, through the single-player story or the competitive arena mode. [Sierra Online]… Expand"}, {"name": "Get On Da Mic", "details_link": "https://www.metacritic.com/game/playstation-2/get-on-da-mic", "publisher": "Eidos Interactive", "release_date": "Oct  5 2004", "developers": ["Artificial Mind and Movement"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "Music Maker"], "meta_score": 49, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/ac236c0dff712e61b821a5b112d95816-98.jpg", "descriptions": "The industry's first hip hop music game. Between 40 of the most popular urban music tracks, today's hottest gear, and multiple playable rappers all trying to get to the top, Get On Da Mic captures the thrill of living the life of rap superstar! 40 Highly recognizable hip hop songs - No needThe industry's first hip hop music game. Between 40 of the most popular urban music tracks, today's hottest gear, and multiple playable rappers all trying to get to the top, Get On Da Mic captures the thrill of living the life of rap superstar! 40 Highly recognizable hip hop songs - No need to learn the words to obscure songs or remember a classic from 1977, GOTM forty of today and tomorrow's hottest rap tracks. Multiple Difficulty Levels - Accessible gameplay allows rappers of all skill levels to get a taste of the big time. 8 Customizable Characters featuring real-world gear - Make sure your character looks as good as they should by buying the same real-world gear seen on rap's megastars! Bling Acquisition - It wouldn't be hip hop without the stuff that comes with it. Outfit your crib with the bling you bring! 8 Levels - Highly unique levels immerse the player in all aspects of a hip hop superstars career. Multiplayer Freestyle Mode - Got your own poetry to share with the world? Showcase your innate talents to your friends to see if you're hip-hops next big thing! Interactive Crowds and Environments - Crowds cheer you on when you're nailing it, and walk away when you don't have it. Party Mode ­- Just want to do the Karaoke thing, hip-hop style? Party Mode let's you flow all of the game's tracks when all you wanna do perform. [Eidos Interactive]… Expand"}, {"name": "Bust-A-Move Universe", "details_link": "https://www.metacritic.com/game/3ds/bust-a-move-universe", "publisher": "Square Enix", "release_date": "Mar 27 2011", "developers": ["Arika"], "platforms": "3DS", "genres": ["Puzzle", "Miscellaneous", "Puzzle", "General", "Puzzle", "Matching", "General"], "meta_score": 49, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/1/badd1784faa72ddb2effd6cb467c5554-98.jpg", "descriptions": "String together colourful bubbles and burst them in the exhilarating puzzles for which the game has come to be known, now upgraded with an all-new feeling of depth."}, {"name": "Aliens vs. Predator: Requiem", "details_link": "https://www.metacritic.com/game/psp/aliens-vs-predator-requiem", "publisher": "Sierra Entertainment", "release_date": "Nov 13 2007", "developers": ["Rebellion"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 49, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/c24ca3cbacd7693f989e6c4f33328b99-98.jpg", "descriptions": "In this third-person action-adventure, players assume the role of an elite lone Predator with an arsenal of exotic weaponry and equipment at their disposal. The game gives access to advanced technologies with the Predator's wrist computer including Pred-tech/thermal vision modes andIn this third-person action-adventure, players assume the role of an elite lone Predator with an arsenal of exotic weaponry and equipment at their disposal. The game gives access to advanced technologies with the Predator's wrist computer including Pred-tech/thermal vision modes and cloaking, to track, stalk and annihilate both humans and Aliens. Both classic and completely new futuristic weapons such as wrist blades, laser trip mines and dual shoulder cannons give players the ability to eradicate all traces of the Alien race. With co-op multiplayer mode players are be able to team up with friends wirelessly to play as the Predator’s comrades, attempting to withstand hordes of attacking Aliens. To add to the game’s challenging features, an honor point system evaluates the player's success based on how closely they adhere to the Predator's value system. The higher the honor achievement, the more weapon and armor upgrades available to the player. [Sierra]… Expand"}, {"name": "Moto Racer 4", "details_link": "https://www.metacritic.com/game/playstation-4/moto-racer-4", "publisher": "Microids", "release_date": "Jan 24 2017", "developers": ["Artefacts Studio", "PQube"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Racing", "Arcade", "Other"], "meta_score": 49, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/0/866ad810797916bdbab55bb9043649b1-98.jpg", "descriptions": "In a world dominated by freestyling and risk-taking, impose your riding style throughout the world. Intimidate your opponents and win your races! Moto Racer 4 is a single and multi-player racing game (for up to 10 players) offering an Asphalt and Off Road mode."}, {"name": "Cannon Fodder 3", "details_link": "https://www.metacritic.com/game/pc/cannon-fodder-3", "publisher": "Game Factory Interactive", "release_date": "Feb  9 2012", "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 49, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/dd03633c1df85a330712f8ca30112a33-98.jpg", "descriptions": "Cannon Fodder 3 is a tactical action game, which inherited the style and traditions of the original game. The war goes on and its scale is nearly the same as before. 500 conscripts are sent to meet their destiny. What awaits them? A general's stars or a bed of honor?"}, {"name": "Domino Master", "details_link": "https://www.metacritic.com/game/xbox-360/domino-master", "publisher": "Microsoft Game Studios", "release_date": "Sep 17 2008", "developers": ["Tik Games", "LLC", "TikGames"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 49, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/5d0edcfa1a8856ba2850490c55707207-98.jpg", "descriptions": "[Xbox Live Arcade]  It's dominos with all the bells and whistles in Domino Master®! Play solo or against friends and family in any of five exciting game variations including Mexican Train, All 3's, All 5's, Straight Dominos, or Bergen. See if you have what it takes to move up the ranks and[Xbox Live Arcade]  It's dominos with all the bells and whistles in Domino Master®! Play solo or against friends and family in any of five exciting game variations including Mexican Train, All 3's, All 5's, Straight Dominos, or Bergen. See if you have what it takes to move up the ranks and score the coveted spot at the top of the Leaderboards or grab the exciting achievements in this great family game sure to please all ages. Variable difficulty levels: The single player mode features three levels of difficulty for the A.I. players, including Beginner, Master, and Guru, to provide exciting game play for all ages. Five game modes: Play Straight, All 3's, All 5's, Bergen, or Mexican Train. Leaderboard support: See your name in lights as you check the leaderboards for each game type. Exciting multiplayer modes: Play Player Match or Ranked Matches. The ultimate party game comes to life when up to four players compete to see who can become the Domino Master. Custom rules: Modify the rules to create your own personal dominos game. Multiple domino sets: Choose from double sixes, double nines, or double twelve domino sets. [Microsoft]… Expand"}, {"name": "Mega Brain Boost", "details_link": "https://www.metacritic.com/game/ds/mega-brain-boost", "publisher": "Majesco Games", "release_date": "Jan 22 2008", "developers": ["Interchannel-Holon"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Miscellaneous", "Edutainment", "Compilation"], "meta_score": 48, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/5f860799b1fdc9cadc22e9829596a4df-98.jpg", "descriptions": "Get three full brain games on 1 game cartridge! Brain Boost Beta Wave includes five different types of progressively difficult brain training games where speed and accuracy count: Find the Match, Shape Recognition, Addition, Remember Sequence and Moving Dots. Brain Boost Gamma Wave includes:Get three full brain games on 1 game cartridge! Brain Boost Beta Wave includes five different types of progressively difficult brain training games where speed and accuracy count: Find the Match, Shape Recognition, Addition, Remember Sequence and Moving Dots. Brain Boost Gamma Wave includes: Remember Colors, Remember Numbers, Remember Circumstances, Remember Faces and Remember Images. Plus a third never-before-released third game on the same cartridge that includes: Match the Kanji Characters, Dots, Colors, Find the Goal and Total Amount of Money. Two game modes within each: Brain Training and Multiplayer. Each game type contains 4 difficulty levels with 20 multiple choice problems in each. Receive your overall score for right brain development after completing a brain training series. Play a friend in any of the 15 game types to see who’s the bigger brainiac. Increase your level of difficulty by answering correctly. Answer incorrectly and your difficulty level will decrease resulting in a lower score percentage. [Majesco]… Expand"}]