[{"name": "Diluvion", "details_link": "https://www.metacritic.com/game/pc/diluvion", "publisher": "Gambitious", "release_date": "Feb  2 2017", "developers": ["ArachnidGames"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 66, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/7c5202913156054a6acee91f49bcda80-98.jpg", "descriptions": "Diluvion is a 3D deep sea, Jules Verne inspired, exploration game with RPG elements and thrilling submarine combat. As the Captain of your own vessel, you must grow and manage your crew as you search for the secrets of the past in a hauntingly beautiful flooded world."}, {"name": "Skully", "details_link": "https://www.metacritic.com/game/xbox-one/skully", "publisher": "Modus Games", "release_date": "Aug  4 2020", "developers": ["Finish Line Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/42065b7d1fae76b567aa8f943971303a-98.jpg", "descriptions": "On a mysterious remote island, a skull washes up on shore and is reawakened by an enigmatic deity. Dubbed Skully, the newly reanimated being has been summoned to intervene in a war between the deity’s three siblings, whose quarrel jeopardizes the island they call home."}, {"name": "Rain World", "details_link": "https://www.metacritic.com/game/pc/rain-world", "publisher": "Adult Swim", "release_date": "Mar 28 2017", "developers": ["Videocult"], "platforms": ["PlayStation 4", "Switch", "PC"], "genres": ["Action", "Platformer", "2D"], "meta_score": 66, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/c180c3f983f09af4b1e4f86b29bb1628-98.jpg", "descriptions": "Assume the role of a nomadic slugcat, both predator and prey in a broken ecosystem. Grab your spear and brave the industrial wastes, hunting enough food to survive, but be wary— other, bigger creatures have the same plan... and slugcats look delicious."}, {"name": "Dengeki Bunko: Fighting Climax", "details_link": "https://www.metacritic.com/game/playstation-3/dengeki-bunko-fighting-climax", "publisher": "Sega", "release_date": "Oct  6 2015", "developers": ["Sega", "French-Bread"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 66, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/559e4af04ccc7a676ef61d4981531e81-98.jpg", "descriptions": "Dengeki Bunko: Fighting Climax sports a character roster of 14 playable characters and 23 assist characters including playable bosses Akira Yuki from Virtua Fighter and Selvaria Bles from Valkyria Chronicles. With playable characters such as Asuna from Sword Art Online or Kuroyukihime fromDengeki Bunko: Fighting Climax sports a character roster of 14 playable characters and 23 assist characters including playable bosses Akira Yuki from Virtua Fighter and Selvaria Bles from Valkyria Chronicles. With playable characters such as Asuna from Sword Art Online or Kuroyukihime from Accel World and support characters like Touma Kamijou from A Certain Magical Index or Izaya Orihara from Durarara, Dengeki Bunko: Fighting Climax makes the most unlikely of character matchups a reality.… Expand"}, {"name": "Picross e3", "details_link": "https://www.metacritic.com/game/3ds/picross-e3", "publisher": "Jupiter Corporation", "release_date": "Oct  3 2013", "developers": ["Jupiter Corporation"], "platforms": "3DS", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Logic", "Logic"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/9533118af0f11c7fc1723ebb9cf7213b-98.jpg", "descriptions": "The third Picross installment, Picross e3, has arrived!\r The new Picross e3 is equipped with a navigation function.\r\n\r\nIt includes an all-new mode called \"Mega Picross\" that's a must-see for fans!\r\n\r\n\"Picross\" is a \"Picture Crossword Puzzle Game\" in which youThe third Picross installment, Picross e3, has arrived!\r The new Picross e3 is equipped with a navigation function.\r It includes an all-new mode called \"Mega Picross\" that's a must-see for fans!\r \"Picross\" is a \"Picture Crossword Puzzle Game\" in which you use numbers as hints to complete illustrations. The rules are simple and easy to understand. Anyone can do it!\r Beginners and intermediate players alike will be able to enjoy these 150 all-new puzzles!\r The new Picross includes an all-new mode, \"Mega Picross,\" which has \"Mega Numbers,\" numbers which span two rows.\r It can be difficult to determine where to fill Mega Numbers, so a different kind of logic from the normal Picross may be necessary.\r You can change the rules for each puzzle to your own liking as you play.… Expand"}, {"name": "My Frogger: Toy Trials", "details_link": "https://www.metacritic.com/game/ds/my-frogger-toy-trials", "publisher": "Konami", "release_date": "Nov 13 2006", "developers": ["Konami"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Action", "General", "General"], "meta_score": 66, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/b3a37fe8a967ae78ebec03e4ee62ac80-98.jpg", "descriptions": "Team up with Frogger in an all new adventure. Frogger is back but he is not alone. Take on the role of Frogger and the Hero. Control the Hero in the Adventure Map and use Frogger to solve puzzles with the touch pad and microphone. The Hero can also provide Frogger with helpful items such asTeam up with Frogger in an all new adventure. Frogger is back but he is not alone. Take on the role of Frogger and the Hero. Control the Hero in the Adventure Map and use Frogger to solve puzzles with the touch pad and microphone. The Hero can also provide Frogger with helpful items such as health and power-ups. Tobi Inc. has created the \"Toy Pet\", where kids can create a toy pet with a will of its own. All the kids have to do is draw their ideal pet and within a few weeks their toy pet is delivered. Tobi Inc. is holding a competition for the best designed pet, which the Hero and Frogger decide to join. The winner of the competition will be granted one wish that can make all their dreams come true. [Konami]… Expand"}, {"name": "This Is the Police", "details_link": "https://www.metacritic.com/game/pc/this-is-the-police", "publisher": "EuroVideo Medien", "release_date": "Aug  2 2016", "developers": ["Weappy Studio"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life", "Career"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/1757a86b4a5898bc43c7b17f38b7ced3-98.jpg", "descriptions": "This Is the Police is a strategy/adventure game set in a city spiraling the drain. Assume the role of gritty Police Chief Jack Boyd and dive into a deep story of crime and intrigue. Will Jack reach his retirement with a nice stack of bills, or will he end up broken ... or worse?"}, {"name": "Patrician IV: Conquest by Trade", "details_link": "https://www.metacritic.com/game/pc/patrician-iv-conquest-by-trade", "publisher": "Kalypso", "release_date": "Sep 17 2010", "developers": ["Gaming Minds Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Management", "Historic", "Business / Tycoon"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/fd0696e15bdbb75006be881747eb0d77-98.jpg", "descriptions": "In Patrician IV , the player takes on the role of a young merchant in the area of the Baltic and North Sea during the late Middle Age, the zenith of the Hanseatic League and its naval trading empire. \r\rStarting from meagre beginnings as a small stall trader, players must use every skill atIn Patrician IV , the player takes on the role of a young merchant in the area of the Baltic and North Sea during the late Middle Age, the zenith of the Hanseatic League and its naval trading empire. \r\rStarting from meagre beginnings as a small stall trader, players must use every skill at their disposal to rise through the merchant ranks and become the most powerful merchant in Europe. The authentic supply and demand-based trading system allows players to grow their business and head out to the high seas to form trading routes with other Hanseatic cities negotiating better prices for the buying and selling of goods. \r\rPatrician IV is being developed by Gaming Minds Studios GmbH, a studio created with members of the original Patrician development team. \r\rFeatures: \rRise through the merchant ranks using your increasing fame and wealth to shape towns from small villages to glorious capitals during the middle ages \r\rThrive based on your ability to prosper in a realistic supply and demand driven economy\r Balance competing interests, trade routes, political turmoil, disease, weather, piracy and greedy royalty to maximise your wealth reputation \r\rConstruct buildings and hire workers, stimulating demand for common and more exotic goods \r\rFortify your convoys to hold off pirate attacks or hunt them down in realistic sea battles\r Set up your trading routes along the Baltic and North Sea and visit bustling medieval cities such as London, Novgorod, Cologne and Bergen\r Compete against eight computer-controlled merchants to become the most famous leader of the Hanseatic League\rVisit the newly launched official Web site at - http://www.patrician4.com… Expand"}, {"name": "Rise & Shine", "details_link": "https://www.metacritic.com/game/xbox-one/rise-shine", "publisher": "Adult Swim", "release_date": "Jan 13 2017", "developers": ["Super Mega Team", "Super Awesome Hyper Dimensional Mega Team"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 66, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/41a1089c4594147d33904a124507998c-98.jpg", "descriptions": "Welcome to Gamearth, a once peaceful planet now threatened by the warmongering Space grunts of Nexgen. In the aftermath of their devastating first strike a child named Rise is forced to take on the sacred gun Shine - and with it the fate of his world."}, {"name": "Mario & Sonic at the London 2012 Olympic Games", "details_link": "https://www.metacritic.com/game/3ds/mario-sonic-at-the-london-2012-olympic-games", "publisher": "Sega", "release_date": "Feb 14 2012", "developers": ["Sega", "Sega Sports R&D"], "platforms": "3DS", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/0e1aa1bb4ad8bb07ea16f0b3c00669fe-98.jpg", "descriptions": "Arriving on Nintendo's new handheld system for the first time ever Mario & Sonic at the London 2012 Olympic Games contains over 50 original Olympic themed events playable in both single and multiplayer modes. Bringing a whole new dimension to the Mario & Sonic universe, theArriving on Nintendo's new handheld system for the first time ever Mario & Sonic at the London 2012 Olympic Games contains over 50 original Olympic themed events playable in both single and multiplayer modes. Bringing a whole new dimension to the Mario & Sonic universe, the glasses-free 3D visuals and the unique control systems mean there are plenty of new and exciting ways to compete for a coveted gold medal!… Expand"}, {"name": "MXGP: The Official Motocross Videogame", "details_link": "https://www.metacritic.com/game/playstation-4/mxgp-the-official-motocross-videogame", "publisher": "Bandai Namco Games", "release_date": "Nov 18 2014", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox 360", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Arcade", "Motorcycle", "Other", "Motocross"], "meta_score": 66, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/6f6c2a0db697f71325acd733db066030-98.jpg", "descriptions": "Sixty riders, sixty bikes, fourteen tracks and rules from the official MX1 and MX2 2013 FIM Motocross World Championship."}, {"name": "Battlezone", "details_link": "https://www.metacritic.com/game/playstation-4/battlezone", "publisher": "Rebellion", "release_date": "Oct 13 2016", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Simulation", "Arcade", "Vehicle", "Combat"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/68b1cb133bb975cd462e9493abeefa98-98.jpg", "descriptions": "Designed for the next wave of virtual reality devices, Battlezone gives you unrivalled battlefield awareness, a monumental sense of scale and breathless combat intensity. You are in the cockpit of a super weapon. Your instincts and senses respond to every threat on the battlefield as enemyDesigned for the next wave of virtual reality devices, Battlezone gives you unrivalled battlefield awareness, a monumental sense of scale and breathless combat intensity. You are in the cockpit of a super weapon. Your instincts and senses respond to every threat on the battlefield as enemy swarms loom over you and super-heated projectiles whistle past your ears.… Expand"}, {"name": "Star Trek Online", "details_link": "https://www.metacritic.com/game/pc/star-trek-online", "publisher": "Atari", "release_date": "Feb  2 2010", "developers": ["Cryptic Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi", "Sci-Fi"], "meta_score": 66, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/179025b33fd46ac2877e8964b7f3f65f-98.jpg", "descriptions": "In Star Trek Online, the Star Trek universe will appear for the first time on a truly massive scale. In this massively multiplayer online game from Cryptic Studios, players can pioneer their own destiny as Captain of a Federation starship. Or, they can become a Klingon Warlord and expand theIn Star Trek Online, the Star Trek universe will appear for the first time on a truly massive scale. In this massively multiplayer online game from Cryptic Studios, players can pioneer their own destiny as Captain of a Federation starship. Or, they can become a Klingon Warlord and expand the Empire to the far reaches of the galaxy. Players will have the opportunity to visit iconic locations from the popular Star Trek fiction, reach out to unexplored star systems, and make contact with new alien species. With Episode Missions, every moment spent playing Star Trek Online will feel like a new Star Trek episode in which you are the star. Immerse yourself in the future of the Trek universe as it moves into the 25th century: a time of shifting alliances and new discoveries. [Atari]… Expand"}, {"name": "Truberbrook: A Nerd Saves the World", "details_link": "https://www.metacritic.com/game/pc/truberbrook-a-nerd-saves-the-world", "publisher": "Headup Games", "release_date": "Mar 12 2019", "developers": ["btf GmbH", "btf"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 66, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/e3b651a8665bf0b7583be3a7efa29640-98.jpg", "descriptions": "Enjoy an adventurous vacation to a 1960's parallel universe! A Sci-Fi-Mystery Adventure Game with handmade scenery. Imagine yourself on a vacation to Europe in the late sixties. Now, picture yourself as a young American scientist; Hans Tannhauser. Yes, that's your name in this scenario.Enjoy an adventurous vacation to a 1960's parallel universe! A Sci-Fi-Mystery Adventure Game with handmade scenery. Imagine yourself on a vacation to Europe in the late sixties. Now, picture yourself as a young American scientist; Hans Tannhauser. Yes, that's your name in this scenario. While you're at it, think of Trüberbrook, a remote village in rural, mountain-sloped and densely forested cold-war Germany. Because, that's where you somehow end up after hitting the continent. But who cares, you won the trip in a lottery! Or at least, that’s how it seems. But don't fear, instead of getting some rest, you could find yourself having to save the world …… Expand"}, {"name": "NHL 2K10", "details_link": "https://www.metacritic.com/game/playstation-3/nhl-2k10", "publisher": "Take-Two Interactive", "release_date": "Sep 15 2009", "developers": ["Take-Two Interactive"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 66, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/1131f25419878bdc02be88af084e638b-98.jpg", "descriptions": "NHL 2K10 redefines the sports gaming experience with a new emphasis on social gaming. Whether you're a die-hard NHL fan or a casual player, NHL 2K10's pick-up-and-play controls, true-to-life authenticity and variety of on- and off-line multiplayer modes promise hours of entertainment for anyNHL 2K10 redefines the sports gaming experience with a new emphasis on social gaming. Whether you're a die-hard NHL fan or a casual player, NHL 2K10's pick-up-and-play controls, true-to-life authenticity and variety of on- and off-line multiplayer modes promise hours of entertainment for any gamer. Among the new features that will make this the must-have hockey game of the season include: New Gameplay Mechanics - Completely rewritten AI, enhanced defensive controls and stick lifts, stumble shots, a new defensive skating model and new incidental contact and small animation systems. Enhanced Presentation - All-new rink intros for each arena, improved goal celebrations, enhanced visuals, and greatly improved, true-to-life character models, with San Jose Sharks commentators Randy Hahn and Drew Remenda returning with new broadcast commentary. Improved Franchise Mode - NHL 2K10 features a new contract/free agency system, improved roster management, an updated financial model, dynamic player progression, and fantasy drafts. New Franchise Co-op Play - Play a franchise season game with or against a friend on- or offline, or play a traditional game against the CPU. Franchise Blog / 2KSports.com Integration - Publish your franchise stats and standings, and upload game highlights and screenshots to your personal page at 2KSports.com. Enhanced Online Modes - New seamless online integration connects players in Team Up games, tracks your progress with My Player Card, and offers full league, leaderboard, tournament and 2K Share support. Create Team Mode - Create a persistent team with friends by designing your uniforms, developing a unique team identity, and then competing against other created teams online, offline and in Franchise mode. [2K Sports]… Expand"}, {"name": "Bridge Constructor", "details_link": "https://www.metacritic.com/game/playstation-4/bridge-constructor", "publisher": "Headup Games", "release_date": "Dec 13 2016", "developers": ["ClockStone Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Xbox One", "PlayStation 4"], "genres": ["Simulation", "Virtual", "Career"], "meta_score": 66, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/011b22ea566f03cd3c49dcdb3d7f6c90-98.jpg", "descriptions": "Bridge Constructor puts you in the role of an engineer. Design and create bridges that span deep valleys, dangerous canyons, city streets or raging rivers. Sure you got it right? Send cars and trucks over your bridges and see what happens. Bridge Constructor features complex physics,Bridge Constructor puts you in the role of an engineer. Design and create bridges that span deep valleys, dangerous canyons, city streets or raging rivers. Sure you got it right? Send cars and trucks over your bridges and see what happens. Bridge Constructor features complex physics, realistic materials, and an introductory tutorial. Creativity and ingenuity required.… Expand"}, {"name": "The Chronicles of Narnia: The Lion, The Witch and The Wardrobe", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-chronicles-of-narnia-the-lion-the-witch-and-the-wardrobe", "publisher": "Buena Vista Games", "release_date": "Nov 14 2005", "developers": ["Amaze Entertainment"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 66, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/df52a5a6eb39dab9e9064af3c6246209-98.jpg", "descriptions": "The malevolent White Witch has cast a 100-year winter on the land of Narnia, and you can help Aslan free his people in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe. As the four children from the movie, you can battle fantastical creatures such as Minotaurs, Cyclops,The malevolent White Witch has cast a 100-year winter on the land of Narnia, and you can help Aslan free his people in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe. As the four children from the movie, you can battle fantastical creatures such as Minotaurs, Cyclops, Werewolves, and Wraiths. The game includes puzzle elements and is closely tied to the plot of the movie. Multiplayer cooperative play is also available.… Expand"}, {"name": "Dark Sector", "details_link": "https://www.metacritic.com/game/pc/dark-sector", "publisher": "Aspyr", "release_date": "Mar 24 2009", "developers": ["Digital Extremes"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/3f5ebe5e53178f14acbb8a82220682a9-98.jpg", "descriptions": "An all-new and original action-thriller designed exclusively for next-generation consoles, Dark Sector thrusts players into the role of Hayden Tenno, an elite black-ops agent sent on a dangerous mission into a decaying Eastern European city that hides a deadly Cold War secret. Attacked by anAn all-new and original action-thriller designed exclusively for next-generation consoles, Dark Sector thrusts players into the role of Hayden Tenno, an elite black-ops agent sent on a dangerous mission into a decaying Eastern European city that hides a deadly Cold War secret. Attacked by an unknown enemy, he awakens to find part of his body altered by an infection that has granted him inhuman abilities and he must learn to evolve along with his powers, to survive and to become a hero. A dark, gritty experience packed with fast action, incredible superpowers and an engaging story. [D3Publisher of America]… Expand"}, {"name": "Monark", "details_link": "https://www.metacritic.com/game/playstation-5/monark", "publisher": "NIS America", "release_date": "Feb 22 2022", "developers": ["Lancarse"], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 66, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/a2b14e6c9ba858606b32ecd0da76ee70-98.jpg", "descriptions": "How far will you go to save the ones you love? Could you face the threats that surround you? Could you face yourself? Your world is plunged into madness when the mysterious and deadly Mist surrounds Shin Mikado Academy. In order to save your friends, you enter the Otherworld, a Daemon-filledHow far will you go to save the ones you love? Could you face the threats that surround you? Could you face yourself? Your world is plunged into madness when the mysterious and deadly Mist surrounds Shin Mikado Academy. In order to save your friends, you enter the Otherworld, a Daemon-filled dimension beyond the real world. Within this enigmatic realm, you must learn to harness your Authority of Vanity and conjure a battalion of Fiends, whose power comes from the Ego of their master. Develop your Ego through various psychological tests to enhance the power of your Fiends, and lead your forces into battle to fight with and against the seven \"Pactbearers\" that are corrupting the academy. Embrace the power of your madness to gain strength, but take care not to delve too far, lest you risk losing yourself. Fellow students and instructors will lend you their aid in your quest to resolve the anomalies throughout the campus.… Expand"}, {"name": "City of Brass", "details_link": "https://www.metacritic.com/game/playstation-4/city-of-brass", "publisher": "Uppercut Games Pty Ltd", "release_date": "May  4 2018", "developers": ["Uppercut Games Pty Ltd"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 66, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/3/5669b2330e9b14ca3512262717f6af45-98.jpg", "descriptions": "Become a daring thief in City of Brass, a first-person action adventure from senior BioShock developers. Armed with scimitar and a versatile whip, you’ll lash and slash, bait and trap your way to the heart of an opulent, Arabian Nights-themed metropolis."}, {"name": "Gal*Gun: Double Peace", "details_link": "https://www.metacritic.com/game/switch/galgun-double-peace", "publisher": "PQube", "release_date": "Mar 17 2022", "developers": ["Inti Creates"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 66, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/591e49f3773af05a400deac725fa35ed-98.jpg", "descriptions": "When Houdai is shot by cupid angel Ekoro, he becomes immensely popular and suddenly every girl at the academy becomes hot for him. But being irresistible is hardly a dream come true! Every love letter, shout of adulation, and advancing kisses drains his energy! And worse - if he doesn't findWhen Houdai is shot by cupid angel Ekoro, he becomes immensely popular and suddenly every girl at the academy becomes hot for him. But being irresistible is hardly a dream come true! Every love letter, shout of adulation, and advancing kisses drains his energy! And worse - if he doesn't find his one true love by the end of the day, he will become cursed and forever alone!Gorgeous anime-styled rail-shooter action. Use your targeting cursor to fend off the advancing girls!Story Mode: Play through the story and see if you can successfully confess your feelings to the girl of your dreams.Score Attack: Play specific levels to achieve the highest scores.Collection: Take a look at your achievements, image gallery and information on all the lovely ladies at the Academy!Choose your own love interest. Your choices will change the story and the path you take throughout the game.… Expand"}, {"name": "Full Mojo Rampage", "details_link": "https://www.metacritic.com/game/playstation-4/full-mojo-rampage", "publisher": "Nicalis", "release_date": "Jun 28 2016", "developers": ["Over the Top Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/fa9e8371c45457739791ba8dbb508e60-98.jpg", "descriptions": "Welcome to the world of Full Mojo Rampage where you get to control a Voodoo keeper throughout his adventures. As the player you'll need to guide him safely through each level whilst hunting for voodoo dolls and mojos. These mojos can be found throughout the game in the form of amulets andWelcome to the world of Full Mojo Rampage where you get to control a Voodoo keeper throughout his adventures. As the player you'll need to guide him safely through each level whilst hunting for voodoo dolls and mojos. These mojos can be found throughout the game in the form of amulets and trinkets that bring him strength and luck. They also unleash an array of other powers that you can craft to your own advantage in order to truly master the terrible powers of Voodoo.… Expand"}, {"name": "Wolfenstein 3D", "details_link": "https://www.metacritic.com/game/xbox-360/wolfenstein-3d", "publisher": "Activision", "release_date": "Jun  3 2009", "developers": ["Nerve Software"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 66, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/53c96db009c2d5cdea848bc895e9c431-98.jpg", "descriptions": "[Xbox Live Arcade]  Achtung! You are OSA super agent B.J. Blazkowicz. Your goal is to escape from Castle Wolfenstein and defeat the twisted Nazi regime in Wolfenstein 3D. Fight all of the memorable enemies from Hans Grosse to Mecha-Hitler in the legendary game that launched the first-person[Xbox Live Arcade]  Achtung! You are OSA super agent B.J. Blazkowicz. Your goal is to escape from Castle Wolfenstein and defeat the twisted Nazi regime in Wolfenstein 3D. Fight all of the memorable enemies from Hans Grosse to Mecha-Hitler in the legendary game that launched the first-person shooter genre. Search classic levels for hidden secrets revealing stolen Nazi treasure, health packs, ammo and weapons, or even short cuts. Battle through all six unique episodes and 60 levels. Customizable weapons: Earn gold and unlock customizable weapon upgrades. Achievements: Conquer Wolfenstein achievements and add points to your Gamerscore. [Id Software]… Expand"}, {"name": "Midnight Pool", "details_link": "https://www.metacritic.com/game/wii/midnight-pool", "publisher": "Gameloft", "release_date": "Aug 18 2008", "developers": ["Gameloft"], "platforms": ["iPhone/iPad", "Wii"], "genres": ["Sports", "Miscellaneous", "Parlor", "Individual", "Billiards", "Billiards"], "meta_score": 66, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/8ae8c6bfcf5f886f4de9c4c9fd909fee-98.jpg", "descriptions": "Take a trip across America to make your dreams come true in a pool tournament worth millions. Visit the most colorful bars and meet seven of the coolest players on the circuit, from country music star Travis to Alison the biologist and John the sheriff. Learn the tricks of the trade throughTake a trip across America to make your dreams come true in a pool tournament worth millions. Visit the most colorful bars and meet seven of the coolest players on the circuit, from country music star Travis to Alison the biologist and John the sheriff. Learn the tricks of the trade through tutorials along the way, while advanced players can take on challenges to show off their trick-shot abilities. Keep things interesting with three sets of rules. [Gameloft]… Expand"}, {"name": "World Championship Poker", "details_link": "https://www.metacritic.com/game/xbox/world-championship-poker", "publisher": "Crave", "release_date": "Nov 30 2004", "developers": ["Coresoft"], "platforms": "Xbox", "num_players": "6  Online", "genres": ["Miscellaneous", "Parlor", "Gambling"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/24ec135b3b7b70f082a34caab704bcf6-98.jpg", "descriptions": "Enter the fast and freewheeling world of high-stakes poker with World Championship Poker. From Texas Hold'em to Seven-Card Stud and Omaha High-Low, you can play more than 18 different poker games, each with in-game tutorials. Once you're ready, you can travel to six tournament locations,Enter the fast and freewheeling world of high-stakes poker with World Championship Poker. From Texas Hold'em to Seven-Card Stud and Omaha High-Low, you can play more than 18 different poker games, each with in-game tutorials. Once you're ready, you can travel to six tournament locations, ranging from a TV studio to a Mississippi riverboat, to compete for the championship. Every good poker player needs a solid poker face; mold your character's look with more than 80 different options.… Expand"}, {"name": "Mario Party 10", "details_link": "https://www.metacritic.com/game/wii-u/mario-party-10", "publisher": "Nintendo", "release_date": "Mar 20 2015", "developers": ["Nintendo", "Nd Cube"], "platforms": "Wii U", "genres": ["Party", "Miscellaneous", "Party / Minigame"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/a006d4341799980ad22920bb3a6681ea-98.jpg", "descriptions": "Bowser crashes the latest Mario Party, the first installment of the series on the Wii U console. In the new Bowser Party mini games, play as Bowser himself and face off against up to four others playing as Mario and friends. Control Bowser using the buttons, motion controls and touch screenBowser crashes the latest Mario Party, the first installment of the series on the Wii U console. In the new Bowser Party mini games, play as Bowser himself and face off against up to four others playing as Mario and friends. Control Bowser using the buttons, motion controls and touch screen of the Wii U GamePad controller in different ways, and wreak havoc as Bowser in each mini-game while the other players strive to survive.… Expand"}, {"name": "The Sims 4", "details_link": "https://www.metacritic.com/game/playstation-4/the-sims-4", "publisher": "Electronic Arts", "release_date": "Nov 17 2017", "developers": ["Maxis"], "platforms": ["PC", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 66, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/0/3a027b223bc9a46bcb0c63b84acddec4-98.jpg", "descriptions": "The Sims 4 is the highly anticipated life simulation game that lets you play with life like never before. Create new Sims with intelligence and emotion. Experience all new intuitive and fun creative tools to sculpt your Sims and build unique homes. Control the mind, body, and heart of yourThe Sims 4 is the highly anticipated life simulation game that lets you play with life like never before. Create new Sims with intelligence and emotion. Experience all new intuitive and fun creative tools to sculpt your Sims and build unique homes. Control the mind, body, and heart of your Sims, and bring your stories to life.… Expand"}, {"name": "CONSORTIUM", "details_link": "https://www.metacritic.com/game/pc/consortium", "publisher": "Interdimensional Games Inc", "release_date": "Jan  8 2014", "developers": ["Interdimensional Games Inc"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Action Adventure", "Adventure", "General", "3D", "First-Person"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/0927e0d699ed2a0cf0a4935fb75d4c9a-98.jpg", "descriptions": "Taking place entirely on board a massive futuristic aircraft, CONSORTIUM is a first person science-fiction role-playing experience unlike any other. The story begins in our world - the \"real world\" - where we here at Interdimensional Games have developed a satellite (iDGi-1) capable ofTaking place entirely on board a massive futuristic aircraft, CONSORTIUM is a first person science-fiction role-playing experience unlike any other. The story begins in our world - the \"real world\" - where we here at Interdimensional Games have developed a satellite (iDGi-1) capable of opening a digital rift through time and space.… Expand"}, {"name": "Arena Football", "details_link": "https://www.metacritic.com/game/playstation-2/arena-football", "publisher": "EA Sports", "release_date": "Feb  7 2006", "developers": ["EA Tiburon"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 66, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/4461263b1ce71534bc68b0841db9f1c8-98.jpg", "descriptions": "Arena Football replicates the unique intensity and passion of the indoor gridiron, giving gamers a completely different football gaming experience.  Staying authentic to AFL rules, Arena Football will feature 8-on-8 play, including six players who play both sides of the ball, and the abilityArena Football replicates the unique intensity and passion of the indoor gridiron, giving gamers a completely different football gaming experience.  Staying authentic to AFL rules, Arena Football will feature 8-on-8 play, including six players who play both sides of the ball, and the ability to send players into and over the walls with each exciting play.  Fast-paced and high-scoring offenses allow players to launch an all-out aerial assault using playbooks created by actual AFL coaches. The arena comes alive with fans, fireworks and a rock-concert atmosphere.  For the first time ever in sports gaming, an in-game telemetry system will provide real-time information about opponents such as passing tendencies, scoring history and player health.  Players can build an AFL powerhouse in Season mode and win their way to ArenaBowl or challenge the best players in the nation with head-to-head online play. [Electronic Arts]… Expand"}, {"name": "Olympic Games Tokyo 2020: The Official Video Game", "details_link": "https://www.metacritic.com/game/xbox-one/olympic-games-tokyo-2020-the-official-video-game", "publisher": "Sega", "release_date": "Jun 22 2021", "developers": ["Sega"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Sports", "Individual", "Athletics"], "meta_score": 66, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/2/908e26372bfc469a3fef1b00182d467f-98.jpg", "descriptions": "Join the fun!The Olympic Games are back, and this time it's your chance for glory! Whether you play with friends, family, or go for gold on the global leaderboards, this is a party game that anyone can pick up and enjoy!\n\nPrepare to unleash the competitor within as you create your athlete,Join the fun!The Olympic Games are back, and this time it's your chance for glory! Whether you play with friends, family, or go for gold on the global leaderboards, this is a party game that anyone can pick up and enjoy!Prepare to unleash the competitor within as you create your athlete, customize their skills and pick the perfect costume. Why settle for standard sportswear when you can take center stage as a pirate, astronaut or cowboy?Choose between 18 fun-fueled sporting eventsfrom Tennis and Football to the 100m, Basketball and Boxingthere's always a record to beat and a score to settle.Going for gold has never been this much fun!… Expand"}, {"name": "Spyborgs", "details_link": "https://www.metacritic.com/game/wii/spyborgs", "publisher": "Capcom", "release_date": "Sep 22 2009", "developers": ["Bionic Games"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 66, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/b8396015ed9c5ef2618df8ff30f396b7-98.jpg", "descriptions": "When players take control of the weapon-enhanced cyborgs in their pursuit of a nefarious traitor, they come together in 2-player co-op to face over 35 stages of mind-blowing challenges packed with epic boss battles and swarms of enemies that only a team of two can defeat! [Capcom]"}, {"name": "Harry Potter and the Half-Blood Prince", "details_link": "https://www.metacritic.com/game/playstation-3/harry-potter-and-the-half-blood-prince", "publisher": "EA Games", "release_date": "Jun 30 2009", "developers": ["EA Bright Light"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 66, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/b2479f487d0452546c84f18f489c0da4-98.jpg", "descriptions": "In Harry Potter and the Half-Blood Prince, Voldemort is tightening his grip on both the Muggle and wizarding worlds and Hogwarts is no longer the safe haven it once was. Harry suspects that dangers may even lie within the castle, but Dumbledore is more intent upon preparing him for the finalIn Harry Potter and the Half-Blood Prince, Voldemort is tightening his grip on both the Muggle and wizarding worlds and Hogwarts is no longer the safe haven it once was. Harry suspects that dangers may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle that he knows is fast approaching. Together they work to find the key to unlock Voldemort's defenses and, to this end, Dumbledore recruits his old friend and colleague, the well-connected and unsuspecting bon vivant Professor Horace Slughorn, whom he believes holds crucial information. Meanwhile, the students are under attack from a very different adversary as teenage hormones rage across the ramparts. Harry finds himself more and more drawn to Ginny, but so is Dean Thomas. And Lavender Brown has decided that Ron is the one for her, only she hadn't counted on Romilda Vane's chocolates! And then there's Hermione, simmering with jealously but determined not to show her feelings. As romance blossoms, one student remains aloof. He is determined to make his mark, albeit a dark one. Love is in the air, but tragedy lies ahead and Hogwarts may never be the same again. In the game, players return to Hogwarts to help Harry survive a fraught sixth year. They also have a chance to engage in exciting wizard duels, mix and brew magical ingredients in Potions class and take to the air to lead the Gryffindor Quidditch team to victory. Players may even get sidetracked by Ron's romantic entanglements as they journey towards a dramatic climax and discover the identity of the Half-Blood Prince. [Electronic Arts]… Expand"}, {"name": "King Arthur II: The Role-Playing Wargame", "details_link": "https://www.metacritic.com/game/pc/king-arthur-ii-the-role-playing-wargame", "publisher": "Paradox Interactive", "release_date": "Jan 27 2012", "developers": ["NeocoreGames"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "General", "Massively Multiplayer Online", "General", "Fantasy"], "meta_score": 66, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/eba7234a899916b6056a69980de9ba2c-98.jpg", "descriptions": "King Arthur II will feature a new and dark fantasy setting. No longer a valiant ruler, King Arthur is now the Maimed King trying to mend a land almost beyond repair in a stunning new plot. More heroic, large scale battles with bigger armies are at reach to defeat more powerful foes. IntenseKing Arthur II will feature a new and dark fantasy setting. No longer a valiant ruler, King Arthur is now the Maimed King trying to mend a land almost beyond repair in a stunning new plot. More heroic, large scale battles with bigger armies are at reach to defeat more powerful foes. Intense boss fights never seen before promise to pit hero's forces against unique and terrifying enemies. A new wide range of camera control options, revised animations and an extensive tutorial will provide for the ultimate gaming experience. … Expand"}, {"name": "ProStroke Golf - World Tour 2007", "details_link": "https://www.metacritic.com/game/xbox/prostroke-golf---world-tour-2007", "publisher": "Oxygen Interactive", "release_date": "Sep 12 2006", "developers": ["Gusto Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Sim"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/39fb0cb1b278172d300c2263a7f1c16a-98.jpg", "descriptions": "With a first-person over-the-ball view, ProStroke Golf's unique \"ProStroke\" swing system puts unprecedented control in the player's hands. No longer does the beauty of the perfect golf swing have to be represented by three controller button presses. Players must put their skill,With a first-person over-the-ball view, ProStroke Golf's unique \"ProStroke\" swing system puts unprecedented control in the player's hands. No longer does the beauty of the perfect golf swing have to be represented by three controller button presses. Players must put their skill, stamina and mental agility to the test in Match Play, against their friends or in the comprehensive career mode.  ProStroke Golf features 18 international courses including The Brabazon at The De Vere Belfry and Lake Nona; noted pros such as Sergio Garcia, Colin Montgomerie, Mark O'Meara and Ben Curtis; commentary from Sam Torrance, Ian Baker Finch and Allan Green; Golf Pro Training exercises; a detailed course and tournament designer and more.… Expand"}, {"name": "NBA Playgrounds", "details_link": "https://www.metacritic.com/game/xbox-one/nba-playgrounds", "publisher": "Saber Interactive", "release_date": "May  9 2017", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Sports", "Team", "Basketball", "Arcade"], "meta_score": 66, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/9fb1d568c91871f4e2888b9d8a98f141-98.jpg", "descriptions": "Play with up to three other players locally on your Xbox One or hop online and defeat your opponents with your awesome, acrobatic displays of skill."}, {"name": "Galactic Civilizations III: Mercenaries", "details_link": "https://www.metacritic.com/game/pc/galactic-civilizations-iii-mercenaries", "publisher": "Stardock", "release_date": "Feb 18 2016", "developers": ["Stardock"], "platforms": "PC", "genres": ["General", "Strategy", "Turn-Based", "4X"], "meta_score": 66, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/73ce80b90c3a65343929c22179bad8a7-98.jpg", "descriptions": "The human race is fighting a desperate war against the remorseless Drengin Empire. Both sides have become increasingly desperate, leading them to turn to the galactic underworld and their elite mercenaries. In Mercenaries, the first expansion to Galactic Civilizations III, new opportunitiesThe human race is fighting a desperate war against the remorseless Drengin Empire. Both sides have become increasingly desperate, leading them to turn to the galactic underworld and their elite mercenaries. In Mercenaries, the first expansion to Galactic Civilizations III, new opportunities open up across the galaxy in the form of Galactic Bazaars. When you discover one of these hidden establishments, you can choose from a long list of hired guns and pay a mercenary to take care of business for you. … Expand"}, {"name": "Death Tank", "details_link": "https://www.metacritic.com/game/xbox-360/death-tank", "publisher": "Microsoft Game Studios", "release_date": "Feb 18 2009", "developers": ["Snowblind Studios"], "platforms": "Xbox 360", "num_players": "8  Online", "genres": ["Strategy", "Turn-Based", "Historic", "General", "Historic"], "meta_score": 66, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/733e4b858305631f08ff0a5ea011d5e0-98.jpg", "descriptions": "[Xbox Live Arcade]  Death Tank is a fast-paced action game that rewards quick reflexes and cunning strategy. Devastating weapons and unique items give your tank unlimited destructive power. Eight separate landscapes react to tank combat, altering their shape when hit and providing an[Xbox Live Arcade]  Death Tank is a fast-paced action game that rewards quick reflexes and cunning strategy. Devastating weapons and unique items give your tank unlimited destructive power. Eight separate landscapes react to tank combat, altering their shape when hit and providing an ever-changing environment in which to play. Battle with up to four friends on the same console, against multiple A.I. opponents in single-player combat, or up to eight tanks simultaneously in the Death Tank arena via Xbox LIVE for exciting co-op or chaotic free-for-all play! Crisp graphics and amazing effects coupled with fast-paced game play makes each battle a visceral experience. [Snowblind Studios]… Expand"}, {"name": "Magic Orbz", "details_link": "https://www.metacritic.com/game/playstation-3/magic-orbz", "publisher": "SCEA", "release_date": "Jan 15 2009", "developers": ["Creat Studios"], "platforms": ["iPhone/iPad", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/b409c88f8e7569099219c7eb08964be4-98.jpg", "descriptions": "Smash your way through nearly 50 fun locations, featuring pirates, sharks and castles filled with noble knights and courtly ladies. Challenge a friend to see who can clear the area first, or work together to finish in record time. Power up with over 24 unique upgrades to your game paddle.Smash your way through nearly 50 fun locations, featuring pirates, sharks and castles filled with noble knights and courtly ladies. Challenge a friend to see who can clear the area first, or work together to finish in record time. Power up with over 24 unique upgrades to your game paddle. Supports in-game live voice communications, and 12 wacky trophies for maximum ball-bashing fun. [Creat Studio]… Expand"}, {"name": "Duel Masters: Kaijudo Showdown", "details_link": "https://www.metacritic.com/game/game-boy-advance/duel-masters-kaijudo-showdown", "publisher": "Atari", "release_date": "Nov 16 2004", "developers": ["Mistic Software"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Board Games"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/015d06dce4d35b2084c3f50575aa9a5c-98.jpg", "descriptions": "Get ready for intense tournament battles in this card-battling game that features characters from the Duel Masters animated series. Kaijudo Showdown challenges you to build a fighting deck from 300 Duel Masters cards, which you'll need defeat your enemies. As you duel various opponents,Get ready for intense tournament battles in this card-battling game that features characters from the Duel Masters animated series. Kaijudo Showdown challenges you to build a fighting deck from 300 Duel Masters cards, which you'll need defeat your enemies. As you duel various opponents, you'll improve your skills and solve the mystery of the missing artifacts. With a Game Boy Advance link cable, you can battle against or trade cards with your friend.… Expand"}, {"name": "NHL 2005", "details_link": "https://www.metacritic.com/game/pc/nhl-2005", "publisher": "EA Sports", "release_date": "Sep 14 2004", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "PC"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 66, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/9/0fbc21f394ae69ce551525454050d42f-98.jpg", "descriptions": "OPEN ICE CONTROL: Seamlessly switch between players with or without the puck -- call for passes, tell a teammate to shoot, set up a vicious one-timer, or call for a defensive double-team on the fly with the push of a button. TOTAL PLAYER AWARENESS: With more player awareness than everOPEN ICE CONTROL: Seamlessly switch between players with or without the puck -- call for passes, tell a teammate to shoot, set up a vicious one-timer, or call for a defensive double-team on the fly with the push of a button. TOTAL PLAYER AWARENESS: With more player awareness than ever before, make saucer passes just before the blueline, call in a second defender to break up a 2-on-1, or fire off wrist shots at the perfect angle on net. FACE-OFF PLAYBOOK: New playcalling system allows you to choose offensive and defensive face-off strategies every time the whistle blows. Plan an attack in your opponent's zone or protect the net right before the puck drops. THE WORLD CUP OF HOCKEY: Take part in the excitement of this year's World Cup of Hockey event featuring teams from USA, Canada, Sweden, Finland, Germany, Russia, Czech Republic, and Slovakia playing in authentic European and North American venues. ALL-NEW SKATING ENGINE: Glide then use explosive speed to get to the open ice -- now you have more puck-handling and turning control. A refined backwards skating system also allows for unprecedented defensive precision and control. THE DRILL: The intensity explodes off the ice with The Drill -- one net, one goalie, and every man for himself. Up to four can play and the one who scores the most goals wins. [EA Sports]… Expand"}, {"name": "Battlestar Galactica", "details_link": "https://www.metacritic.com/game/playstation-2/battlestar-galactica", "publisher": "VU Games", "release_date": "Nov 19 2003", "developers": ["Warthog"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Sci-Fi", "Small Spaceship"], "meta_score": 66, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/3e5ca72d1f9180ec343c273b22d1a4d8-98.jpg", "descriptions": "One Man...One Universe...Thousands of Cylons...It is the end of the sixth millennium in the era of the Cylon Wars. The mechanical Cylons, who were once created as android slaves, revolted against the Humans and were exiled into the stars. Ten years ago they returned...The skies over CapricaOne Man...One Universe...Thousands of Cylons...It is the end of the sixth millennium in the era of the Cylon Wars. The mechanical Cylons, who were once created as android slaves, revolted against the Humans and were exiled into the stars. Ten years ago they returned...The skies over Caprica turned black with Cylon Raiders whose single plan was to wipe out the Human race. For ten years the Colonial survivors have fought a vicious war against the evil mechanical empire. Begin your heroic journey through the Battlestar Galactica universe as the fearless, young Adama, and help lead the fleet of Colonials to survival. [Vivendi Universal]… Expand"}, {"name": "Grabbed by the Ghoulies", "details_link": "https://www.metacritic.com/game/xbox/grabbed-by-the-ghoulies", "publisher": "Microsoft Game Studios", "release_date": "Oct 21 2003", "developers": ["Rare Ltd."], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/b5b8908fc852d8374fc0b300a690f76e-98.jpg", "descriptions": "Do you dare step into a haunted house full of dancing zombies, cursed mummies, and boxing skeletons? Grabbed by the Ghoulies tests your courage as you play as Cooper, a kid on a mission to rescue his kidnapped girlfriend. She's trapped somewhere in the ominous Ghoulhaven Hall, which is rifeDo you dare step into a haunted house full of dancing zombies, cursed mummies, and boxing skeletons? Grabbed by the Ghoulies tests your courage as you play as Cooper, a kid on a mission to rescue his kidnapped girlfriend. She's trapped somewhere in the ominous Ghoulhaven Hall, which is rife with monsters, traps, and scares. But don't worry--you'll have more than 100 household objects, including chairs, pool cues, and fire extinguishers, to bash the ghoulies with. But be careful--if you fail to get through Ghoulhaven Hall, you'll become a prisoner there forever. … Expand"}, {"name": "Neocron", "details_link": "https://www.metacritic.com/game/pc/neocron", "publisher": "cdv Software", "release_date": "Nov 17 2002", "developers": ["Reakktor Media"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi", "Sci-Fi"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/bf8d53a265edc7ed901e29ae363612a8-98.jpg", "descriptions": "If you like first person shooters, you're going to love Neocron, because it provides a whole range of varied weaponry and direct battles. While there's a ceasefire in the city, you can set out to the vast wastelands to hunt monsters and mutants. You can participate in deathmatches in specialIf you like first person shooters, you're going to love Neocron, because it provides a whole range of varied weaponry and direct battles. While there's a ceasefire in the city, you can set out to the vast wastelands to hunt monsters and mutants. You can participate in deathmatches in special arenas within the game without damaging the game characters and their skills or values. Clan friends will also be thrilled: You can found a clan in your team's own apartment and communicate with its members via board and messaging systems, or trade materials, weapons and real estate to become a commercial tycoon. [CDV]… Expand"}, {"name": "Sega Soccer Slam", "details_link": "https://www.metacritic.com/game/playstation-2/sega-soccer-slam", "publisher": "Sega", "release_date": "Sep  2 2002", "developers": ["Black Box"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/1f0f7ee733a120d7bdb7c727e0ca0373-98.jpg", "descriptions": "Unleash merciless kicks, tackles, and steals against excitable, quirky characters from all over the world. Each character in this anything-but-ordinary soccer game wields special powers and moves that if executed properly earn those dramatic victory dances they love so much. Get to theUnleash merciless kicks, tackles, and steals against excitable, quirky characters from all over the world. Each character in this anything-but-ordinary soccer game wields special powers and moves that if executed properly earn those dramatic victory dances they love so much. Get to the random spotlight that appears on the field and your character will shoot skyward with the ball and slam it toward the unsuspecting goalie. The more victories your team scores, the closer you'll get to Quest Mode where you can unlock secret stadiums and uncover hidden items to improve your already stellar performance. [Sega]… Expand"}, {"name": "3 on 3 NHL Arcade", "details_link": "https://www.metacritic.com/game/playstation-3/3-on-3-nhl-arcade", "publisher": "Electronic Arts", "release_date": "Feb  5 2009", "developers": ["EA Canada"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "6  Online", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Arcade", "Arcade"], "meta_score": 66, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/edd6f9d5a715dfcf58ba955e78422925-98.jpg", "descriptions": "[Playstation Network]  With fast paced action, crushing hits and loads of room to experiment, 3 on 3 NHL Arcade promises to have gamers from all walks of life excited about hockey. With no rules to hinder the action, deliver devastating checks that send your opponent over the boards and[Playstation Network]  With fast paced action, crushing hits and loads of room to experiment, 3 on 3 NHL Arcade promises to have gamers from all walks of life excited about hockey. With no rules to hinder the action, deliver devastating checks that send your opponent over the boards and watch as he has to skate back onto the ice. If the goalie comes out of his crease to play the puck, check him. Exaggerated player-looks take center stage with 40 of the top NHL stars, representing every team, skating around the miniature rink. With game-changing power-ups falling on the ice throughout each session, serious is not the name of this game. Fly down the ice with a super-speed skater, and beat a giant sprawling goalie with a trick move for that highlight reel finish. With two control schemes to choose from, players can pick between button controls that allow gamers of all skill levels to pass, shoot, hit and break out the all-new trick moves with ease, or the more advanced Skill Stick controls from NHL 09. 3 on 3 NHL Arcade also brings the online experience players have come to expect from EA SPORTS. In addition to standard ranked matches, 3 on 3 NHL Arcade allows the ability for three players on one console to play three other players on another console anywhere in the world. [Electronic Arts]… Expand"}, {"name": "WinBack: Covert Operations", "details_link": "https://www.metacritic.com/game/playstation-2/winback-covert-operations", "publisher": "Koei", "release_date": "Mar 27 2001", "developers": ["Omega Force"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/5ebb5ff240c1b564ddddae0f6dddace3-98.jpg", "descriptions": "After less-than spectacular sales on its N64 version of the game, Koe's anti-terrorist action/adventure WinBack has returned on the PS2 to help make waiting for \"Metal Gear Solid 2\" a little easier."}, {"name": "Strania", "details_link": "https://www.metacritic.com/game/xbox-360/strania", "publisher": "G.Rev", "release_date": "Mar 30 2011", "developers": ["G.Rev"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/fd7fe7e1b1d9c658c278e1c757408330-98.jpg", "descriptions": "Seisou Kouki Strania is a Japanese arcade game coming out for the XBLA."}, {"name": "Obscure: The Aftermath", "details_link": "https://www.metacritic.com/game/psp/obscure-the-aftermath", "publisher": "Playlogic", "release_date": "Sep 30 2009", "developers": ["Hydravision"], "platforms": ["PC", "PSP"], "num_players": "1-2 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 66, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/a17bed0109600665d64c619ff2eddc02-98.jpg", "descriptions": "Two years ago, at Leafmore High, a group of young teenagers were trapped inside their school and hunted by monsters that had been released by the maniac headmaster. Some of them survived that terrible night, while others perished. Now, the survivors have picked up their lives and joinedTwo years ago, at Leafmore High, a group of young teenagers were trapped inside their school and hunted by monsters that had been released by the maniac headmaster. Some of them survived that terrible night, while others perished. Now, the survivors have picked up their lives and joined college. But all is not right on Fallcreek University; strange black flowers have suddenly sprung up everywhere on the campus. While experimenting with these flowers in class, a dangerous substance is discovered that induces strange but vivid dreams. But a handful of students find out that there is more to the flowers than anyone could have expected; when the seeds finally germinate, a bad trip suddenly turns into a horrible reality... Features 6 charismatic characters with unique skills; unique coop mode: second player can join in at any time; highly detailed and rich 3D environment; find clues and solve various rddles and mysteries; and a vast variety of weapons and horrifying monsters. [Playlogic]… Expand"}, {"name": "Dead Rising 2: Off the Record", "details_link": "https://www.metacritic.com/game/pc/dead-rising-2-off-the-record", "publisher": "Capcom", "release_date": "Oct 11 2011", "developers": ["Capcom Vancouver"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action Adventure", "Horror", "Horror", "Open-World"], "meta_score": 66, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/f4b52d06bda574f98ffc4e389194f0b2-98.jpg", "descriptions": "Dead Rising 2: Off the Record, sees photojournalist and original hero of Dead Rising's Willamette incident, Frank West take center stage as players experience a reimagining of the Fortune City outbreak. Forget what you know about Dead Rising 2,\"Frank West is back in the game!\" The new, \"OffDead Rising 2: Off the Record, sees photojournalist and original hero of Dead Rising's Willamette incident, Frank West take center stage as players experience a reimagining of the Fortune City outbreak. Forget what you know about Dead Rising 2,\"Frank West is back in the game!\" The new, \"Off the Record\" storyline means an all new Dead Rising 2 experience. Frank will face off against more twisted enemies, build more outrageous combo weapons, follow his own unique mission structure and explore brand new areas of Fortune City to get his biggest scoop yet. Frank's come back means the return of his trusty camera, with players able to earn Prestige Points (PP) for specific photo opportunities that are graded against criteria such as horror, drama, erotica and brutality. In addition to the new scenario and gameplay enhancements, Dead Rising 2: Off the Record offers a suite of technical updates including load time optimizations, improved network performance and a host of system upgrades to deliver a more satisfying Dead Rising experience. … Expand"}, {"name": "Serious Sam Double D", "details_link": "https://www.metacritic.com/game/pc/serious-sam-double-d", "publisher": "Devolver Digital", "release_date": "Aug 30 2011", "developers": ["Mommy's Best Games"], "platforms": ["Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Arcade"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/48afb34015565a4eeef45c3bb371faa0-98.jpg", "descriptions": "Inspired by the shout-out-loud awesome adventures of Serious Sam, this title is part of the Serious Sam Indie Series -- a collection of Serious Sam games designed and developed by some of the most talented independent developers in the world. Acclaimed indie developers take the reins of theInspired by the shout-out-loud awesome adventures of Serious Sam, this title is part of the Serious Sam Indie Series -- a collection of Serious Sam games designed and developed by some of the most talented independent developers in the world. Acclaimed indie developers take the reins of the award-winning series and unleash their own brand of mayhem on carnage-craving gamers! … Expand"}, {"name": "Sword of the New World: Granado Espada", "details_link": "https://www.metacritic.com/game/pc/sword-of-the-new-world-granado-espada", "publisher": "K2 Network", "release_date": "Jul 12 2007", "developers": ["IMC Games"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Historic", "Historic"], "meta_score": 66, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/f4a8f8967d8176c8e12312870e940ffb-98.jpg", "descriptions": "A fantasy MMORPG whose story is modeled after Europe's exploration of the New World, this original title allows players to create and simultaneously control a family of characters utilizing the excusive Multiple Character Control (MCC) system. This fantasy adventure unfolds its lusciousA fantasy MMORPG whose story is modeled after Europe's exploration of the New World, this original title allows players to create and simultaneously control a family of characters utilizing the excusive Multiple Character Control (MCC) system. This fantasy adventure unfolds its luscious graphical style through a story comprised of thrilling missions and quests. Swept by an exotic New World fever in the 17th century, this fictional yet historical exploration of the new found continent includes features that are all-new and exclusive to the U.S. version of the game. K2 Network's version offers a new character customization feature with hundreds of costume options, while an improved control scheme and in-game tutorial makes controlling multiple characters familiar and comfortable (for MMO players). In addition, the game includes an all-new story with hundreds of new quests. Control three characters simultaneously - While most games allow you to level just one character at a time, Sword of the New World allows players to develop, mix and match a team of three distinct characters simultaneously. Get the best of both types of MMO worlds with Player vs. Environment (PvE) and Player vs. Player (PvP) combat fully integrated into gameplay. Sword of the New World also includes additional combat options, Family vs. Family (FvF) dueling and City vs. City (CvC) in specific arenas. Character classes include the traditional melee champ Fighter; the spell-casting Wizard, and the dual-purpose assassin and healing Scout, with more classes to be announced later. Each class can learn and perform unique stances and unlock advanced skills. [K2 Network]… Expand"}, {"name": "Beautiful Desolation", "details_link": "https://www.metacritic.com/game/switch/beautiful-desolation", "publisher": "Untold Tales", "release_date": "May 28 2021", "developers": ["THE BROTHERHOOD"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 66, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/2eec34a9aaba0b686eb535393a98ebef-98.jpg", "descriptions": "THE BROTHERHOOD has crafted a homage to adventure games from your childhood. BEAUTIFUL DESOLATION is a 2D isometric adventure set in the distant future. Explore a post-apocalyptic landscape, solve puzzles, meet new friends and make powerful enemies, mediate conflicts and fight for your lifeTHE BROTHERHOOD has crafted a homage to adventure games from your childhood. BEAUTIFUL DESOLATION is a 2D isometric adventure set in the distant future. Explore a post-apocalyptic landscape, solve puzzles, meet new friends and make powerful enemies, mediate conflicts and fight for your life as you unravel the secrets of the world around you. Mark, a man out of time, searches for his lost brother Don, in a far-flung futuristic era ruled by highly advanced technologies which are both revered and reviled. Your surroundings hold echoes of a desolate past, and glimpses of a dark future that has yet to be written by your actions. Be prepared to face many tough choices that will shape this land long after you complete your journey. The inhabitants of this world will help and hinder you, as you make new discoveries and navigate the spectacular African-inspired landscape. Negotiate your passage with local leaders, healers and warriors, or find yourself embroiled in a battle against nanite swarms, enormous scorpions and rocket-equipped robots. From thriving villages to crumbling cities, petrified forests and bone-dry ocean beds, this strange new world holds a multitude of terrains to uncover, beautifully rendered in 2D isometric art. [The Brotherhood]\r … Expand"}, {"name": "Fallen Legion: Rise to Glory", "details_link": "https://www.metacritic.com/game/switch/fallen-legion-rise-to-glory", "publisher": "NIS America", "release_date": "May 29 2018", "developers": ["YummyYummyTummy"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/31d5759124cb64fcef2f655fd20d779f-98.jpg", "descriptions": "Legatus Laendur, a brilliant tactician beloved by the people, fought on the front lines for the Fenumian Empire. But when he discovers why it is rotting from within, he vows to overthrow the royal family. Fenumia devoured his homeland - will you fight to reclaim it?"}, {"name": "Viral Survival", "details_link": "https://www.metacritic.com/game/wii/viral-survival", "publisher": "NIS America", "release_date": "May 24 2010", "developers": ["PeakVox"], "platforms": ["PC", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/5414e4556a26500d1205d635b4b1303b-98.jpg", "descriptions": "[WiiWare]  Viral Survival is an \"escape\" action game where you control a special DNA unit and dodge through enemy virus attacks. If you save a friendly DNA unit they will connect to you, creating a tail. The more you save, the higher point total you will accumulate. There are also four other[WiiWare]  Viral Survival is an \"escape\" action game where you control a special DNA unit and dodge through enemy virus attacks. If you save a friendly DNA unit they will connect to you, creating a tail. The more you save, the higher point total you will accumulate. There are also four other game modes, including one where you can shoot the enemy down and compete for number of kills, and a time attack mode to save 128 DNA units in the shortest time possible. For all five game modes your score can be ranked online. Try your best to become number one in the world.… Expand"}, {"name": "Wolf of the Battlefield: Commando 3", "details_link": "https://www.metacritic.com/game/xbox-360/wolf-of-the-battlefield-commando-3", "publisher": "Capcom", "release_date": "Jun 25 2008", "developers": ["Backbone Emeryville"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "3  Online", "genres": ["Action", "General", "General"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/420e986f79102f816e8d5c2ac0459e49-98.jpg", "descriptions": "[Xbox Live Arcade]  Wolf of the Battlefield: Commando 3 revives the classic Commando franchise with an all-new adventure. Fight solo or recruit two other specialized commandos to defeat the evil tyrant General Ratiev. This frantic war-fest combines precise, old-school gameplay with hi-def[Xbox Live Arcade]  Wolf of the Battlefield: Commando 3 revives the classic Commando franchise with an all-new adventure. Fight solo or recruit two other specialized commandos to defeat the evil tyrant General Ratiev. This frantic war-fest combines precise, old-school gameplay with hi-def 3-D graphics. Play as Codename Wolf, Coyote, or Fox as you take on waves of soldiers, rescue POWs, and blow up armored vehicles through a variety of dangerous battlefields. With loads of weapons and power-ups at your disposal, gear up and blast your way to victory! Experience the classic and immersive arcade-style gameplay blasting onto your TV in 1080p high-definition graphics. Fight solo, or recruit your friends on a mission in three-player, online or local cooperative play. Unleash an advanced arsenal with power-up capabilities, with co-op armed vehicle control at your disposal. [Capcom]… Expand"}, {"name": "Yu-Gi-Oh! GX: Spirit Caller", "details_link": "https://www.metacritic.com/game/ds/yu-gi-oh!-gx-spirit-caller", "publisher": "Konami", "release_date": "Jan  2 2007", "developers": ["Konami"], "platforms": "DS", "num_players": "2  Online", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 66, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/544abf4bee9551c5046f338671c43af9-98.jpg", "descriptions": "It is a brand new year at the Duel Academy and the students are excited to start school. You are placed in the Slifer Red Dorm, and soon after the start of the school year, strange things begin happening. As soon as these odd occurrences begin, you start hearing the voice of spirit duelist.It is a brand new year at the Duel Academy and the students are excited to start school. You are placed in the Slifer Red Dorm, and soon after the start of the school year, strange things begin happening. As soon as these odd occurrences begin, you start hearing the voice of spirit duelist. This spirit is a good spirit and will help you duel and solve the mysteries surrounding the Duel Academy. Head to head worldwide dueling via the Nintendo Wi-Fi Connection. Includes over 1,500 cards. Create and edit the look of your character. Each game includes three exclusive trading cards. [Konami]… Expand"}, {"name": "Tamagotchi Connection: Corner Shop 2", "details_link": "https://www.metacritic.com/game/ds/tamagotchi-connection-corner-shop-2", "publisher": "Namco Bandai Games America", "release_date": "Nov 14 2006", "developers": ["NanaOn-Sha"], "platforms": "DS", "num_players": "1-5 ", "genres": ["Strategy", "Breeding/Constructing", "General", "Breeding/Constructing"], "meta_score": 66, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/6bc14ae635ecf66bc949a92630ae11fc-98.jpg", "descriptions": "In Tamagotchi Connection: Corner Shop 2, shop owners must keep their bizarrely adorable Tamagotchi partners happy by earning “Gotchi points” through performing mini-game tasks for the customers. Gotchi points can be used to clothe, feed, and care for your Tamagotchi partners. As more pointsIn Tamagotchi Connection: Corner Shop 2, shop owners must keep their bizarrely adorable Tamagotchi partners happy by earning “Gotchi points” through performing mini-game tasks for the customers. Gotchi points can be used to clothe, feed, and care for your Tamagotchi partners. As more points are collected, new types of shops for players to open will become unlocked. Shops not seen in the original such as the Bowling Alley and Sushi Bar will be available, as well as upgrades to old favorites like the Concert Hall where players can sing along to the music with the DS’ microphone. In Tamagotchi Connection: Corner Shop 2, catering to the needs of your customers will be essential in keeping the Tamagotchi happy. The five different happiness levels will determine the dialogue that occurs between the player and their Tamagotchi partner, and nobody likes a grumpy Tamagotchi. [Namco Bandai]… Expand"}, {"name": "Street Racing Syndicate", "details_link": "https://www.metacritic.com/game/xbox/street-racing-syndicate", "publisher": "Namco", "release_date": "Aug 31 2004", "developers": ["Eutechnyx"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 66, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/a7a4651331895e34a5ed4d09022a454b-98.jpg", "descriptions": "From fancy cars to beautiful import models, Street Racing Syndicate delivers the fast-paced world of street racing. You can race for money, pink slips, and more through the streets of LA, Philadelphia, and Miami. With each win, you'll earn cash, respect, and the affections of real-worldFrom fancy cars to beautiful import models, Street Racing Syndicate delivers the fast-paced world of street racing. You can race for money, pink slips, and more through the streets of LA, Philadelphia, and Miami. With each win, you'll earn cash, respect, and the affections of real-world street racing models. Use your cash to customize vehicles with licensed parts and graphic upgrades. Showcase your vehicle in online races, but be ready to drive off track if the police come.… Expand"}, {"name": "Assassin's Creed Liberation HD", "details_link": "https://www.metacritic.com/game/pc/assassins-creed-liberation-hd", "publisher": "Ubisoft", "release_date": "Jan 15 2014", "developers": ["Ubisoft Sofia"], "platforms": ["PlayStation 3", "PlayStation 4", "Stadia", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 66, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/eb021500681e8ea72406cd1aa4dbd9f7-98.jpg", "descriptions": "Liberation is set in New Orleans between 1765 and 1780, in the period between the end of the French and Indian War, up to the middle of the American Revolution. The game tells the story of Aveline; a female Assassin of mixed French and African heritage. Brought up in a world of privilege andLiberation is set in New Orleans between 1765 and 1780, in the period between the end of the French and Indian War, up to the middle of the American Revolution. The game tells the story of Aveline; a female Assassin of mixed French and African heritage. Brought up in a world of privilege and contrasts, Aveline becomes a strong willed woman and an avid opponent of slavery.… Expand"}, {"name": "Obscure", "details_link": "https://www.metacritic.com/game/xbox/obscure", "publisher": "DreamCatcher Interactive", "release_date": "Apr  6 2005", "developers": ["Hydravision"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action Adventure", "Horror"], "meta_score": 66, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/afe0a4c19d8c0ff6425b3ec2306be0cc-98.jpg", "descriptions": "Inspired by recent \"teen slasher\" movies and TV shows, Obscure takes you to a deserted high school rife with tortured screams and faceless creatures. In single-player mode, you'll play as one of five students teamed with a computer-controlled character. In cooperative mode, yourInspired by recent \"teen slasher\" movies and TV shows, Obscure takes you to a deserted high school rife with tortured screams and faceless creatures. In single-player mode, you'll play as one of five students teamed with a computer-controlled character. In cooperative mode, your friend can play as your partner. As you explore the school, you must combine your weapons with artificial or natural light sources to drive away the monsters.… Expand"}, {"name": "Lucky's Tale", "details_link": "https://www.metacritic.com/game/pc/luckys-tale", "publisher": "Playful Corp.", "release_date": "Mar 28 2016", "developers": ["Playful Corp."], "platforms": ["PlayStation 4", "PC"], "genres": ["Action", "Platformer", "3D"], "meta_score": 66, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/1/59814549b593317dacd3b807c190c092-98.jpg", "descriptions": "[Oculus Rift VR-Exclusive] Lucky's Tale is a platforming adventure game designed exclusively for the Oculus Rift. Join Lucky as he runs, jumps, climbs and spins his way through bright, colorful worlds filled with thrilling challenges, wacky creatures, and all the shiny things a little fox[Oculus Rift VR-Exclusive] Lucky's Tale is a platforming adventure game designed exclusively for the Oculus Rift. Join Lucky as he runs, jumps, climbs and spins his way through bright, colorful worlds filled with thrilling challenges, wacky creatures, and all the shiny things a little fox could ever want. Built from the ground up for virtual reality, the game invites you to step inside a vibrant, living world like never before. Whether you’re racing with Lucky through lush trees, dodging swamp pits, battling menacing bosses, or mastering mini-games, you’ll feel like you’re really there thanks to the magic of VR. [Playful]… Expand"}, {"name": "Fairy Fencer F: Advent Dark Force", "details_link": "https://www.metacritic.com/game/switch/fairy-fencer-f-advent-dark-force", "publisher": "Idea Factory", "release_date": "Jan 17 2019", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/fd3a1bc6c10f5f896e32cf98a79d2f77-98.jpg", "descriptions": "Long ago, a war was waged between the Vile God and the Goddess. The battle was fierce; the two were equally matched. Finally, both sides unleashed special weapons that contained fairies imbued with their power. Using this power, each god sealed away the other within another world.\r And so,Long ago, a war was waged between the Vile God and the Goddess. The battle was fierce; the two were equally matched. Finally, both sides unleashed special weapons that contained fairies imbued with their power. Using this power, each god sealed away the other within another world.\r And so, time passed...\r The weapons that the Goddess and the Vile God left were called Furies, and the warriors who used them were called Fencers. Rumors arose that the Furies were so powerful, whoever collected them all would be granted one wish. As a result, Fencers fought each other endlessly to obtain them. By chance, a young man named Fang happened to unwittingly become a Fencer, and saved a girl named Tiara. And she, too, was a Fencer.\r From that day forward, Fang found himself an important part of the battle between the Goddess and the Vile God.… Expand"}, {"name": "Need for Speed", "details_link": "https://www.metacritic.com/game/playstation-4/need-for-speed", "publisher": "Electronic Arts", "release_date": "Nov  3 2015", "developers": ["Ghost Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 66, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/a7afbff90513b469d067390685250836-98.jpg", "descriptions": "Jump behind the wheel of some iconic cars and put the pedal to the metal through Ventura Bay, a sprawling urban playground. Explore overlapping stories as you establish your reputation – and your dream car – and become the top racing icon. Play repeatedly this time, you have five distinctJump behind the wheel of some iconic cars and put the pedal to the metal through Ventura Bay, a sprawling urban playground. Explore overlapping stories as you establish your reputation – and your dream car – and become the top racing icon. Play repeatedly this time, you have five distinct ways to win.… Expand"}, {"name": "A Bird Story", "details_link": "https://www.metacritic.com/game/pc/a-bird-story", "publisher": "Freebird Games", "release_date": "Nov  7 2014", "developers": ["Freebird Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Adventure", "General"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/e60debb7815d3abc8bfd4306894ccbd0-98.jpg", "descriptions": "From the developer of To the Moon: A simple and surreal hour-long short about a boy and an injured bird -- a light interactive animation without dialogue. An interactive pixel animation with the sole purpose of telling a simple story. It is a standalone narrative with its own discreteFrom the developer of To the Moon: A simple and surreal hour-long short about a boy and an injured bird -- a light interactive animation without dialogue. An interactive pixel animation with the sole purpose of telling a simple story. It is a standalone narrative with its own discrete beginning and end.… Expand"}, {"name": "Shred Nebula", "details_link": "https://www.metacritic.com/game/xbox-360/shred-nebula", "publisher": "CrunchTime Games", "release_date": "Sep  3 2008", "developers": ["CrunchTime Games"], "platforms": "Xbox 360", "num_players": "8  Online", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/d4154969260774ef5259d44e4f06039f-98.jpg", "descriptions": "[Xbox Live Arcade]  Shred Nebula combines the best elements of arcade space-shooter action with free-roaming exploration and multiplayer excitement. Pilot the experimental R.I.P. Rocket through the galaxy in search of the Lost Expeditions ... no ship has ever returned from the vastness of[Xbox Live Arcade]  Shred Nebula combines the best elements of arcade space-shooter action with free-roaming exploration and multiplayer excitement. Pilot the experimental R.I.P. Rocket through the galaxy in search of the Lost Expeditions ... no ship has ever returned from the vastness of interstellar space. This top-down, fast-paced ship-combat game features three loaded modes of play—Adventure, Score Attack, and Multiplayer. Play co-op with your friends, or go head-to-head in a deathmatch dogfight. No one knows what lies in the center of the galaxy. Will you be the first to discover the secrets of the gravitational region known as The Shred and make it home alive? [Microsoft]… Expand"}, {"name": "Lost Cities", "details_link": "https://www.metacritic.com/game/xbox-360/lost-cities", "publisher": "Sierra Online", "release_date": "Apr 23 2008", "developers": ["Sierra Online Shanghai"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 66, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/2f412ddf9dcfaa92bad69b3cbf4d45b6-98.jpg", "descriptions": "[Xbox Live Arcade]  Risk it all on the expeditions of a lifetime in the award-winning card game Lost Cities as it comes to life on Xbox Live Arcade. Draw from a pool of cards to amass the most points, play your cards wisely, take chances with your money, and create the best strategy to[Xbox Live Arcade]  Risk it all on the expeditions of a lifetime in the award-winning card game Lost Cities as it comes to life on Xbox Live Arcade. Draw from a pool of cards to amass the most points, play your cards wisely, take chances with your money, and create the best strategy to outwit your opponent on the road to victory. True to the original: All of the fun and strategy of the original card game has been faithfully translated for the console audience. Easy to learn: Jump into a game and start devising strategies within minutes. Exotic locales: Manage prosperous expeditions through the lost cities of the frozen Himalayas to the sandy deserts of Egypt, and even the Brazilian rain forest. Online play: Play with up to three of your friends over Xbox Live. [Sierra Online]… Expand"}, {"name": "NASCAR", "details_link": "https://www.metacritic.com/game/psp/nascar", "publisher": "EA Games", "release_date": "Sep  6 2006", "developers": ["Exient Entertainment"], "platforms": "PSP", "num_players": "4  Online", "genres": ["Driving", "Racing", "Simulation", "Stock Car", "Stock Car", "Automobile"], "meta_score": 66, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/ae1defd56b09315bf36c8b85192d0035-98.jpg", "descriptions": "Get an inside look at the incredibly fast and dangerous world of NASCAR racing with NASCAR 07.  The control is now in the hands of the player as they attempt to navigate through intense moments with drivers racing inches apart at 200 mph. Push your car to the limit and leave drivers in theGet an inside look at the incredibly fast and dangerous world of NASCAR racing with NASCAR 07.  The control is now in the hands of the player as they attempt to navigate through intense moments with drivers racing inches apart at 200 mph. Push your car to the limit and leave drivers in the dust as all-new effects from screen blurring to camera shaking highlight every detail of the action. Modify your car's handling to your exact specification with a user-friendly sliding scale that makes for ultimate control behind the wheel. Get a NASCAR 101 racing education in a one-on-one tutorial from Kenny Wallace, then select your favorite driver and invest skill points to help him reach the pinnacle of the sport: The NEXTEL Cup Series Championship. [Electronic Arts]… Expand"}, {"name": "Vikings: Wolves of Midgard", "details_link": "https://www.metacritic.com/game/pc/vikings-wolves-of-midgard", "publisher": "Kalypso", "release_date": "Mar 24 2017", "developers": ["Games Farm"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/676a6148c65f5ff453224927ce3535d5-98.jpg", "descriptions": "Fear the wolves. They are cold, they are hungry - and they will stop at nothing to survive\r Ragnarok. Legend has it that when the coldest winter descends, the Jotan will return to take their vengeance against the Gods of Asgard. The world is on the road to perdition and the fate of MidgardFear the wolves. They are cold, they are hungry - and they will stop at nothing to survive\r Ragnarok. Legend has it that when the coldest winter descends, the Jotan will return to take their vengeance against the Gods of Asgard. The world is on the road to perdition and the fate of Midgard hangs in the balance. But when the Fire and Frost Giants begin to merge their armies, they encounter the clan of the Ulfung  the Wolves of Midgard. Bloody, but unbowed following the destruction of their village, this notorious band of ostracized Viking warriors are determined to seize their destiny and save the world. As clan chief, you must save Midgard from complete annihilation, and spearhead the charge to vanquish the fiendish creatures of the Fimbulwinter.\r * Fantasy Meets Norse Mythology\rTravel the realms of earthly Midgard, freezing Niflheim and boiling Balheim, either as a fierce Viking warrior or merciless shieldmaiden.\r *The Deadly Fimbulwinter\rWithstand the deathly colds and protect yourself from exposure to natures wrath in order to survive.\r * Tribute To The Gods\rCollect blood from fallen enemies and sacrifice it at the altar to gain gifts from the Gods to enhance your powers.\r * Berserker Rage\rLet your anger take hold by activating Rage Mode to overwhelm your enemies in bloodthirsty combat.\r * The Art Of Combat\rPerfect your skills with each weapon to unlock their true potential, including swords, bows and spell-powered canes.\r * The Power Of The Gods\rMake the abilities of the Gods your own by equipping power-infused amulets, like the Talismans of Thor or Loki. Put your new skills to the test by competing in the Trials of the Gods to earn further rewards.\r * Teamwork\rTeam up with a friend and journey to the Shores of Midgard together in an epic two player online co-op mode. Choose between four difficulty levels to suit your skills and talents. Do you dare attempt the unrelenting hardcore mode?… Expand"}, {"name": "Never Alone", "details_link": "https://www.metacritic.com/game/xbox-one/never-alone", "publisher": "E-Line Media", "release_date": "Nov 19 2014", "developers": ["Upper One Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/c3d3d9d75934e10964775f11ee45aefd-98.jpg", "descriptions": "Developed in partnership with the Alaska Native community, Never Alone (Kisima Ingitchuna) is an atmospheric puzzle platformer that explores the harsh and dynamic world of Alaska Native stories. Delve deeply into the traditional lore of the Inupiat people of the Arctic."}, {"name": "Mafia II: Definitive Edition", "details_link": "https://www.metacritic.com/game/xbox-one/mafia-ii-definitive-edition", "publisher": "2K Games", "release_date": "May 19 2020", "developers": ["Hangar 13"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/11997dd9522e193e55a12dc76415c767-98.jpg", "descriptions": "After taking a bullet during World War II and returning home to Empire Bay on leave, Sicilian immigrant Vito Scaletta discovers that his late father was indebted to a loan shark. He needs to make a lot of money fast, and thanks to his career criminal best friend Joe, soon becomes entangledAfter taking a bullet during World War II and returning home to Empire Bay on leave, Sicilian immigrant Vito Scaletta discovers that his late father was indebted to a loan shark. He needs to make a lot of money fast, and thanks to his career criminal best friend Joe, soon becomes entangled with the mob. As Vito, you need to prove yourself by committing crimes of escalating reward, status, and consequence. But what happens when your motivations become less about necessity and more about greed? When having it all is not enough? For the first time ever, Mafia II: Definitive Edition packs the entire Mafia II crime drama into one HD package. HDR and 4K resolution are supported on PC as well as on PlayStation®4 Pro and Xbox One X consoles. Mafia II: Definitive Edition also benefits from improved facial animations to give cutscenes an even more cinematic feel. While technological and graphical improvements have given Empire Bay and its inhabitants a visual overhaul, Vito's timeless story is unchanged.… Expand"}, {"name": "Mutant Football League: Dynasty Edition", "details_link": "https://www.metacritic.com/game/switch/mutant-football-league-dynasty-edition", "publisher": "Nighthawk Interactive", "release_date": "Oct 30 2018", "developers": ["Nighthawk Interactive"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Sports", "Team", "Football", "Arcade"], "meta_score": 66, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/7bbb7a0fcd11a05fd33f3f165256b2f1-98.jpg", "descriptions": "Mutant Football League is an action packed, arcade style football game with intense online multiplayer action, deep strategy, and deadly humor."}, {"name": "Code of Princess EX", "details_link": "https://www.metacritic.com/game/switch/code-of-princess-ex", "publisher": "Nicalis", "release_date": "Jul 31 2018", "developers": ["Nicalis"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/f0201d6f2c6e82a734cb803a5fb68785-98.jpg", "descriptions": "Code of Princess EX brings a unique combination of hack-and-slash beat-'em-up action and role-playing depth to Nintendo Switch!The story follows Princess Solange of DeLuxia as she fights to restore order in a world where monsters are trying to overtake the human race. Armed with theCode of Princess EX brings a unique combination of hack-and-slash beat-'em-up action and role-playing depth to Nintendo Switch!The story follows Princess Solange of DeLuxia as she fights to restore order in a world where monsters are trying to overtake the human race. Armed with the legendary sword DeLuxcalibur, Solange assembles a team of talented fighters to join her quest. Together, they embark on an epic journey where they will confront the monster uprising and try to discover it's secret origins.… Expand"}, {"name": "The King of Fighters 2006", "details_link": "https://www.metacritic.com/game/playstation-2/the-king-of-fighters-2006", "publisher": "SNK Playmore", "release_date": "Sep 19 2006", "developers": ["SNK Playmore"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 66, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/f2f47eadb7b0cea1f566ee1b1ba47488-98.jpg", "descriptions": "(Also known as \"King of Fighters: Maximum Impact 2\")  Enhanced 3D graphics and game play mechanics. The King of Fighters 2006 takes the fighting genre to a whole new level. Several new KOF characters, as well as returning favorites and hidden bonus characters. Classic SNK characters Kula(Also known as \"King of Fighters: Maximum Impact 2\")  Enhanced 3D graphics and game play mechanics. The King of Fighters 2006 takes the fighting genre to a whole new level. Several new KOF characters, as well as returning favorites and hidden bonus characters. Classic SNK characters Kula Diamond and Billy Kane, for the first time in 3D. Beautiful background stages including NEOGEO Land. In-depth storyline featuring a different ending for each character. All-new mini-games. English and Japanese voice options. [SNK Playmore]… Expand"}, {"name": "Among the Sleep", "details_link": "https://www.metacritic.com/game/playstation-4/among-the-sleep", "publisher": "Krillbite Studio", "release_date": "Jul 26 2016", "developers": ["Krillbite Studio"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/4d8b36746d5f59518b0914fe95a82a70-98.jpg", "descriptions": "Among The Sleep invites you into the mind and body of a two year old child. After being put to bed one evening, mysterious things start to happen.  Being played in first person, the game lets its players immerse themselves in a child's limitless imagination. This is a perspective we all haveAmong The Sleep invites you into the mind and body of a two year old child. After being put to bed one evening, mysterious things start to happen.  Being played in first person, the game lets its players immerse themselves in a child's limitless imagination. This is a perspective we all have a distant familiarity with, but few can clearly remember what it felt like. In the borderland between dream and reality, surreal creatures and diverse environments will present you with both physical and mental obstacles that challenge your creativity.… Expand"}, {"name": "Tom Clancy's HAWX 2", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-hawx-2", "publisher": "Ubisoft", "release_date": "Nov 22 2010", "developers": ["Ubisoft"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 66, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/0/7a4459da9aa51eb4cbcb2518f91c5f27-98.jpg", "descriptions": "Tom Clancy’s H.A.W.X. 2 plunges fans into an explosive environment where they can become elite aerial soldiers in control of the world's most technologically advanced aircraft. The game will appeal to a wide array of gamers as players will have the chance to control exceptional pilotsTom Clancy’s H.A.W.X. 2 plunges fans into an explosive environment where they can become elite aerial soldiers in control of the world's most technologically advanced aircraft. The game will appeal to a wide array of gamers as players will have the chance to control exceptional pilots trained to use cutting edge technology in amazing aerial warfare missions. … Expand"}, {"name": "Neptunia x Senran Kagura: Ninja Wars", "details_link": "https://www.metacritic.com/game/playstation-4/neptunia-x-senran-kagura-ninja-wars", "publisher": "Idea Factory", "release_date": "Oct 26 2021", "developers": ["Tamsoft"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/e469309d2a6890d014542bdf94548e2e-98.jpg", "descriptions": "Gamninjustri - a place where all manner of ninjas gather. As the struggle for control increased between the daimyos of the nations, tensions Rose between the two great nations, each of which was home to One of the major schools of martial arts. The compa style which has mastered the NinjaGamninjustri - a place where all manner of ninjas gather. As the struggle for control increased between the daimyos of the nations, tensions Rose between the two great nations, each of which was home to One of the major schools of martial arts. The compa style which has mastered the Ninja arts based on the command technique. The honeypa style which has mastered the Ninja arts rooted in the action technique. … Expand"}, {"name": "Dustoff Z", "details_link": "https://www.metacritic.com/game/xbox-one/dustoff-z", "publisher": "Zordix", "release_date": "Oct 15 2020", "developers": ["Invictus"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down", "Horizontal"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/6f366501ae1ca8c8c0f6bdb5baeeae24-98.jpg", "descriptions": "Get those blades spinning and load up on guns and ammo, the time has come to rebuild humanity! Dustoff Z is a game about maneuvering combat-helicopters in one of the harshest weather conditions possible – A Zombie Apocalypse."}, {"name": "The Stillness of the Wind", "details_link": "https://www.metacritic.com/game/switch/the-stillness-of-the-wind", "publisher": "Fellow Traveller", "release_date": "Feb  7 2019", "developers": ["Memory of God / Lambic Studios"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Point-and-Click", "Third-Person"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/57bf5f5ff02aadd0d4c5a35a4d02c664-98.jpg", "descriptions": "One by one, everyone left the once bustling village for the city. Everyone, except Talma. Now approaching the end of her days, she maintains a simple, solitary way of life, surviving, subsisting, tending to her homestead and her goats. Develop your own personal routine as you care for yourOne by one, everyone left the once bustling village for the city. Everyone, except Talma. Now approaching the end of her days, she maintains a simple, solitary way of life, surviving, subsisting, tending to her homestead and her goats. Develop your own personal routine as you care for your farm and your animals. Tend to your goats, make cheese with their milk, collect eggs and cook meals, grow vegetables and barter with the travelling merchant who brings increasingly disturbing letters from your family in the city. A follow up to the critically acclaimed Where the Goats Are, The Stillness of the Wind is a quiet rumination on life and loss. … Expand"}, {"name": "Tiny Metal", "details_link": "https://www.metacritic.com/game/switch/tiny-metal", "publisher": "AREA35", "release_date": "Dec 21 2017", "developers": ["AREA35"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 66, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/6199e919e2b9f7723c3f892b02501861-98.jpg", "descriptions": "A turn-based strategy game of intrigue with a distinct Japanese flavor that takes place in the aftermath of your king's assassination. Roll out the tanks, create more troops, expand your squad, and struggle for territory with war-room levels of control. Outfight the enemy with your own armyA turn-based strategy game of intrigue with a distinct Japanese flavor that takes place in the aftermath of your king's assassination. Roll out the tanks, create more troops, expand your squad, and struggle for territory with war-room levels of control. Outfight the enemy with your own army of foot soldiers, tanks, helicopters, tactical vehicles, and fighter jets. Capture rival territories and extend your military power over the sprawling map of Zipang. Follow the gripping story of Nathan Gries and answer for yourself what is -- and what isn't -- worth fighting for. Inspired by turn-based strategy games of the past, TINY METAL takes the finely honed gameplay of classical Japanese war gaming and brings it into the modern era with great graphics, 15 unique units, and never-before-seen gameplay mechanics. TINY METAL is the Japanese arcade war game you wish you had as a kid. [Nintendo]… Expand"}, {"name": "Lightning Returns: Final Fantasy XIII", "details_link": "https://www.metacritic.com/game/pc/lightning-returns-final-fantasy-xiii", "publisher": "Square Enix", "release_date": "Dec 10 2015", "developers": ["Square Enix"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "Japanese-Style"], "meta_score": 66, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/a93240a370af9375e8fdcfe2af92ee4c-98.jpg", "descriptions": "The world of Gran Pulse is sinking into the sea and what remains is now called Nova Chrysalia. With only thirteen days remaining until the end of the world, Chaos reigns in a world that never ages. New life cannot be born. People need salvation. As Lightning, it is your mission to save asThe world of Gran Pulse is sinking into the sea and what remains is now called Nova Chrysalia. With only thirteen days remaining until the end of the world, Chaos reigns in a world that never ages. New life cannot be born. People need salvation. As Lightning, it is your mission to save as many souls as possible so that they may be brought to the new world. Along the journey, you will encounter familiar faces and engage new foes in all new lands. You must ultimately choose which souls to save and which to abandon and fully understand Lightning's true destiny. It all ends here.… Expand"}, {"name": "Angry Birds Trilogy", "details_link": "https://www.metacritic.com/game/playstation-3/angry-birds-trilogy", "publisher": "Activision", "release_date": "Sep 25 2012", "developers": ["Rovio Mobile", "Rovio Entertainment"], "platforms": ["3DS", "PlayStation Vita", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "General", "General", "Compilation"], "meta_score": 66, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/b2a94dce91cb05e12c5a738e7bd01483-98.jpg", "descriptions": "Angry Birds Trilogy is a compilation of three blockbuster classics: Angry Birds, Angry Birds Seasons, and Angry Birds Rio."}, {"name": "London 2012 - The Official Video Game of the Olympic Games", "details_link": "https://www.metacritic.com/game/playstation-3/london-2012---the-official-video-game-of-the-olympic-games", "publisher": "Sega", "release_date": "Jun 26 2012", "developers": ["Sega Studios Australia"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/178667402af7cc5b222e9445ad2eee4b-98.jpg", "descriptions": "London 2012 - The Official Video Game of the Olympic Games will allow gamers to create their own moments of sporting history and fame by experiencing the thrill and adrenaline rush of the events and disciplines that will be a part of the London 2012 Olympic Games. With over 30 events inLondon 2012 - The Official Video Game of the Olympic Games will allow gamers to create their own moments of sporting history and fame by experiencing the thrill and adrenaline rush of the events and disciplines that will be a part of the London 2012 Olympic Games. With over 30 events in which to claim gold, players will enjoy more gameplay variety than ever before, even taking the race for medals online by competing for personal and national glory with online leaderboards.… Expand"}, {"name": "Slam Bolt Scrappers", "details_link": "https://www.metacritic.com/game/playstation-3/slam-bolt-scrappers", "publisher": "Sony Online Entertainment", "release_date": "Mar 15 2011", "developers": ["Fire Hose Games"], "platforms": ["PC", "PlayStation 3"], "num_players": "1-4 ", "genres": ["Puzzle", "Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/5a24ced42e030e60bcbae9947a254f56-98.jpg", "descriptions": "Its a mash up of building and brawling! Reach for the sky and build the greatest towers in Slam Bolt City while defending against deviously charming baddies and epic bosses. Play with up to three of your friends in the co-op campaign or go head to head in the simple, yet surprisingly deepIts a mash up of building and brawling! Reach for the sky and build the greatest towers in Slam Bolt City while defending against deviously charming baddies and epic bosses. Play with up to three of your friends in the co-op campaign or go head to head in the simple, yet surprisingly deep competitive battle mode.… Expand"}, {"name": "Wonder Boy: Asha in Monster World", "details_link": "https://www.metacritic.com/game/switch/wonder-boy-asha-in-monster-world", "publisher": "ININ Games", "release_date": "May 28 2021", "developers": ["Artdink"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 66, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/58c0a40fb4b86316d300a92f4d3e01da-98.jpg", "descriptions": "An icon in adventure gaming history is back!Wonder Boy: Asha in Monster World becomes a real Wonder Boy adventure that stays true to its roots as the latest part of the legendary and successful series, that dates back to 1986. \n\nAsha is tasked to free the four spirits being confined byAn icon in adventure gaming history is back!Wonder Boy: Asha in Monster World becomes a real Wonder Boy adventure that stays true to its roots as the latest part of the legendary and successful series, that dates back to 1986. Asha is tasked to free the four spirits being confined by evil forces whose origin she discovers throughout her journey. Luckily, she does not have to face this adventure alone, as early on she finds her new companion, a special blue Pepelogoo.The players can experience the adventures of the dynamic duo like never before thanks to cell-shaded 3D graphics and 2D gameplay as well as enhanced visuals and refined play content. Especially in the event scenes the performance is deepened and the world view is reproduced vividly and colorfully. Plus, for the first time in the series, it comes with a character voice by the popular and talented Japanese voice actress Ai Fairouz.… Expand"}, {"name": "Disney's Chicken Little: Ace in Action", "details_link": "https://www.metacritic.com/game/ds/disneys-chicken-little-ace-in-action", "publisher": "Buena Vista Games", "release_date": "Nov  9 2006", "developers": ["DC Studios"], "platforms": ["PC", "PlayStation 2", "DS"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/aff523c0d1c0d97dbb51d7d558047b29-98.jpg", "descriptions": "Inspired by the \"superhero movie within the movie\" finale of Walt Disney Pictures'  film \"Chicken Little,\" Disney\"s Chicken Little: Ace in Action features Ace, the superhero alter ego of Chicken Little, and the Hollywood versions of his misfit band of friends:  Runt, Abby andInspired by the \"superhero movie within the movie\" finale of Walt Disney Pictures'  film \"Chicken Little,\" Disney\"s Chicken Little: Ace in Action features Ace, the superhero alter ego of Chicken Little, and the Hollywood versions of his misfit band of friends:  Runt, Abby and Fish-Out-of-Water. The crew of the intergalactic Battle Barn faces off against Foxy Loxy and her evil Amazonian sidekick, Goosey Loosey, who have an evil plan to take over Earth. Battle evil alien robots through multiple levels across the solar system and combat your foes in one of three distinct game play modes: Ace on foot as a soldier, Runt as the driver of an armored tank, or Abby as the pilot of a spaceship.  The original Chicken Little and his friends Abby, Runt and Fish we know from the film are featured in cut scenes throughout the game. [Buena Vista Games]… Expand"}, {"name": "Duel Masters", "details_link": "https://www.metacritic.com/game/playstation-2/duel-masters", "publisher": "Atari", "release_date": "Nov  2 2004", "developers": ["High Voltage Software"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Card Battle"], "meta_score": 66, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/1ef8485d6e0fb998e11ad1abc77ca303-98.jpg", "descriptions": "Duel Masters is a fast-paced, real-time, dueling action based on the popular Duel Masters collectable card game. Over a hundred creatures fight it out in spectacular combat, all at your command. Custom deck building and strategizing let you make the deck that you want, the way you want. SaveDuel Masters is a fast-paced, real-time, dueling action based on the popular Duel Masters collectable card game. Over a hundred creatures fight it out in spectacular combat, all at your command. Custom deck building and strategizing let you make the deck that you want, the way you want. Save your decks to your memory card and take them to your friend's house for multiplayer duels to prove once and for all who the best duelist is. [Atari]… Expand"}, {"name": "Classic NES Series: Ice Climber", "details_link": "https://www.metacritic.com/game/game-boy-advance/classic-nes-series-ice-climber", "publisher": "Nintendo", "release_date": "Jun  2 2004", "developers": ["Nintendo"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/0a124bc621f958600bc020dac1d2a865-98.jpg", "descriptions": "Twenty years after their debut on the NES, mountain climbers Popo and Nana return to scale the heights as part of the NES Classic Series for the Game Boy Advance. As Popo (player two plays as Nana), you must use your trusty mallet to work your way up the mountain by chipping away at theTwenty years after their debut on the NES, mountain climbers Popo and Nana return to scale the heights as part of the NES Classic Series for the Game Boy Advance. As Popo (player two plays as Nana), you must use your trusty mallet to work your way up the mountain by chipping away at the blocks overhead and then jumping through the resulting hole. Your mallet is also useful for eliminating pesky enemies, including polar bears, seals, and mountain men. … Expand"}, {"name": "kill.switch", "details_link": "https://www.metacritic.com/game/pc/killswitch", "publisher": "Hip Games", "release_date": "Mar 30 2004", "developers": ["Namco"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 66, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/e413601fce827c5642fa6744343256b5-98.jpg", "descriptions": "In a world on the brink of global conflict, you find yourself on the frontlines of battle. Only this time, you?re not here to prevent a war?You?re here to start one. Kill.Switch is an innovative military shooter that emphasizes realistic cover techniques and awesome firepower for theIn a world on the brink of global conflict, you find yourself on the frontlines of battle. Only this time, you?re not here to prevent a war?You?re here to start one. Kill.Switch is an innovative military shooter that emphasizes realistic cover techniques and awesome firepower for the ultimate experience in combat gaming. Featuring the unique offensive cover system, Kill.Switch demands the use of modern combat tactics, forcing players to utilize surrounding environments and quickly adjust on-the-fly through each intense and challenging scenario. In Kill.Switch, you will take on the role of a highly skilled military operative with a dark agenda. Your initial missions will take you to global 'hotspots' such as the Middle East, the Caspian Sea region, and North Korea. As the story unfolds, more will be revealed about who you are, and exactly why you are undertaking the types of missions assigned to you. Remember: Cover is your only ally. The environment can be used to your advantage. Utilize the terrain. Take cover. Take aim. Take over. [Hip Games]… Expand"}, {"name": "Dragon Ball Z: Budokai 2", "details_link": "https://www.metacritic.com/game/playstation-2/dragon-ball-z-budokai-2", "publisher": "Atari", "release_date": "Dec  4 2003", "developers": ["Dimps Corporation"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 66, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/fcb513b818187b34fb675c796bd927cb-98.jpg", "descriptions": "The time has come to go beyond the Dragon Ball Z sagas and experience the full force of the most powerful fighters in the universe. Dragon Ball Z: Budokai 2 will challenge players like no other DBZ game before. Begin with an all-new single player \"Dragon World\" that opens the story to newThe time has come to go beyond the Dragon Ball Z sagas and experience the full force of the most powerful fighters in the universe. Dragon Ball Z: Budokai 2 will challenge players like no other DBZ game before. Begin with an all-new single player \"Dragon World\" that opens the story to new match-ups, surprising character appearances, and missions that will amaze. You can also battle your friends in multiplayer \"VS.\" and \"Tournament\" modes. If your will and skill prevail, you will come face-to-face with Buu, the most lethal of all DBZ villains. Do you have what it takes not only to survive, but to dominate? [Atari]… Expand"}, {"name": "Whiplash", "details_link": "https://www.metacritic.com/game/playstation-2/whiplash", "publisher": "Eidos Interactive", "release_date": "Nov 18 2003", "developers": ["Crystal Dynamics"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/572383e752f85c3872d03d1c1053aa2d-98.jpg", "descriptions": "Whiplash features a shackled animal duo on a mission to escape and sabotage an evil animal product-testing corporation. Providing a groundbreaking approach to the character-based action genre, Whiplash combines a unique \"chain\" gameplay mechanic with in-depth enemy and environmentWhiplash features a shackled animal duo on a mission to escape and sabotage an evil animal product-testing corporation. Providing a groundbreaking approach to the character-based action genre, Whiplash combines a unique \"chain\" gameplay mechanic with in-depth enemy and environment interaction, rich combat and slapstick humor. The result is an engaging game where player choice triggers an unscripted chain of chaotic, humorous events. [Eidos Interactive]… Expand"}, {"name": "Wallace & Gromit in Project Zoo", "details_link": "https://www.metacritic.com/game/gamecube/wallace-gromit-in-project-zoo", "publisher": "Bam Entertainment", "release_date": "Oct 14 2003", "developers": ["Frontier Developments"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 66, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/5/527f5a3726972e5b33d53fab0b935dff-98.jpg", "descriptions": "The diabolical penguin, Feathers, has imprisoned all the baby animals in a zoo, and it's up to Wallace and Gromit to rescue them. Charge through the gates as the resourceful and adventurous Gromit, and receive helpful hints from Wallace. This indomitable duo has an array of new inventionsThe diabolical penguin, Feathers, has imprisoned all the baby animals in a zoo, and it's up to Wallace and Gromit to rescue them. Charge through the gates as the resourceful and adventurous Gromit, and receive helpful hints from Wallace. This indomitable duo has an array of new inventions such as the Porridge Gun and the Banana Launcher, plus interesting contraptions built by Wallace himself. Gromit's break dancing, backflips, and sneaking moves will also prove valuable in your adventure.… Expand"}, {"name": "XGRA: Extreme-G Racing Association", "details_link": "https://www.metacritic.com/game/xbox/xgra-extreme-g-racing-association", "publisher": "Acclaim", "release_date": "Sep 17 2003", "developers": ["Acclaim Studios Cheltenham"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 66, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/9672a80e89ea4f4104beda2c5c5812d5-98.jpg", "descriptions": "Pull a few more Gs in the next installment of the Extreme-G series, XGRA: Extreme-G Racing Association.  This futuristic racing game features all-new gameplay modes, features, weapons, bikes, controls, and unlockable content.  Choose from unique characters on eight different teams and buildPull a few more Gs in the next installment of the Extreme-G series, XGRA: Extreme-G Racing Association.  This futuristic racing game features all-new gameplay modes, features, weapons, bikes, controls, and unlockable content.  Choose from unique characters on eight different teams and build your career through variable missions and storylines.  Unlock new game modes, tracks, faster bikes, and character-enhancing cybernetic implants.  Race in a variety of race tracks with destructible objects including bridges and spectators.  Experience the future of racing.… Expand"}, {"name": "Black & Bruised", "details_link": "https://www.metacritic.com/game/gamecube/black-bruised", "publisher": "Majesco Games", "release_date": "Jan 26 2003", "developers": ["Digital Fiction"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/2350b0b2aed77472eb90263cd621a0c1-98.jpg", "descriptions": "To the fighters in Black & Bruised, boxing is no game; it's a matter of survival. Nineteen outrageous characters fight their way through grueling slugfests to win the pot or settle a score. You'll play through their intertwining stories as they battle each other in 21 different arenas.To the fighters in Black & Bruised, boxing is no game; it's a matter of survival. Nineteen outrageous characters fight their way through grueling slugfests to win the pot or settle a score. You'll play through their intertwining stories as they battle each other in 21 different arenas. During each match, you can earn power-ups such as Armor, AutoSlip, Vamp, or Fire Damage to give your fighter a competitive advantage over your opponent.… Expand"}, {"name": "Bleeding Edge", "details_link": "https://www.metacritic.com/game/xbox-one/bleeding-edge", "publisher": "Microsoft", "release_date": "Mar 24 2020", "developers": ["Ninja Theory"], "platforms": ["PC", "Xbox One"], "num_players": "Up to 8 ", "genres": ["3D", "Beat-'Em-Up", "Fighting", "Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 66, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/c961c3578e6cd7b3fba9e2de0e76e1e6-98.jpg", "descriptions": "From the studio behind DmC: Devil May Cry and Hellblade: Senua’s Sacrifice comes Bleeding Edge, a fast and frenetic 4v4 team brawler where every fighter comes mechanically enhanced for mayhem!\rChoose your fighter from a diverse cast of colorful characters from the edges of society: burnFrom the studio behind DmC: Devil May Cry and Hellblade: Senua’s Sacrifice comes Bleeding Edge, a fast and frenetic 4v4 team brawler where every fighter comes mechanically enhanced for mayhem!\rChoose your fighter from a diverse cast of colorful characters from the edges of society: burn rubber as bold and beautiful Buttercup with her detachable saw blade arms, wreak havoc as Black-Metal rocker Niđhöggr with his electrifying guitar solos or slash up the streets as Daemon, New York’s most wanted assassin.… Expand"}, {"name": "Magna Carta: Tears of Blood", "details_link": "https://www.metacritic.com/game/playstation-2/magna-carta-tears-of-blood", "publisher": "Atlus Co.", "release_date": "Nov 16 2005", "developers": ["SoftMax"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/a0dadbfda694dda1067d8644397baa8e-98.jpg", "descriptions": "Revenge is the only thing that can erase this hatred. In the land of Efferia, humans and native-Efferians uneasily co-exist in the clutches of an endless war. A young man out for revenge against the natives finds a girl who has lost her memories. Where will destiny lead them...? A 50+ hourRevenge is the only thing that can erase this hatred. In the land of Efferia, humans and native-Efferians uneasily co-exist in the clutches of an endless war. A young man out for revenge against the natives finds a girl who has lost her memories. Where will destiny lead them...? A 50+ hour fantasy that unfolds through amazing CGI cut-scenes and fully voiced dialogue. Unlock the secrets of the Carta System and unleash magical fury. Character designs are created by renowned Korean Artist, Hyung Tae Kim bring the world of Efferia to life. Unique real-time battle systems allow you to position yourself anywhere on the battlefield.… Expand"}, {"name": "Just Dance 2016", "details_link": "https://www.metacritic.com/game/xbox-one/just-dance-2016", "publisher": "Ubisoft", "release_date": "Oct 20 2015", "developers": ["Ubisoft"], "platforms": ["PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One"], "genres": ["Action", "Rhythm", "Dancing"], "meta_score": 66, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/d5f9bc5e5079fcf6d1ce88aad71606df-98.jpg", "descriptions": "Bust some moves to \"Uptown Funk\" by Mark Ronson ft. Bruno Mars and feel the beats in \"All About That Bass\" by Meghan Trainor."}, {"name": "One Piece: Grand Adventure", "details_link": "https://www.metacritic.com/game/playstation-2/one-piece-grand-adventure", "publisher": "Namco Bandai Games America", "release_date": "Aug 29 2006", "developers": ["Ganbarion"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 66, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/c132fb4408674f41e6a8b5d247f2085e-98.jpg", "descriptions": "Based on the popular comic and anime series, One Piece: Grand Adventure delivers battles that take place with a new free-moving Vs. Battle action system that will offer hours of entertainment. The game has also been completely revamped with the inclusion of an Adventure Mode, sending playersBased on the popular comic and anime series, One Piece: Grand Adventure delivers battles that take place with a new free-moving Vs. Battle action system that will offer hours of entertainment. The game has also been completely revamped with the inclusion of an Adventure Mode, sending players on various mini-game filled quests as well as allowing players to create their very own band of roving pirates. [Namco Bandai]… Expand"}, null, {"name": "Disney Universe", "details_link": "https://www.metacritic.com/game/xbox-360/disney-universe", "publisher": "Disney Interactive Studios", "release_date": "Oct 25 2011", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "General", "Fantasy"], "meta_score": 66, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/12015174e780fb1ecd2c8cd0e2044a8b-98.jpg", "descriptions": "In Disney Universe, players can select from more than 40 classic and contemporary Disney character costumes, including Alice (\"Alice in Wonderland\"), Mike (\"Monsters, Inc.\"), TRON (\"TRON: Legacy\") and Stitch (\"Lilo & Stitch\") to explore sixIn Disney Universe, players can select from more than 40 classic and contemporary Disney character costumes, including Alice (\"Alice in Wonderland\"), Mike (\"Monsters, Inc.\"), TRON (\"TRON: Legacy\") and Stitch (\"Lilo & Stitch\") to explore six different worlds inspired by legendary Disney and Disney Pixar films.  Each world will allow players to experience objectives and missions that follow Disney and Disney Pixar movie storylines.  Players will select a character-based costume, with each costume offering a specific tool that changes and grows in power as players adventure through the game.  Disney Universe offers frenetic gameplay, multiplayer with up to three friends and slapstick humor that will appeal to players of all ages.… Expand"}, {"name": "Planet Minigolf", "details_link": "https://www.metacritic.com/game/playstation-3/planet-minigolf", "publisher": "Zen Studios", "release_date": "Jun  1 2010", "developers": ["Zen Studios"], "platforms": "PlayStation 3", "genres": ["Sports", "Traditional", "Individual", "Golf", "Arcade", "Arcade"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/4d200332007f7c27d3875102d62cf5ec-98.jpg", "descriptions": "[Playstation Network]  Miniature Golf."}]