[{"name": "Mini Ninjas", "details_link": "https://www.metacritic.com/game/playstation-3/mini-ninjas", "publisher": "Eidos Interactive", "release_date": "Sep  8 2009", "developers": ["Io Interactive"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "General", "Fantasy"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/1c4802b54c16530a1c0b4e057b1452b4-98.jpg", "descriptions": "Prepare yourself for a Ninja adventure like you have never seen before! Join Hiro, the smallest hero on the biggest adventure, as he embarks on an epic and electrifying quest to restore harmony to a world on the brink of chaos. Use your skills and mighty Ninja training to battle a magicalPrepare yourself for a Ninja adventure like you have never seen before! Join Hiro, the smallest hero on the biggest adventure, as he embarks on an epic and electrifying quest to restore harmony to a world on the brink of chaos. Use your skills and mighty Ninja training to battle a magical army of evil Samurai. Harness the power of your Kuji magic and utilise the special skills of your Mini Ninja friends as you travel through a perilous world to reach the final confrontation with the Evil Samurai Warlord in his Fortress of Doom.… Expand"}, {"name": "Tiger Woods PGA Tour 07", "details_link": "https://www.metacritic.com/game/pc/tiger-woods-pga-tour-07", "publisher": "EA Sports", "release_date": "Oct 10 2006", "developers": ["EA Redwood Shores"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 73, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/62310ea019c6fb5161c91fc385e109b2-98.jpg", "descriptions": "Tiger Woods Comes Alive — See and feel every emotion in complete detail with the introduction of all-new Universal Capture (UCAP) technology. Play Under Pressure — With bigger galleries, mass crowd movement from hole to hole, and cheers from nearby greens, all eyes are on you in tournamentTiger Woods Comes Alive — See and feel every emotion in complete detail with the introduction of all-new Universal Capture (UCAP) technology. Play Under Pressure — With bigger galleries, mass crowd movement from hole to hole, and cheers from nearby greens, all eyes are on you in tournament play. Enhanced Career Mode — From working on your driving to mastering your putting skills, craft your game with training challenges in the Practice Facility, then take on the world's best golfers on the World Tour. All-New Championship Courses — The course content doubles with the addition of new licensed courses, including Firestone Country Club, Glen Abbey, Princeville, Spyglass Hill, St Andrews, and Bandon Dunes. The game features 15 of the world's top players, including Tiger Woods, John Daly, Vijay Singh, Ian Poulter, Michael Campbell, and Annika Sorenstam, the most decorated golfer on the LPGA Tour. Show Your GameFace — The innovative character creation tool is revamped with deeper modifications, more apparel, equipment licenses, and specialty items. Challenge up to three players in five new game modes, or play in online tournaments complete with money lists, full stat tracking, league leaders, and more. More Game Modes — Work on your game or take on a friend in Match Play, Battle Golf, 21, OneBall, and more. [EA Sports]… Expand"}, {"name": "Far Cry New Dawn", "details_link": "https://www.metacritic.com/game/pc/far-cry-new-dawn", "publisher": "Ubisoft", "release_date": "Feb 15 2019", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/3/9d136f14988e20b46979ba4a402ba922-98.jpg", "descriptions": "Seventeen years after a nuclear doomsday, Hope County, Montana, has changed in unexpected ways. Nuclear winter has given way to a \"superbloom,\" creating a lush, colourful landscape that survivors have begun to re-populate with makeshift buildings. It's a lawless frontier where people areSeventeen years after a nuclear doomsday, Hope County, Montana, has changed in unexpected ways. Nuclear winter has given way to a \"superbloom,\" creating a lush, colourful landscape that survivors have begun to re-populate with makeshift buildings. It's a lawless frontier where people are struggling to get by - and you'll be able to experience it all with a friend in co-op, or on your own as a lone gunslinger. After living through the apocalypse, the survivors in Hope County now face a new threat: the nihilistic Highwaymen, vicious scavengers intent on bleeding the county dry. When the survivors put out a call for help to combat this deadly threat, you are quickly thrust into the middle of a new battle for the future of Hope County. Since the nuclear apocalypse, survivors have been piecing their shelter, tools, and weapons together from the broken remnants of the old world. The results may look ramshackle, but they'll keep you alive in a fight. Your Homebase will let you construct powerful weapons and vehicles, giving you more options than ever for explosive, over-the-top action. When anything and everything can happen, it is never too much to have someone watching your back. Whether it's Hurk, a boar, or whoever you want, you can recruit an eclectic cast of Guns and Fangs for Hire to fight by your side. You can even play with a friend in co-op.… Expand"}, {"name": "XIII", "details_link": "https://www.metacritic.com/game/gamecube/xiii", "publisher": "Ubisoft", "release_date": "Nov 24 2003", "developers": ["Ubisoft Paris"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Fantasy"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/ad48020d3d12e2dc5ab7d2f1ceb74fd7-98.jpg", "descriptions": "The president of the United States of America has been assassinated and you are the prime suspect.  In XIII, you must unravel a conspiracy that left your memory erased, the President dead, and a bullet wound in your head.  Evade assailants eager to end your life or use them as human shields.The president of the United States of America has been assassinated and you are the prime suspect.  In XIII, you must unravel a conspiracy that left your memory erased, the President dead, and a bullet wound in your head.  Evade assailants eager to end your life or use them as human shields.  Select from a deadly arsenal of weapons including silent crossbows, furious automatic weapons, and ashtrays.  Face off against other players in multiplayer modes such as Barfight or go co-op in Cover Me mode.  Uncover both your shadowy past and America's darkest corridors of power.… Expand"}, {"name": "Your Shape: Fitness Evolved", "details_link": "https://www.metacritic.com/game/xbox-360/your-shape-fitness-evolved", "publisher": "Ubisoft", "release_date": "Nov  4 2010", "developers": ["Ubisoft Montreal"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Sports", "Miscellaneous", "General", "Exercise / Fitness"], "meta_score": 73, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/61c10101e427c5b0abfab3df9d019619-98.jpg", "descriptions": "Your Shape: Fitness Evolved is the first game from the training franchise exclusive for Kinect."}, {"name": "Army of Two: The 40th Day", "details_link": "https://www.metacritic.com/game/xbox-360/army-of-two-the-40th-day", "publisher": "Electronic Arts", "release_date": "Jan 12 2010", "developers": ["EA Montreal"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/96b9d6a468d3398b59e54d75a8d14f06-98.jpg", "descriptions": "When a disaster of epic proportions strikes Shanghai, China, Rios and Salem find themselves right in the middle of it all - the wrong place, the wrong time, but the right team. A carefully orchestrated series of mysterious catastrophes is dragging Shanghai to the brink of ruin, and now theWhen a disaster of epic proportions strikes Shanghai, China, Rios and Salem find themselves right in the middle of it all - the wrong place, the wrong time, but the right team. A carefully orchestrated series of mysterious catastrophes is dragging Shanghai to the brink of ruin, and now the Army of Two must fight their way through ravaged city districts as they try to beat the odds and uncover the secret of the 40th Day. ARMY OF TWO: THE 40th DAY features a bigger playbook of new co-op moves that either player can use at any time, opening up new strategies and countless choices for both players. The result is a bigger, better, more organic and immersive co-op experience that lets gamers put their best two-man tactics to use whenever and wherever they want. [Electronic Arts]… Expand"}, {"name": "Killzone: Shadow Fall", "details_link": "https://www.metacritic.com/game/playstation-4/killzone-shadow-fall", "publisher": "SCEA", "release_date": "Nov 15 2013", "developers": ["Guerrilla"], "platforms": "PlayStation 4", "num_players": "Up to 24 ", "genres": ["Shooter", "Sci-Fi", "Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/1309d48e6afd85f34fb919060eade613-98.jpg", "descriptions": "The events of Killzone Shadow Fall take place thirty years after the events of Killzone 3. Set in a time of planetary colonization, the game focuses on the conflict between the Vektans and the Helghast, two rival colonist factions inhabiting a remote planet. For 3 decades, both factions haveThe events of Killzone Shadow Fall take place thirty years after the events of Killzone 3. Set in a time of planetary colonization, the game focuses on the conflict between the Vektans and the Helghast, two rival colonist factions inhabiting a remote planet. For 3 decades, both factions have lived side by side, separated by an enormous security wall – but now their cold war is about to run hot. It is up to Lucas Kellan, a member of the military intelligence unit dubbed the Shadow Marshals, to try to protect the fragile peace that exists. A new warrior for a new era of war, Kellan 's missions will range from quiet infiltrations to all-out combat. Lucas will need to be methodical and ready to adapt, as any misstep could lead to mutually assured destruction.… Expand"}, {"name": "Life Goes On", "details_link": "https://www.metacritic.com/game/pc/life-goes-on", "publisher": "Infinite Monkeys", "release_date": "Apr 17 2014", "developers": ["Infinite Monkeys"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Platformer", "2D", "Action", "Platformer", "2D"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/c24a8a4ebe5132fc3176f941b7050717-98.jpg", "descriptions": "Life Goes On is a comically-morbid platform game where you guide heroic knights to their demise and use their dead bodies to solve puzzles. Impale knights on spikes to create a safe path. Catch a knight on a saw blade (ouch!) to strategically land the body on a button. Freeze your knightsLife Goes On is a comically-morbid platform game where you guide heroic knights to their demise and use their dead bodies to solve puzzles. Impale knights on spikes to create a safe path. Catch a knight on a saw blade (ouch!) to strategically land the body on a button. Freeze your knights into blocks of ice to reach higher ground. Make your way through this strange, treacherous, and trap-ridden world to find the Cup of Life. On your quest, you will summon knight after knight and brutally sacrifice them to solve each challenging puzzle. In Life Goes On, death is not a setback—it is the only means to success.… Expand"}, {"name": "The House of the Dead 4", "details_link": "https://www.metacritic.com/game/playstation-3/the-house-of-the-dead-4", "publisher": "Sega", "release_date": "Apr 17 2012", "developers": ["Sega"], "platforms": "PlayStation 3", "genres": ["Action", "Shooter", "Shooter", "Light Gun", "Light Gun"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/c6668db828720f5fc988f19265701654-98.jpg", "descriptions": "Zombie killing mayhem returns in this latest installment of House of the Dead."}, {"name": "Tom Clancy's Rainbow Six Extraction", "details_link": "https://www.metacritic.com/game/playstation-5/tom-clancys-rainbow-six-extraction", "publisher": "Ubisoft", "release_date": "Jan 20 2022", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 73, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/17a9dab128196317a1caaae52b733583-98.jpg", "descriptions": "Assemble your elite team of Rainbow Six Operators to launch incursions in the unpredictable containment zones and face off against an evolving Alien threat. Band together and put everything on the line as you take on this unknown enemy. Pick from 18 Rainbow Six operators. Assemble a squad inAssemble your elite team of Rainbow Six Operators to launch incursions in the unpredictable containment zones and face off against an evolving Alien threat. Band together and put everything on the line as you take on this unknown enemy. Pick from 18 Rainbow Six operators. Assemble a squad in Co-op of up to three Operators, or go solo. Each operator has a specific set of weapons and abilities to learn improve and master, and improve through a new progression-system. Explore 12 uniquely designed maps featuring procedurally generated challenges will test your team every time. Knowledge, cooperation and a tactical approach are your best weapons to survive. Fail against the enemies and your Operators will go Missing in Action (MIA). Be prepared to fight a lethal, unpredictable and constantly evolving Alien Threat. You will have to count on your teammates to face each of the 10 parasitic archetypes. Their abilities, combined with the alien ecosystem, will stand in your way.… Expand"}, {"name": "Battlefield Hardline", "details_link": "https://www.metacritic.com/game/playstation-4/battlefield-hardline", "publisher": "Electronic Arts", "release_date": "Mar 17 2015", "developers": ["Visceral Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to more than 64 ", "genres": ["Modern", "Action", "Shooter", "First-Person", "Tactical", "Arcade"], "meta_score": 73, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/3/136ad7d4b06765c50e21ddf88bf6cf91-98.jpg", "descriptions": "Run your crew as detective Nick Mendoza in an episodic crime drama single player campaign or as cops and criminals in rapid Battlefield multi-player. You will be on one side of the thin blue line or the other. Assume control using new tactics to gather intelligence, obtain warrants andRun your crew as detective Nick Mendoza in an episodic crime drama single player campaign or as cops and criminals in rapid Battlefield multi-player. You will be on one side of the thin blue line or the other. Assume control using new tactics to gather intelligence, obtain warrants and takedown with non-lethal force to effectuate the arrests. Take the cash in a new battlefield playground. New maps and gadgets alter the way you play the game. Utilize grappling hooks and zip-lines to scale city buildings and fly across the city with the cheddar. No matter the strategy, teamwork is key to winning the turf war. Sate your need for speed in  new action-packed modes. Hop in exotic muscle cars, sleek crotch rockets or even give your whole crew a lift in transports or armored trucks.… Expand"}, {"name": "Chorus", "details_link": "https://www.metacritic.com/game/playstation-5/chorus", "publisher": "Deep Silver", "release_date": "Dec  3 2021", "developers": ["Fishlabs", "Deep Silver Fishlabs"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Simulation", "Space", "Combat"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/5ff840318ef86bd7fb4956b4a5ac2f1f-98.jpg", "descriptions": "Take control of Nara, once the Circle’s deadliest warrior, now their most wanted fugitive, on a quest to destroy the dark cult that created her. Unlock devastating weapons and mind-bending abilities in a true evolution of the space-combat shooter. Along with Forsaken, her sentientTake control of Nara, once the Circle’s deadliest warrior, now their most wanted fugitive, on a quest to destroy the dark cult that created her. Unlock devastating weapons and mind-bending abilities in a true evolution of the space-combat shooter. Along with Forsaken, her sentient starfighter, explore ancient temples, engage in exhilarating zero-g combat, and venture beyond our waking reality. Lead Nara and Forsaken, her sentient ship, as their quest for redemption takes them across the galaxy and beyond the boundaries of reality. Enter a dark new universe, teeming with mystery and rife with conflict. Explore epic locations such as sprawling space stations and strange planes of existence beyond our own. Attain powerful weapons and combat upgrades. Master your ship’s unique drift mechanic and deadly mind-bending abilities, including extra-sensory perception, teleportation, and telekinesis. Chain your powers together to become the ultimate living weapon.… Expand"}, {"name": "Red Dead Revolver", "details_link": "https://www.metacritic.com/game/playstation-2/red-dead-revolver", "publisher": "Rockstar Games", "release_date": "May  3 2004", "developers": ["Rockstar San Diego"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Historic"], "meta_score": 73, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/75d567f1765dab3930a94d532c5c5f0a-98.jpg", "descriptions": "A blazing arcade-style third person game fueled by precision gunplay, Red Dead Revolver is a classic tale of vengeance on the untamed frontier. The addictively fun, innovative combat scheme rewards accurate and ruthless elimination of backwater lowlifes. Ride down outlaws on horseback, fightA blazing arcade-style third person game fueled by precision gunplay, Red Dead Revolver is a classic tale of vengeance on the untamed frontier. The addictively fun, innovative combat scheme rewards accurate and ruthless elimination of backwater lowlifes. Ride down outlaws on horseback, fight bloody duels aboard trains, command stagecoaches and more in your quest for justice. Punctuated with dark humor and filled with the elements that make the Wild West so compelling, Red Dead Revolver's story is told through full motion cutscenes and breathtaking in-game visuals. [Rockstar Games]… Expand"}, {"name": "Arcadegeddon", "details_link": "https://www.metacritic.com/game/playstation-5/arcadegeddon", "publisher": "IllFonic", "release_date": "Jul  5 2022", "developers": ["IllFonic"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/1282f2e444c1624ba72dcb32c9e455d0-98.jpg", "descriptions": "Gilly, the owner of a local arcade, is trying to save his business from a faceless mega corporation. To do so he takes all the top arcade games and connects them all to make a super game, unfortunately the mega corporation, Fun Fun Co., hacks the game and injects a virus. You and yourGilly, the owner of a local arcade, is trying to save his business from a faceless mega corporation. To do so he takes all the top arcade games and connects them all to make a super game, unfortunately the mega corporation, Fun Fun Co., hacks the game and injects a virus. You and your friends need to save the game and the last hometown arcade.… Expand"}, {"name": "Atomic Heart", "details_link": "https://www.metacritic.com/game/xbox-series-x/atomic-heart", "publisher": "Mundfish", "release_date": "Feb 21 2022", "developers": ["Mundfish"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/233fb2fcebc22ab468de75d9abaf32d6-98.jpg", "descriptions": "In the Soviet Union of the future, in 1955, science reigns supreme. The world is on the verge of the greatest event. You are Agent Major P-3 and you will have to find out what is really lying behind the utopian dream."}, {"name": "Killsquad", "details_link": "https://www.metacritic.com/game/pc/killsquad", "publisher": "Novarama", "release_date": "Oct 21 2021", "developers": ["Novarama"], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/b82b900a2f098dd1b718369b672e893e-98.jpg", "descriptions": "Hack and slash? Check. Twin-stick-shooter? Check. 4 player coop to slay hordes of aliens & bosses with your friends? Check. Skills, upgrades, weapons, gears, talismans and more to make you stronger? Check. Wake up, bounty hunter. We have a mission for you. Time to clean up the scum of the galaxy."}, {"name": "Resident Evil 5: Desperate Escape", "details_link": "https://www.metacritic.com/game/playstation-3/resident-evil-5-desperate-escape", "publisher": "Capcom", "release_date": "Mar  4 2010", "developers": ["Capcom"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/c489479a13a9cc7ac7b5000616b833dc-98.jpg", "descriptions": "[Playstation Network]  This is the second installment of new content for Resident Evil 5. After Jill Valentine is rescued by Chris Redfield, he leaves her to finish his mission. Find out how she made it out on her own, and what role Josh Stone played in her escape. This package also allows[Playstation Network]  This is the second installment of new content for Resident Evil 5. After Jill Valentine is rescued by Chris Redfield, he leaves her to finish his mission. Find out how she made it out on her own, and what role Josh Stone played in her escape. This package also allows you to unlock two new characters in the all-new The Mercenaries Reunion. Play as one of the stars of Resident Evil 0, Rebecca Chambers, or take on the role of Delta Team's commander, Josh Stone. There are also additional figures available in Extra Figures to round out this action-packed package.… Expand"}, {"name": "Puchi Puchi Virus", "details_link": "https://www.metacritic.com/game/ds/puchi-puchi-virus", "publisher": "NIS America", "release_date": "May 20 2009", "developers": ["Jaleco Entertainment", "Keys Factory"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Action", "Puzzle", "General", "General", "Matching"], "meta_score": 73, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/a773fc82c2dd08f9cf7d7a36773f8dc8-98.jpg", "descriptions": "Puchi Puchi Virus does not resemble the ordinary puzzle game. The usual \"object drop\" style was replaced with a more intuitive system of \"object linkage\". Its simple design and surprisingly in-depth game play can addict even the most demanding puzzle game enthusiasts. The object is to formPuchi Puchi Virus does not resemble the ordinary puzzle game. The usual \"object drop\" style was replaced with a more intuitive system of \"object linkage\". Its simple design and surprisingly in-depth game play can addict even the most demanding puzzle game enthusiasts. The object is to form at least a single triangle formation by linking viruses together and erasing them from the screen. Victory conditions vary from mission to mission, but erasing all of the viruses will be the fundamental rule of this game. Erase all the viruses and you win, but if the screen gets filled with the emerging viruses you lose. Note: there is a twist to this system that gives depth to the game play. Viruses turn to stone if left alone for a while, which cannot be selected to form a triangle. However, these stones can be erased if they are within a triangle that you create. With a little luck and practice players can rake in massive points by letting the viruses turn to stones and erasing them all at once. [NIS America]… Expand"}, {"name": "The Egyptian Prophecy", "details_link": "https://www.metacritic.com/game/pc/the-egyptian-prophecy", "publisher": "The Adventure Company", "release_date": "Mar 30 2004", "developers": ["DreamCatcher Interactive"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 73, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/86eda6f192d99241be57226dd379449e-98.jpg", "descriptions": "(Also known as \"Egypt III: The Fate of Ramses\")  Ramses II is dying and with him the glory of Egypt shall fall. Amon-Ra, the Sun-God, promises to extend his life in exchange for the most magnificent temple ever built. Trouble is not far away as the building site for the temple is affected by(Also known as \"Egypt III: The Fate of Ramses\")  Ramses II is dying and with him the glory of Egypt shall fall. Amon-Ra, the Sun-God, promises to extend his life in exchange for the most magnificent temple ever built. Trouble is not far away as the building site for the temple is affected by a number of sinister incidents. Maia, a young priestess, must solve the mystery behind these events and save the life of the Pharaoh. Travel along the Nile and explore magnificent locations and monuments such as: Karnak, Memphis, and the labyrinth of Ptah. Interact with various characters and encounter Egyptian gods, including: Osiris, Seth, Isis and Ptah. Decipher an array of intriguing 3D real-time puzzles set in breath-taking environments. Easily concoct sacred potions and perform ancient Egyptian rituals using the customized game interface and inventory. Scour the in-game encyclopedia for historically accurate information on rituals, ancient monuments and artifacts, and Egyptian mythology. [DreamCatcher Interactive]… Expand"}, {"name": "1080: Avalanche", "details_link": "https://www.metacritic.com/game/gamecube/1080-avalanche", "publisher": "Nintendo", "release_date": "Dec  1 2003", "developers": ["Nintendo"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/a3a852c6566e1b602cbacadb42428c6c-98.jpg", "descriptions": "Danger is the name of the game in 1080- Avalanche.  Huge air, massive drop-offs, deep powder, and the nastiest tricks come together in one package.  It's a frantic race to the bottom of the mountain, so stick tricks on the way down to increase your rider's speed and power.  Keep your eyesDanger is the name of the game in 1080- Avalanche.  Huge air, massive drop-offs, deep powder, and the nastiest tricks come together in one package.  It's a frantic race to the bottom of the mountain, so stick tricks on the way down to increase your rider's speed and power.  Keep your eyes peeled for shortcuts, rockslides, natural wildlife, dizzying drops, and sudden weather changes.  The successor to the Nintendo 64 version of the game, 1080- Avalanche offers a wide variety of play modes, challenges, and secrets to keep you on your toes.… Expand"}, {"name": "James Bond 007: Everything or Nothing", "details_link": "https://www.metacritic.com/game/game-boy-advance/james-bond-007-everything-or-nothing", "publisher": "EA Games", "release_date": "Nov 17 2003", "developers": ["Griptonite Games"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 73, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/92b401d9b352568d0cc56624d057bbeb-98.jpg", "descriptions": "Think like Bond, act like Bond, and experience an entirely new Bond adventure.  James Bond, the world's greatest secret agent, returns in Everything or Nothing with new guns and gadgets, combat skills, and clever tricks--and it's up to you to put them to good use.  Travel through fourThink like Bond, act like Bond, and experience an entirely new Bond adventure.  James Bond, the world's greatest secret agent, returns in Everything or Nothing with new guns and gadgets, combat skills, and clever tricks--and it's up to you to put them to good use.  Travel through four exciting continents including the Valley of the Kings in Egypt and the French Quarter in New Orleans.  The game also features two-player co-op missions and four-player multiplayer arena modes.  … Expand"}, {"name": "Voodoo Vince", "details_link": "https://www.metacritic.com/game/xbox/voodoo-vince", "publisher": "Microsoft Game Studios", "release_date": "Sep 23 2003", "developers": ["Beep Industries"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 73, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/98de20739d182bc0ab96f3de53cd8922-98.jpg", "descriptions": "Get ready for an intense adventure--from the streets of New Orleans to the depths of a Louisiana bayou--where you'll explore and fight as a tattered-but-tough voodoo doll on a quest to find his keeper, Madam Charmaine. As Voodoo Vince, you can defeat quirky monsters and villains just byGet ready for an intense adventure--from the streets of New Orleans to the depths of a Louisiana bayou--where you'll explore and fight as a tattered-but-tough voodoo doll on a quest to find his keeper, Madam Charmaine. As Voodoo Vince, you can defeat quirky monsters and villains just by hurting yourself. Race under a falling safe, jump into a high-speed blender, or leap under falling rubble--all in the effort to defeat your enemies and escape completely unscathed. … Expand"}, {"name": "Indiana Jones and the Emperor's Tomb", "details_link": "https://www.metacritic.com/game/xbox/indiana-jones-and-the-emperors-tomb", "publisher": "LucasArts", "release_date": "Feb 24 2003", "developers": ["Double Helix Games"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 73, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/d340537761b84548ff0addfcae1e6300-98.jpg", "descriptions": "Join daring archeologist and adventurer Indiana Jones as he travels to 1935 China to prevent a powerful artifact from falling into evil hands.  Indy's latest globe-spanning adventure takes you from the jungles of Ceylon and underwater palaces in Istanbul, to the deadly streets of Hong KongJoin daring archeologist and adventurer Indiana Jones as he travels to 1935 China to prevent a powerful artifact from falling into evil hands.  Indy's latest globe-spanning adventure takes you from the jungles of Ceylon and underwater palaces in Istanbul, to the deadly streets of Hong Kong and beyond.  You'll leap, swim, climb, and punch your way through exotic locales, fighting hand-to-hand combat from street brawls to martial arts battles.  It will take more than just your trusty whip and pistol to avoid deadly traps and navigate through all the dangerous environments.  Do you have what it takes to possess the mysterious Heart of the Dragon?… Expand"}, {"name": "Red Dog: Superior Firepower", "details_link": "https://www.metacritic.com/game/dreamcast/red-dog-superior-firepower", "publisher": "Crave", "release_date": "Oct 31 2000", "developers": ["Argonaut Games"], "platforms": "Dreamcast", "genres": ["Driving", "Car Combat"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/97394e44b34398f9074f3eb39569499e-98.jpg", "descriptions": "As commander of the Red Dog assault vehicle, your job is to rid our people of the now aggressive Haak forces occupying the continents of earth. You'll utilize Red Dog's advanced weaponry and armor as you engage in a variety of search and destroy, escort, and defense missions."}, {"name": "Death Track Racing", "details_link": "https://www.metacritic.com/game/pc/death-track-racing", "publisher": "Take-Two Interactive", "release_date": "Oct 10 2000", "developers": ["Attention To Detail"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade", "Futuristic", "Futuristic"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/27072e1e51084396f9e2a20580f88c79-98.jpg", "descriptions": "An adrenaline-packed driving phenomenon delivering the ultimate in arcade racing. Combining the heart-pounding elements of extreme racing with a stack of souped-up features, such as insane Rubble Soccer, this game forces racers to use every trick in the book to win.  [Take 2 Interactive]"}, {"name": "Sanity: Aiken's Artifact", "details_link": "https://www.metacritic.com/game/pc/sanity-aikens-artifact", "publisher": "Fox Interactive", "release_date": "Sep 26 2000", "developers": ["Monolith Productions"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Action", "General", "General"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/c12791f34c430a5bfd00abe2d71009ca-98.jpg", "descriptions": "Thirty years from now, citizens begin to display remarkable psychic abilities. Called Psionics, they can generate and control energy emissions using only their minds, often with deadly results. Succumbing to the lure of power, the Psionics will stop at nothing to achieve control of theThirty years from now, citizens begin to display remarkable psychic abilities. Called Psionics, they can generate and control energy emissions using only their minds, often with deadly results. Succumbing to the lure of power, the Psionics will stop at nothing to achieve control of the universe.  [Fox Interactive]… Expand"}, {"name": "The Urbz: Sims in the City", "details_link": "https://www.metacritic.com/game/gamecube/the-urbz-sims-in-the-city", "publisher": "EA Games", "release_date": "Nov  9 2004", "developers": ["Maxis"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 73, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/2b30624091aef58085ce1265cbf041da-98.jpg", "descriptions": "The Sims have moved to the City where there's always action and where reputation means everything. In the Urbz: Sims in the City, you can go to work at such locations as the Sushi Bar, Chop Shop, or Bootleg Fireworks, Inc. Success at work brings promotions, access to new power socials, andThe Sims have moved to the City where there's always action and where reputation means everything. In the Urbz: Sims in the City, you can go to work at such locations as the Sushi Bar, Chop Shop, or Bootleg Fireworks, Inc. Success at work brings promotions, access to new power socials, and gear to influence your new lifestyle. Flaunt your attitude by styling your Urbz, and then cross the velvet ropes of an uptown night club, or explore the subway to earn new skills and items. … Expand"}, {"name": "Luminous Arc 2", "details_link": "https://www.metacritic.com/game/ds/luminous-arc-2", "publisher": "Atlus", "release_date": "Nov 18 2008", "developers": ["Image Epoch", "Imageepoch"], "platforms": "DS", "num_players": "1 Player", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "General", "Tactics"], "meta_score": 73, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/0cf2af2515c9bd38af6512433e3a6190-98.jpg", "descriptions": "For most of the past four millennia, peace has reigned over the Kingdom of Carnava. \"The Grand Kingdom\" has flourished due to its close cooperation with the Witches of the Rev Magic Association and the ever-present usage of magic. Unfortunately, the era of peace has come to an end. Fatima,For most of the past four millennia, peace has reigned over the Kingdom of Carnava. \"The Grand Kingdom\" has flourished due to its close cooperation with the Witches of the Rev Magic Association and the ever-present usage of magic. Unfortunately, the era of peace has come to an end. Fatima, the Shadow Frost Witch, broke from the Magic Association and has taken over Granend, the Forbidden Land, with the use of magic. This infighting, dubbed the \"Witch Conflict,\" has pushed Carnava to the brink of chaos. When the young squire Roland gains magnificent powers due to a chance encounter, Sophia, the Queen of Carnava, calls upon him to bring about an end to the discord. [Atlus USA]… Expand"}, {"name": "FlatOut 2", "details_link": "https://www.metacritic.com/game/xbox/flatout-2", "publisher": "Vivendi Games", "release_date": "Aug  1 2006", "developers": ["Bugbear"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "8  Online", "genres": ["Driving", "Demolition Derby"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/65ce7cb0735f836b606671543b240c04-98.jpg", "descriptions": "Featuring an enhanced version of the original's physics engine with even faster driving track designs, FlatOut 2 also boasts numerous improvements, enhancements and additions to make the title the definitive FlatOut experience. Twice as many vehicles, a more sophisticated career mode,Featuring an enhanced version of the original's physics engine with even faster driving track designs, FlatOut 2 also boasts numerous improvements, enhancements and additions to make the title the definitive FlatOut experience. Twice as many vehicles, a more sophisticated career mode, additional race environments, double the number of tracks, twice as many mini-games along with brand new and much requested online multiplayer modes are just some of the exhaustive features that are included in FlatOut 2. With more than 5,000 fully destructible objects on every track as well as 40 deformable parts on each vehicle, physical interaction in a racing game is taken to unprecedented heights. With a greater emphasis placed on causing destruction on the track by offering greater rewards, game play will be even more frantic than ever. Drivers will need to tear into competitors' cars, trash the local scenery, litter the track with obstacles, while at the same time trying to concentrate on their own race in a bid to cross the line first. The ever-popular Ragdoll mini-games from the original FlatOut game make a welcome return and are better than ever with 12 Ragdoll events, a Ragdoll Championship and full online support. New Ragdoll events include basketball, baseball and royal flush cards.… Expand"}, {"name": "The Elder Scrolls V: Skyrim Anniversary Edition", "details_link": "https://www.metacritic.com/game/playstation-5/the-elder-scrolls-v-skyrim-anniversary-edition", "publisher": "Bethesda Softworks", "release_date": "Nov 11 2021", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Role-Playing", "Western-Style"], "meta_score": 73, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/6/ff9df160893c39395672d5ef2e9385c7-98.jpg", "descriptions": "The Anniversary Edition includes Skyrim Special Edition and 74 creations, all 48 currently available and 26 to be released. These showcase over 500+ individual elements such as quests, items, armor, houses, etc."}, {"name": "WarioWare D.I.Y. Showcase", "details_link": "https://www.metacritic.com/game/wii/warioware-diy-showcase", "publisher": "Nintendo", "release_date": "Mar 29 2010", "developers": ["Intelligent Systems"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 73, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/49c19fbe43f983a92c143fae840dc912-98.jpg", "descriptions": "[WiiWare]  WarioWare: D.I.Y. Showcase is a standalone product exclusive to the WiiWare service and available only from the Wii Shop Channel. The game contains more than 70 new microgames and features interoperability with theWarioWare: D.I.Y. game for the Nintendo DS family of products.[WiiWare]  WarioWare: D.I.Y. Showcase is a standalone product exclusive to the WiiWare service and available only from the Wii Shop Channel. The game contains more than 70 new microgames and features interoperability with theWarioWare: D.I.Y. game for the Nintendo DS family of products. Players that own both games can transfer content between the two via a local wireless connection, and can even play user-created microgames on their television using WarioWare: D.I.Y. Showcase. [Nintendo]… Expand"}, {"name": "Leisure Suit Larry: Wet Dreams Dry Twice", "details_link": "https://www.metacritic.com/game/pc/leisure-suit-larry-wet-dreams-dry-twice", "publisher": "Assemble Entertainment", "release_date": "Oct 23 2020", "developers": ["CrazyBunch"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/a34b2f05c492e8823a14b3452b3a6c15-98.jpg", "descriptions": "No obstacle will keep me away from my beloved, my Faith, not even the wild and untamed islands of Kalau’a. Those lovely island ladies can only distract me for so long as my heart’s compass only points in one direction - Faith!"}, {"name": "Destiny 2: Shadowkeep", "details_link": "https://www.metacritic.com/game/xbox-one/destiny-2-shadowkeep", "publisher": "Activision", "release_date": "Oct  1 2019", "developers": ["Bungie"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/4cf9d12d16d3719c1ea34037fefdf773-98.jpg", "descriptions": "New nightmares have emerged from the shadows of our Moon. Called forth by haunting visions, Eris Morn has returned. Join her to slay these nightmares before they reach out beyond the Moon to cast humanity back into an age of darkness. Features: New Missions, & Quests; New Destination &New nightmares have emerged from the shadows of our Moon. Called forth by haunting visions, Eris Morn has returned. Join her to slay these nightmares before they reach out beyond the Moon to cast humanity back into an age of darkness. Features: New Missions, & Quests; New Destination & Dungeon; New Weapons and Gear to Earn; An All New Raid; and more.… Expand"}, {"name": "Just Cause", "details_link": "https://www.metacritic.com/game/xbox-360/just-cause", "publisher": "Eidos Interactive", "release_date": "Sep 27 2006", "developers": ["Avalanche Studios"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/f87dc24160676a0aa93723ca66c4752a-98.jpg", "descriptions": "Assume the role of the flamboyant Rico Rodriguez – an undercover CIA operative specializing in regime change - as he tries to overthrow the corrupt government of San Esperito. This rogue South American island is suspected of stockpiling WMDs and it’s your job to negate the threat to worldAssume the role of the flamboyant Rico Rodriguez – an undercover CIA operative specializing in regime change - as he tries to overthrow the corrupt government of San Esperito. This rogue South American island is suspected of stockpiling WMDs and it’s your job to negate the threat to world peace. It could be to your advantage that this tropical paradise is about to implode as various factions vie for power – it just needs a gentle nudge in the right direction. Just Cause offers the freedom to tackle your assignment however you want: play the island’s factions off against one another; incite a rebellion among the masses; or build alliances with rebel forces and drug cartels. The game world consists of 1,225 sq. miles of mountains, jungles, beaches, cities and villages which can be explored by land, sea and air. And you will have at your disposal a varied and exciting array of vehicles, planes and watercraft. [Eidos Interactive]… Expand"}, {"name": "Jetpac Refuelled", "details_link": "https://www.metacritic.com/game/xbox-360/jetpac-refuelled", "publisher": "Microsoft Game Studios", "release_date": "Oct 24 2006", "developers": ["Rare Ltd."], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Shooter", "Platformer", "Shooter", "Scrolling", "2D", "Scrolling"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/132d5b9008c85ebd9ab9c559022235cf-98.jpg", "descriptions": "[Xbox Live Arcade]  Jetpac Refuelled takes tried and tested laser-driven arcade gameplay and brings it right up to date, crowbarring in masses of new levels, enemies and weapon upgrades while polishing the visuals and soundtrack to a space-age shine. Veteran twitch gamers and eager rookies[Xbox Live Arcade]  Jetpac Refuelled takes tried and tested laser-driven arcade gameplay and brings it right up to date, crowbarring in masses of new levels, enemies and weapon upgrades while polishing the visuals and soundtrack to a space-age shine. Veteran twitch gamers and eager rookies are all well catered for, with over 100 stages challenging allcomers to build and refuel their rockets under heavy pressure from disgruntled locals. The ultimate point of all this? Same as it always was: to stay alive and get rich. Online components include access to global high score Leaderboards and a good spread of Achievements, while the inclusion of simultaneous multiplayer action marks another first for the franchise. Two players can quickly and easily set up a head-to-head battle on a single Xbox 360 console or over Xbox Live. So if you fancy giving your trigger finger a proper arcade workout for the first time in ages, this is the game for you. Feel free to storm Xbox Live Arcade and download the Trial version if you're still not sure. Jetpac Refuelled is much more than a simple nostalgia trip, though to show due reverence we've also included a recreation of the classic 1983 original under the heading of Retro mode... we did, however, stop short of making it take five minutes to load. [Rare]… Expand"}, {"name": "Ultratron", "details_link": "https://www.metacritic.com/game/wii-u/ultratron", "publisher": "Curve Digital", "release_date": "May 14 2015", "developers": ["Puppy Games", "Carbon Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox One", "Wii U"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down", "Vertical"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/f7e09294867992aeb00f6b098bbe45e6-98.jpg", "descriptions": "Experience the gameplay of old-school arcade standards, updated for the 21st century. Unique retro-futuristic sound and graphics, player responsive difficulty, and a subtle system of tactics combined with classic gameplay make Ultratron a hypnotic arcade game. The last human has been slainExperience the gameplay of old-school arcade standards, updated for the 21st century. Unique retro-futuristic sound and graphics, player responsive difficulty, and a subtle system of tactics combined with classic gameplay make Ultratron a hypnotic arcade game. The last human has been slain by evil killer robots. You are the one remaining humanoid battle droid. Your mission: avenge the human race. Boost your battledroid with powerups, buy cute but deadly pets in the shop. Blast your way through 40+ glowing neon levels, avoiding Chasers, Turrets, Spawners, Minelayers, bombs, and bullets, and take on the four giant boss 'bots of the Apocalypse - Ieiunitas, Bellum, Lues and Letum.… Expand"}, {"name": "The Sims 2: Castaway", "details_link": "https://www.metacritic.com/game/wii/the-sims-2-castaway", "publisher": "Electronic Arts", "release_date": "Oct 23 2007", "developers": ["Maxis"], "platforms": ["PC", "PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "General", "Virtual", "Virtual Life"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/1b854a49bd6854949a1e8cb8921436fd-98.jpg", "descriptions": "Help your Sims build a life from scratch after washing ashore on a deserted tropical island. Overcome the forces of nature to help them become the ultimate survivors and thrive in this undiscovered paradise while unearthing clues that will lead them back to civilization. Build shelters,Help your Sims build a life from scratch after washing ashore on a deserted tropical island. Overcome the forces of nature to help them become the ultimate survivors and thrive in this undiscovered paradise while unearthing clues that will lead them back to civilization. Build shelters, craft unique items, and discover many useful treasures and ancient mysteries hidden deep within a diverse jungle environment filled with plants, fruits, and even wildlife. Your Sims change as they take on the challenges of island life and learn to survive in style. Create a new life for your Sims on an uncharted island in The Sims 2 Castaway. [Electronic Arts]… Expand"}, {"name": "FAR: Changing Tides", "details_link": "https://www.metacritic.com/game/pc/far-changing-tides", "publisher": "Frontier Foundry", "release_date": "Mar  1 2022", "developers": ["Okomotive"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/3254befe73b00d492e3f2f7294425cf6-98.jpg", "descriptions": "Set sail and discover the wonders of a flooded world rife with mystery. Dive into unknown depths on the hunt for fuel and salvage, devise innovative solutions to overcome intricate obstacles, and unearth forgotten relics lost to time."}, {"name": "Control: AWE", "details_link": "https://www.metacritic.com/game/pc/control-awe", "publisher": "Epic Games", "release_date": "Aug 27 2020", "developers": ["Remedy Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action Adventure", "General"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/a9ed032cb358f0200a14180e22683469-98.jpg", "descriptions": "Explore the sealed Investigations Sector, uncover the mystery of Bright Falls, and face a new terror with a new Service Weapon form. \r\rAWE is short for Altered World Event, which occur when paranatural forces breach our world. Sometimes, AWEs are minor and go unnoticed. However, sometimesExplore the sealed Investigations Sector, uncover the mystery of Bright Falls, and face a new terror with a new Service Weapon form. \r\rAWE is short for Altered World Event, which occur when paranatural forces breach our world. Sometimes, AWEs are minor and go unnoticed. However, sometimes AWEs cause catastrophic events. Historically, the Investigations Sector was where the Federal Bureau of Control's dangerous work of searching for AWE cases was coordinated from, and where evidence was stored until things went horribly, horribly wrong, and the sector was sealed off years ago.\r Director Jesse Faden has to enter the sector to chase down a mysterious being that's been stalking this long-abandoned area for years. In order to reclaim the Investigations Sector from the clutches of this creature of darkness, Jesse will need to explore the numerous Altered World Events investigated here, including one from the town of Bright Falls.… Expand"}, {"name": "A Normal Lost Phone", "details_link": "https://www.metacritic.com/game/switch/a-normal-lost-phone", "publisher": "Plug In Digital", "release_date": "Mar  1 2018", "developers": ["Plug In Digital"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/8a2e53742a1ec8db2e105f0c3ebb0f92-98.jpg", "descriptions": "A Normal Lost Phone is a game about exploring the intimacy of an unknown person whose phone was found by the player.\r The game takes the shape of a narrative investigation: you have to search the phones text messages, pictures and applications, in order to learn about its former owner.A Normal Lost Phone is a game about exploring the intimacy of an unknown person whose phone was found by the player.\r The game takes the shape of a narrative investigation: you have to search the phones text messages, pictures and applications, in order to learn about its former owner. Through this phone, you uncover Sams life, friends, family and relationships, until the evening when they turn 18 and mysteriously disappear.… Expand"}, {"name": "Chicken Wiggle", "details_link": "https://www.metacritic.com/game/3ds/chicken-wiggle", "publisher": "Atooi LLC", "release_date": "Aug 17 2017", "developers": ["Atooi LLC"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/9815c7f51a48dac602bec47ed3117460-98.jpg", "descriptions": "A brand new world of platforming and adventure!The stars of Chicken Wiggle are an improbable duo: a young chicken and his best buddy a wiggly worm nestled in his backpack! Together, they team up for adventure to jump, peck, and worm-grapple across a myriad of perplexing platforming levelsA brand new world of platforming and adventure!The stars of Chicken Wiggle are an improbable duo: a young chicken and his best buddy a wiggly worm nestled in his backpack! Together, they team up for adventure to jump, peck, and worm-grapple across a myriad of perplexing platforming levels full of fun gadgets, tricky hazards, and sneaky foes determined to rescue their friends from the wicked witch in her sky towers.But wait, there's more! Aspiring game designers and playful doodlers alike can spend hours of fun hatching their own levels with the user-friendly level creator included with the game. You can even choose different gameplay rules, art themes, and provide custom hints, tips, and search tags. Once you're ready, it's easy to share your creations on-line with other Chicken Wiggle players via the community portal. Now, anyone can be a game designer on the go!Players seeking more levels to play after completing Chicken Wiggle's main story mode will find a wealth of unique levels to download, play, and rate for free! Level categories include Atooi official, popular, latest, or simply enter your own search tags or a specific level ID to locate a friend's level.… Expand"}, {"name": "The Saboteur", "details_link": "https://www.metacritic.com/game/xbox-360/the-saboteur", "publisher": "Electronic Arts", "release_date": "Dec  8 2009", "developers": ["Pandemic Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/802156a7fc90b2dbccdf0c948b5e0ae4-98.jpg", "descriptions": "Inspired by a true story, The Saboteur stars Sean Devlin, a street-tough Irish race car driver trapped behind enemy lines in 1940s Nazi-occupied France. Motivated by personal revenge, Sean fights, climbs, and races through open-world Paris, sneaking into the heart of the Nazi operations andInspired by a true story, The Saboteur stars Sean Devlin, a street-tough Irish race car driver trapped behind enemy lines in 1940s Nazi-occupied France. Motivated by personal revenge, Sean fights, climbs, and races through open-world Paris, sneaking into the heart of the Nazi operations and sabotaging their every move. With the help of the French Resistance, the British intelligence, an arsenal of weaponry, street smarts and brawn, players exact revenge on those who aim to destroy Sean's life. From derailing trains and blowing up zeppelins to scaling famous Parisian landmarks and more, this action hero uses a broad range of weapons, explosives and vehicles to get the job done. As Sean takes down enemies, the citizens of Paris are empowered to resist the tyrannical Third Reich and their eyes open to the colorful world around them. This innovative mechanic, called the 'Will to Fight,' change the way Paris is seen and felt - from a dark and oppressed policed state to a bright and inspired world where the citizens fight back. As the player executes acts of sabotage against the occupying force, color returns to the stylized black and white world - both figuratively and literally. The ‘Will to Fight’ spawns an underground resistance that takes players not only through Paris, but across various parts of France. [Pandemic Studios]… Expand"}, {"name": "My Spanish Coach", "details_link": "https://www.metacritic.com/game/ds/my-spanish-coach", "publisher": "Ubisoft", "release_date": "Nov  6 2007", "developers": ["Ubisoft", "Sensory Sweep"], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/cc298484f3185ded894d4b5151049f8c-98.jpg", "descriptions": "Playing My Spanish Coach for 15 to 20 minutes a day is all you need to become fluent in Spanish. Other Features include: 8 touchpad mini-games to sharpen your mastery of the language at your own pace. Track your progress with charts showing your performance learning the language. SimplePlaying My Spanish Coach for 15 to 20 minutes a day is all you need to become fluent in Spanish. Other Features include: 8 touchpad mini-games to sharpen your mastery of the language at your own pace. Track your progress with charts showing your performance learning the language. Simple touch screen interface makes it perfect for anyone of any age. [Ubisoft]… Expand"}, {"name": "Sonic Mega Collection Plus", "details_link": "https://www.metacritic.com/game/playstation-2/sonic-mega-collection-plus", "publisher": "Sega", "release_date": "Nov  2 2004", "developers": ["Sonic Team"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/85384458af6e9e74f771c01ff8776e93-98.jpg", "descriptions": "Sonic Mega Collection Plus features SEGA's mascot and all his friends in some of their greatest adventures including Sonic The Hedgehog games from the SEGA Genesis, three lock-on games, four additional unlockable Genesis games, six Sonic the Hedgehog SEGA Game Gear games, and a Sonic museumSonic Mega Collection Plus features SEGA's mascot and all his friends in some of their greatest adventures including Sonic The Hedgehog games from the SEGA Genesis, three lock-on games, four additional unlockable Genesis games, six Sonic the Hedgehog SEGA Game Gear games, and a Sonic museum filled with art, comics and more. In particular, Sonic Mega Collection Plus features: Sonic The Hedgehog, Sonic The Hedgehog 2, Sonic The Hedgehog 3, Sonic & Knuckles, Sonic 3D Blast, Sonic The Hedgehog Spinball, Dr. Robotnik's Mean Bean Machine, The Ooze, Comix Zone, Flicky, Ristar, and six hidden SEGA Game Gear games: Sonic the Hedgehog, Sonic Chaos, Sonic Drift, Sonic Labyrinth, Dr. Robotnik's Mean Bean Machine, Sonic Blast. [Sega]… Expand"}, {"name": "FIFA Soccer 11", "details_link": "https://www.metacritic.com/game/wii/fifa-soccer-11", "publisher": "Electronic Arts", "release_date": "Oct  4 2010", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/601ec4c63b50b8724dd0bc6dcd41afb4-98.jpg", "descriptions": "EA returns to the field with another installment in its long-running soccer series."}, {"name": "Black Desert Online", "details_link": "https://www.metacritic.com/game/pc/black-desert-online", "publisher": "GameOn", "release_date": "Mar  3 2016", "developers": ["Pearl Abyss"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/074dff2f77bf724460efd0711fe8fc45-98.jpg", "descriptions": "Black Desert is a large scale of sandbox oriented MMORPG that provides you a variety of unique experiences with spectacular action and battle, strategy-based castle siege, sophisticated simulation contents such as trade, NPC-hiring and real estate management."}, {"name": "LittleBigPlanet Karting", "details_link": "https://www.metacritic.com/game/playstation-3/littlebigplanet-karting", "publisher": "SCEA", "release_date": "Nov  6 2012", "developers": ["Media Molecule", "United Front Games"], "platforms": "PlayStation 3", "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Kart", "Kart", "Automobile"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/f7f4cd98ab92ee32815b49371488c338-98.jpg", "descriptions": "Race through your favourite themes from the world of LittleBigPlanet, using a variety of gadgets to bounce, grapple or grab your way into 1st place. Battle your friends online via PSN or in split-screen mode, complete challenges or dive into the community to discover new player-created tracks."}, {"name": "Medal of Honor: Airborne", "details_link": "https://www.metacritic.com/game/xbox-360/medal-of-honor-airborne", "publisher": "Electronic Arts", "release_date": "Sep  4 2007", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/c9672c34f7a8f63dc8dba4c04312a651-98.jpg", "descriptions": "Step into the boots of Boyd Travers, Private First Class of the 82nd Airborne Division and engage in battles throughout Europe. From rocky beginnings in Sicily to war-winning triumphs in Germany, each mission begins behind enemy lines, with an intense and fully interactive airdrop. YourStep into the boots of Boyd Travers, Private First Class of the 82nd Airborne Division and engage in battles throughout Europe. From rocky beginnings in Sicily to war-winning triumphs in Germany, each mission begins behind enemy lines, with an intense and fully interactive airdrop. Your ability to determine your own starting point dramatically changes the way each mission plays out. View the entire operation from the air, and then control your parachute to choose your landing spot. On the ground, gather your senses and assess the terrain. A wide variety of authentic, customizable weapons are at your disposal, each with distinct characteristics. Choose your path in this free roaming FPS environment. Medal of Honor Airborne also features exceptionally photo-realistic characters, adding to the intensity of the cinematic, story-driven game. [Electronic Arts]… Expand"}, {"name": "MirrorMoon EP", "details_link": "https://www.metacritic.com/game/pc/mirrormoon-ep", "publisher": "Santa Ragione", "release_date": "Sep  4 2013", "developers": ["Santa Ragione"], "platforms": "PC", "genres": ["Miscellaneous", "Adventure", "Puzzle", "General", "Puzzle", "3D", "First-Person", "General"], "meta_score": 73, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/a9433a4fad8625277ec1b1b68a98e093-98.jpg", "descriptions": "MirrorMoon is a first-person puzzle-adventure game set on an uninhabited planet that is experiencing a full solar eclipse. MirrorMoon is about mystery, solitude and feeling lost, it's a metaphor of space. It challenges players through real-time juxtaposition of two 3D coordinate system thatMirrorMoon is a first-person puzzle-adventure game set on an uninhabited planet that is experiencing a full solar eclipse. MirrorMoon is about mystery, solitude and feeling lost, it's a metaphor of space. It challenges players through real-time juxtaposition of two 3D coordinate system that partially coexist in the same game space, questioning the nature of interaction with the limits of the represented game world.… Expand"}, {"name": "Yoshi Touch & Go", "details_link": "https://www.metacritic.com/game/ds/yoshi-touch-go", "publisher": "Nintendo", "release_date": "Mar 14 2005", "developers": ["Nintendo"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/5c4a905de0d6e7a3cc10762d9ec63ef4-98.jpg", "descriptions": "Yoshi and Baby Mario embark on another wild adventure, this time on the Nintendo DS. Using the Nintendo DS system's two screens and touch-screen capability, you'll have to help Yoshi guard Baby Mario and guide him to safety. On vertical-action levels, players must use the stylus to drawYoshi and Baby Mario embark on another wild adventure, this time on the Nintendo DS. Using the Nintendo DS system's two screens and touch-screen capability, you'll have to help Yoshi guard Baby Mario and guide him to safety. On vertical-action levels, players must use the stylus to draw clouds on the touch screen to protect Baby Mario from enemies and lead him to Yoshi. On horizontal side-scrolling levels, players must use the stylus to look out for Yoshi as he gallops across the countryside. On top of all that, Yoshis Touch & Go also features two-player wireless play. Creating lines of clouds with the stylus is fun and intuitive, and despite the simple control interface the game can actually become quite challenging. There is something distinctly satisfying about drawing clouds on the bottom screen, then watching them scroll up and affect the game on the upper screen. [Nintendo]… Expand"}, {"name": "The Elder Scrolls V: Skyrim - Dawnguard", "details_link": "https://www.metacritic.com/game/xbox-360/the-elder-scrolls-v-skyrim---dawnguard", "publisher": "Bethesda Softworks", "release_date": "Jun 26 2012", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/e321f8288b580608f2d024356d0b3da1-98.jpg", "descriptions": "Dawnguard is the 1st official game add-on for The Elder Scrolls V: Skyrim. The Vampire Lord Harkon has returned to power. By using the Elder Scrolls, he seeks to do the unthinkable - to end the sun itself. Will you join the ancient order of the Dawnguard and attempt to stop him? Or will youDawnguard is the 1st official game add-on for The Elder Scrolls V: Skyrim. The Vampire Lord Harkon has returned to power. By using the Elder Scrolls, he seeks to do the unthinkable - to end the sun itself. Will you join the ancient order of the Dawnguard and attempt to stop him? Or will you become a Vampire Lord yourself? Featuring an all new faction questline and locations, the ultimate choice will be yours.… Expand"}, {"name": "Motocross Madness", "details_link": "https://www.metacritic.com/game/xbox-360/motocross-madness", "publisher": "Microsoft Game Studios", "release_date": "Apr 10 2013", "developers": ["Bongfish"], "platforms": "Xbox 360", "genres": ["Driving", "Racing", "General", "General", "Arcade", "Automobile"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/9f9fa2adac2c5c51270ad8600fa8a40b-98.jpg", "descriptions": "Motocross Madness lets players take their bike freeriding across massive environments, from the deserts of Egypt to the snows of Iceland."}, {"name": "Scott Pilgrim vs. the World: The Game", "details_link": "https://www.metacritic.com/game/xbox-360/scott-pilgrim-vs-the-world-the-game", "publisher": "Ubisoft", "release_date": "Aug 25 2010", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "General", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/bfd0e1bdbb0bc1cf505a199d1093e3e6-98.jpg", "descriptions": "This will be a video game based on Universal Pictures' upcoming action-comedy, Scott Pilgrim vs. the World."}, {"name": "NFL Street 2 Unleashed", "details_link": "https://www.metacritic.com/game/psp/nfl-street-2-unleashed", "publisher": "EA Sports Big", "release_date": "Mar 21 2005", "developers": ["EA Tiburon"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/1eb7658d47f91471697a939d48edc300-98.jpg", "descriptions": "Defy gravity and stretch the world of arcade football to the skies with NFL Street 2 Unleashed. NFL players are free from their real-world constraints to dominate the streets one stylin' move and one field at a time. Raise your game to the limits with up-the-wall passes, off-the-wallDefy gravity and stretch the world of arcade football to the skies with NFL Street 2 Unleashed. NFL players are free from their real-world constraints to dominate the streets one stylin' move and one field at a time. Raise your game to the limits with up-the-wall passes, off-the-wall catches, and highlight-reel wall jukes that are sure to solidify your place as football's greatest urban legend. With New Exclusive Street Events, head-to-head wireless gameplay, NFL superstars and legends playing both sides of the ball, and new PSP-specific content, the time to own the streets is NOW. You won't find Street Events like Street Slalom, Style Standoff, and Style Point Challenge on any other platform. Up to four players use a single PSP unit to compete in game modes including 2 Minute Challenge, Jump Ball Challenge, and more. EA Pocket Trax is a new feature designed for PSP allows you to listen and watch music content via this built in player. [Electronic Arts]… Expand"}, {"name": "Flat Eye", "details_link": "https://www.metacritic.com/game/pc/flat-eye", "publisher": "Raw Fury", "release_date": "Nov 14 2022", "developers": ["Monkey Moon"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/3b6acef0c8cc4f061322b25c63330ca2-98.jpg", "descriptions": "Flat Eye is a perfectly balanced blend of management simulation and narrative-driven gameplay.As the manager of the world's premier gas and technological hub, it's your job to keep your station running smoothly, complete daily objectives tasked by the world's first true AI, and develop newFlat Eye is a perfectly balanced blend of management simulation and narrative-driven gameplay.As the manager of the world's premier gas and technological hub, it's your job to keep your station running smoothly, complete daily objectives tasked by the world's first true AI, and develop new technology to improve (or curse) the future of humanity.… Expand"}, {"name": "Hot Wheels Unleashed", "details_link": "https://www.metacritic.com/game/switch/hot-wheels-unleashed", "publisher": "Koch Media", "release_date": "Sep 30 2021", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 73, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/63be2002a14b6b540b4ef48ab7f80e8b-98.jpg", "descriptions": "Drive the cars of your dreams! The coolest, the fastest, the most unique badass vans and jaw-dropping muscle cars are waiting for you. Take the wheel of tons of vehicles with their own personality and style, different traits, and levels of rarity. The very best of the hot wheels universe isDrive the cars of your dreams! The coolest, the fastest, the most unique badass vans and jaw-dropping muscle cars are waiting for you. Take the wheel of tons of vehicles with their own personality and style, different traits, and levels of rarity. The very best of the hot wheels universe is here! Prove you're the best and unlock Premium cars and extraordinary items and with the livery editor make your ride a one-of-a-kind masterpiece of speed. Race like everyone's watching! Get ready for pure fun and show off your driving skills! Drift like a pro, charge your boost and blast through the loops to beat time, rivals and gravity itself! Are you up for a challenge? Boom, jackpot: race side by side a friend in the 2-player local split-screen mode or face up to 12 players online in a worldwide event. The harder the challenge, the more glorious the triumph! Unleash your creativity! Massive, themed playgrounds are ready to host the most immersive races. Have fun on and off the track with these beautifully detailed and interactive environments, where any object can play a role and be an actual part of your circuit! You can even build a racetrack inside your very own room, a space to customize with furniture and the items you will collect during your journey. And thanks to the incredibly powerful editor, building the craziest tracks has never been easier! Bend and stretch the iconic Orange track piece to create your unique design and then add special Boosters, loops, obstacles, and exclusive interactive elements to build your own racing paradise. Share your creations with the world Or enjoy tracks made by other crazy players like you. Now it's time to unleash the fun! … Expand"}, {"name": "Ikenfell", "details_link": "https://www.metacritic.com/game/switch/ikenfell", "publisher": "Humble Bundle", "release_date": "Oct  8 2020", "developers": ["Happy Ray Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/62eb6b580d7f89b3c408fd4199f2b306-98.jpg", "descriptions": "A turn based-tactical RPG about a group of troublesome magic students. Use timing mechanics to power your spells and block attacks, explore the twisted halls of a vast magic school, fight challenging monsters and bosses, find tons of hidden treasure, and uncover dark secrets never meant to be found."}, {"name": "Final Fantasy VIII Remastered", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-viii-remastered", "publisher": "Square Enix", "release_date": "Sep  3 2019", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 73, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/4e0f50f49e9f4d3a5f04e3fc9637f14e-98.jpg", "descriptions": "In a world where an ancient energy known as the Sorceress Power is passed down through generations, the peace of the realm is threatened when the evil Sorceress Edea takes power as ruler of the Galbadia Republic. Squall, a member of Balamb Garden Military Academy's elite mercenary forceIn a world where an ancient energy known as the Sorceress Power is passed down through generations, the peace of the realm is threatened when the evil Sorceress Edea takes power as ruler of the Galbadia Republic. Squall, a member of Balamb Garden Military Academy's elite mercenary force SeeD, other allies from the Garden, and Rinoa, a member of the resistance, join together on a journey to fight against Sorceress Edea, who shows hostility toward the Garden. [Square Enix]… Expand"}, {"name": "Quarantine Circular", "details_link": "https://www.metacritic.com/game/pc/quarantine-circular", "publisher": "Mike Bithell", "release_date": "May 22 2018", "developers": ["Mike Bithell"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Text"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/9350c64466e43deeef994d7c28a744ec-98.jpg", "descriptions": "First, do no harm. From the award-winning team behind Thomas Was Alone and Subsurface Circular comes another experimental short, the next mutation in text-based adventure. In the middle of a world-ending pandemic, a group of scientists discover the galaxy has been watching."}, {"name": "Max: The Curse of Brotherhood", "details_link": "https://www.metacritic.com/game/switch/max-the-curse-of-brotherhood", "publisher": "Stage Clear Studios", "release_date": "Dec 21 2017", "developers": ["Stage Clear Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/d3405972e9eee1bcc42a2034112c469c-98.jpg", "descriptions": "When Max wishes for his annoying little brother, Felix, to be whisked away by unknown evil forces, he gets more than he bargained for. Armed only with a marker and a hope of undoing what he has just done, he sets out on a perilous journey across deserts, eerie lantern-lit bogs, ancientWhen Max wishes for his annoying little brother, Felix, to be whisked away by unknown evil forces, he gets more than he bargained for. Armed only with a marker and a hope of undoing what he has just done, he sets out on a perilous journey across deserts, eerie lantern-lit bogs, ancient temples and lush green forests to get his younger sibling back. Along the way Max gains the power to manipulate his environment and overcome seemingly impossible obstacles.… Expand"}, {"name": "Just Dance 2017", "details_link": "https://www.metacritic.com/game/xbox-one/just-dance-2017", "publisher": "Ubisoft", "release_date": "Oct 25 2016", "developers": ["Ubisoft Paris"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One"], "genres": ["Action", "Rhythm", "Dancing"], "meta_score": 73, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/0b3505031ecd042a3ae64ef362b2e8c5-98.jpg", "descriptions": "Grab your friends and family because it's time to dance! The biggest music video game franchise of all time is back, with over 60 million units sold. Just Dance 2017 brings you over 40 new tracks, six game modes, updated content all year long and access to 200+ songs through Just DanceGrab your friends and family because it's time to dance! The biggest music video game franchise of all time is back, with over 60 million units sold. Just Dance 2017 brings you over 40 new tracks, six game modes, updated content all year long and access to 200+ songs through Just Dance Unlimited! \r\rJoin a community of more than 118 million players around the world and bust out your best moves! Dance your heart out to Cheap Thrills by Sia Ft. Sean Paul, Lean On by Major Lazer & DJ Snake Ft. MO, and Sorry by Justin Bieber. Relive classics including Don't Stop Me Now by Queen, or if J-Pop is your thing get down to Po Pi Po by Hatsune Miku!… Expand"}, {"name": "Just Dance 2017", "details_link": "https://www.metacritic.com/game/playstation-4/just-dance-2017", "publisher": "Ubisoft", "release_date": "Oct 25 2016", "developers": ["Ubisoft Paris"], "platforms": ["PC", "PlayStation 3", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action", "Rhythm", "Dancing"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/8413a8854d3d9192ce3e0e8b1d7adc00-98.jpg", "descriptions": "Grab your friends and family because it's time to dance! The biggest music video game franchise of all time is back, with over 60 million units sold. Just Dance 2017 brings you over 40 new tracks, six game modes, updated content all year long and access to 200+ songs through Just DanceGrab your friends and family because it's time to dance! The biggest music video game franchise of all time is back, with over 60 million units sold. Just Dance 2017 brings you over 40 new tracks, six game modes, updated content all year long and access to 200+ songs through Just Dance Unlimited! \r\rJoin a community of more than 118 million players around the world and bust out your best moves! Dance your heart out to Cheap Thrills by Sia Ft. Sean Paul, Lean On by Major Lazer & DJ Snake Ft. MO, and Sorry by Justin Bieber. Relive classics including Don't Stop Me Now by Queen, or if J-Pop is your thing get down to Po Pi Po by Hatsune Miku!… Expand"}, {"name": "Jotun: Valhalla Edition", "details_link": "https://www.metacritic.com/game/xbox-one/jotun-valhalla-edition", "publisher": "Thunder Lotus Games", "release_date": "Sep  9 2016", "developers": ["Thunder Lotus Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Wii U", "Xbox One"], "genres": ["Action", "Action Adventure", "General"], "meta_score": 73, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/ee08bb867f34aeb62b9768c9fd71c408-98.jpg", "descriptions": "In Jotun, you play Thora, a Norse warrior who has died an inglorious death and must face the challenges of Viking purgatory to prove herself to the Gods and enter Valhalla."}, {"name": "Another World: 20th Anniversary Edition", "details_link": "https://www.metacritic.com/game/wii-u/another-world-20th-anniversary-edition", "publisher": "The Digital Lounge", "release_date": "Jun 19 2014", "developers": ["The Digital Lounge"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/20f9d2eeb083a8a1645025ba29d914b6-98.jpg", "descriptions": "Also known as Out Of This World, Another World is a pioneer action/platformer that released across more than a dozen platforms since its debut in 1991. Along the years, Another World has attained cult status among critics and sophisticated gamers alike.\r Another World chronicles the storyAlso known as Out Of This World, Another World is a pioneer action/platformer that released across more than a dozen platforms since its debut in 1991. Along the years, Another World has attained cult status among critics and sophisticated gamers alike.\r Another World chronicles the story of Lester Knight Chaykin a young scientist hurtled through space and time by a nuclear experiment that goes wrong. In an alien and inhospitable world, you will have to dodge, outwit, and overcome the host of alien monsters, while surviving an environment as deadly as your enemies. Only a perfect blend of logic and skill will get you past the deadly obstacles that lie in wait.… Expand"}, {"name": "Bandfuse: Rock Legends", "details_link": "https://www.metacritic.com/game/xbox-360/bandfuse-rock-legends", "publisher": "Mastiff", "release_date": "Nov 19 2013", "developers": ["Realta Entertainment Group"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Music", "Action", "Miscellaneous", "Rhythm", "Music"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/971b981620d7bf1eae6eb05ff96f9156-98.jpg", "descriptions": "BandFuse: Rock Legends provides a pick up and play experience. Whether you have never held a guitar before, or you are already playing in a band, BandFuse will have you rockin' with your favorite songs in minutes. BandFuse connects real guitars and microphones to your game console unleashingBandFuse: Rock Legends provides a pick up and play experience. Whether you have never held a guitar before, or you are already playing in a band, BandFuse will have you rockin' with your favorite songs in minutes. BandFuse connects real guitars and microphones to your game console unleashing a full band experience for players of all skill levels.… Expand"}, {"name": "Crash: Mind Over Mutant", "details_link": "https://www.metacritic.com/game/playstation-2/crash-mind-over-mutant", "publisher": "Activision Blizzard", "release_date": "Oct  7 2008", "developers": ["Radical Entertainment"], "platforms": "PlayStation 2", "genres": ["Action", "Platformer", "3D"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/0028f580947c8e25bfccfb686639129c-98.jpg", "descriptions": "Help Crash save his friends and stop the evil Neo Cortex from taking over the world in Crash Bandicoot: Mind Over Mutant."}, {"name": "All-Pro Football 2K8", "details_link": "https://www.metacritic.com/game/playstation-3/all-pro-football-2k8", "publisher": "2K Sports", "release_date": "Jul 16 2007", "developers": ["Visual Concepts"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 14 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/51a4e97196ffa73f3bb3f7ade544485a-98.jpg", "descriptions": "Imagine Rice, Unitas, Butkus, and Singletary. In their prime.  On the same field. Maybe even the same team. Imagine preparing a precision squad of mercenaries—even building your own players. Imagine football action the way football is really played. Now imagine the best gridiron game comingImagine Rice, Unitas, Butkus, and Singletary. In their prime.  On the same field. Maybe even the same team. Imagine preparing a precision squad of mercenaries—even building your own players. Imagine football action the way football is really played. Now imagine the best gridiron game coming back for more.  Imagine Football Resurrected. This is All Pro Football 2K8. Draft your dream team from football’s legendary players--over 240 of them. Choose your arena and pump up the fan base to create stadium energy you can feel. Next Gen Graphics feature thousands of new player animations—games come alive with sweat and steam, rabid fans in the stands and dynamic weather challenges. 2K Broadcasting – A new style combining TV broadcast with on-field commentary to put you closer to the action than ever before. 2K Beats – Kick it off with original soundtracks, mashups and remixes by an all-pro producer with legendary artists. [2K Sports]… Expand"}, {"name": "Mario Party 9", "details_link": "https://www.metacritic.com/game/wii/mario-party-9", "publisher": "Nintendo", "release_date": "Mar 11 2012", "developers": ["Nd Cube"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/c48ed07a342bdad858aafaaace84ea97-98.jpg", "descriptions": "The party is back and bigger than ever in the Mario Party 9 game for Wii, featuring all-new ways to play! For the first time in the franchise, boss battles crash the party and challenge players to compete to defeat a common enemy. In addition, players now travel across stages together in aThe party is back and bigger than ever in the Mario Party 9 game for Wii, featuring all-new ways to play! For the first time in the franchise, boss battles crash the party and challenge players to compete to defeat a common enemy. In addition, players now travel across stages together in a vehicle towards a common goal - overcoming obstacles, battling bosses, and collecting Mini Stars stolen by Bowser™ and his minions. Featuring 80 new minigames, adventurous new stages, and all-new ways to play that blend cooperative and competitive action for up to four players*, Mario Party 9 is the perfect way to get the party started.… Expand"}, {"name": "MechWarrior 5: Mercenaries", "details_link": "https://www.metacritic.com/game/pc/mechwarrior-5-mercenaries", "publisher": "Piranha Games", "release_date": "Dec 10 2019", "developers": ["Piranha Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Simulation", "Vehicle", "Combat"], "meta_score": 73, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/68fd7b31485d83ad1abd06f69fba6759-98.jpg", "descriptions": "The year is 3015. Humanity has colonized thousands of systems across a vast region of space splintered by centuries of conflict. The battlefields of the future are dominated by MechWarriors, elite pilots of hulking machines of war known as BattleMechs."}, {"name": "Project Spark", "details_link": "https://www.metacritic.com/game/xbox-one/project-spark", "publisher": "Microsoft Game Studios", "release_date": "Mar  4 2014", "developers": ["Microsoft Game Studios"], "platforms": ["PC", "Xbox One"], "genres": ["General", "Action", "Action Adventure", "General", "Sandbox"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/edfee736af1622721d686af17bbfe070-98.jpg", "descriptions": "Project Spark gives players the power to build, play, and share their very own games and worlds on the Xbox One."}, {"name": "Assassin's Creed III - The Infamy", "details_link": "https://www.metacritic.com/game/xbox-360/assassins-creed-iii---the-infamy", "publisher": "Ubisoft", "release_date": "Feb 19 2013", "developers": ["Ubisoft Quebec"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 73, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/967c29b5dda1b33b7c19560a61a800a0-98.jpg", "descriptions": "The Tyranny of King Washington is a DLC for Assassin's Creed III in which you will explore an alternate reality where George Washington has become a dictator that you must overthrown."}, {"name": "Assassin's Creed Valhalla: Wrath of the Druids", "details_link": "https://www.metacritic.com/game/xbox-series-x/assassins-creed-valhalla-wrath-of-the-druids", "publisher": "Ubisoft", "release_date": "May 13 2021", "developers": ["Ubisoft Bordeaux"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "genres": ["Action Adventure", "Open-World"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/c79593d07af976ae70ac680ba39d1961-98.jpg", "descriptions": "Explore the haunted wilds and beautiful landscapes of Ireland as you battle a druidic cult known as the Children of Danu. Conquer ring forts, master the art of smuggling, and gain the favor of Gaelic kings in a new open-world adventure."}, {"name": "Orcs Must Die! 3", "details_link": "https://www.metacritic.com/game/stadia/orcs-must-die!-3", "release_date": "Jul 14 2020", "developers": ["Robot Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Stadia"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/3b70d4005e48924a37eab4d34605e162-98.jpg", "descriptions": "Orcs Must Die! 3 ushers orc-slaying mayhem to a previously unimaginable scale. All new War Scenarios pit players and their friends against the largest orc armies ever assembled. Mountable War Machines give players the essential firepower to heave, stab, carbonize, and disarticulate theOrcs Must Die! 3 ushers orc-slaying mayhem to a previously unimaginable scale. All new War Scenarios pit players and their friends against the largest orc armies ever assembled. Mountable War Machines give players the essential firepower to heave, stab, carbonize, and disarticulate the abominable intruders. Orcs Must Die! 3 is the long-awaited successor to the award-winning series.… Expand"}, {"name": "Tak 2: The Staff of Dreams", "details_link": "https://www.metacritic.com/game/xbox/tak-2-the-staff-of-dreams", "publisher": "THQ", "release_date": "Oct 11 2004", "developers": ["Avalanche Software"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/15c47c19189949faec356c9589de4279-98.jpg", "descriptions": "Tak must learn new Juju magic to recover the Staff of Dreams and defeat Tlaloc once and for all. Now dabbling with new abilities, Tak can create a little Juju magic of his own. As Tak, try to master three new Jujus, expanded combat capabilities, and new weapons as you battle NightmareTak must learn new Juju magic to recover the Staff of Dreams and defeat Tlaloc once and for all. Now dabbling with new abilities, Tak can create a little Juju magic of his own. As Tak, try to master three new Jujus, expanded combat capabilities, and new weapons as you battle Nightmare creatures. Interact with familiar characters from the series, along with Jibolba's brother, JB. Multiplayer \"Dinky\" games let you face off in head-to-head action with playable characters from Tak's world.… Expand"}, {"name": "Battlefield V", "details_link": "https://www.metacritic.com/game/playstation-4/battlefield-v", "publisher": "Electronic Arts", "release_date": "Nov 15 2018", "developers": ["EA DICE"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 73, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/0/40be7fd07d02ac64677468703236fa4b-98.jpg", "descriptions": "Enter mankind's greatest conflict with Battlefield 5 as the series goes back to its roots with a never-before-seen portrayal of World War 2. Lead your squad to victory with new ways to turn the battlefield to your advantage. Assemble your Company of customized soldiers, weapons, and vehiclesEnter mankind's greatest conflict with Battlefield 5 as the series goes back to its roots with a never-before-seen portrayal of World War 2. Lead your squad to victory with new ways to turn the battlefield to your advantage. Assemble your Company of customized soldiers, weapons, and vehicles then take them on an epic journey through the Tides of War. Experience the most intense, immersive Battlefield yet. You will never be the same.… Expand"}, {"name": "Nebuchadnezzar", "details_link": "https://www.metacritic.com/game/pc/nebuchadnezzar", "publisher": "Nepos Games", "release_date": "Feb 17 2021", "developers": ["Nepos Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/c2c7db2b78a16f5da037c92d97a587ed-98.jpg", "descriptions": "Nebuchadnezzar is a classic isometric city builder game inviting players to experience the mysterious history and culture of ancient Mesopotamia. In the campaign, players get to rule over influential historical cities filled with magnificent monuments."}, {"name": "Tesla vs Lovecraft", "details_link": "https://www.metacritic.com/game/pc/tesla-vs-lovecraft", "publisher": "10tons", "release_date": "Jan 26 2018", "developers": ["10tons"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 73, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/c0206455f2af1cf2b66b1f8e441a6cc2-98.jpg", "descriptions": "Tesla vs Lovecraft is an intense top-down twin stick arena shooter. Play as the enigmatic inventor Nikola Tesla harnessing the static energy to power up Tesla-Mech and give the lovecraftian nightmares a lesson in horror!\r Tesla vs Lovecraft is a top-down twin stick shooter with goal basedTesla vs Lovecraft is an intense top-down twin stick arena shooter. Play as the enigmatic inventor Nikola Tesla harnessing the static energy to power up Tesla-Mech and give the lovecraftian nightmares a lesson in horror!\r Tesla vs Lovecraft is a top-down twin stick shooter with goal based levels. The games highlight features are Quantum Teleportation, which allows the player to warp short distances even through solid objects, and the Tesla-Mech, which provides the player an immense boost to firepower for a limited time.\r Genre hallmarks such as a large arsenal of weapons, a multitude of player empowering perks, monster crushing powerups, and secondary weapon abilities are also included.… Expand"}, {"name": "Yo-kai Watch 2: Psychic Specters", "details_link": "https://www.metacritic.com/game/3ds/yo-kai-watch-2-psychic-specters", "publisher": "Nintendo", "release_date": "Sep 29 2017", "developers": ["Level 5"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 73, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/73e84d1badf9c0dd4ec67f6b397889e4-98.jpg", "descriptions": "Get wicked and complete the ultimate YO-KAI WATCH experience.The strange but friendly troublemakers, Yo-kai, are back in a time-traveling adventure, and this time their mysterious world is packed with exclusive quests, Wicked Yo-kai to befriend, new areas to explore, and a revampedGet wicked and complete the ultimate YO-KAI WATCH experience.The strange but friendly troublemakers, Yo-kai, are back in a time-traveling adventure, and this time their mysterious world is packed with exclusive quests, Wicked Yo-kai to befriend, new areas to explore, and a revamped Blasters action co-op mode* featuring new bosses.As the cause of life's troubles, Yo-kai are hiding everywhere! Explore the seaside town San Fantastico and the sleepy village Harrisville in search of these mischievous beings. Then travel 60 years into the past with Hovernyan to ensure the Yo-kai Watch Model Zero is created and your timeline is preserved! Battle online or via local wireless to earn in-game rewards for your adventure. Or take control of a Yo-kai in Psychic Blasters, a revamped 4-player action mode! If you own the YO-KAI WATCH 2: Bony Spirits or YO-KAI WATCH 2: Fleshy Souls game, you can transfer save data from your Nintendo 3DS family system to YO-KAI WATCH 2: Psychic Specters and pick up where you left off. Prepare yourself for the deepest and most immersive Yo-kai experience yet!* Embark on an epic adventure in Springdale with more than 350 Yo-kai to discover and befriend* Assemble and summon your team of 6 Yo-kai from your Yo-kai Watch to battle troublemaking Yo-kai, solve people's problems, and fight to end a civil war between competing Yo-kai factions* Travel back in time to discover the origin of the Yo-kai Watch and meet Classic Yo-kai from 60 years ago* For the first time, befriend Yo-kai from the Wicked Tribe as well as Boss Yo-kai and other Yo-kai exclusive to this ultimate version* Discover exclusive quests, such as the secret pasts of Darknyan, Dame Dedtime, and Whisper* Hop on the Hexpress train and explore new locations, including a Yo-kai amusement park, hot springs, and kabuki theater* Team up in an expanded version of the Yo-kai Watch Blasters local co-op mode, with powerful new bosses to defeat* Challenge your friend's team over the Internet or local wireless in 2-player multiplayer battles* Transfer game data from YO-KAI WATCH 2: Bony Spirits or YO-KAI WATCH 2: Fleshy Souls to YO-KAI WATCH 2: Psychic Specters and play from where you left off* Connect with YO-KAI WATCH 2: Bony Spirits or YO-KAI WATCH 2: Fleshy Souls to YO-KAI WATCH 2: Psychic Specters to unlock exclusive dungeons, stronger bosses, and special gleaming Yo-kai… Expand"}, {"name": "Life is Strange: Episode 2 - Out of Time", "details_link": "https://www.metacritic.com/game/xbox-one/life-is-strange-episode-2---out-of-time", "publisher": "Square Enix", "release_date": "Mar 25 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "General"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/0cd78961351b1b4c8b33f2073223f234-98.jpg", "descriptions": "Reunited with her friend Chloe, Max begins experimenting with her power and starts to wonder if it is related to her visions or the weird snow from the previous day. But life goes on in Blackwell Academy and a certain viral video has become a serious topic of discussion. Meanwhile, what DIDReunited with her friend Chloe, Max begins experimenting with her power and starts to wonder if it is related to her visions or the weird snow from the previous day. But life goes on in Blackwell Academy and a certain viral video has become a serious topic of discussion. Meanwhile, what DID happen to Rachel Amber? … Expand"}, {"name": "Scrolls", "details_link": "https://www.metacritic.com/game/pc/scrolls", "publisher": "Mojang AB", "release_date": "Dec 12 2014", "developers": ["Mojang AB"], "platforms": "PC", "genres": ["Action", "General", "Miscellaneous", "Card Battle", "Strategy", "Turn-Based", "Card Battle"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/7773a111efe118f04e5823148211bbdc-98.jpg", "descriptions": "Scrolls is Mojang's next game and offers a new and unique game play where you fight to outmaneuver your opponent on the battlefield using the destructive powers in your collection of magical scrolls. Tear your opponent limb from limb with the might of your summoned armies, lay waste to theScrolls is Mojang's next game and offers a new and unique game play where you fight to outmaneuver your opponent on the battlefield using the destructive powers in your collection of magical scrolls. Tear your opponent limb from limb with the might of your summoned armies, lay waste to the defenses with the obliterating power of your siege weapons or open up the very skies and let bolts of lightning shower his minions until only ash remains. The road to victory is yours to choose. Obtain the powerful scrolls and decide which ones you will take to battle as you fight to become the mightiest Magician of all.… Expand"}, {"name": "Sniper Elite III: Ultimate Edition", "details_link": "https://www.metacritic.com/game/switch/sniper-elite-iii-ultimate-edition", "publisher": "Rebellion", "release_date": "Oct  1 2019", "developers": ["Rebellion"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Switch"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/2d664d666dc119db3da8a1316aa4a017-98.jpg", "descriptions": "This ULTIMATE EDITION contains the thrilling main game as well as 9 additional DLC packs, including the biggest environments yet in SAVE CHURCHILL  Parts 1, 2 and 3 and 6 WEAPONS PACKS  CAMOUFLAGE, SNIPER, EASTERN FRONT, HUNTER, AXIS and PATRIOT. Includes free updates to main game  6 newThis ULTIMATE EDITION contains the thrilling main game as well as 9 additional DLC packs, including the biggest environments yet in SAVE CHURCHILL  Parts 1, 2 and 3 and 6 WEAPONS PACKS  CAMOUFLAGE, SNIPER, EASTERN FRONT, HUNTER, AXIS and PATRIOT. Includes free updates to main game  6 new MULTIPLAYER MAPS, CAPTURE THE FLAG mode, TWILIGHT STRIKE Co-Op Mission, and SHOOTING RANGE.… Expand"}, {"name": "Phantom Doctrine", "details_link": "https://www.metacritic.com/game/playstation-4/phantom-doctrine", "publisher": "Good Shepherd Entertainment", "release_date": "Aug 14 2018", "developers": ["CreativeForge Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/a5a7eb09abc14ec8b8176e4e7f531f1a-98.jpg", "descriptions": "The year is 1983. The world teeters on the verge of destruction as the Cold War tightens its icy grip. East or West: trust no one, question everything. The fate of humanity rests in your hands as you pit spy versus spy in tactical Phantom Doctrine."}, {"name": "When Vikings Attack!", "details_link": "https://www.metacritic.com/game/playstation-vita/when-vikings-attack!", "publisher": "SCEA", "release_date": "Nov  6 2012", "developers": ["Clever Beans"], "platforms": ["PlayStation 3", "PlayStation Vita"], "genres": ["Action", "General", "General", "Beat-'Em-Up", "3D"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/0cfb7c76054a9d07255f5ec040aa7500-98.jpg", "descriptions": "In this all-action fighting adventure, a battalion of Viking invaders, 1200 years late to the party, are causing havoc in your town. Imagine getting together a posse of local citizens: a construction worker, a butcher, a policeman, a pastor, and a schoolboy, then ripping up a phone booth orIn this all-action fighting adventure, a battalion of Viking invaders, 1200 years late to the party, are causing havoc in your town. Imagine getting together a posse of local citizens: a construction worker, a butcher, a policeman, a pastor, and a schoolboy, then ripping up a phone booth or picking up a car,and hurling it at the advancing Viking hordes. That's the sort of crazy action you can expect in this totally new and original PSN title for PS3 and PS Vita.… Expand"}, {"name": "ArmA II: Operation Arrowhead", "details_link": "https://www.metacritic.com/game/pc/arma-ii-operation-arrowhead", "publisher": "Meridian4", "release_date": "Jun 29 2010", "developers": ["Bohemia Interactive"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 73, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/629c02ed301d88eaad628b252722960d-98.jpg", "descriptions": "Three years after the conflict in Chernarus, portrayed in the original Arma 2, a new flashpoint in the Green Sea region heats up and coalition forces led by the US Army are sent to Takistan  to quickly restore peace and prevent further civilian casualties in this standalone expansion pack toThree years after the conflict in Chernarus, portrayed in the original Arma 2, a new flashpoint in the Green Sea region heats up and coalition forces led by the US Army are sent to Takistan  to quickly restore peace and prevent further civilian casualties in this standalone expansion pack to the best military simulator of 2009 – Arma 2. [Bohemia Interactive]… Expand"}, {"name": "Wasteland 3: The Battle of Steeltown", "details_link": "https://www.metacritic.com/game/pc/wasteland-3-the-battle-of-steeltown", "publisher": "Deep Silver", "release_date": "Jun  3 2021", "developers": ["InXile Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Role-Playing", "Western-Style"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/5993131ceccf484942c58dc3f5e83c7d-98.jpg", "descriptions": "The towering factory complex of Steeltown manufactures all the tech that keeps Colorado running and the Patriarch in power—trucks, armor, weapons, and robots. But deliveries from Steeltown have stopped cold, and all the Patriarch is getting from Abigail Markham—Steeltown's leader—areThe towering factory complex of Steeltown manufactures all the tech that keeps Colorado running and the Patriarch in power—trucks, armor, weapons, and robots. But deliveries from Steeltown have stopped cold, and all the Patriarch is getting from Abigail Markham—Steeltown's leader—are excuses. When he sends the Rangers to investigate, they find the place is a powder keg with the fuse already lit. The workers are striking, bandits raid with impunity, and nobody is allowed through the gates, not even on the business of the Patriarch. Without help, Steeltown could crash and burn for good, and take Markham with it—but maybe that's just what it needs. The Rangers will have to decide that for themselves.… Expand"}, {"name": "The Legend of Bum-bo", "details_link": "https://www.metacritic.com/game/pc/the-legend-of-bum-bo", "publisher": "Edmund McMillen", "release_date": "Nov 12 2019", "developers": ["James Interactive"], "platforms": ["PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Strategy", "General"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/028e578ce9a5871bf7a1907ab1f007a0-98.jpg", "descriptions": "A puzzle based deck building rogue-like prequel to The Binding of Isaac... Made of cardboard."}, {"name": "Assassin's Creed Origins: The Hidden Ones", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-origins-the-hidden-ones", "publisher": "Ubisoft", "release_date": "Jan 23 2018", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Miscellaneous", "Action Adventure", "Edutainment", "Open-World"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/2224b1374819385b00cc5c8f51143afb-98.jpg", "descriptions": "In The Hidden Ones, Bayek and his newly formed Assassins clash with Roman forces in a brand-new region, the Sinaï."}, {"name": "Typoman: Revised", "details_link": "https://www.metacritic.com/game/xbox-one/typoman-revised", "publisher": "Brainseed Factory", "release_date": "Feb 17 2017", "developers": ["Brainseed Factory"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/31d88cd3cfe8ad35662098f3f4d521b8-98.jpg", "descriptions": "Typoman is a 2D puzzle platformer. You slip into the role of a character made of letters, struggling to make your way through a dark and hostile world. Despite your small stature you have a powerful gift: You can craft words to alter your environment. But choose your words wisely - they canTypoman is a 2D puzzle platformer. You slip into the role of a character made of letters, struggling to make your way through a dark and hostile world. Despite your small stature you have a powerful gift: You can craft words to alter your environment. But choose your words wisely - they can either be a blessing ...or a curse!… Expand"}, {"name": "Just Dance 2016", "details_link": "https://www.metacritic.com/game/playstation-4/just-dance-2016", "publisher": "Ubisoft", "release_date": "Oct 20 2015", "developers": ["Ubisoft"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action", "Rhythm", "Dancing"], "meta_score": 73, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/68dfe7d8826c81168253eb8bf429987a-98.jpg", "descriptions": "Bust some moves to \"Uptown Funk\" by Mark Ronson ft. Bruno Mars and feel the beats in \"All About That Bass\" by Meghan Trainor."}, {"name": "Baboon!", "details_link": "https://www.metacritic.com/game/playstation-vita/baboon!", "publisher": "Relevo", "release_date": "Jan 28 2015", "developers": ["Relevo"], "platforms": ["PlayStation 4", "PlayStation Vita"], "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/3de4db21aae525ecba05f7361a1427be-98.jpg", "descriptions": "Baboon! explores a mix of genres, from platform to puzzles, dexterity and physics with a healthy dose of adventure. Test your skill helping Tumbili reach the top and collect all the bananas. The dread Pirate Baboon is wrecking havoc in Banana Island. Help the brave little monkey TumbiliBaboon! explores a mix of genres, from platform to puzzles, dexterity and physics with a healthy dose of adventure. Test your skill helping Tumbili reach the top and collect all the bananas. The dread Pirate Baboon is wrecking havoc in Banana Island. Help the brave little monkey Tumbili travel through an exotic island filled with Pirate Monkeys, Flying Penguins and all shorts of wacky characters on a sprawling adventure. Can you unlock every secret? [Sony]… Expand"}, {"name": "Pokemon Colosseum", "details_link": "https://www.metacritic.com/game/gamecube/pokemon-colosseum", "publisher": "Nintendo", "release_date": "Mar 22 2004", "developers": ["Genius Sonority Inc."], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/5808ea93d980d8d301a7dcc11859dac0-98.jpg", "descriptions": "Pokémon fans can now battle their favorite Pokémon on the grand stage.  Starring a brand new leading character, Pokémon, Colosseum offers a story mode that pits you against tough trainers who routinely catch damaged Pokémon.  In Battle mode, you can use the GamePokémon fans can now battle their favorite Pokémon on the grand stage.  Starring a brand new leading character, Pokémon, Colosseum offers a story mode that pits you against tough trainers who routinely catch damaged Pokémon.  In Battle mode, you can use the Game Boy Advance cable to send your team from your Pokémon Ruby or Pokémon Sapphire Game Pak to your Gamecube, then witness the true potential of your team.  Rescue Pokémon and watch them come to life in spectacular Colosseum battles.  … Expand"}, {"name": "Pitfall: The Lost Expedition", "details_link": "https://www.metacritic.com/game/xbox/pitfall-the-lost-expedition", "publisher": "Activision", "release_date": "Feb 18 2004", "developers": ["Edge of Reality"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/70668eb4cb7f11c652de2a72debf85c4-98.jpg", "descriptions": "Delving deep in the Peruvian Jungle, you assume the role of Pitfall Harry--a fearless, rough-and-ready treasure seeker who battles evil using his athletic ability and a knapsack filled with adventure gear.  Your mission: Race against a rival explorer to find hidden treasures, which couldDelving deep in the Peruvian Jungle, you assume the role of Pitfall Harry--a fearless, rough-and-ready treasure seeker who battles evil using his athletic ability and a knapsack filled with adventure gear.  Your mission: Race against a rival explorer to find hidden treasures, which could spell doom for you and your friends if they fall into the wrong hands.  The game challenges you to explore an obstacle-filled world featuring over 50 perilous levels, including lush rainforests, creature-ridden caves and vast glacial mountains.  You'll be swinging on vines, avoiding crocodiles and dodging rolling logs as you unearth artifacts and use your cunning to defeat dangerous foes.  … Expand"}, {"name": "kill.switch", "details_link": "https://www.metacritic.com/game/playstation-2/killswitch", "publisher": "Namco", "release_date": "Oct 28 2003", "developers": ["Namco"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/76451a3dad4f02a898982091d6b9f823-98.jpg", "descriptions": "In a world on the brink of global conflict, you find yourself back on the front lines of battle. Only this time, you're not here to prevent a war... You're here to start one. Offensive Cover System: Dynamically use your environment as cover - conform to objects and terrain, popping out toIn a world on the brink of global conflict, you find yourself back on the front lines of battle. Only this time, you're not here to prevent a war... You're here to start one. Offensive Cover System: Dynamically use your environment as cover - conform to objects and terrain, popping out to fire from protected positions. Blindfire: Lay down suppressing fire without even looking! Sophisticated AI: Your enemies use all of the same tactics available to you, including cover and blindfire, but also communicate and work as teams to take you down. 18 Action-Packed Scenarios:Compelling story-driven campaign featuring diverse missions and objectives that span the globe. [Namco]… Expand"}, {"name": "Pride FC: Fighting Championships", "details_link": "https://www.metacritic.com/game/playstation-2/pride-fc-fighting-championships", "publisher": "THQ", "release_date": "Feb 11 2003", "developers": ["Anchor (Legacy)"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 73, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/63b21c5e209c206358a80550b09393f7-98.jpg", "descriptions": "The most realistic \"No Holds Barred\" fighting videogame for the PS2. Fighters are accurately recreated in amazing detail with appearance, fighting style, movements and signature ring entrances. Various combat elements capture the intensity and authenticity of a Pride contest includingThe most realistic \"No Holds Barred\" fighting videogame for the PS2. Fighters are accurately recreated in amazing detail with appearance, fighting style, movements and signature ring entrances. Various combat elements capture the intensity and authenticity of a Pride contest including multiple fighting positions, unique fighting styles, hundreds of moves, counters and reversals. With a TV-style presentation, each match-up comes to life in fully scaled arenas complete with ring announcers, lighting, pyrotechnics and realistic camera angles. [THQ]… Expand"}, {"name": "Rally Fusion: Race of Champions", "details_link": "https://www.metacritic.com/game/playstation-2/rally-fusion-race-of-champions", "publisher": "Activision", "release_date": "Nov 11 2002", "developers": ["Climax Group"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/0afe3b92a728343aa54e429540ca0cac-98.jpg", "descriptions": "Tear up the terrain in mudslinging, arcade-style gameplay, driving 19 fully licensed rally cars from top manufacturers, including Toyota, Audi and Saab - all as featured in the annual \"Race of Champions\" event. Race on 24 varied, tough tracks through expansive, fully interactive andTear up the terrain in mudslinging, arcade-style gameplay, driving 19 fully licensed rally cars from top manufacturers, including Toyota, Audi and Saab - all as featured in the annual \"Race of Champions\" event. Race on 24 varied, tough tracks through expansive, fully interactive and destructible environments. [Activision]… Expand"}, {"name": "Sled Storm", "details_link": "https://www.metacritic.com/game/playstation-2/sled-storm", "publisher": "Electronic Arts", "release_date": "Mar 11 2002", "developers": ["Electronic Arts"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Snow / Water"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/1b499f352394a83c4e6fca767a6db713-98.jpg", "descriptions": "On the edge of your seat, experience the white-knuckle thrill of trying to harness the power of over-engineered sleds all the way to the finish line. Race beyond boundaries in this all-out world of high-powered sled racing where speed is a necessity and losing is not an option. SledStormOn the edge of your seat, experience the white-knuckle thrill of trying to harness the power of over-engineered sleds all the way to the finish line. Race beyond boundaries in this all-out world of high-powered sled racing where speed is a necessity and losing is not an option. SledStorm delivers on high speed, big drops and excessive inclines. Screaming sleds compete in volume with the biggest beats from the industrial charts, which is just what is needed to push you over the edge. Unique shortcuts, incredible track design and cutting-edge machines take you into worlds of neck-and-neck arcade action. [Electronic Arts]… Expand"}, {"name": "Motor City Online", "details_link": "https://www.metacritic.com/game/pc/motor-city-online", "publisher": "EA Games", "release_date": "Oct 29 2001", "developers": ["EA Games"], "platforms": "PC", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "Automobile"], "meta_score": 73, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/fc8705f2ae5af1b6cefbfff5a39af60a-98.jpg", "descriptions": "Build and race your own collection of custom hot rods with thousands of real people online! More than just a racing game, MCO is a virtual hot rod haven for gearheads, car lovers, and gamers alike! Make friends, join a club turf war, customize your dream car, battle racers from around theBuild and race your own collection of custom hot rods with thousands of real people online! More than just a racing game, MCO is a virtual hot rod haven for gearheads, car lovers, and gamers alike! Make friends, join a club turf war, customize your dream car, battle racers from around the world, and race your way to a reputation as the baddest rodder in Motor City. [Electronic Arts]… Expand"}, {"name": "Formula One 2001", "details_link": "https://www.metacritic.com/game/playstation-2/formula-one-2001", "publisher": "SCEA", "release_date": "Sep 24 2001", "developers": ["Studio Liverpool"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Formula One"], "meta_score": 73, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/cc97e1aab8eb39ac7b11083de8257fa7-98.jpg", "descriptions": "The follow-up to the 2001 game features all eleven teams, 22 drivers, and 17 tracks of the 2001 Formula One season."}, {"name": "Gauntlet: Dark Legacy", "details_link": "https://www.metacritic.com/game/playstation-2/gauntlet-dark-legacy", "publisher": "Midway", "release_date": "May  1 2001", "developers": ["Midway"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/7bd9ebda2d365d5536ab62ef7730ce1a-98.jpg", "descriptions": "Team up again as medieval warriors galavanting through 20 worlds in this classic arcade hack 'n slash, button-masher which makes a stop on the PS2."}, {"name": "Dave Mirra Freestyle BMX", "details_link": "https://www.metacritic.com/game/pc/dave-mirra-freestyle-bmx", "publisher": "Acclaim", "release_date": "Dec 15 2000", "developers": ["Z-Axis", "Ltd."], "platforms": "PC", "num_players": "1 Player", "genres": ["Sports", "Alternative", "Individual", "Biking", "Biking"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/69e5d1e49275a6558018b2ab8c8886b7-98.jpg", "descriptions": "Dave Mirra Freestyle BMX can be fun, but the occasional problems with the graphics and collision detection can quickly become a source of unnecessary frustration."}]