[{"name": "Pac-Man Museum", "details_link": "https://www.metacritic.com/game/xbox-360/pac-man-museum", "publisher": "Namco Bandai Games", "release_date": "Feb 26 2014", "developers": ["Namco Bandai Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Miscellaneous", "General", "Compilation", "Compilation"], "meta_score": 64, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/5/15f87987903b230c7fc848065aa92449-98.jpg", "descriptions": "PAC-MAN, the yellow 80's icon with a voracious appetite that has transcended generation upon generation of gamers, stars in this nostalgia-packed collection of games. In the game, players will need to skilfully dodge and juke troublesome ghosts while gobbling up all the pac-dots and powerPAC-MAN, the yellow 80's icon with a voracious appetite that has transcended generation upon generation of gamers, stars in this nostalgia-packed collection of games. In the game, players will need to skilfully dodge and juke troublesome ghosts while gobbling up all the pac-dots and power pellets lying in their path. PAC-MAN MUSEUM will include classic PAC-MAN titles as well as newer arcade releases, allowing gamers to play through the evolution of PAC-MAN from his humble beginnings from 1980 through 2008's critically acclaimed PAC-MAN Championship Edition and 2010's arcade smash-hit PAC-MAN Battle Royale.… Expand"}, {"name": "Command & Conquer: Red Alert 3 - Uprising", "details_link": "https://www.metacritic.com/game/pc/command-conquer-red-alert-3---uprising", "publisher": "Electronic Arts", "release_date": "Mar 12 2009", "developers": ["EA LA"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 64, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/d2dc8b8f62df635a9a017e7e02a0cd0b-98.jpg", "descriptions": "An epic single-player campaign expansion, this standalone title catapults players deeper into the Red Alert universe, giving them more of the action-packed gameplay they have been clamoring for, while offering a gauntlet of new and compelling challenges with the new Commander’s ChallengeAn epic single-player campaign expansion, this standalone title catapults players deeper into the Red Alert universe, giving them more of the action-packed gameplay they have been clamoring for, while offering a gauntlet of new and compelling challenges with the new Commander’s Challenge mode. Command & Conquer Red Alert 3: Uprising takes players into the aftermath of the epic battles in Red Alert 3, with the Soviets still reeling from a crushing defeat, the Empire of the Rising Sun desperately trying to regain both honor and identity and the seemingly victorious Allies finding themselves in the midst of corruption and deceit within their own ranks. In addition to four mini-campaigns, one for each faction and one bonus campaign centered on the origins of the Empire of the Rising Sun’s commando Yuriko, Command & Conquer Red Alert 3: Uprising will also introduce the new Commander’s Challenge, enabling the players to test their skills against a set of nine commanders from different territories and difficulty levels in 50 unique challenges with their own special rules and unique conditions. In true Command & Conquer fashion, top Hollywood talent will be delivering the gripping story in full HD live-action cinematics.  Fan favorites Gemma Atkinson and Ivana Milicevic will make their stunning return to the high ranks of the Allied and Soviet leaderships and will be joined by an all new set of stars, who will be announced soon. [Electronic Arts]… Expand"}, {"name": "Alien Breed 3: Descent", "details_link": "https://www.metacritic.com/game/playstation-3/alien-breed-3-descent", "publisher": "Team17", "release_date": "Feb 22 2011", "developers": ["Team17"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 64, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/2/a71a27fe882bae46c81e394927f231d9-98.jpg", "descriptions": "With Alien Breed 3: Descent, gamers can fight to the conclusion of the latest trilogy."}, {"name": "Mario Sports Mix", "details_link": "https://www.metacritic.com/game/wii/mario-sports-mix", "publisher": "Nintendo", "release_date": "Feb  7 2011", "developers": ["Square Enix"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Sports", "General", "General"], "meta_score": 64, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/7d4eb4c7324632727c454c480cad9f54-98.jpg", "descriptions": "A variety of sports games featuring your favorite Nintendo characters."}, {"name": "Maid of Sker", "details_link": "https://www.metacritic.com/game/playstation-4/maid-of-sker", "publisher": "Wales Interactive", "release_date": "Jul 28 2020", "developers": ["Wales Interactive"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 64, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/052b9910c22505301e414577908a7ecc-98.jpg", "descriptions": "Maid of Sker is a first-person survival horror, set in a remote hotel with a gory and macabre history from British folklore. Brave the nightmares of the Quiet Ones. Do not panic…don’t even breathe!"}, {"name": "Dr. Kawashima's Brain Training for Nintendo Switch", "details_link": "https://www.metacritic.com/game/switch/dr-kawashimas-brain-training-for-nintendo-switch", "publisher": "Nintendo", "release_date": "Jan  3 2020", "developers": ["Nintendo"], "platforms": "Switch", "genres": ["Miscellaneous", "Edutainment"], "meta_score": 64, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/24ff1173cd5d1cef0bad998f3cf69cd6-98.jpg", "descriptions": "Get ready to challenge your brain in a variety of ways in Dr Kawashima’s Brain Training for Nintendo Switch. Enjoy new exercises, some of them making use of the right Joy-Con’s IR Motion Camera*, or tap and train with classic exercises from past Brain Training games that you can play using aGet ready to challenge your brain in a variety of ways in Dr Kawashima’s Brain Training for Nintendo Switch. Enjoy new exercises, some of them making use of the right Joy-Con’s IR Motion Camera*, or tap and train with classic exercises from past Brain Training games that you can play using a stylus (included with the packaged version from retail stores) or your finger. It’s in your hands.… Expand"}, {"name": "SwapQuest", "details_link": "https://www.metacritic.com/game/playstation-vita/swapquest", "publisher": "Constantin Graf", "release_date": "Feb 23 2016", "developers": ["Constantin Graf"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "PlayStation Vita"], "genres": ["Action", "Role-Playing", "General", "Japanese-Style"], "meta_score": 64, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/da0c2c1ed2acfc9f18e12abf9d605bac-98.jpg", "descriptions": "SwapQuest is a captivating new mix of easy-to-learn puzzle mechanics and old-school RPG elements."}, {"name": "TRON RUN/r", "details_link": "https://www.metacritic.com/game/playstation-4/tron-runr", "publisher": "Disney Interactive Studios", "release_date": "Feb 16 2016", "developers": ["Sanzaru Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Platformer", "3D"], "meta_score": 64, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/31cb6372e0faf5ab22ecd774584bd425-98.jpg", "descriptions": "In TRON RUN/r, a new lightning fast, action-adventure runner set in the world of TRON, players will blaze through dynamic circuits, facing-off against virulent adversaries while taking on all challengers."}, {"name": "Phantom Breaker: Battle Grounds", "details_link": "https://www.metacritic.com/game/pc/phantom-breaker-battle-grounds", "publisher": "Degica", "release_date": "Jan 23 2015", "developers": ["Mages."], "platforms": ["PlayStation Vita", "Xbox 360", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/b3a5b67b5cf48cc147c897a9b374b483-98.jpg", "descriptions": "Phantom Breaker: Battle Grounds. Enjoy fast and frantic arcade-style beat 'em up gameplay with cute characters. Beat up hordes of weird enemies with awesome special attacks. Local co-op and PVP supported for up to 4 players."}, {"name": "Jet Car Stunts", "details_link": "https://www.metacritic.com/game/playstation-vita/jet-car-stunts", "publisher": "Grip Games", "release_date": "Oct  7 2014", "developers": ["True Axis"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation Vita"], "genres": ["Action", "Racing", "General", "Arcade", "Automobile"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/01ccab98f3623f7770f08fa3ab29a55c-98.jpg", "descriptions": "------ Apple: Best Games of 2009 ----- AppModo: \"truly one of the best iPhone games\" ----- PocketFullOfApps: \"An absolute must have game!\" ----------- Customer: \"and I thought doodle jump was addictive\" ----- Many Customers: \"Best\" and------ Apple: Best Games of 2009 ----- AppModo: \"truly one of the best iPhone games\" ----- PocketFullOfApps: \"An absolute must have game!\" ----------- Customer: \"and I thought doodle jump was addictive\" ----- Many Customers: \"Best\" and \"Ever\"Jet Car Stunts is an award winning, over the top, adrenaline rush, 3D driving game, with massive jumps, mid-air hoops, floating platforms, spiral roadways and outlandish maneuvers in impossible environments. The original levels, tight controls and fast, smooth, addictive game play has landed Jet Car Stunts on many \"Best of 2009\" lists.**** Profesional Reviews ****(5/5) AppSmile: \"one of the best iDevice games we've ever played\"(5/5) TouchGen: \"I've played hundreds of games on my iPhone, and I can honestly say that this is the most fun I've had, thus far!\"(10/10) PocketFullOfApps: \"An absolute must have game!\"(5/5) apphunter.net - \"The controls are easy to master and the visual effects are simply stunning\"(4.6/5) AppVee: \"I recommend it\"(8/10) PocketGamer.co.uk: \"amazingly fun\"(9/10) IGN - \"excellent controls, a great drift mechanic\" - \"an amazing iPhone racer that you should absolutely buy\"(5/5) TouchArcade: \"Jet Car Stunts has really set the bar high in both visual appeal and handling\"(4/4) SlideToPlay: \"a thrill ride\" (5/5) AppAdvice: \"this one is a tight gripping, brow sweating, stunt filled marathon that you’ll enjoy every minute of\" - \"Jet Car Stuns is one experience everyone idevice owner should have\"(5/5) touchreviews.net: \"enough content in Jet Car Stunts to keep you playing the game again and again\"(5/5) AppSafari: \"truly one of the best racing games I’ve ever played\"(4.6/5) AppSpy: \"poetry in motion\"(4.5/5) iphoneachievements.org: \"simply magnificent\"(9.99/10) IpwnAge: \"the BEST app I've ever reviewed\"TheAppera: \"It’s a great game, one of my personal favorites on iPhone\"AppModo: \"truly one of the best iPhone games\"**** Accolades ****Apple: Best Games of 2009TouchGen: Biggest Surprise 2009AppAdvice: #5 in Top 100 iPhone Games through 2009PocketGamer.co.uk: Top 10 best iPhone games of 2009TouchArcade: Best iPhone Games November 2009TouchArcade: Best iPod Touch and iPhone Games: 2009IGN.COM: Game of the Month: November 2009IGN.COM Editors Choice AwardIGN.COM: #8 in The Top 25 iPhone GamesBestAppEver Awards: 3rd Place award for Best Racing Game**** Features ****- The smoothest, fastest game play of any App Store driving game. Perfectly smooth on 1st Gen iPhones and iPods.- The tightest, most responsive, yet most forgiving accelerometer driving controls in existence.- Smash Physics.- 36 insane tracks. Each track offers something new.- NEW: 26 new downloadable tracks available with an 'in app purchase'. Even more insane driving then before.- NEW: 8 free downloadable tracks from Jet Car Stunts Lite.- Multiple play modes.- Jet assisted drift handling.- Half car, half jet with in-air control surfaces.- Online leaderboards, achievements, challenges and downloadable replays.**** 3 PLAY MODES ****- Platforming - The challenge is simple, just get to the end. Each track is more challenging then the last.- Time Trial - Race to reach the next check point before the time runs out. Beat your best time.- Ghost Racing - Race other people through challenges or by downloading replaysWith 25 challenging Platforming levels and 11 Time Trail levels, this is some of the best value you can find on the App Store.**** CONNECTIVITY ****Jet Car Stunts uses OpenFeint for online community, leaderboards with replays, achievements and challenges. So let's see who are the best players in the world, we dare you!… Expand"}, {"name": "The Mighty Quest for Epic Loot", "details_link": "https://www.metacritic.com/game/pc/the-mighty-quest-for-epic-loot", "publisher": "Ubisoft", "release_date": "Jun 10 2013", "developers": ["Ubisoft Montreal"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 64, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/5f6a7278769db80c508819fdeb003ded-98.jpg", "descriptions": "The Mighty Quest for Epic Loot is a free-to-play IP for the PC that thrusts players in an outrageous medieval fantasy world called Opulencia where wealth, status and showboating are the name of the game."}, {"name": "One Piece: Pirate Warriors", "details_link": "https://www.metacritic.com/game/playstation-3/one-piece-pirate-warriors", "publisher": "Namco Bandai Games", "release_date": "Sep 25 2012", "developers": ["Omega Force", "Tecmo Koei Games"], "platforms": "PlayStation 3", "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 64, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/1b54aa270a478163e6fb4a1fd8cbf6b7-98.jpg", "descriptions": "The first nautical outing for the ONE PIECE series on the PlayStation 3 system, ONE PIECE: PIRATE WARRIORS will immerse players in the Straw Hat Pirates' grand voyage around the globe, letting them face hordes of pirate and Marine enemies as well as experience all the great moments from theThe first nautical outing for the ONE PIECE series on the PlayStation 3 system, ONE PIECE: PIRATE WARRIORS will immerse players in the Straw Hat Pirates' grand voyage around the globe, letting them face hordes of pirate and Marine enemies as well as experience all the great moments from the anime from Orange Town through Marineford. Faithful to the original ONE PIECE manga by Eiichiro Oda, players will relive their favorite scenes controlling many of the beloved Straw Hat Pirates including; Luffy, Zoro, Nami, and others, each with their signature moves, including Luffy's Gum-Gum attacks. … Expand"}, {"name": "Scars Above", "details_link": "https://www.metacritic.com/game/playstation-5/scars-above", "publisher": "Deep Silver", "release_date": "Feb 28 2023", "developers": ["Mad Head Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 64, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/b146c47af3248f3f0b187e688761d5e8-98.jpg", "descriptions": "Something strange has entered Earth's orbit; an object alien and unknowable, made out of matter that seems not to obey the laws of physics - the Metahedron. As a part of a hastily gathered group of astronauts and scientists sent off to explore it, your fate takes a jarring turn as you awakenSomething strange has entered Earth's orbit; an object alien and unknowable, made out of matter that seems not to obey the laws of physics - the Metahedron. As a part of a hastily gathered group of astronauts and scientists sent off to explore it, your fate takes a jarring turn as you awaken in another world - dazed, alone on an alien planet... but determined to stay alive.  Scars Above is a challenging, immersive third-person shooter inspired by modern type action-adventure games. It takes the genre staples, such as the rewarding feeling of overcoming difficulty, and combines it with a compelling and intricate story, meticulous and lavish world design, and a living, breathing ecosystem to explore and endure.\r This is a game of mystery and discovery.… Expand"}, {"name": "Made in Abyss: Binary Star Falling into Darkness", "details_link": "https://www.metacritic.com/game/switch/made-in-abyss-binary-star-falling-into-darkness", "publisher": "Spike Chunsoft", "release_date": "Sep  2 2022", "developers": ["Spike Chunsoft", "Chime"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 64, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/4025e83198db9545d160d9cc5b05c377-98.jpg", "descriptions": "Take the Dive of Your Life! Made in Abyss, the breathtaking manga and anime series by Akihito Tsukushi, is getting its first ever video game adaptation! Experience the Anime's Story - The story begins with Riko and Reg's meeting in the first episode of season one. This marks the start ofTake the Dive of Your Life! Made in Abyss, the breathtaking manga and anime series by Akihito Tsukushi, is getting its first ever video game adaptation! Experience the Anime's Story - The story begins with Riko and Reg's meeting in the first episode of season one. This marks the start of their great adventure, and together they travel to Seeker Camp in the second layer of the Abyss. Experience the awesome power of the Curse of the Abyss, as well as the astonishing, legendary entities known as primeval creatures. Prepare to glimpse the world of Riko and her friends. Experience a Brand-New Story - Another story takes place many days after Riko and Reg depart for the Abyss. The world’s sole remaining, unconquered chasm, the Abyss, is the stage where many adventures are born...and disappear. Those who appear in these stories are mesmerized by the power of the Abyss and aim for the bottom of the netherworld. The story about to be told is of the adventures of a nameless Cave Raider in the Abyss.… Expand"}, {"name": "Dead by Daylight", "details_link": "https://www.metacritic.com/game/playstation-4/dead-by-daylight", "publisher": "505 Games", "release_date": "Jun 20 2017", "developers": ["505 Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 5 ", "genres": ["Action Adventure", "Survival"], "meta_score": 64, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/9/9ff896c11529159c8172d21d07a2eebb-98.jpg", "descriptions": "Dead by Daylight is a multiplayer (4vs1) horror game where one player takes on the role of the savage Killer, and the other four players play as Survivors, trying to escape the Killer and avoid being caught, tortured and killed. Survivors play in third-person and have the advantage of betterDead by Daylight is a multiplayer (4vs1) horror game where one player takes on the role of the savage Killer, and the other four players play as Survivors, trying to escape the Killer and avoid being caught, tortured and killed. Survivors play in third-person and have the advantage of better situational awareness. The Killer plays in first-person and is more focused on their prey. The Survivors' goal in each encounter is to escape the Killing Ground without getting caught by the Killer - something that sounds easier than it is, especially when the environment changes every time you play.… Expand"}, {"name": "Unreal II: The Awakening", "details_link": "https://www.metacritic.com/game/xbox/unreal-ii-the-awakening", "publisher": "Atari", "release_date": "Feb 10 2004", "developers": ["Tantalus"], "platforms": ["PC", "Xbox"], "num_players": "1-12 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 64, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/ade52cd2fc88bab88c3d608011d4f955-98.jpg", "descriptions": "The Unreal adventure continues with the release of the action shooter Unreal II: The Awakening.  Along the outer edge of space, you are plunged into a desperate mission to kill all comers--alien and otherwise--and prevent the awakening of an evil force.  Unreal II: The Awakening includesThe Unreal adventure continues with the release of the action shooter Unreal II: The Awakening.  Along the outer edge of space, you are plunged into a desperate mission to kill all comers--alien and otherwise--and prevent the awakening of an evil force.  Unreal II: The Awakening includes adrenaline-pumping destruction and impressive visuals in both solo levels and team multiplayer combat. Player-controlled vehicles add to the carnage, acting as both transport and heavy weaponry.  Now, through scorching heat, over icy terrain, and within eerie alien cities, are you ready to launch into battle?… Expand"}, {"name": "Pirates of the Caribbean", "details_link": "https://www.metacritic.com/game/pc/pirates-of-the-caribbean", "publisher": "Bethesda Softworks", "release_date": "Jun 30 2003", "developers": ["Akella"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 64, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/eb8c6cd647f2100f465dbd12eae556e9-98.jpg", "descriptions": "Designed as a thrilling blend of role-playing and action Pirates of the Caribbean takes place in a large group of Caribbean islands during the golden age of piracy and high seas adventure. You will take command of a ship and its crew, swordfight with other captains, accept and completeDesigned as a thrilling blend of role-playing and action Pirates of the Caribbean takes place in a large group of Caribbean islands during the golden age of piracy and high seas adventure. You will take command of a ship and its crew, swordfight with other captains, accept and complete daring quests, chase rumors of dangers and riches, and change allegiances amongst the colonial powers in the game. Through skill and daring, you will have the ability to obtain more power than the toughest captains in history ever dreamed possible. [Bethesda Softworks]… Expand"}, {"name": "World War II: Prisoner of War", "details_link": "https://www.metacritic.com/game/pc/world-war-ii-prisoner-of-war", "publisher": "Codemasters", "release_date": "Sep 30 2002", "developers": ["Wide Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Historic", "Historic", "Arcade"], "meta_score": 64, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/d02f292d30eb7fa55d5a0d959e396d82-98.jpg", "descriptions": "Prisoner of War captures the intrigue, danger and heroism of Allied escape attempts from prisoner of war camps during World War II, including Colditz - the Germans highest security \"escape-proof\" camp. Gameplay delivers a tense 3rd person stealth adventure game where bravery, stealth andPrisoner of War captures the intrigue, danger and heroism of Allied escape attempts from prisoner of war camps during World War II, including Colditz - the Germans highest security \"escape-proof\" camp. Gameplay delivers a tense 3rd person stealth adventure game where bravery, stealth and cunning will win the day. [Codemasters]… Expand"}, {"name": "Prisoner of War", "details_link": "https://www.metacritic.com/game/xbox/prisoner-of-war", "publisher": "Codemasters", "release_date": "Aug 26 2002", "developers": ["Wide Games"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Historic"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/9adb77208a48a051608d9ea13da9aab0-98.jpg", "descriptions": "Prisoner of War captures the intrigue, danger, and heroism of Allied escape attempts from prisoner of war camps during World War II, including Colditz--the Germans highest security \"escape-proof\" camp. As one of Germany's prisoners, Captain Stone, you'll embark on an adventurePrisoner of War captures the intrigue, danger, and heroism of Allied escape attempts from prisoner of war camps during World War II, including Colditz--the Germans highest security \"escape-proof\" camp. As one of Germany's prisoners, Captain Stone, you'll embark on an adventure across Germany in a variety of different POW camps. Outwit the German war machine by crawling through muddy tunnels and over stone walls and using disguises and makeshift equipment to escape. In this third-person adventure, bravery, stealth, and cunning will win the day.… Expand"}, {"name": "Fire Blade", "details_link": "https://www.metacritic.com/game/playstation-2/fire-blade", "publisher": "Midway", "release_date": "Jun 16 2002", "developers": ["Kuju Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Flight", "Helicopter"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/e02b7943b767d7e2b7400749c9505b6a-98.jpg", "descriptions": "In the cockpit of FireBlade there is one goal: use whatever means available to annihilate the terrorist cells flaming up around the globe. Battle through 18 Missions in 4 campaigns at the helm of the Carrier chopper or the Vendetta attack copter and unleash a barrage of hi-tech deadlyIn the cockpit of FireBlade there is one goal: use whatever means available to annihilate the terrorist cells flaming up around the globe. Battle through 18 Missions in 4 campaigns at the helm of the Carrier chopper or the Vendetta attack copter and unleash a barrage of hi-tech deadly weapons including Swarm Missiles, Sniper Cannons and Laser Guided Homing Missiles. Go turbo, or remain undetected from enemies in stealth mode. To win the war, you've got to end the war. Attack and destroy! [Midway]… Expand"}, {"name": "Spy Hunter", "details_link": "https://www.metacritic.com/game/game-boy-advance/spy-hunter", "publisher": "Midway", "release_date": "May 19 2002", "developers": ["Midway"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/3007d54d3e57dbd8014b6cb4dfd7fdb5-98.jpg", "descriptions": "The evil NOSTRA Corporation prepares to unleash havoc on the world, and only the SpyHunter is equipped to stop them. Get behind the wheel of the powerful G-6155 Interceptor, a vehicle that can transform into a boat, Jet Ski, or motorcycle. With an arsenal of both offensive and defensiveThe evil NOSTRA Corporation prepares to unleash havoc on the world, and only the SpyHunter is equipped to stop them. Get behind the wheel of the powerful G-6155 Interceptor, a vehicle that can transform into a boat, Jet Ski, or motorcycle. With an arsenal of both offensive and defensive weapons, you must elude NOSTRA spies, henchmen, and assassins at any cost. Hordes of air, ground, and water enemies pursue you as you try to save the world from the mind of a madman.… Expand"}, {"name": "The Simpsons Road Rage", "details_link": "https://www.metacritic.com/game/playstation-2/the-simpsons-road-rage", "publisher": "Electronic Arts", "release_date": "Nov 24 2001", "developers": ["Fox Interactive"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/2a7546bbb9818d73f058be436d81d6bb-98.jpg", "descriptions": "Mr. Burns is up to his greedy ways again, purchasing the Springfield Transit Corporation and jacking up the fares. Refusing to shell out the high rates, Springfield citizens are forced into humorous Simpsons \"road rage\" as they brave commuters, jam-packed back-routes and the challenge toMr. Burns is up to his greedy ways again, purchasing the Springfield Transit Corporation and jacking up the fares. Refusing to shell out the high rates, Springfield citizens are forced into humorous Simpsons \"road rage\" as they brave commuters, jam-packed back-routes and the challenge to make enough money to buy back the Transit Corporation before time runs out. No time for donuts, Homer. [Electronic Arts]… Expand"}, {"name": "Fortress", "details_link": "https://www.metacritic.com/game/game-boy-advance/fortress", "publisher": "Majesco Games", "release_date": "Aug 13 2001", "developers": ["Pipe Dream Interactive"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Strategy", "General"], "meta_score": 64, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/7fbef9e0eadd6bc920b64f00b10cf164-98.jpg", "descriptions": "Fortress is a FAST-ACTION strategy game where players build an endless variety of unique structures and compete against each other in an all out war to the end! Hurl Strone Age rocks during the days of the dinosaurs, engage in cannon fire from the Golden Age of Piracy to Medieval Times, andFortress is a FAST-ACTION strategy game where players build an endless variety of unique structures and compete against each other in an all out war to the end! Hurl Strone Age rocks during the days of the dinosaurs, engage in cannon fire from the Golden Age of Piracy to Medieval Times, and energize plasma projectiles in the world of tomorrow. Populate your fortress with a variety of humorous Twerp characters as you learn to unlock the secrets of the Wizard's Tower! Play alone or in head-to-head mode using the Game Boy Advance Game Link® cable feature.… Expand"}, {"name": "Assassin's Creed Chronicles: India", "details_link": "https://www.metacritic.com/game/xbox-one/assassins-creed-chronicles-india", "publisher": "Ubisoft", "release_date": "Jan 12 2016", "developers": ["Ubisoft", "Climax Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "Linear"], "meta_score": 64, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/17d7ace2fe44029194112294a9df614f-98.jpg", "descriptions": "Assassin's Creed Chronicles: India throws you into the tension between the Sikh Empire and the East India Company in 1841. When a Master Templar arrives with a mysterious item that used to belong to the Assassin Order, Arbaaz Mir must discover why he's come, steal back the item, and protectAssassin's Creed Chronicles: India throws you into the tension between the Sikh Empire and the East India Company in 1841. When a Master Templar arrives with a mysterious item that used to belong to the Assassin Order, Arbaaz Mir must discover why he's come, steal back the item, and protect his friends and his lover.… Expand"}, {"name": "Ancestors: The Humankind Odyssey", "details_link": "https://www.metacritic.com/game/pc/ancestors-the-humankind-odyssey", "publisher": "Panache Digital Games", "release_date": "Aug 27 2019", "developers": ["Panache Digital Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 64, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/72fef8edf2ad59a621135aecc46d647c-98.jpg", "descriptions": "Ancestors: The Humankind Odyssey is a third-person open world survival game from independent studio Panache Digital Games and published by Private Division. From Creative Director Patrice Désilets, experience the beauty and danger of Africa 10 million years ago as your hominid clan mustAncestors: The Humankind Odyssey is a third-person open world survival game from independent studio Panache Digital Games and published by Private Division. From Creative Director Patrice Désilets, experience the beauty and danger of Africa 10 million years ago as your hominid clan must Explore, Expand, and Evolve to survive over the course of 8 million years. Write your own unique story of human evolution and see if you can survive like our ancestors before us.… Expand"}, {"name": "WRC 9 FIA World Rally Championship", "details_link": "https://www.metacritic.com/game/switch/wrc-9-fia-world-rally-championship", "publisher": "Nacon", "release_date": "Mar 11 2021", "developers": ["KT Racing"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 64, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/7/7d19b49936804c5393e13f4b775597c8-98.jpg", "descriptions": "The WRC license is back and even better this year with WRC 9. Take part in the Calendar's 3 new rallies and challenge the community with the customisable league system. Then dive into the skin of a co-driver with the astonishing co-op mode."}, {"name": "Danger Zone", "details_link": "https://www.metacritic.com/game/xbox-one/danger-zone", "publisher": "Three Fields Entertainment", "release_date": "Oct 10 2017", "developers": ["Three Fields Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Racing", "General", "Arcade", "Vehicle", "Automobile", "Civilian"], "meta_score": 64, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/3/56eeff83e6e95890ed4b2f5f462d8b8b-98.jpg", "descriptions": "Welcome to the Danger Zone, a virtual crash testing facility where you're tasked to survive a variety of challenging and deadly scenarios. With real-world vehicle physics with explosive gameplay, your goal is to cause as much explosive and creative damage as possible. [Xbox.com]"}, {"name": "Dusty Revenge", "details_link": "https://www.metacritic.com/game/pc/dusty-revenge", "publisher": "PD Design Studio Pte Ltd", "release_date": "Jul  8 2013", "developers": ["PD Design Studio Pte Ltd"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 64, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/a3237901d28fa0726f9309f42e426575-98.jpg", "descriptions": "Dusty Revenge is a 2D action platformer where you play as Dusty, a duel weapon wielding warrior ready to face loads of outlawed criminals."}, {"name": "Guns of Icarus Online", "details_link": "https://www.metacritic.com/game/pc/guns-of-icarus-online", "publisher": "Muse Games", "release_date": "Oct 29 2012", "developers": ["Muse Games"], "platforms": "PC", "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 64, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/0db2ea7a1beec5de2ba1c9c8a1daa621-98.jpg", "descriptions": "Guns of Icarus Online is a multiplayer airship combat game where you will attempt to survive and thrive in the post apocalyptic wasteland, moving from town to town, trading and collecting resources, outfitting your ship, and battling deadly pirates.Visit the website for a look at ourGuns of Icarus Online is a multiplayer airship combat game where you will attempt to survive and thrive in the post apocalyptic wasteland, moving from town to town, trading and collecting resources, outfitting your ship, and battling deadly pirates.Visit the website for a look at our beautiful teaser and find out more about the game.… Expand"}, {"name": "Serious Sam: The Random Encounter", "details_link": "https://www.metacritic.com/game/pc/serious-sam-the-random-encounter", "publisher": "Devolver Digital", "release_date": "Oct 24 2011", "developers": ["Croteam", "Vlambeer"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "Shooter", "Japanese-Style", "First-Person", "Sci-Fi"], "meta_score": 64, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/cd6d80b4a26f2d3a2f3d5a23c88ee592-98.jpg", "descriptions": "Serious Sam: The Random Encounter is the third chapter of the series."}, {"name": "Hot Brain", "details_link": "https://www.metacritic.com/game/psp/hot-brain", "publisher": "Midway", "release_date": "Jun 18 2007", "developers": ["Creat Studios"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 64, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/9/6a6cf45e8f6ea642a0863133e8799219-98.jpg", "descriptions": "Fire up your mind with Hot Brain, a game that engages the mind through a series of puzzles and challenges designed to raise the activity and temperature of your brain. Hot Brain presents challenging and fun mental activities that help ignite your mind in areas like logic, memory, math,Fire up your mind with Hot Brain, a game that engages the mind through a series of puzzles and challenges designed to raise the activity and temperature of your brain. Hot Brain presents challenging and fun mental activities that help ignite your mind in areas like logic, memory, math, language and concentration. The game allows you to test your skills in several single player modes or you can play with up to three people via ad-hoc connection. Whether you're an expert or a beginner, a robust tutorial mode makes the game accessible and enjoyable to people of all ages. Hot Brain features five challenging categories with hundreds of timed challenges in each that test your brain powers in logic, memory, math, language and concentration. The controls are simple and intuitive, and are geared toward fast-reaction gameplay. Each potential answer to a given Challenge is mapped to a controller button, allowing even a novice PSP user to start playing immediately. [Midway]… Expand"}, {"name": "Tappingo", "details_link": "https://www.metacritic.com/game/3ds/tappingo", "publisher": "CIRCLE Entertainment", "release_date": "Feb 27 2014", "developers": ["Goodbye Galaxy Games"], "platforms": "3DS", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 64, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/8970a00c8be478a0769b3c2c42a04b91-98.jpg", "descriptions": "Tappingo is a new puzzle game in which you create small pictures by solving puzzles. Your goal is to solve each puzzle picture by making all the numbered blocks extend into lines of the correct length. The number on each block indicates exactly how long the line needs to be.\r The gameTappingo is a new puzzle game in which you create small pictures by solving puzzles. Your goal is to solve each puzzle picture by making all the numbered blocks extend into lines of the correct length. The number on each block indicates exactly how long the line needs to be.\r The game keeps track of the time taken to solve each puzzle. You can challenge your friends or yourself to set a better time! How quickly can you solve each puzzle?\r -Over 100 puzzles based on different themes: hobbies, sports, computers, animals, etc.\r-Time Attack mode: finish each puzzle as quickly as possible\r-Two gameplay modes\r-Cool art style… Expand"}, {"name": "Hammerting", "details_link": "https://www.metacritic.com/game/pc/hammerting", "publisher": "Team17", "release_date": "Nov 16 2021", "developers": ["Warpzone Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 64, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/1/3d6393bf6533c63bb10cc7592dcca5ee-98.jpg", "descriptions": "Manage a Dwarven mining colony in the unexplored mountains of Mara. As a war rages in the Overworld, you will need to craft, explore and fight as you provide your allies with the finest weapons and gear to assist in the war against evil."}, {"name": "Knowledge is Power: Decades", "details_link": "https://www.metacritic.com/game/playstation-4/knowledge-is-power-decades", "publisher": "Sony Interactive Entertainment", "release_date": "Nov 13 2018", "developers": ["Wish Studios"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Trivia / Game Show"], "meta_score": 64, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/14ffb66c8ba290f5f00fef6109057bce-98.jpg", "descriptions": "Do you have the wits to come out on top in this exclusive PlayLink quiz game? Test your pop culture and entertainment knowledge from the '80s, '90s, '00s and 2010s, in a fun, accessible and madcap game show which uses your smart device as the controller.Up to six of you can goDo you have the wits to come out on top in this exclusive PlayLink quiz game? Test your pop culture and entertainment knowledge from the '80s, '90s, '00s and 2010s, in a fun, accessible and madcap game show which uses your smart device as the controller.Up to six of you can go head-to-head, with thousands of unique questions, a variety of themed environments and eight unique characters to choose from. From '80s Gamer Girl to Hip Hop Guy, there are plenty of retro-styled personalities to meet in your quest to scale the Pyramid of Knowledge.Get the edge on your opponents with brand new Power Plays which let you lock your foes' screens, zip up their answers, and more. And with four new touch screen challenges, you have the chance to mix things up in a time-based score attack mode.… Expand"}, {"name": "Naruto: Ultimate Ninja Heroes 2: The Phantom Fortress", "details_link": "https://www.metacritic.com/game/psp/naruto-ultimate-ninja-heroes-2-the-phantom-fortress", "publisher": "Namco Bandai Games", "release_date": "Jun 24 2008", "developers": ["CyberConnect2"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/0968084e2f2c5d6dbfcf082863e44d42-98.jpg", "descriptions": "The storyline of Nartuo: Ultimate Ninja Heroes 2 - The Phantom Fortress revolves around a mysterious phantom castle that has suddenly appeared over the Hidden Leaf Village, draining the townspeople’s life energy. When Naruto infiltrates the castle to find out who is behind this terribleThe storyline of Nartuo: Ultimate Ninja Heroes 2 - The Phantom Fortress revolves around a mysterious phantom castle that has suddenly appeared over the Hidden Leaf Village, draining the townspeople’s life energy. When Naruto infiltrates the castle to find out who is behind this terrible scheme, he finds himself confronted with threatening illusions, visions of the past and a strange masked woman with a vendetta against the Leaf Ninja. Joined by his friends, it will take all of Naruto’s courage to unravel the puzzle behind the castle and defeat this powerful new enemy. In The Phantom Fortress, players take a custom party of four NARUTO characters through over 100 floors of the castle, experiencing fierce one-on-one battles, exciting mini-games and dramatic story twists in an all-out game of survival. Along the way, players will be able to power-up each party member in a new character customization system, equipping abilities and items to gain a decisive edge in battle. Updating the series’ trademark fast-paced combat system, players will be able to pull off acrobatic flying attacks, flashy combo strikes and unstoppable jutsu skills with ease. Additionally, players can customize their game experience by choosing to play through the full game with English or the original Japanese voices. Players can also hone their fighting spirit against their friends in the game’s intense multiplayer mode. An incredible variety of team configurations are available as players do battle to see who has the strongest ninja jutsu. NARUTO: Ultimate Ninja Heroes 2: The Phantom Fortress supports game sharing for multiplayer action on two PSP systems with just one copy of the game. [Namco Bandai Games]… Expand"}, {"name": "Pagan Online", "details_link": "https://www.metacritic.com/game/pc/pagan-online", "publisher": "Wargaming.net", "release_date": "Apr 17 2019", "developers": ["Mad Head Games"], "platforms": "PC", "num_players": "2 ", "genres": ["Massively Multiplayer", "Role-Playing", "Action RPG"], "meta_score": 64, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/0/3865aee7fc971e1f5d9d33f83a7fd182-98.jpg", "descriptions": "Pagan Online is a fast-paced hack-and-slash action RPG that will challenge your skill in brutal and satisfying combat against countless enemies and larger than life bosses. Master all heroes, each with their own unique playstyle, solo or online for greater challenges and greater rewards."}, {"name": "Xenon Racer", "details_link": "https://www.metacritic.com/game/playstation-4/xenon-racer", "publisher": "Soedesco", "release_date": "Mar 26 2019", "developers": ["3DClouds.it", "3DClouds"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 64, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/3919ebb1e0867612a34c9dbd023aced7-98.jpg", "descriptions": "It’s the year 2030, the era of flying vehicles. A one-off championship for wheel based vehicles has been organized, with cutting-edge electric cars boosted by Xenon gas. Drift through cities like Tokyo and Dubai as fast as you can and claim eternal glory."}, {"name": "Psycho-Pass: Mandatory Happiness", "details_link": "https://www.metacritic.com/game/playstation-vita/psycho-pass-mandatory-happiness", "publisher": "NIS America", "release_date": "Sep 13 2016", "developers": ["5pb"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita"], "genres": ["Adventure", "Visual Novel"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/63f806a8d59883a145f2689cebbaf8ef-98.jpg", "descriptions": "Developed by MAGES, creators of the “Science Adventure” series (Chaos:Head, Steins;Gate, Robotic;Notes), Psycho-Pass: Mandatory Happiness takes place during the timespan of the first season of the anime series and adds backstory and world building to the overall story, as well as in-depthDeveloped by MAGES, creators of the “Science Adventure” series (Chaos:Head, Steins;Gate, Robotic;Notes), Psycho-Pass: Mandatory Happiness takes place during the timespan of the first season of the anime series and adds backstory and world building to the overall story, as well as in-depth storylines to each of the newly introduced characters.… Expand"}, {"name": "Zombie Vikings", "details_link": "https://www.metacritic.com/game/playstation-4/zombie-vikings", "publisher": "Zoink!", "release_date": "Sep  1 2015", "developers": ["Zoink!"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 64, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/4bb48272c5be2a3f4e58ec21682807e9-98.jpg", "descriptions": "Loki just snatched Odin's last magic eye right out of his eye-socket and hastly gangled off with it. Thor and the gods are too busy partying, so blind as a bat, Odin makes a desperate move. He raises four of the most fearsome Zombie Vikings out of Norse soil - Gunborg, Seagurd, Hedgy andLoki just snatched Odin's last magic eye right out of his eye-socket and hastly gangled off with it. Thor and the gods are too busy partying, so blind as a bat, Odin makes a desperate move. He raises four of the most fearsome Zombie Vikings out of Norse soil - Gunborg, Seagurd, Hedgy and Caw-kaa! A putrid posse sent on a mission through the most epicness of worlds to retrieve The Eye and make peace with their rotten pasts.… Expand"}, {"name": "Red Faction II", "details_link": "https://www.metacritic.com/game/pc/red-faction-ii", "publisher": "THQ", "release_date": "Apr  7 2003", "developers": ["Outrage Games"], "platforms": ["PlayStation 2", "PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 64, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/a921c64bee6fd57c9f032afc0e63939f-98.jpg", "descriptions": "Earth. Twenty-second century. Five years after the rebellion on Mars. For 15 years, Chancellor Victor Sopot has oppressed the people of the Commonwealth. His corrupt rule and a relentless war of unification with the United Republic has left the Commonwealth bloodied and impoverished. AsEarth. Twenty-second century. Five years after the rebellion on Mars. For 15 years, Chancellor Victor Sopot has oppressed the people of the Commonwealth. His corrupt rule and a relentless war of unification with the United Republic has left the Commonwealth bloodied and impoverished. As distant battles rage, sewage taints Sopot City's rivers, pollution smudges the sky, and wretched citizens huddle in crumbling ruins. Condemned to death by Chancellor Sopot, six super-soldiers unite to save their country, vowing to overthrow Sopot using the unique powers that nano-technology has given them. Join the squad as Alias, a demolitions expert. Fight side-by-side with Molov, Repta, Shrike, Tangier, and Quill--each possessing unique attributes and specialties. Battle through diverse environments using vehicles, an arsenal of specialized weapons, and explosives in a mission to overthrow the government. Defeat Sopot and restore the honor of the Commonwealth! [THQ]… Expand"}, {"name": "Urban Trial Tricky", "details_link": "https://www.metacritic.com/game/switch/urban-trial-tricky", "publisher": "Tate Multimedia", "release_date": "Jun 25 2020", "developers": ["Tate Multimedia"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Biking"], "meta_score": 64, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/ad475d73a4ee4f020db8231a47d6337a-98.jpg", "descriptions": "Hold on to your seat and pull off the most savage tricks and combos on your motorbike. Ride free, spin in the air, move back and forth and let yourself be carried away by the exciting, fast-paced gameplay, colorful visuals, and smooth controls."}, {"name": "ChromaGun VR", "details_link": "https://www.metacritic.com/game/playstation-4/chromagun-vr", "publisher": "Pixel Maniacs", "release_date": "Feb 19 2019", "developers": ["Pixel Maniacs"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 64, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/d935924562b3ca3c9d2535bc95820b70-98.jpg", "descriptions": "Welcome to ChromaTec’s test lab! You’re here to test our state-of-the-art military-grade color-technology: The ChromaGun (patent pending)! Use it to solve our meticulously designed test chambers by painting the walls and droids. Remember how to mix colors from pre-school? Congratulations,Welcome to ChromaTec’s test lab! You’re here to test our state-of-the-art military-grade color-technology: The ChromaGun (patent pending)! Use it to solve our meticulously designed test chambers by painting the walls and droids. Remember how to mix colors from pre-school? Congratulations, you qualify!… Expand"}, {"name": "Mulaka", "details_link": "https://www.metacritic.com/game/playstation-4/mulaka", "publisher": "Lienzo", "release_date": "Feb 27 2018", "developers": ["Lienzo"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 64, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/a9b855ec19c849f2e5cf90405656abda-98.jpg", "descriptions": "Explore northern Mexico’s breathtaking landscapes with Mulaka, a 3D action-adventure game based on the rich indigenous culture of the Tarahumara."}, {"name": "Assassin's Creed Liberation HD", "details_link": "https://www.metacritic.com/game/playstation-3/assassins-creed-liberation-hd", "publisher": "Ubisoft", "release_date": "Jan 14 2014", "developers": ["Ubisoft Sofia"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox 360", "Xbox One", "PlayStation 3"], "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 64, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/34b9ceb76bae887c5395957353ea9da9-98.jpg", "descriptions": "Liberation is set in New Orleans between 1765 and 1780, in the period between the end of the French and Indian War, up to the middle of the American Revolution. The game tells the story of Aveline; a female Assassin of mixed French and African heritage. Brought up in a world of privilege andLiberation is set in New Orleans between 1765 and 1780, in the period between the end of the French and Indian War, up to the middle of the American Revolution. The game tells the story of Aveline; a female Assassin of mixed French and African heritage. Brought up in a world of privilege and contrasts, Aveline becomes a strong willed woman and an avid opponent of slavery.… Expand"}, {"name": "UEFA Euro 2012", "details_link": "https://www.metacritic.com/game/pc/uefa-euro-2012", "publisher": "EA Sports", "release_date": "Apr 24 2012", "developers": ["EA Canada"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 64, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/8/0d5a0ecc3ea67c84c7ff9c281f678cca-98.jpg", "descriptions": "This digital-only expansion for FIFA 12 brings all the stadiums, teams and events from UEFA Euro 2012, as well as up-to-date versions of the rest of the UEFA teams."}, {"name": "We Cheer 2", "details_link": "https://www.metacritic.com/game/wii/we-cheer-2", "publisher": "Namco Bandai Games America", "release_date": "Nov  3 2009", "developers": ["Machatin", "Inc."], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/5db537a8f1488736b6db3a776be7d9f2-98.jpg", "descriptions": "We Cheer 2 heightens the realistic, competitive cheerleading experience by immersing players in a nationwide cheerleading championship setting. Utilizing the Wii Remotes as virtual pom-poms, players follow on-screen prompts for choreographed routines that utilize a full range of arm and bodyWe Cheer 2 heightens the realistic, competitive cheerleading experience by immersing players in a nationwide cheerleading championship setting. Utilizing the Wii Remotes as virtual pom-poms, players follow on-screen prompts for choreographed routines that utilize a full range of arm and body movements. Players can choose to play with two Wii Remotes (one for each hand) or use just one in either the right or left hand. We Cheer 2 is the only cheerleading video game to offer a hit soundtrack of licensed music and features a brand new lineup of 30 rockin’ songs that will get players energized and ready to cheer. The game offers more than twice the amount of playable characters than the original and now also offers the choice for boys as well as girls. Players will also have access to limitless customization for both their character and their entire squad with an increased range of options for outfits, accessories, facial features and more.  We Cheer 2 offers cooperative and competitive multiplayer modes with more than 20 stages and supports up to four players for exciting squad group action. With various difficulty options, the game caters to players of all skill levels from novice cheerleaders to varsity level movers and shakers. Players can practice and perfect their moves in a tutorial mode complete with a set of cheer lessons that provide an overview of each of the various motions in the routines. Performing well in the single player campaign and trainer modes earns points that can be used to unlock new stages, moves, songs and character customization options. With its simple yet addictive gameplay, players lose themselves in the music and moves as they perfect the routines and earn top spot as captain of the squad.  [Namco Bandai Games]… Expand"}, {"name": "Murder in the Abbey", "details_link": "https://www.metacritic.com/game/pc/murder-in-the-abbey", "publisher": "DreamCatcher Interactive", "release_date": "Aug 26 2008", "developers": ["Alcachofa Soft"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 64, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/7f8e5283fb3df1184dbba86137d0b997-98.jpg", "descriptions": "(Also known as \"The Abbey\" in the UK/EU)  This point-and-click adventure game is set in the Middle Ages and challenges players to investigate a series of murders at an old abbey."}, {"name": "Wild ARMs XF", "details_link": "https://www.metacritic.com/game/psp/wild-arms-xf", "publisher": "XSEED Games", "release_date": "Mar 11 2008", "developers": ["Media.Vision"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy", "Tactics"], "meta_score": 64, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/5d432f20b5bffc1fd5fe556909ff9e3b-98.jpg", "descriptions": "Wild ARMs XF (pronounced \"Crossfire\") is the newest installment in the long-running role-playing series which marks a couple firsts for the franchise; the first one containing tactical strategy gameplay, as well as the first Wild ARMs game to appear on a handheld system. Wild ARMs XF offersWild ARMs XF (pronounced \"Crossfire\") is the newest installment in the long-running role-playing series which marks a couple firsts for the franchise; the first one containing tactical strategy gameplay, as well as the first Wild ARMs game to appear on a handheld system. Wild ARMs XF offers a unique strategy role-playing experience with a hex-based grid system producing more tactical positioning options, a large number of job classes allowing vast party customization, and a wide range of mission objectives making it one of the deepest strategy games on the PSP. Wild ARMs XF features an all-new cast in an epic story of death, betrayal and redemption played out against the backdrop of the dying world of Filgaia. The once vibrant world of Filgaia is slowly dying, a result of some cataclysmic event lost in the dim, misty reaches of the past. The few pathetic remnants of once mighty nations are caught up in an endless cycle of war, fighting over Filgaia’s ever-dwindling natural resources. Amidst the carnage and slow decay, there is one kingdom that has until recently managed to avoid the chaos and suffering plaguing its neighbors; the kingdom of Elesius. However, the kingdom is slowly descending into anarchy with the king inflicted with a mysterious illness that has kept him bed-ridden, intensifying the future uncertainty as the heir-apparent disappeared a year earlier and is presumed dead. An opportunistic senate has formed its own police force and is gradually usurping power from the royal family. It is against this backdrop of political intrigue and social decay that the main character Clarissa Arwin, accompanied by her half-brother and protector, Felius, enter Elesius hot on the trail of Rupert Dandridge, the man who murdered her mother. What started out as a personal vendetta soon turns into an epic battle to not only keep a kingdom from falling, but to save the world of Filgaia from being turned into an uninhabitable wasteland. [XSEED]… Expand"}, {"name": "The Sinking City", "details_link": "https://www.metacritic.com/game/playstation-4/the-sinking-city", "publisher": "Bigben Interactive", "release_date": "Jun 25 2019", "developers": ["Frogwares"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "Survival"], "meta_score": 64, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/f6c044397ab7a23bb7dcee95ce0dc21d-98.jpg", "descriptions": "The Sinking City is an adventure and investigation game set in an open world inspired by the universe of H.P. Lovecraft, the master of Horror. The half-submerged city of Oakmont is gripped by supernatural forces. You’re a private investigator, and you have to uncover the truth of what hasThe Sinking City is an adventure and investigation game set in an open world inspired by the universe of H.P. Lovecraft, the master of Horror. The half-submerged city of Oakmont is gripped by supernatural forces. You’re a private investigator, and you have to uncover the truth of what has possessed the city… and the minds of its inhabitants.… Expand"}, {"name": "Corruption 2029", "details_link": "https://www.metacritic.com/game/pc/corruption-2029", "publisher": "The Bearded Ladies Consulting", "release_date": "Feb 17 2020", "developers": ["The Bearded Ladies Consulting"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/bd15ee3387f4ff1bcbb56e679c316cc1-98.jpg", "descriptions": "Set in a dystopian America in the not-so distant future. CORRUPTION 2029 is a new tactical strategy game from The Bearded Ladies, creators of ‘Mutant Year Zero: Road to Eden’. Using your supreme tactical abilities, command a squad of heavily augmented ‘units’ deep into enemy territory toSet in a dystopian America in the not-so distant future. CORRUPTION 2029 is a new tactical strategy game from The Bearded Ladies, creators of ‘Mutant Year Zero: Road to Eden’. Using your supreme tactical abilities, command a squad of heavily augmented ‘units’ deep into enemy territory to discover the cause of the CORRUPTION. CORRUPTION 2029 is a hardcore tactical game that should test the mettle of even the most experienced tactical gamers. [Epic]… Expand"}, {"name": "Urban Trial Freestyle", "details_link": "https://www.metacritic.com/game/3ds/urban-trial-freestyle", "publisher": "Tate Multimedia", "release_date": "Jun 27 2013", "developers": ["Strangelands Ltd."], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "3DS"], "genres": ["Miscellaneous", "Driving", "Racing", "General", "Arcade", "Arcade", "Automobile"], "meta_score": 64, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/671dae36c6d17c8c8ac2825511dd6f6b-98.jpg", "descriptions": "Urban Trial Freestyle challenges players to push their risk-taking to the absolute limits to deliver maximum stunt rewards. The game's nonstop action is complemented by a host of features including trophies, multiple game modes, leader boards, rider and bike customisation, and much more.Urban Trial Freestyle challenges players to push their risk-taking to the absolute limits to deliver maximum stunt rewards. The game's nonstop action is complemented by a host of features including trophies, multiple game modes, leader boards, rider and bike customisation, and much more.\r \rWith slick urban detailed graphics and an innovative physics engine fine-tuned for fun pick-up and play, the game has been specifically engineered to get the most out of each platform.… Expand"}, {"name": "The Legend of Korra", "details_link": "https://www.metacritic.com/game/pc/the-legend-of-korra", "publisher": "Activision", "release_date": "Oct 21 2014", "developers": ["PlatinumGames"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action Adventure", "General", "Fantasy", "Linear"], "meta_score": 64, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/220bd331ffb10156d8b5d2a2e1d82a04-98.jpg", "descriptions": "Only one human born every generation, the Avatar, can bend the four elements of nature to their will. The Legend of Korra is a third-person action game that follows the current reincarnation of the Avatar – Korra – a headstrong teenage girl chosen by fate to bring balance to the powers ofOnly one human born every generation, the Avatar, can bend the four elements of nature to their will. The Legend of Korra is a third-person action game that follows the current reincarnation of the Avatar – Korra – a headstrong teenage girl chosen by fate to bring balance to the powers of the world.… Expand"}, {"name": "Pressure", "details_link": "https://www.metacritic.com/game/pc/pressure", "publisher": "TopWare Interactive", "release_date": "Mar 26 2013", "developers": ["Chasing Carrots"], "platforms": "PC", "genres": ["Action", "Racing", "General", "General", "Arcade", "Automobile"], "meta_score": 64, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/b5ff0c1195cd94689a73339816c4d836-98.jpg", "descriptions": "\"Pressure\", a Vertical Battle Racer with extraordinary bossfights. The game's dramatic structure is driven by a hilarious story and crazy characters."}, {"name": "Dragon Age II: Legacy", "details_link": "https://www.metacritic.com/game/xbox-360/dragon-age-ii-legacy", "publisher": "Electronic Arts", "release_date": "Jul 26 2011", "developers": ["BioWare"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "PC-style RPG", "Action RPG"], "meta_score": 64, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/5/87bea1539c11bfe33ec1f1dd68c12855-98.jpg", "descriptions": "Dragon Age II: Legacy is the first major story-based DLC for the PS3, 360, and PC."}, {"name": "MXGP Pro", "details_link": "https://www.metacritic.com/game/playstation-4/mxgp-pro", "publisher": "Milestone S.r.l", "release_date": "Jul 10 2018", "developers": ["Milestone S.r.l"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/32b31c28bcf2c01aa606b83bf562c832-98.jpg", "descriptions": "Create your rider and climb the ranks in Career mode. Jump in the Compound area: a bigger, wider training area with different terrain conditions. Test your skills facing 30 different challenges: a dedicated game mode to learn step by step the best motocross techniques in the most realisticCreate your rider and climb the ranks in Career mode. Jump in the Compound area: a bigger, wider training area with different terrain conditions. Test your skills facing 30 different challenges: a dedicated game mode to learn step by step the best motocross techniques in the most realistic way. This and much, much more thanks to the new, innovative PRO Physics.… Expand"}, {"name": "Chasing Aurora", "details_link": "https://www.metacritic.com/game/wii-u/chasing-aurora", "publisher": "Broken Rules", "release_date": "Nov 18 2012", "developers": ["Broken Rules"], "platforms": "Wii U", "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "General", "Flight", "Flight", "Combat"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/4a78080e9ccb4b96432ec74de0e92e49-98.jpg", "descriptions": "Chasing Aurora is an aerial action game that is set in the thin air of the Alps. It is a 2D open world action game featuring physics-based flight and air combat. Your quest is to find and retrieve shards of the shattered sun and return them to the sun altar. Move freely in three differentChasing Aurora is an aerial action game that is set in the thin air of the Alps. It is a 2D open world action game featuring physics-based flight and air combat. Your quest is to find and retrieve shards of the shattered sun and return them to the sun altar. Move freely in three different climate zones, searching for the shards of the sun. Some of them were found by vile animals, some landed in precarious locations, some are hidden from plain sight. Sometimes it takes a fight, and sometimes it takes a breakneck stunt in midair to retrieve a shard. Chasing Aurora is a game about the dream of flight.… Expand"}, {"name": "Fatal Frame: Mask of the Lunar Eclipse", "details_link": "https://www.metacritic.com/game/xbox-series-x/fatal-frame-mask-of-the-lunar-eclipse", "publisher": "Koei Tecmo Games", "release_date": "Mar  9 2023", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "genres": ["Action Adventure", "Survival"], "meta_score": 64, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/e951e674e845996e9d753e13341b75f6-98.jpg", "descriptions": "Fatal Frame (aka Project Zero): Mask of the Lunar Eclipse takes place a decade after five girls mysteriously disappeared at a festival on Rogetsu Isle, an island in southern Japan. While all of the girls were eventually rescued, their memories were lost, with only the faint remembrance of aFatal Frame (aka Project Zero): Mask of the Lunar Eclipse takes place a decade after five girls mysteriously disappeared at a festival on Rogetsu Isle, an island in southern Japan. While all of the girls were eventually rescued, their memories were lost, with only the faint remembrance of a single melody and a seemingly possessed masked woman dancing in the moonlight. \r\rNow, ten years later, with still no memory of the events surrounding their disappearance, two of the five girls have died - discovered with covered faces and found in a tragic, crying pose. The remaining three girls now head off to the eerie island to solve the mystery of their friends' death, while also unlocking the mystery of the memories left behind.\r The remastered game features an all-new Photo Mode, along with new and altered costumes, and enhanced graphics including the improved rendering of shadows and light, delivering a more immersive and frightening experience. In addition, in-game movies and character models have been brushed-up to deliver a story that shines, both narratively and aesthetically as the three remaining girls attempt to rediscover their past before becoming victims once again.… Expand"}, {"name": "Deadcore", "details_link": "https://www.metacritic.com/game/playstation-4/deadcore", "publisher": "Grip Games", "release_date": "Jul 14 2017", "developers": ["Grip Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/8baa7a0397c1d492947310649909ca25-98.jpg", "descriptions": "DeadCore is a Platformer-FPS blending exploration and speedrun. Become immersed in a futuristic and dreamlike adventure which will see you climb a huge Tower born from the void and truly put your capabilities to the test. Will you be able to reveal the secrets that lie beneath this fog-ridden world?"}, {"name": "Sonic Heroes", "details_link": "https://www.metacritic.com/game/playstation-2/sonic-heroes", "publisher": "Sega", "release_date": "Jan 27 2004", "developers": ["Sonic Team"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 64, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/410d1517cd073ff8bf19f04fd4893935-98.jpg", "descriptions": "In Sonic's most exciting adventure yet, you maneuver a team of three Sonic characters through massive levels to overcome the ultimate evil! You guessed it, Dr. Eggman is on the loose once again, but this time he'll have to take on three powerful characters at once! Whether he's trying toIn Sonic's most exciting adventure yet, you maneuver a team of three Sonic characters through massive levels to overcome the ultimate evil! You guessed it, Dr. Eggman is on the loose once again, but this time he'll have to take on three powerful characters at once! Whether he's trying to outrun Sonic, or dodge Knuckles punches, he'll have plenty to contend with. All twelve characters have unique strengths that you'll take full advantage of to get your team through the course at full speed. Whether you choose Team Sonic, Team Dark, Team Rose, or Team Chaotix, you'll be off on a wild journey filled with challenging missions unique to each team. In this groundbreaking title that brings the Sonic series to PlayStation 2 and Xbox for the first time, Sonic Heroes marks the next evolution in Sonic's gaming career. [Sega]… Expand"}, {"name": "Egg Mania: Eggstreme Madness", "details_link": "https://www.metacritic.com/game/gamecube/egg-mania-eggstreme-madness", "publisher": "Kemco", "release_date": "Sep 11 2002", "developers": ["Kemco"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 64, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/ec5d48c3098ac9850bd1c436e5e63820-98.jpg", "descriptions": "In Egg Mania: Eggstreme Madness, you must build a tower from falling puzzle pieces to reach a balloon basket high above. Your tower must be strong and stable, or it will collapse on itself back into the water below. If that wasn't hard enough, you'll have opponents that will do anything toIn Egg Mania: Eggstreme Madness, you must build a tower from falling puzzle pieces to reach a balloon basket high above. Your tower must be strong and stable, or it will collapse on itself back into the water below. If that wasn't hard enough, you'll have opponents that will do anything to stop you--from throwing bombs and hammers to summoning clouds of lightning. This is a frenetic puzzle game that both young and old gamers can enjoy.… Expand"}, {"name": "Triple Play 2002", "details_link": "https://www.metacritic.com/game/xbox/triple-play-2002", "publisher": "Electronic Arts", "release_date": "Mar 18 2002", "developers": ["Pandemic Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/e7d4266c72a33534cb1e1acf5339ca36-98.jpg", "descriptions": "Step up to the plate and swing for the fences with Triple Play 2002 for the Xbox. The action on the field comes to life with real player models and dramatic out-of-play sequences, giving players the chance to experience big game moments such as a game-winning hit or a key strikeout."}, {"name": "Harry Potter and the Sorcerer's Stone", "details_link": "https://www.metacritic.com/game/playstation/harry-potter-and-the-sorcerers-stone", "publisher": "Electronic Arts", "release_date": "Nov 15 2001", "developers": ["Argonaut Games"], "platforms": ["PC", "PlayStation 2", "PlayStation"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 64, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/a98a8898b02bbc9d89fa8a3aa0ca7dc0-98.jpg", "descriptions": "Leave the nonmagical world behind and enroll in Hogwarts School of Witchcraft and Wizardry in Harry Potter and The Sorcerer's Stone.  As Harry Potter, you will hone your magical skills and advance through three terms of study during Harry's first year at Hogwarts.  Each term will challengeLeave the nonmagical world behind and enroll in Hogwarts School of Witchcraft and Wizardry in Harry Potter and The Sorcerer's Stone.  As Harry Potter, you will hone your magical skills and advance through three terms of study during Harry's first year at Hogwarts.  Each term will challenge you to meet a number of objectives, such as collecting and mixing potions with Professor Snape or piloting a flying broom through the Forbidden Forest in search of Neville Longbottom's Remembrall.  In order to pass the first year of study, players must complete over 29 different objectives, while avoiding enemies and obstacles.… Expand"}, {"name": "Test Drive Off-Road Wide Open", "details_link": "https://www.metacritic.com/game/xbox/test-drive-off-road-wide-open", "publisher": "Atari", "release_date": "Nov 14 2001", "developers": ["Rockstar San Diego"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 64, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/1c92e54a72751a0a319f56680516ef7a-98.jpg", "descriptions": "In Test Drive Off-Road Wide Open, off-road racing takes a detour through nature's badlands. The wilderness is your playground for 13 licensed trucks such as Hummer, Dodge T-Rex, Ford Bronco, and more. Avoid rockslides, waterfalls, and volcanoes as you tear up three countrysides--eachIn Test Drive Off-Road Wide Open, off-road racing takes a detour through nature's badlands. The wilderness is your playground for 13 licensed trucks such as Hummer, Dodge T-Rex, Ford Bronco, and more. Avoid rockslides, waterfalls, and volcanoes as you tear up three countrysides--each featuring over 10 races and events. Speed through checkpoints in three gameplay modes--Circuit, A-B, and Blitz--against tough competition on rough terrain. The road to off-road supremacy goes through towering jumps, high-speed trucks, and shortcuts.… Expand"}, {"name": "4x4 Evolution", "details_link": "https://www.metacritic.com/game/playstation-2/4x4-evolution", "publisher": "Gathering", "release_date": "Feb 26 2001", "developers": ["Terminal Reality"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 64, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/9987ebd400a666d73a7bdfdfd0a13284-98.jpg", "descriptions": "4x4 Evolution takes gamers for a rough ride through 15 off-road courses, each with its own distinctive design, music score, and difficulty level. In addition to contending with the other vehicles, you'll face challenges such as gates, trees, and tractors in junkyards or oncoming traffic in4x4 Evolution takes gamers for a rough ride through 15 off-road courses, each with its own distinctive design, music score, and difficulty level. In addition to contending with the other vehicles, you'll face challenges such as gates, trees, and tractors in junkyards or oncoming traffic in construction zones. Win cash in a series of off-road races to upgrade your truck. You can even stop, rewind, and view an entire race again from multiple camera angles and different racers' perspectives.… Expand"}, {"name": "Gunbird 2", "details_link": "https://www.metacritic.com/game/dreamcast/gunbird-2", "publisher": "Capcom", "release_date": "Nov 17 2000", "developers": ["Psikyo"], "platforms": "Dreamcast", "genres": ["Action", "General"], "meta_score": 64, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/4feee671fa874563d2b1b3b7277e63b6-98.jpg", "descriptions": "Straight from the hit arcade game, Gunbird 2  is the most intense test of coordination and skill. This action shooters features 7 characters on a quest for the magical ingredients to produce the All-Purpose Medicine. On a journey to see the wise medicine master, you are intercepted by aStraight from the hit arcade game, Gunbird 2  is the most intense test of coordination and skill. This action shooters features 7 characters on a quest for the magical ingredients to produce the All-Purpose Medicine. On a journey to see the wise medicine master, you are intercepted by a rowdy band of pirates. Now, maneuver through insane levels of enemy fire to pick up power-ups and other weapons and be the first to recover your stolen bounty and unlock the secret of the medicine master.… Expand"}, {"name": "JoJo's Bizarre Adventure HD Ver.", "details_link": "https://www.metacritic.com/game/playstation-3/jojos-bizarre-adventure-hd-ver", "publisher": "Capcom", "release_date": "Aug 21 2012", "developers": ["Capcom"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/e80aa2f9969ff1a8120d108e2e38fbfa-98.jpg", "descriptions": "A 2D Fighting game, developed and published by Capcom."}, {"name": "Sid Meier's Pirates!", "details_link": "https://www.metacritic.com/game/wii/sid-meiers-pirates!", "publisher": "Atari", "release_date": "Sep 28 2010", "developers": ["Virtuos"], "platforms": ["iPhone/iPad", "PC", "Wii"], "num_players": "1 Player", "genres": ["Strategy", "General", "General"], "meta_score": 64, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/6552bdfd7c154d36fd3da01cef7d674e-98.jpg", "descriptions": "In Pirates! you take the leading role of a pirate captain in the 17th-century Caribbean, amassing fortune and fame in an attempt to seize your rightful place as one of the most revered (and feared) pirates in history. As your reputation and skills grow, so will the size and quality of yourIn Pirates! you take the leading role of a pirate captain in the 17th-century Caribbean, amassing fortune and fame in an attempt to seize your rightful place as one of the most revered (and feared) pirates in history. As your reputation and skills grow, so will the size and quality of your crew and your ability to take on larger enemy ships, raid and plunder heavily fortified ports, and locate ancient treasure. There's a whole cast of interesting and dangerous characters to meet, mysteries to solve, exotic island destinations to discover, and powerful alliances to forge.… Expand"}, {"name": "SimCity", "details_link": "https://www.metacritic.com/game/pc/simcity", "publisher": "Electronic Arts", "release_date": "Mar  5 2013", "developers": ["Maxis"], "platforms": "PC", "genres": ["Miscellaneous", "Virtual Life", "Strategy", "City Building", "Management", "Modern", "Modern", "Government"], "meta_score": 64, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/1/0acc084e86917864b6de4dbabc707646-98.jpg", "descriptions": "Control a region that delivers true multi-city scale and play a single city or up to sixteen cities at once each with different specializations. Multiplayer adds a new facet to your game as your decisions will have an effect both your city and your region and creates new ways to play byControl a region that delivers true multi-city scale and play a single city or up to sixteen cities at once each with different specializations. Multiplayer adds a new facet to your game as your decisions will have an effect both your city and your region and creates new ways to play by collaborating or competing to earn achievements.… Expand"}, {"name": "Gods Will Be Watching", "details_link": "https://www.metacritic.com/game/pc/gods-will-be-watching", "publisher": "Devolver Digital", "release_date": "Jul 24 2014", "developers": ["Devolver Digital"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 64, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/b260c48aeb7ce965e6ed276a116c00ae-98.jpg", "descriptions": "Gods Will Be Watching is a minimalistic point and click thriller centered on despair, commitment, and sacrifice as players face narrative puzzles and moral dilemmas that will affect both the lives of your team and the people you are sworn to protect. Set against the backdrop of anGods Will Be Watching is a minimalistic point and click thriller centered on despair, commitment, and sacrifice as players face narrative puzzles and moral dilemmas that will affect both the lives of your team and the people you are sworn to protect. Set against the backdrop of an interstellar struggle, Gods Will Be Watching follows Sgt. Burden and his crew in six tense chapters from hostage situations and wilderness survival to biological weapon prevention and agonizing torture scenarios. Each decision is crucial and players will need to choose between the lives of their team and the saving the world from genocide. There's no good or evil, just decisions, with only you and the gods as a judge to your actions.… Expand"}, {"name": "Aragami 2", "details_link": "https://www.metacritic.com/game/playstation-5/aragami-2", "publisher": "Merge Games", "release_date": "Sep 17 2021", "developers": ["Lince Works"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 3 ", "genres": ["Action Adventure", "General"], "meta_score": 64, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/864cc7802579e5f5599b26f1f76502a9-98.jpg", "descriptions": "Aragami 2 is a third person stealth game where you play as an assassin with the power to control the shadows. Join the shadow clan and fight the invader armies to protect your people."}, {"name": "Greak: Memories of Azur", "details_link": "https://www.metacritic.com/game/xbox-series-x/greak-memories-of-azur", "publisher": "Team17", "release_date": "Aug 17 2021", "developers": ["Navegante Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "Metroidvania"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/040621d662b5edb7aa6ba56a740bad9d-98.jpg", "descriptions": "Greak: Memories of Azur is a side scrolling single-player game with hand-drawn animations. You will take the role of three siblings: Greak, Adara and Raydel to guide them through the lands of Azur. Alternate control between them and use their unique abilities to escape from the Urlag invasion."}, {"name": "Planet of the Eyes", "details_link": "https://www.metacritic.com/game/xbox-one/planet-of-the-eyes", "publisher": "Coco Cucumber", "release_date": "Sep 12 2017", "developers": ["Coco Cucumber", "Cococucumber"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 64, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/794424c7bb0a9c045b9bf4ae39172e77-98.jpg", "descriptions": "An atmospheric narrative-platformer about a service robot stranded on a mysterious planet, Planet of the Eyes features a stunning visual mix of puzzle and platforming challenges, an original musical score, and fully voiced audio logs left by another survivor."}, {"name": "Hell Yeah! Wrath of the Dead Rabbit", "details_link": "https://www.metacritic.com/game/pc/hell-yeah!-wrath-of-the-dead-rabbit", "publisher": "Sega", "release_date": "Oct  3 2012", "developers": ["Arkedo Studio"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 64, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/894817fbf4849edb675edb81a78c235d-98.jpg", "descriptions": "Hell Yeah! is a crazy action-adventure platformer. In Hell. You are Ash, a devil rabbit and the prince of Hell. When some jerk finds it funny to post your secret intimate photos all over the Hell-ternet, you get VERY angry. Time to find him and destroy him once and for all. While you’re atHell Yeah! is a crazy action-adventure platformer. In Hell. You are Ash, a devil rabbit and the prince of Hell. When some jerk finds it funny to post your secret intimate photos all over the Hell-ternet, you get VERY angry. Time to find him and destroy him once and for all. While you’re at it, why not use this incredible journey to kill everybody else? It’s you against all Hell. It’s Hell Yeah!… Expand"}, {"name": "Of Orcs and Men", "details_link": "https://www.metacritic.com/game/xbox-360/of-orcs-and-men", "publisher": "Focus Home Interactive", "release_date": "Oct 24 2012", "developers": ["Cyanide", "Spiders"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG", "Western-Style"], "meta_score": 64, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/44a203042053bf4dc00e3aa197a5fb60-98.jpg", "descriptions": "Of Orcs and Men first puts you into the role of an elite Orc soldier from the legendary legion of Bloodjaws, a league of warriors deeply involved in the war opposing the Orcs and Goblins on one side to their persecutors, Humankind. As a veteran warrior who has seen the most brutal ofOf Orcs and Men first puts you into the role of an elite Orc soldier from the legendary legion of Bloodjaws, a league of warriors deeply involved in the war opposing the Orcs and Goblins on one side to their persecutors, Humankind. As a veteran warrior who has seen the most brutal of battles, you are appointed by the Orc commander to complete a mission that could change the course of the war: kill the one man responsible for all of this bloodshed, the one who has, for years, exhorted the human masses to loath and fight the green-skinned people: the Emperor himself.… Expand"}, {"name": "The Lord of the Rings: Tactics", "details_link": "https://www.metacritic.com/game/psp/the-lord-of-the-rings-tactics", "publisher": "EA Games", "release_date": "Nov  8 2005", "developers": ["Amaze Entertainment"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy", "Tactics"], "meta_score": 64, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/60a806f8ef7f2555fba700bedf23a523-98.jpg", "descriptions": "Return to Middle-earth in this tactical RPG where you decide the fate of The Third Age. Build a Fellowship of heroes or create the ultimate force of evil with hundreds of skill, weapon, and ability upgrades at your disposal. Send your heroes and villains from The Lord of the Rings intoReturn to Middle-earth in this tactical RPG where you decide the fate of The Third Age. Build a Fellowship of heroes or create the ultimate force of evil with hundreds of skill, weapon, and ability upgrades at your disposal. Send your heroes and villains from The Lord of the Rings into battle across legendary locations from the film trilogy and J.R.R. Tolkien's fiction. Seize the high ground, set traps, and ambush the enemy in intense single-player battles or strategic multiplayer skirmishes. The board is set, the pieces are in motion. Middle-earth awaits you. Play as the 12 Heroes and Villains of Middle-earth - Build your Fellowship for good or evil in your quest to capture, or destroy, The One Ring. Fight Across Middle-earth - Engage the enemy in battle arenas that re-create locations from all three The Lord of the Rings films as well as J.R.R. Tolkien's legendary books. Gain a Strategic Advantage - Hundreds of in-depth skill options and an item-based battle system offer a variety of character customization options. Deep Tactical Gameplay - A simultaneous turn-based encounter system for multiplayer delivers a gripping four-person combat experience unrivalled by any previous Tactics game. Multiplayer Innovation - Good and evil fight on the same side for the first time in an exclusive Wi-Fi multiplayer mode. [Electronic Arts]… Expand"}, {"name": "Vampire: The Masquerade - Swansong", "details_link": "https://www.metacritic.com/game/playstation-5/vampire-the-masquerade---swansong", "publisher": "Nacon", "release_date": "May 19 2022", "developers": ["Big Bad Wolf"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 64, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/5/15f0ef50a6f0842584c40a7179d4a0df-98.jpg", "descriptions": "What if vampires were real? What if these bloodthirsty predators lived hidden among us, meticulously and skilfully hatching ancient conspiracies? And what if you became one of them? In Vampire: The Masquerade - Swansong, you play as these alluring monsters in a sophisticated world where theWhat if vampires were real? What if these bloodthirsty predators lived hidden among us, meticulously and skilfully hatching ancient conspiracies? And what if you became one of them? In Vampire: The Masquerade - Swansong, you play as these alluring monsters in a sophisticated world where the lines between the real and supernatural are always blurred.Hazel Iversen, the Swan, is the new Prince of the Boston Camarilla. An iron hand in a velvet glove, she intends to assert her power and respect the Masquerade, the vampiric law designed to ensure humans never learn of the existence of these creatures of the night. But nothing works as planned. With rumours of plots, murders and power struggles, you must work in the shadows to protect your Sect in a frantic investigation that plunges Boston into chaos.Play as 3 vampires who are over a hundred years old. Progress through the game through their intertwined destinies, deal with their different points of view and use their character sheets to try to separate the truth from the lies. Each character has their own abilities and vampiric disciplines that you can upgrade individually to suit your preferred approach.Will you choose intimidation, seduction or stealth? It's your decision, as long as you can sate your Hunger for blood.With its unique approach to gameplay, Swansong puts emphasis on the consequences of your actions in both the investigation and your social interactions with characters. Analyse each situation carefully because your decisions can have huge consequences on your heroes' lives and the fate of the Boston Camarilla.… Expand"}, {"name": "Musashi: Samurai Legend", "details_link": "https://www.metacritic.com/game/playstation-2/musashi-samurai-legend", "publisher": "Square Enix", "release_date": "Mar 15 2005", "developers": ["Square Enix"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 64, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/ded8c545f9300efc29d973a8fc44379b-98.jpg", "descriptions": "The journey begins when Princess Mycella summons Musashi across space and time to save her people from danger. As a stranger in a new world, Musashi finds intrigue and adventure as he hones his battle skills to defeat a sinister nemesis. All-new battle systems contribute to non-stop action.The journey begins when Princess Mycella summons Musashi across space and time to save her people from danger. As a stranger in a new world, Musashi finds intrigue and adventure as he hones his battle skills to defeat a sinister nemesis. All-new battle systems contribute to non-stop action. Musashi can focus his energy to learn his opponents' techniques, allowing him to give enemies a taste of their own medicine. And this time Musashi can not only pick up allies and enemies but also wield them in combat to devastating effect. [Square-Enix]… Expand"}, {"name": "SpongeBob Squigglepants 3D", "details_link": "https://www.metacritic.com/game/3ds/spongebob-squigglepants-3d", "publisher": "THQ", "release_date": "May 17 2011", "developers": ["WayForward"], "platforms": "3DS", "genres": ["Miscellaneous", "General", "General"], "meta_score": 64, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/bc82ed14d838b38d8ca0aab54f9bcf38-98.jpg", "descriptions": "SpongeBob Squigglepants has players tilt, flick, tap, and draw through more than 100 Nanogames set in six zany worlds."}, {"name": "Restaurant Empire II", "details_link": "https://www.metacritic.com/game/pc/restaurant-empire-ii", "publisher": "Paradox Interactive", "release_date": "May 26 2009", "developers": ["Enlight Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 64, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/2e51568c9f66165dee0fda098efaa4aa-98.jpg", "descriptions": "The sequel to Restaurant Empire takes you further into the depths and delights of the culinary universe than ever before. Take part in an exciting world where the customers are fickle and the bounty in your cash register changes as quickly as their tastes. With two handfuls of cash and aThe sequel to Restaurant Empire takes you further into the depths and delights of the culinary universe than ever before. Take part in an exciting world where the customers are fickle and the bounty in your cash register changes as quickly as their tastes. With two handfuls of cash and a dream of stamping a legacy, build, cook and hire your way to the very top of the gastronomic biz, where tasty food is king and smart management reels in the dollar signs. And if you’re lucky, you just may go further than any other before you and cement your status as a true legend of cuisine. [Enlight]… Expand"}, {"name": "Disney*Pixar WALL-E", "details_link": "https://www.metacritic.com/game/psp/disneypixar-wall-e", "publisher": "THQ", "release_date": "Jun 24 2008", "developers": ["Heavy Iron Studios", "Savage Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 64, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/10775583001f5499990154b5a0ad28c3-98.jpg", "descriptions": "What if mankind had to leave Earth, and somebody forgot to turn the last robot off? After hundreds of lonely years of doing what he was built for, WALL-E (short for Waste Allocation Load Lifter Earth-Class) discovers a new purpose in life (besides collecting knick-knacks) when he meets aWhat if mankind had to leave Earth, and somebody forgot to turn the last robot off? After hundreds of lonely years of doing what he was built for, WALL-E (short for Waste Allocation Load Lifter Earth-Class) discovers a new purpose in life (besides collecting knick-knacks) when he meets a sleek search robot named EVE. EVE comes to realize that WALL-E has inadvertently stumbled upon the key to the planet’s future, and races back to space to report her findings to the humans (who have been eagerly awaiting word that it is safe to return home). Meanwhile, WALL-E chases EVE across the galaxy and sets into motion one of the most exciting and imaginative comedy adventures ever brought to the big screen. Joining WALL-E on his fantastic journey across a universe of never-before-imagined visions of the future, is a hilarious cast of characters including a pet cockroach, and a heroic team of malfunctioning misfit robots. Players of the game take control of WALL-E and EVE through a fast-paced adventure based on the Disney/Pixar film. The game allows fans to relive some of the movie’s most thrilling moments as they explore 10 worlds filled with non-stop action and adventure, along with head-to-head multiplayer challenges. Players will recognize the storyline, characters and key locations from the WALL-E film as they carry out intense missions, dodge dangerous enemies and navigate their way through a futuristic world. In addition, the game contains new storylines and environments that movie-goers will not see in theaters. [THQ]… Expand"}, {"name": "Hardwood Hearts", "details_link": "https://www.metacritic.com/game/xbox-360/hardwood-hearts", "publisher": "Silver Creek Entertainment", "release_date": "Dec  8 2005", "developers": ["Silver Creek Entertainment"], "platforms": ["iPhone/iPad", "Xbox 360"], "num_players": "4  Online", "genres": ["Miscellaneous", "Parlor", "Gambling", "Board / Card Game", "Gambling"], "meta_score": 64, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/408f6c4dd2220efab92ebfe157760032-98.jpg", "descriptions": "[Xbox Live Arcade]  Your mama told you not to go around breaking hearts. But in the classic card game Hardwood Hearts, that's what it’s all about. Try to take as few points as possible... unless you want to shoot the moon. If you take all the points in a moon shot, the points go to your[Xbox Live Arcade]  Your mama told you not to go around breaking hearts. But in the classic card game Hardwood Hearts, that's what it’s all about. Try to take as few points as possible... unless you want to shoot the moon. If you take all the points in a moon shot, the points go to your opponents. Up the stakes even more with Spot Hearts, where heart cards are worth their face values, the queen of spades is worth 50, and a moon shot earns your foes a whopping 150 points. Rule variants: Play versions of the classic Hearts game like Cutthroat, four-player partners, and Spot Hearts. Customizable items: Change the look with different backgrounds (some with sound), cards, and tables. Fooms: Much like emotes, Fooms don’t affect the game, but they might affect your mood. Send a Foom like a Kiss, Fireball, or Lightning at friends or opponents to clue them in on how you feel. [Xbox.com]… Expand"}, {"name": "Seven Pirates H", "details_link": "https://www.metacritic.com/game/switch/seven-pirates-h", "publisher": "EastAsiaSoft", "release_date": "May 12 2022", "developers": ["Compile Heart"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Roguelike", "Japanese-Style"], "meta_score": 64, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/9d5e86622b220ae4ddcbdf33349076c6-98.jpg", "descriptions": "Set sail with a crew of monster girls!Join young pirate Parute Kairi and pervy boy monster Otton in an adventure to locate the lost treasures of the Monsupi Sea! Determined to make a legendary name for herself, Parute sets sail with a magic compass and the aid of newfound monster girlSet sail with a crew of monster girls!Join young pirate Parute Kairi and pervy boy monster Otton in an adventure to locate the lost treasures of the Monsupi Sea! Determined to make a legendary name for herself, Parute sets sail with a magic compass and the aid of newfound monster girl companions, but what starts as a raucous romp across uncharted islands gradually reveals something more sinister. Through their colorful encounters with rival pirates and locals in need, Parute and company learn some unsettling truths about the king who governs these waters, all leading to a confrontation that could tear their adorable crew apart!Seven Pirates H is a traditional RPG focused on exploration and discovery with a gigantic dose of fanservice thrown in! As Parute, you'll command your party of monster girls in combat against naughty enemies, exploiting weaknesses to gain the upper hand in turn-based combat. Adventure across islands and ride Otton to reach secret areas, gather items and enhance your abilities as you level up!… Expand"}, {"name": "Rock of Ages 3: Make & Break", "details_link": "https://www.metacritic.com/game/switch/rock-of-ages-3-make-break", "publisher": "Modus Games", "release_date": "Jul 21 2020", "developers": ["ACE Team"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action", "Strategy", "Real-Time", "General", "Defense"], "meta_score": 64, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/6f37aa5c9d16b3664187b4d476463dfd-98.jpg", "descriptions": "Rock of Ages 3: Make & Break is competitive tower defense and arcade action rolled up with ACE Team's quirky, Monty Python-esque humor into one giant, creative game for the ages. Jump into the expansive, gut-busting story for an eclectic adventure featuring bizarre and irreverent takes onRock of Ages 3: Make & Break is competitive tower defense and arcade action rolled up with ACE Team's quirky, Monty Python-esque humor into one giant, creative game for the ages. Jump into the expansive, gut-busting story for an eclectic adventure featuring bizarre and irreverent takes on legendary characters, or for the first time, create and share your own levels to compete with friends and strangers online in a real-time mix of hectic tower defense and epic boulder-racing arcade action. … Expand"}, {"name": "SIMULACRA", "details_link": "https://www.metacritic.com/game/switch/simulacra", "publisher": "Wales Interactive", "release_date": "Dec  3 2019", "developers": ["Kaigan Games OU"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/8c8911e1e85852cdd3712f8b574fd3ef-98.jpg", "descriptions": "\"Simulacra expands upon its predecessor, Sara is Missing, experimenting even further with unsettling horror. And it succeeds.\"9/10 - Pocket Gamer\n\"WINNER, Excellence in Storytelling\" - International Mobile Game Awards SEA\n\"NOMINATED, Most Innovative Game\" - Indie Prize Kyiv 2017\n\nYou found\"Simulacra expands upon its predecessor, Sara is Missing, experimenting even further with unsettling horror. And it succeeds.\"9/10 - Pocket Gamer\"WINNER, Excellence in Storytelling\" - International Mobile Game Awards SEA\"NOMINATED, Most Innovative Game\" - Indie Prize Kyiv 2017You found the lost phone of a woman named Anna. In it, you see a desperate cry for help in the form of a video message. The phone behaves strangely as you dive deeper into it. You talk to her friends and they have no idea where she is. Her texts, emails and photo gallery provides fragments of information as the mystery deepens. It's up to you to piece it together.About the GameSIMULACRA is a realistic \"found phone\" horror game that takes place entirely on the screen of a mobile phone. A voyeuristic experience that combines of point and click adventure games, found footage videos and fully realised phone apps. Features:- Explore a fully realised world through a simulated phone.- Solve the mystery using through popular phone apps.- An expansive narrative with hours of gameplay that leads to 5 possible endings.- Filmed with live actors and an extensive VO cast.- Solve the recurring image and text decryption puzzles to learn more about Anna's story.… Expand"}, {"name": "Snooker 19", "details_link": "https://www.metacritic.com/game/playstation-4/snooker-19", "publisher": "Ripstone", "release_date": "Apr 16 2019", "developers": ["Lab42"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Billiards"], "meta_score": 64, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/3/397d5f744e3d3cff18cc78c6c2231ddd-98.jpg", "descriptions": "This is the most authentic simulation of the sport ever created, with TV-style presentation and commentary, true-to-life physics and advanced artificial intelligence. Choose from offline and online modes, from quick play online match-making to global online tournaments that link in real-timeThis is the most authentic simulation of the sport ever created, with TV-style presentation and commentary, true-to-life physics and advanced artificial intelligence. Choose from offline and online modes, from quick play online match-making to global online tournaments that link in real-time with the live World Snooker calendar.… Expand"}, {"name": "The Council - Episode 5: Checkmate", "details_link": "https://www.metacritic.com/game/playstation-4/the-council---episode-5-checkmate", "publisher": "Focus Home Interactive", "release_date": "Dec  4 2018", "developers": ["Big Bad Wolf"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 64, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Checkmate is the fifth and final episode of The Council's inaugural season. The Complete Season of The Council grants access to all 5 episodes.As his assumptions about reality come crashing down around him, Louis de Richet must take the final steps on deciding his path -- and the fate ofCheckmate is the fifth and final episode of The Council's inaugural season. The Complete Season of The Council grants access to all 5 episodes.As his assumptions about reality come crashing down around him, Louis de Richet must take the final steps on deciding his path -- and the fate of the world. Democracies, monarchies, and the future of nations hang in the balance.This finale brings all your decisions, mistakes, and victories to the fore as Louis' alliances, enemies, and family all come together for a climatic confrontation. Who will win, and can the De Richets survive the island in the end?Finish the adventure in The Council Episode 5: Checkmate as kings fall, pawns rise, and the choice, as always, is yours.… Expand"}, {"name": "Grand Ages: Medieval", "details_link": "https://www.metacritic.com/game/playstation-4/grand-ages-medieval", "publisher": "Kalypso", "release_date": "Oct 13 2015", "developers": ["Gaming Minds Studios"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 64, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/9de73530724ebbad56c3d03e15ab7464-98.jpg", "descriptions": "Grand Ages: Medieval is a real-time strategy game from Gaming Minds. Lead your people and advance through the decades by utilising construction, research, expansion and conquest in an area extending from Scandinavia and North Africa; to Portugal, the Caucasus and the Middle East. Rise fromGrand Ages: Medieval is a real-time strategy game from Gaming Minds. Lead your people and advance through the decades by utilising construction, research, expansion and conquest in an area extending from Scandinavia and North Africa; to Portugal, the Caucasus and the Middle East. Rise from the humble role of a simple mayor governing a small settlement and rule over all of Europe. Experience an exciting campaign with elaborately designed cut-scenes, play by your own rules in free play or test your skills in multiplayer against up to 8 players!… Expand"}, {"name": "WRC 2: FIA World Rally Championship 2011", "details_link": "https://www.metacritic.com/game/playstation-3/wrc-2-fia-world-rally-championship-2011", "publisher": "Ubisoft", "release_date": "Oct 14 2011", "developers": ["MileStone Inc."], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 64, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/2/26bd03341e5a6ee11b1d36e509c8581c-98.jpg", "descriptions": "Live the life of a real rally driver through the career mode of WRC 2. Start from scratch by creating your own racing team, win prestigious victories to increase your funds and improve your reputation. Among the brand new features this year, you can create your own team and manage themLive the life of a real rally driver through the career mode of WRC 2. Start from scratch by creating your own racing team, win prestigious victories to increase your funds and improve your reputation. Among the brand new features this year, you can create your own team and manage them during your ascent to the WRC. Find the best mechanics on the market to maximize the performance of your car, hire skilled managers to unlock profitable sponsorships ... and strive to earn a contract with one of the WRC teams. Are you ready to become the new champion of the world?… Expand"}, {"name": "Alien Breed 3: Descent", "details_link": "https://www.metacritic.com/game/pc/alien-breed-3-descent", "publisher": "Team17", "release_date": "Nov 17 2010", "developers": ["Team17"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 64, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/6/f47a7456681a32ab5920d8161925fa05-98.jpg", "descriptions": "With the Leopold and its unwanted attachment breaching the surface of an imposing ice planet, you have only a few hours to wade your way through flooded corridors and locate the origin of the threat that has so far laid waste to your once proud space ship. For the first time Conrad canWith the Leopold and its unwanted attachment breaching the surface of an imposing ice planet, you have only a few hours to wade your way through flooded corridors and locate the origin of the threat that has so far laid waste to your once proud space ship. For the first time Conrad can venture outside of the ship in the breathtaking hull walk set pieces, and for those trigger-happy shooter fans there are vicious new enemies to fight, including the Electro-Shocker alien and the awe-inspiring final bosses. New armaments are also available in Descent, with the Electro-Link gun allowing for shockingly good crowd control whilst the formidable Project X weapon will tear through anything in its path. … Expand"}, {"name": "Kholat", "details_link": "https://www.metacritic.com/game/pc/kholat", "publisher": "IMGN.PRO", "release_date": "Jun  9 2015", "developers": ["IMGN.PRO"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Adventure", "3D", "First-Person"], "meta_score": 64, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/de130db8c0a793b67ac1f6da721ffb34-98.jpg", "descriptions": "The game is inspired by true event known as Dyatlov Pass Incident."}, {"name": "Sid Meier's Starships", "details_link": "https://www.metacritic.com/game/pc/sid-meiers-starships", "publisher": "2K Games", "release_date": "Mar 12 2015", "developers": ["Firaxis Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 64, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/9/cf1c9baa64fa9ed3be563653a19199fb-98.jpg", "descriptions": "Assemble and helm a fleet of starships and travel between planets as you explore, build, negotiate, and fight to preserve your vision for humanity."}, {"name": "Infliction: Extended Cut", "details_link": "https://www.metacritic.com/game/playstation-4/infliction-extended-cut", "publisher": "Blowfish Studios", "release_date": "Feb 25 2020", "developers": ["Caustic Reality"], "platforms": ["PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Survival", "First-Person"], "meta_score": 64, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/2/c443bd1c8b753a797460a26d67889c32-98.jpg", "descriptions": "Wander through an interactive nightmare set within a once-happy home. Uncover the heartbreaking mystery hidden within messages, artwork, and other vestiges of domestic life all while struggling to survive encounters with a relentless entity that stands in the way of finding absolution."}, {"name": "Harry Potter and the Half-Blood Prince", "details_link": "https://www.metacritic.com/game/pc/harry-potter-and-the-half-blood-prince", "publisher": "EA Games", "release_date": "Jun 30 2009", "developers": ["EA Bright Light"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 64, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/1/c511a1671f4000ce7486bb165ac7f6fd-98.jpg", "descriptions": "In Harry Potter and the Half-Blood Prince, Voldemort is tightening his grip on both the Muggle and wizarding worlds and Hogwarts is no longer the safe haven it once was. Harry suspects that dangers may even lie within the castle, but Dumbledore is more intent upon preparing him for the finalIn Harry Potter and the Half-Blood Prince, Voldemort is tightening his grip on both the Muggle and wizarding worlds and Hogwarts is no longer the safe haven it once was. Harry suspects that dangers may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle that he knows is fast approaching. Together they work to find the key to unlock Voldemort's defenses and, to this end, Dumbledore recruits his old friend and colleague, the well-connected and unsuspecting bon vivant Professor Horace Slughorn, whom he believes holds crucial information. Meanwhile, the students are under attack from a very different adversary as teenage hormones rage across the ramparts. Harry finds himself more and more drawn to Ginny, but so is Dean Thomas. And Lavender Brown has decided that Ron is the one for her, only she hadn't counted on Romilda Vane's chocolates! And then there's Hermione, simmering with jealously but determined not to show her feelings. As romance blossoms, one student remains aloof. He is determined to make his mark, albeit a dark one. Love is in the air, but tragedy lies ahead and Hogwarts may never be the same again. In the game, players return to Hogwarts to help Harry survive a fraught sixth year. They also have a chance to engage in exciting wizard duels, mix and brew magical ingredients in Potions class and take to the air to lead the Gryffindor Quidditch team to victory. Players may even get sidetracked by Ron's romantic entanglements as they journey towards a dramatic climax and discover the identity of the Half-Blood Prince. [Electronic Arts]… Expand"}, {"name": "Zoo Tycoon 2: Endangered Species", "details_link": "https://www.metacritic.com/game/pc/zoo-tycoon-2-endangered-species", "publisher": "Microsoft Game Studios", "release_date": "Oct 19 2005", "developers": ["Blue Fang Games"], "platforms": "PC", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 64, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/3982cec47fc42e423f858cc3aff33dc0-98.jpg", "descriptions": "Endangered Species brings some of the world's rarest animals home to your zoo. This expansion pack for Zoo Tycoon 2 adds a slew of exotic new content for a zookeeper just like you. Treat yourself and your guests to breathtaking overhead views from the new sky trams. Or drive through yourEndangered Species brings some of the world's rarest animals home to your zoo. This expansion pack for Zoo Tycoon 2 adds a slew of exotic new content for a zookeeper just like you. Treat yourself and your guests to breathtaking overhead views from the new sky trams. Or drive through your exhibits in the new Jeep vehicle tours. Build bridges and observation decks for a refreshing new view of your animals. And that’s not all. There are also erupting volcanoes, new endangered-species-themed buildings and scenery, and a whole new set of challenges and campaigns. [Microsoft]… Expand"}, {"name": "Accel World vs. Sword Art Online: Millennium Twilight", "details_link": "https://www.metacritic.com/game/playstation-4/accel-world-vs-sword-art-online-millennium-twilight", "publisher": "Bandai Namco Games", "release_date": "Jul  7 2017", "developers": ["Artdink"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 64, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/bbdffd7defb4ceb8be040201a6d47eb4-98.jpg", "descriptions": "Svart Alfheim and the Accelerated World have begun to merge. In the midst of the chaos, Yui has gone missing. Kirito must challenge the Seven Kings of pure color from the Accelerated World to gain access to her location. RECRUIT YOUR FAVOURITE CHARACTERS among a large roster from the animeSvart Alfheim and the Accelerated World have begun to merge. In the midst of the chaos, Yui has gone missing. Kirito must challenge the Seven Kings of pure color from the Accelerated World to gain access to her location. RECRUIT YOUR FAVOURITE CHARACTERS among a large roster from the anime and novel series.TAKE THE SKIES using your flying abilities, deploy magic and sword skills to perform outstanding aerial strikes!DEFY GRAVITY with hyper jumping skill, accelerate your movement before giving a Coup de Grace!UNITE FOR THE FIGHT in fierce online multiplayer featuring multiple modes supporting up to 4 players. This version of the game includes the DLC \"Castaway From Another World\".… Expand"}, {"name": "Star Soldier R", "details_link": "https://www.metacritic.com/game/wii/star-soldier-r", "publisher": "Hudson Soft", "release_date": "May 19 2008", "developers": ["Hudson Soft"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/9f8d4048dfb5861c8424b4b93d6e1152-98.jpg", "descriptions": "[WiiWare]  This tournament-style outer space shooter challenges players to achieve a high score in either a 2-Minute or 5-Minute Mode. In 2-Minute Mode, players have just enough time to battle through one action-packed stage and one giant boss. In 5-Minute Mode, they also have enough time to[WiiWare]  This tournament-style outer space shooter challenges players to achieve a high score in either a 2-Minute or 5-Minute Mode. In 2-Minute Mode, players have just enough time to battle through one action-packed stage and one giant boss. In 5-Minute Mode, they also have enough time to fight their way through a second level with its own boss. Additionally, players can play Quick Shot Mode to see if they have the fastest trigger fingers around! Once gamers have their scores, they can go to the online leaderboards to see how they compare with other players in their region and can keep playing to improve their ranking. There's also significant depth and replay value to this challenging game, as players can keep practicing to learn all of the different strategies to achieve bonus points in both 2-Minute and 5-Minute Modes. If they discover them all, players might have a shot at having the top score in the world. Like traditional vertically-scrolling shooters, the game features a top-down perspective and players fly from the bottom of the screen towards the top, shooting at any ship or structure that obstructs their path. As players progress, they can collect power-ups to increase their weapon or shield strength, and an all-new Force System enables gamers to collect up to five orbiting satellites that can be held close to the ship for defensive cover, or can be sent out for additional firepower. Players can also decide how they want to play, choosing from three control schemes – Nunchuk and Wii Remote, Wii Remote only (held sideways) or the Classic Controller. [Hudson Entertainment]… Expand"}, {"name": "Yosumin! LIVE", "details_link": "https://www.metacritic.com/game/xbox-360/yosumin!-live", "publisher": "Square Enix", "release_date": "May 27 2009", "developers": ["Square Enix"], "platforms": ["PC", "Xbox 360"], "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Matching", "General"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/2fd06704e5548043db40002161cb3830-98.jpg", "descriptions": "[Xbox Live Arcade]  Yosumin! is a puzzle game where you find rectangles of matching tiles known as \"yosumin\" and make them disappear. Make massive rectangles for the ultimate feeling of satisfaction! Yosumin! is a deceptively simple yet fiendish challenge, and it's not just about solo play -[Xbox Live Arcade]  Yosumin! is a puzzle game where you find rectangles of matching tiles known as \"yosumin\" and make them disappear. Make massive rectangles for the ultimate feeling of satisfaction! Yosumin! is a deceptively simple yet fiendish challenge, and it's not just about solo play - there are online battle modes to enjoy as well. Online battle Yosumin! Take on opponents from across the globe in online battles on Xbox LIVE. Endless Yosumin! Go it alone in this non-stop single-player mode. Battle Yosumin! Challenge the system itself in battles against computer-controlled opponents. Local battle Yosumin! Beat your buddies in local vs. matches! [Square Enix]… Expand"}, {"name": "SingStar ABBA", "details_link": "https://www.metacritic.com/game/playstation-2/singstar-abba", "publisher": "SCEA", "release_date": "Dec  2 2008", "developers": ["SCEE London Studio"], "platforms": ["PlayStation 3", "PlayStation 2"], "num_players": "1-8 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 64, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/163adb2e8b70806da9381ff296bd0da3-98.jpg", "descriptions": "SingStar ABBA features 25 fabulous pop tracks so you can shine on stage and sing along to authentic ABBA music videos. Experience SingStar’s online features and personalize your content by purchasing songs, uploading videos/photos and rating the performances of others. Get ready to singSingStar ABBA features 25 fabulous pop tracks so you can shine on stage and sing along to authentic ABBA music videos. Experience SingStar’s online features and personalize your content by purchasing songs, uploading videos/photos and rating the performances of others. Get ready to sing along to some of the most unforgettable songs of all time with SingStar ABBA. 25 famous tracks with the original ABBA videos, including ‘Mamma Mia’, ‘Gimme Gimme Gimme’, ‘Waterloo’ and ‘Dancing Queen’. Connect to my SingStar Online and share your favorite SingStar moments by uploading photos and performances. Up to 8 players can perform and compete in a variety of multiplayer game modes. [Sony]… Expand"}, {"name": "Call of Duty: Roads to Victory", "details_link": "https://www.metacritic.com/game/psp/call-of-duty-roads-to-victory", "publisher": "Activision", "release_date": "Mar 13 2007", "developers": ["Amaze Entertainment"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "Up to 6 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 64, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/a86a1377924471fee4bfc6ca45adc32d-98.jpg", "descriptions": "In Call of Duty: Roads to Victory, get closer than ever to the fury of combat as an Allied soldier in World War IIs most harrowing military operation, the Normandy Breakout Campaign. Melee combat and destructible cover bring you face-to-face with German forces. Multiple attack routes meanIn Call of Duty: Roads to Victory, get closer than ever to the fury of combat as an Allied soldier in World War IIs most harrowing military operation, the Normandy Breakout Campaign. Melee combat and destructible cover bring you face-to-face with German forces. Multiple attack routes mean you decide whether to flank your enemy or hit him head on. [Activision]… Expand"}, {"name": "Wheelman", "details_link": "https://www.metacritic.com/game/xbox-360/wheelman", "publisher": "Ubisoft", "release_date": "Mar 24 2009", "developers": ["Tigon", "Midway Studios - Newcastle"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 64, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/ff6757cca160beb77aaa0b0ed53a984b-98.jpg", "descriptions": "Wheelman takes gamers on a white knuckle thrill ride that unfolds throughout the streets of Barcelona. Featuring car chases inspired by Hollywood's most famous action-sequences, Wheelman delivers powerful cinematic moments throughout the game's compelling storyline. Vin Diesel stars as anWheelman takes gamers on a white knuckle thrill ride that unfolds throughout the streets of Barcelona. Featuring car chases inspired by Hollywood's most famous action-sequences, Wheelman delivers powerful cinematic moments throughout the game's compelling storyline. Vin Diesel stars as an undercover agent and highly skilled driver who must infiltrate the Barcelona underworld to gather intelligence surrounding a covert heist. Posing as a driver-for-hire, he ends up caught in a crossfire of corruption and chaos while trying to stay one step ahead of local law enforcement and rival gangs. [Midway]… Expand"}]