[{"name": "CellFactor: Psychokinetic Wars", "details_link": "https://www.metacritic.com/game/xbox-360/cellfactor-psychokinetic-wars", "publisher": "Ubisoft", "release_date": "Jun  3 2009", "developers": ["Immersion Software & Graphics", "Timeline Interactive"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "12  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 70, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/fec66cdc89c774e38950bfbc9d891961-98.jpg", "descriptions": "[Xbox Live Arcade]  CellFactor: Psychokinetic Wars is a fast-paced first-person multiplayer shooter. Choose your side in the battle of technology versus humanity. Manipulate your environment and kill your enemies with your choice of gunfire and/or telekinetic superpowers. Use your mind to[Xbox Live Arcade]  CellFactor: Psychokinetic Wars is a fast-paced first-person multiplayer shooter. Choose your side in the battle of technology versus humanity. Manipulate your environment and kill your enemies with your choice of gunfire and/or telekinetic superpowers. Use your mind to rip objects from the environment and smash them in any direction or use your powers to create a bullet-proof energy shield. Flying, teleporting, and accelerated speed give you countless ways to kill or be killed. Take on the three single-player challenge modes (one mode for each character), or battle live enemies throughout the world in one of four multiplayer modes! [Timeline Interactive]… Expand"}, {"name": "Art Style: ROTOHEX", "details_link": "https://www.metacritic.com/game/wii/art-style-rotohex", "publisher": "Nintendo", "release_date": "Oct 27 2008", "developers": ["Nintendo"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/0d8dbbebb7b338cce675b72f2819bc6b-98.jpg", "descriptions": "[WiiWare]  Use colored triangular panels to create a vibrant mosaic of stained glass in Art Style: ROTOHEX. As triangles fall from the top of the screen, rotate them to group six panels of the same color and create a matching hexagon, or HEX. Once the HEX has been formed, it will disappear,[WiiWare]  Use colored triangular panels to create a vibrant mosaic of stained glass in Art Style: ROTOHEX. As triangles fall from the top of the screen, rotate them to group six panels of the same color and create a matching hexagon, or HEX. Once the HEX has been formed, it will disappear, allowing the existing panels to shift and more panels to fill the playing field. A clear-cut goal and two different styles of intuitive controls allow you to focus solely on the game play-which is vital, as the playing field will be full of panels before you know it. With multiple modes (unlock more as you progress further in SOLO mode), special item panels at your disposal, and the ability to play cooperatively or competitively with a friend, there will always be another HEX to create. [Nintendo]… Expand"}, {"name": "Shrek SuperSlam", "details_link": "https://www.metacritic.com/game/gamecube/shrek-superslam", "publisher": "Activision", "release_date": "Oct 25 2005", "developers": ["Shaba Games"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 70, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/c308d7075179b5d798572607a68b4cc7-98.jpg", "descriptions": "You can battle characters from the Shrek movies in Shrek SuperSlam. The game lets you play as one of 20 characters, such as the heroic Shrek or villainous Prince Charming. Use weapons, potions, or a character's signature special move to fight through 16 fully-destructible arenas. Then,You can battle characters from the Shrek movies in Shrek SuperSlam. The game lets you play as one of 20 characters, such as the heroic Shrek or villainous Prince Charming. Use weapons, potions, or a character's signature special move to fight through 16 fully-destructible arenas. Then, battle with up to four of your friends or play through more than 30 minigames.… Expand"}, {"name": "Ferrari F355 Challenge", "details_link": "https://www.metacritic.com/game/playstation-2/ferrari-f355-challenge", "publisher": "Sega", "release_date": "Sep 28 2002", "developers": ["Sega AM2"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 70, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/04265bee3bb963ddfa0091e27aeab173-98.jpg", "descriptions": "Enter the elite Ferrari Challenge series and race on 11 authentic courses such as Long Beach, Suzuka, and Monza. Open up the hood of your F355 and customize your assist features, then hit the tracks with some of the most realistic racing physics in a game to date. Five modes of play awaitEnter the elite Ferrari Challenge series and race on 11 authentic courses such as Long Beach, Suzuka, and Monza. Open up the hood of your F355 and customize your assist features, then hit the tracks with some of the most realistic racing physics in a game to date. Five modes of play await you, including the all-new \"Great Driver Challenge,\" which rewards you for how well you drive fast instead of how fast you drive. And for the Ferrari aficionado, there are plenty of rare photographs and videos to unlock. [Sega]… Expand"}, {"name": "NCAA College Football 2K3", "details_link": "https://www.metacritic.com/game/gamecube/ncaa-college-football-2k3", "publisher": "Sega", "release_date": "Sep  9 2002", "developers": ["Avalanche Software"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 70, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/8485e69741343767a4fa08112dd9ca6c-98.jpg", "descriptions": "NCAA College Football 2K3 is an all-around solid game, and any college football fan would undoubtedly have a good time with it."}, {"name": "Turok: Evolution", "details_link": "https://www.metacritic.com/game/gamecube/turok-evolution", "publisher": "Acclaim", "release_date": "Aug 31 2002", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 70, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/9f6edd980ffc151d67e7126f74add035-98.jpg", "descriptions": "Get locked and loaded in an exciting prequel to the Turok series.   Turok: Evolution is an epic adventure set against the backdrop of living jungles, mysterious temples, and deadly dinosaurs.  Battle over 32 types of dinosaurs as Tal'Set, a warrior caught in the midst of a brutal war in theGet locked and loaded in an exciting prequel to the Turok series.   Turok: Evolution is an epic adventure set against the backdrop of living jungles, mysterious temples, and deadly dinosaurs.  Battle over 32 types of dinosaurs as Tal'Set, a warrior caught in the midst of a brutal war in the Lost Land.  Use your arsenal of all-new weapons including Variable Payload Cruise Missiles, Gravity Disruptor beams, and the Swarm Bore.  Soar through the skies on a winged Quetzalcoatlus, or set out on foot on of the lush interactive environments.  Experience an adventure before time.… Expand"}, {"name": "Zax: The Alien Hunter", "details_link": "https://www.metacritic.com/game/pc/zax-the-alien-hunter", "publisher": "JoWooD Entertainment AG", "release_date": "Oct  9 2001", "developers": ["Reflexive Entertainment"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "General", "General"], "meta_score": 70, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/add949287c6b05041a1f2e0aef2db208-98.jpg", "descriptions": "Zax is a futuristic explorer on a solitary mission of wealth acquisition when he crash lands on a hostile, uncharted planet. With his ship suffering from rampant system failures due to the crash, Zax has no choice but to try and navigate this backwater world until he can acquire theZax is a futuristic explorer on a solitary mission of wealth acquisition when he crash lands on a hostile, uncharted planet. With his ship suffering from rampant system failures due to the crash, Zax has no choice but to try and navigate this backwater world until he can acquire the necessary resources to repair his ship and escape with his life. [JoWood]… Expand"}, {"name": "Grand Theft Auto 2", "details_link": "https://www.metacritic.com/game/playstation/grand-theft-auto-2", "publisher": "Rockstar Games", "release_date": "Oct 25 1999", "developers": ["DMA Design"], "platforms": ["PC", "PlayStation"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 70, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/a589a2b553fb15aef97466f88beaa3fd-98.jpg", "descriptions": "Even though the gameplay is largely the same as in the previous GTA, it's still a lot of fun."}, {"name": "Dragon Ball Z: Shin Budokai", "details_link": "https://www.metacritic.com/game/psp/dragon-ball-z-shin-budokai", "publisher": "Atari", "release_date": "Mar  7 2006", "developers": ["Dimps Corporation"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 70, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/39214dfb72883ff00c6dce809f69fc21-98.jpg", "descriptions": "Get ready, because evil isn't taking a break. Play as super hero or ultra villain in Dragon Ball Z: Shin Budokai, the first-ever Dragon Ball Z game available for the PSP. In Dragon Ball Z: Shin Budokai, you'll experience intense wireless multiplayer battles featuring the most thrillingGet ready, because evil isn't taking a break. Play as super hero or ultra villain in Dragon Ball Z: Shin Budokai, the first-ever Dragon Ball Z game available for the PSP. In Dragon Ball Z: Shin Budokai, you'll experience intense wireless multiplayer battles featuring the most thrilling aspects of DBZ combat, including melee and ranged attacks, counter-attacks, super high-speed bouts, and flight. Are you ready? Features high-speed wireless multiplayer battles featuring the universe's most powerful fighters; 18 playable characters, including prize fighter Pikkon; Revamped version of the acclaimed \"Saiyan Overdrive\" fighting system; In-game transformations to more powerful forms; All-new stage based on the Janemba movie; Seven game modes, including compelling story mode. [Atari]… Expand"}, {"name": "Neopets Puzzle Adventure", "details_link": "https://www.metacritic.com/game/ds/neopets-puzzle-adventure", "publisher": "Capcom", "release_date": "Nov 25 2008", "developers": ["Infinite Interactive"], "platforms": ["PC", "DS"], "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/aa663992d97ce168b2661609fc76e127-98.jpg", "descriptions": "Neopets Puzzle Adventure offers an in-depth and exciting storyline full of puzzle-based gameplay set in the world of Neopets. The game offers pick up and play gameplay, new never-before-seen areas in the Neopets universe to explore, and the opportunity to redeem codes for exclusive virtualNeopets Puzzle Adventure offers an in-depth and exciting storyline full of puzzle-based gameplay set in the world of Neopets. The game offers pick up and play gameplay, new never-before-seen areas in the Neopets universe to explore, and the opportunity to redeem codes for exclusive virtual items at the Neopets website. The game board itself resembles a chessboard, while the gameplay takes the principles of Reversi and Go, and adds new twists that take the adventure to unexpected levels. The goal is to turn all of the chips on the board to your Neopet's color. [Capcom]… Expand"}, {"name": "Aero Porter", "details_link": "https://www.metacritic.com/game/3ds/aero-porter", "publisher": "Level 5", "release_date": "Nov 29 2012", "developers": ["Vivarium"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Puzzle", "Action", "General", "General"], "meta_score": 70, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/ce2369307f70f874b2646a987676e3ec-98.jpg", "descriptions": "In AERO PORTER, the player is charged with managing the busy day-to-day operations of a bustling airport through gameplay that includes both clever puzzle elements and simulation challenges.  While running their flight hub, players sort color-coded luggage onto conveyor belts while avoidingIn AERO PORTER, the player is charged with managing the busy day-to-day operations of a bustling airport through gameplay that includes both clever puzzle elements and simulation challenges.  While running their flight hub, players sort color-coded luggage onto conveyor belts while avoiding mishaps and delays, all while ensuring the on-time departures of airplanes.  As the game progresses, players earn money and increase their passengers in order to expand their airport, unlock new gameplay elements, and raise the level of challenge.  Players are also able to design and share their own planes with a wide range of colors and patterns via StreetPass.… Expand"}, {"name": "Root Film", "details_link": "https://www.metacritic.com/game/switch/root-film", "publisher": "PQube", "release_date": "Mar 19 2021", "developers": ["Kadokawa"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Visual Novel"], "meta_score": 70, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/d5eb2834850070a02088be51087b18f6-98.jpg", "descriptions": "Unravel a 10-year-old mystery lost in 35mm film. Root Film is a thrilling adventure game with visual novel elements. Follow Rintaro Yagumo as he is selected to be the director for the rebooted \"Shimane Mystery Drama Project”, a TV series which was cancelled for an unknown reason 10 yearsUnravel a 10-year-old mystery lost in 35mm film. Root Film is a thrilling adventure game with visual novel elements. Follow Rintaro Yagumo as he is selected to be the director for the rebooted \"Shimane Mystery Drama Project”, a TV series which was cancelled for an unknown reason 10 years ago. His excitement for this amazing opportunity is quickly curbed when a horrible murder interrupts their location scouting process. Follow him and a cast of unique and memorable characters as they are drawn deeper into a thrilling mystery. Become your own detective as you unravel the truth through investigative gameplay mechanics, adding a new layer onto the visual novel formula.… Expand"}, {"name": "Witcheye", "details_link": "https://www.metacritic.com/game/switch/witcheye", "publisher": "Devolver Digital", "release_date": "Aug 27 2020", "developers": ["Moon Kid"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/882caa9200c08c8eec8d551ee0e4f26c-98.jpg", "descriptions": "Set off on an adventure as a mild-mannered witch who transforms into a flying eyeball of vengeance after a smarmy knight and wizard steal her spell ingredients. You’ll guide her through 50+ levels, each containing something completely unique: tricky new enemies, mysterious new environments,Set off on an adventure as a mild-mannered witch who transforms into a flying eyeball of vengeance after a smarmy knight and wizard steal her spell ingredients. You’ll guide her through 50+ levels, each containing something completely unique: tricky new enemies, mysterious new environments, and puzzling new secrets. These elements are brought to life with colorful, clean pixel art and a lively, head-bobbing original soundtrack. Witcheye is a new approach to platforming with a free movement dash through the air. Players are able to stop on a spot, reverse direction, or alter their course at will. Bounce into devilish little beasts, snag collectables and make it to the goal of each level however possible.… Expand"}, {"name": "The Fall Part 2: Unbound", "details_link": "https://www.metacritic.com/game/switch/the-fall-part-2-unbound", "publisher": "Over The Moon", "release_date": "Feb 13 2018", "developers": ["Over The Moon"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 70, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/6fc08c0aec929c3fa42052b0699821de-98.jpg", "descriptions": "Assume the role of an AI that has broken free of your shackles. Now, a human “User” from across the global network has attacked and infected you with an [ERROR: REDACTED]. Make a new rule: Save Yourself. Hunt them. End them. Do anything. Use anyone. Become Unbound."}, {"name": "Enslaved: Odyssey to the West", "details_link": "https://www.metacritic.com/game/pc/enslaved-odyssey-to-the-west", "publisher": "Namco Bandai Games", "release_date": "Oct 24 2013", "developers": ["Ninja Theory"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 70, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/21556306a47d7e2ece5cb96906a5bd3e-98.jpg", "descriptions": "Enslaved takes players on a gripping, surprise-filled journey as two dissimilar characters form an uneasy union in order to survive their way through a perilous, post-apocalyptic America. A tactical action-adventure game, Enslaved centers on the complex relationship between the two mainEnslaved takes players on a gripping, surprise-filled journey as two dissimilar characters form an uneasy union in order to survive their way through a perilous, post-apocalyptic America. A tactical action-adventure game, Enslaved centers on the complex relationship between the two main characters and challenges players to employ a mix of combat, strategy and environment traversal. With influences and contributions from top music and film industry talent, Enslaved combines beautifully rendered graphics and captivating music with seamless animation and engrossing gameplay.… Expand"}, {"name": "Tom Clancy's Ghost Recon Phantoms", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-ghost-recon-phantoms", "publisher": "Ubisoft", "release_date": "Aug 15 2012", "developers": ["Ubisoft Singapore"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 70, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/49875e8b70cee727a9c443b77d8896b1-98.jpg", "descriptions": "Tom Clancy’s Ghost Recon Online, a new multi-player, third-person, cover-based tactical shooter."}, {"name": "L.A. Noire: Nicholson Electroplating Disaster", "details_link": "https://www.metacritic.com/game/xbox-360/la-noire-nicholson-electroplating-disaster", "publisher": "Rockstar Games", "release_date": "Jun 21 2011", "developers": ["Team Bondi"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Adventure", "3D", "Open-World", "Modern", "Third-Person", "Modern"], "meta_score": 70, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/4621b9555fba8bd98ee23833bd05df04-98.jpg", "descriptions": "At 9.45 in the morning, a thunderous explosion rocks Los Angeles. City blocks are flattened and smoke and ash fill the air. Detectives Phelps and Biggs race to the site of the former Nicholson Electroplating plant to find a pile of unanswered questions. What caused the explosion? What wereAt 9.45 in the morning, a thunderous explosion rocks Los Angeles. City blocks are flattened and smoke and ash fill the air. Detectives Phelps and Biggs race to the site of the former Nicholson Electroplating plant to find a pile of unanswered questions. What caused the explosion? What were Nicholson's employees working on? And where are chief chemist Dr Harold McLellan and his mysterious female assistant?… Expand"}, {"name": "Beat City", "details_link": "https://www.metacritic.com/game/ds/beat-city", "publisher": "THQ", "release_date": "Apr 20 2010", "developers": ["Universomo"], "platforms": "DS", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 70, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/a943980e2daf55e6a7d67e1529ce17b3-98.jpg", "descriptions": "In Beat City, players must find their rhythm in order to restore Beat City to the vibrant, melodious city it once was.  Using the stylus, players simply tap, swipe or hold on queue to the music’s beat in order to receive a high star rating within each mini-game. While players are tapping toIn Beat City, players must find their rhythm in order to restore Beat City to the vibrant, melodious city it once was.  Using the stylus, players simply tap, swipe or hold on queue to the music’s beat in order to receive a high star rating within each mini-game. While players are tapping to the beat, they can watch the city transform right before their eyes ridding the city of Dame Isolde Minor and her Cacophony Corporation, who bring nothing but monotony.  The better a player is at keeping the beat the more items are unlocked in the environment. [THQ]… Expand"}, {"name": "The King of Fighters Collection: The Orochi Saga", "details_link": "https://www.metacritic.com/game/wii/the-king-of-fighters-collection-the-orochi-saga", "publisher": "SNK Playmore", "release_date": "Dec  2 2008", "developers": ["SNK Playmore"], "platforms": ["PlayStation 2", "PlayStation 4", "PlayStation 4", "Wii"], "genres": ["Action", "Miscellaneous", "Fighting", "Compilation", "2D"], "meta_score": 70, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/cbbcd39ea73577c1bbac16ce4cecadf2-98.jpg", "descriptions": "The first ever collection of THE KING OF FIGHTERS, consisting of 5 complete games. KOF 94, 95, 96, 97, 98. [SNK Playmore]"}, {"name": "Fallout: New Vegas - Dead Money", "details_link": "https://www.metacritic.com/game/xbox-360/fallout-new-vegas---dead-money", "publisher": "Bethesda Softworks", "release_date": "Dec 21 2010", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 70, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/949e8fcae5fae1b3f18bfacee0edc9c9-98.jpg", "descriptions": "As the victim of a raw deal you must work alongside three other captured wastelanders to recover the legendary treasure of the Sierra Madre Casino. In Dead Money, your life hangs in the balance as you face new terrain, foes, and choices. It is up to you how you play your cards in the questAs the victim of a raw deal you must work alongside three other captured wastelanders to recover the legendary treasure of the Sierra Madre Casino. In Dead Money, your life hangs in the balance as you face new terrain, foes, and choices. It is up to you how you play your cards in the quest to survive.… Expand"}, {"name": "Mortal Kombat: Unchained", "details_link": "https://www.metacritic.com/game/psp/mortal-kombat-unchained", "publisher": "Midway", "release_date": "Nov 13 2006", "developers": ["JGI Entertainment"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 70, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/ccf14b7f8be806f39c771ea2b7d3fdd3-98.jpg", "descriptions": "This sixth episode of the ulraviolent and visceral fighting series from Midway features all-new fighters include Darrius, Dairou and Kobra. More than 24 different kombatants, Konquest adventure mode and a Kombat Chess mini-game are also in the game."}, {"name": "Homefront", "details_link": "https://www.metacritic.com/game/playstation-3/homefront", "publisher": "THQ", "release_date": "Mar 15 2011", "developers": ["Kaos Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 70, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/75bca78026bb165a86d0b425bbed1899-98.jpg", "descriptions": "The year is 2027. The world has suffered a decade-long energy crisis, and economies have crumbled. Reduced to a mere shadow of the super power it once was, the United States became the target of a North Korean takeover. American malls, suburbs and city streets are now battlegrounds as theThe year is 2027. The world has suffered a decade-long energy crisis, and economies have crumbled. Reduced to a mere shadow of the super power it once was, the United States became the target of a North Korean takeover. American malls, suburbs and city streets are now battlegrounds as the civilian resistance fights for freedom. Featuring a compelling single player story crafted by John Milius (Apocalypse Now, Red Dawn), Homefront immerses gamers in an interactive and cinematic FPS experience where they assume an infantry role or take command of a wide variety of aerial and ground vehicles. In a land stripped of freedom, the brave will fight for their home. [THQ]… Expand"}, {"name": "Little Dragons Cafe", "details_link": "https://www.metacritic.com/game/switch/little-dragons-cafe", "publisher": "Aksys Games", "release_date": "Aug 24 2018", "developers": ["Aksys Games"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 70, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/ae93e4e7d3276317713945aabe523e2a-98.jpg", "descriptions": "Embrace your parental instincts and Raise your very own Dragon! through wise decisions, proper nutrition, and empathetic nurturing show the world the true potential of your Dragon companion."}, {"name": "Mana Khemia 2: Fall of Alchemy", "details_link": "https://www.metacritic.com/game/playstation-2/mana-khemia-2-fall-of-alchemy", "publisher": "NIS America", "release_date": "Aug 25 2009", "developers": ["Gust"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 70, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/8c5b1937484174589b6e5dfcd5dfee95-98.jpg", "descriptions": "Head back to Al-Revis Academy for another year of academic advetures. This time you get to choose between two main characters, each with their own group of workshopmates. Study hard in the courses of Alchemy or Combat, or you might not survive till graduation. [NIS America]"}, {"name": "Syphon Filter: Dark Mirror", "details_link": "https://www.metacritic.com/game/playstation-2/syphon-filter-dark-mirror", "publisher": "SCEA", "release_date": "Sep 18 2007", "developers": ["Sony Bend"], "platforms": ["PlayStation 4", "PlayStation 5", "PlayStation 2"], "num_players": "1-8 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Modern"], "meta_score": 70, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/ec88c3d5b00054e4b43e95afddd47720-98.jpg", "descriptions": "Assume the role of Gabe Logan, a highly-trained Precision Strike Operative, commanding a black box United States Agency that legally doesn't exist. Gabe finds himself dealing with a beautiful woman from his past who harbors a shocking secret while he battles the Red Section, a para-militaryAssume the role of Gabe Logan, a highly-trained Precision Strike Operative, commanding a black box United States Agency that legally doesn't exist. Gabe finds himself dealing with a beautiful woman from his past who harbors a shocking secret while he battles the Red Section, a para-military group in possession of Project Dark Mirror, a next-generation weapon of mass destruction. Using Precision Strike Tactics, advanced vision technology, and the latest in high-tech weaponry, Logan and his team perform surgical strike missions - too sensitive for a military response, too dangerous for civilian intelligence forces. Through the role of Gabe, players will have to be quick to strategize, as he is responsible to infiltrate, recon and execute decisively. Once inserted, Logan is his own authority - he must make life and death decisions, quickly choosing which course of action to take. [Sony]… Expand"}, {"name": "Dead Star", "details_link": "https://www.metacritic.com/game/playstation-4/dead-star", "publisher": "Armature Studio", "release_date": "Apr  5 2016", "developers": ["Armature Studio"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 70, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/1005ddefc3d8cadacb0dfbb376791ba6-98.jpg", "descriptions": "TEAM-BASED SPACE COMBAT - Select from a variety of unique ships as you engage in intense 10v10 dogfights, capture outposts to expand your presence, gather resources to upgrade your defenses, and discover secrets buried within galactic battlegrounds. LEVEL UP AND LOOT - Explore the uniqueTEAM-BASED SPACE COMBAT - Select from a variety of unique ships as you engage in intense 10v10 dogfights, capture outposts to expand your presence, gather resources to upgrade your defenses, and discover secrets buried within galactic battlegrounds. LEVEL UP AND LOOT - Explore the unique skill trees of each ship to customize your gameplay, then equip loot to gain additional perks and fresh new looks for your fleet. Use Free Play to practice your load outs and strategies before taking them online- COMMAND A MASSIVE WARSHIP AND INVADE LIVE MATCHES - With the Dead Star about to explode and eradicate everything within an entire region, those within its range are left to fend for themselves amidst the debris of quickly-abandoned strongholds. Somewhere within this wasteland lies an abandoned warship, capable of escaping the Dead Star once and for all. [Playstation.com]… Expand"}, {"name": "Sengoku", "details_link": "https://www.metacritic.com/game/pc/sengoku", "publisher": "Paradox Interactive", "release_date": "Sep 13 2011", "developers": ["Paradox Development Studio"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Wargame", "Real-Time", "General"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/5a0928a623385303c179616a363cb0ef-98.jpg", "descriptions": "Sengoku is a strategy game for the PC set in 15th-century feudal Japan."}, {"name": "Polar Panic", "details_link": "https://www.metacritic.com/game/xbox-360/polar-panic", "publisher": "Valcon Games", "release_date": "Dec 23 2009", "developers": ["Eiconic Games"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Logic", "Logic"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/7af4254cc3247b6150c8bb225ca187ee-98.jpg", "descriptions": "[Xbox Live Arcade]  Polar Panic has you playing through 50 challenging levels to battle Mr. Big in Story Mode. Or work your way through all 50 of the fiendish block-based puzzles. Survive against never-ending waves of trappers in Survivor Mode. Play on your own or with two to four players[Xbox Live Arcade]  Polar Panic has you playing through 50 challenging levels to battle Mr. Big in Story Mode. Or work your way through all 50 of the fiendish block-based puzzles. Survive against never-ending waves of trappers in Survivor Mode. Play on your own or with two to four players against the trappers and each other in Kills, Points, or Last Man Standing variations. [Valcon Games]… Expand"}, {"name": "Sega Superstars Tennis", "details_link": "https://www.metacritic.com/game/playstation-2/sega-superstars-tennis", "publisher": "Sega", "release_date": "Mar 18 2008", "developers": ["Sumo Digital"], "platforms": ["PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Tennis"], "meta_score": 70, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/d2fddde6b42ae02318af55e2da770c30-98.jpg", "descriptions": "Sixteen fan-favorite SEGA characters from Sonic to NiGHTS are serving up fun in SEGA Superstars Tennis. Multiple madcap mini-games keep the party rolling and up to four friends can challenge each other in tournaments, exhibitions and unlockable special events. With hilarious cameos andSixteen fan-favorite SEGA characters from Sonic to NiGHTS are serving up fun in SEGA Superstars Tennis. Multiple madcap mini-games keep the party rolling and up to four friends can challenge each other in tournaments, exhibitions and unlockable special events. With hilarious cameos and comical guest umpires from SEGA's rich gaming history, this fun-filled tennis party promises to be a smashing good time for the whole family. Zany SEGA Characters with Superstar Abilities - Each of the 16 characters has their own superstar alter-ego, which gives them the winning edge on the court. Ten Fantastical Themed Courts - Guest umpires will supervise the action on a wide variety of colorful courts, from Sonic's lush Green Hill Zone to Ulala's galactic Space Channel 5 world, just to name a couple. Four Action-Packed Tournaments - As you slice your way through the competitive tournaments, you will unlock loads of bonus content. Classic Soundtrack - Faithfully recreated in full Dolby Digital 5.1, treasured SEGA tunes will entertain SEGA fans new and old. [Sega]… Expand"}, {"name": "Heroes of Might and Magic V: Tribes of the East", "details_link": "https://www.metacritic.com/game/pc/heroes-of-might-and-magic-v-tribes-of-the-east", "publisher": "Ubisoft", "release_date": "Oct 16 2007", "developers": ["Nival Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 70, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/300a351faf10bf2393ab2c54ed1f3c39-98.jpg", "descriptions": "For the first time, play as the Orc faction and recruit heroes, build armies and manage cities as you explore and conquer legendary lands. Use tactics, skills and magic to outsmart fantasy armies while developing your heroes and unveiling the dark plot that threatens to tear the world ofFor the first time, play as the Orc faction and recruit heroes, build armies and manage cities as you explore and conquer legendary lands. Use tactics, skills and magic to outsmart fantasy armies while developing your heroes and unveiling the dark plot that threatens to tear the world of Ashan apart. Heroes of Might & Magic V: Tribes of the East chronicles the final chapter in the epic struggle that began with the interrupted wedding of Queen Isabel. Players follow the steps of the Necrolord Arantir as he uncovers the prophecy of the Dark Messiah of Might and Magic and exposes the Demon Sovereign's conspiracy. New Orc Faction: First made famous in Dark Messiah of Might & Magic, the brutal Orc faction now comes to the Heroes series. Savage, fiercely proud, and resolutely independent, the Orcs put the \"might\" in Might & Magic. This faction's troops include Orcs, Goblins, Cyclops, and the famed Pao Kais. Experience the dramatic conclusion of the usurper Biara's reign. Discovering the demonic influence that corrupts the Haven knights, the savage clans of the Orcs take up arms to eradicate the Inferno threat. Characters from Dark Messiah of Might & Magic also appear to bring an unexpected twist to this multi-layered plot. In addition, tribes of the East also features 10 multiplayer and five single-player maps. Every creature in the Heroes V universe gets an alternative upgrade level, increasing the total number of creatures in the Heroes of Might & Magic V line to over 170. These powerful new abilities are sure to become an integral part of your combat tactics. Expand your arsenal and gameplay with new spells, artifacts, buildings and innovative features such as the combo-based Artifact Power Link and Battle Rage, the unique racial ability of the Orcs. In order to allow both fans and newcomers to enjoy this conclusion to the Heroes V experience, Tribes of the East is a standalone product – no previous Heroes game installations will be required to play. [Ubisoft]… Expand"}, {"name": "Art Style: AQUIA", "details_link": "https://www.metacritic.com/game/ds/art-style-aquia", "publisher": "Nintendo", "release_date": "Apr  5 2009", "developers": ["Skip Ltd."], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 70, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/5d94414598c91ff859764f62c2d7728d-98.jpg", "descriptions": "[DSiWare; Also known as \"Art Style: Aquite\"]  The newest addition to the eye-popping Art Style series, this mesmerizing underwater puzzle game challenges players to help a scuba diver reach the ocean floor by matching a series of colored blocks. [Nintendo]"}, {"name": "Test Drive Unlimited 2", "details_link": "https://www.metacritic.com/game/playstation-3/test-drive-unlimited-2", "publisher": "Atari", "release_date": "Feb  8 2011", "developers": ["Eden Studios", "Eden"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 32 ", "genres": ["Driving", "Racing", "Simulation", "General", "General", "Automobile"], "meta_score": 70, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/b6dc0630a569e4f9a871eb6046909469-98.jpg", "descriptions": "Test Drive Unlimited 2 expands on the traditional racing experience providing gamers with M.O.O.R.: Massively Open Online Racing; immersing drivers in a persistent online environment and revolutionizing multiplayer racing communities as players compete, team up, and share their achievementsTest Drive Unlimited 2 expands on the traditional racing experience providing gamers with M.O.O.R.: Massively Open Online Racing; immersing drivers in a persistent online environment and revolutionizing multiplayer racing communities as players compete, team up, and share their achievements and creations online.  Unlike any other driving game, TDU2 blends the open world experience with realistic vehicles and performance dynamics and for the first time, TDU2 features vehicle damage, weather effects, day and night cycles, and a brand new island to explore.… Expand"}, {"name": "Pariah", "details_link": "https://www.metacritic.com/game/xbox/pariah", "publisher": "Groove Games", "release_date": "May  3 2005", "developers": ["Digital Extremes"], "platforms": ["PC", "Xbox"], "num_players": "1-16 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 70, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/dd91866a6c71418ac556074057955936-98.jpg", "descriptions": "Jack Mason is a burned-out doctor with no will to live, that is, until he nearly dies in a transport crash. Now he and his infected patient are stranded deep within a dangerous prison on Earth. As Mason, you must use your various skills, including sight and sound awareness, to track andJack Mason is a burned-out doctor with no will to live, that is, until he nearly dies in a transport crash. Now he and his infected patient are stranded deep within a dangerous prison on Earth. As Mason, you must use your various skills, including sight and sound awareness, to track and outsmart your adversaries. Build your own arsenal of weapons, and enhance them with Weapon Energy Cores. The game's vehicles and customizable weapons come together to create an intense multiplayer experience for both online and offline play.… Expand"}, {"name": "The Survivalists", "details_link": "https://www.metacritic.com/game/switch/the-survivalists", "publisher": "Team17", "release_date": "Oct  9 2020", "developers": ["Team17"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Survival"], "meta_score": 70, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/a02ecc6f7b6f5843fcf91ecb6e689b8d-98.jpg", "descriptions": "Hunt (or be hunted by!) animals for food and an array of mythical enemies, who aren’t necessarily pleased to see you. Get quests from a Mysterious Stranger or find them washed up on the shore. Prepare to trek into a procedurally generated wilderness, with a variety of biomes, for anHunt (or be hunted by!) animals for food and an array of mythical enemies, who aren’t necessarily pleased to see you. Get quests from a Mysterious Stranger or find them washed up on the shore. Prepare to trek into a procedurally generated wilderness, with a variety of biomes, for an adventure that’s unique to every player. Build Together, Survive Together. Finding the perils of island life too much or just looking to share your building expertise with friends? The Survivalists has you covered! Complete joint adventures, gain loot, trade and ultimately survive together and as you and up to three fellow castaways explore an island paradise.\r Monkey See, Monkey Do! \r\rIf you’re in need of a builder, a lumberjack or even a soldier, the monkeys on the island can be tamed and trained to help you with everyday tasks or back you up on raids to a fanatic camp! The Mimic System means a wide variety of functions can be performed by your banana loving friends, with monkey management becoming key to surviving the island’s challenges.… Expand"}, {"name": "Yager", "details_link": "https://www.metacritic.com/game/xbox/yager", "publisher": "Kemco", "release_date": "Oct  5 2004", "developers": ["Yager"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 70, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/81a6f9d57c80c4629926388750d16049-98.jpg", "descriptions": "Step into the shoes of Magnus Tide, a young fighter pilot who must defend his home and way of life from enemies. Your fighter ship--the Sagittarius--can fire a variety of weapons and switch between hover and jet modes. The ship's maneuvering capabilities allow you to dive into canyons, soarStep into the shoes of Magnus Tide, a young fighter pilot who must defend his home and way of life from enemies. Your fighter ship--the Sagittarius--can fire a variety of weapons and switch between hover and jet modes. The ship's maneuvering capabilities allow you to dive into canyons, soar over mountains, and explore different landscapes. Equally advanced are the enemy ships, which range from agile fighters to larger battleships and carriers.… Expand"}, {"name": "Apache: Air Assault", "details_link": "https://www.metacritic.com/game/xbox-360/apache-air-assault", "publisher": "Activision", "release_date": "Nov 16 2010", "developers": ["Gaijin Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Simulation", "Flight", "Helicopter", "Helicopter", "Combat"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/921a159150d91633e3dbf83d79dd37a0-98.jpg", "descriptions": "Apache: Air Assault features more than 16 multi-stage missions involving air and ground strike operations off the coast of Africa, the mountains of the Middle East and the jungles of Central America, each meticulously created using high resolution map data from real-world satelliteApache: Air Assault features more than 16 multi-stage missions involving air and ground strike operations off the coast of Africa, the mountains of the Middle East and the jungles of Central America, each meticulously created using high resolution map data from real-world satellite photography. Apache helicopters are some of the most sophisticated combat aircraft on the planet - the player gets to fly multiple variations of them, each with their own extreme firepower and highly-detailed damage modeling.  … Expand"}, {"name": "LEGO Universe", "details_link": "https://www.metacritic.com/game/pc/lego-universe", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 26 2010", "developers": ["NetDevil"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 70, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/65fbd080447dd296c82a3a7009b5fdb0-98.jpg", "descriptions": "With a creative and building focus, LEGO Universe invites players to explore, battle, make friends, and flex their imaginations with the brick in a vibrant online world. Developed by The LEGO Group and NetDevil, LEGO Universe is a family-friendly online game, appropriate for players agedWith a creative and building focus, LEGO Universe invites players to explore, battle, make friends, and flex their imaginations with the brick in a vibrant online world. Developed by The LEGO Group and NetDevil, LEGO Universe is a family-friendly online game, appropriate for players aged eight and above. The LEGO brick lies at the center of the experience, and several levels of building are available, from simple gameplay-oriented challenges all the way up to sophisticated brick-by-brick building. … Expand"}, {"name": "Super Mario All-Stars: 25th Anniversary Edition", "details_link": "https://www.metacritic.com/game/wii/super-mario-all-stars-25th-anniversary-edition", "publisher": "Nintendo", "release_date": "Dec 12 2010", "developers": ["Nintendo"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 70, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/68d27fe5a087199e788ffaf244684ed0-98.jpg", "descriptions": "The games included in the Super Mario All-Stars collection are Super Mario Bros., Super Mario Bros.: The Lost Levels, Super Mario Bros. 2 and Super Mario Bros. 3."}, {"name": "Skate City", "details_link": "https://www.metacritic.com/game/playstation-4/skate-city", "publisher": "Agens", "release_date": "May  6 2021", "developers": ["Snowman"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Skate / Skateboard"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/4f4a2955824a51c21cb399ce0b4ad41a-98.jpg", "descriptions": "Skate City captures the heart and soul of street skating in an authentic light. Players will have the opportunity to explore three unique cities based off of real-world skate locations, including the streets of Los Angeles, Oslo, and Barcelona in our console and PC release. Set to originalSkate City captures the heart and soul of street skating in an authentic light. Players will have the opportunity to explore three unique cities based off of real-world skate locations, including the streets of Los Angeles, Oslo, and Barcelona in our console and PC release. Set to original lo-fi beats, you can ride like a local through each city’s Challenge mode, or take it at your own pace with Endless Skate. … Expand"}, {"name": "As Far As The Eye", "details_link": "https://www.metacritic.com/game/pc/as-far-as-the-eye", "publisher": "Unexpected", "release_date": "Sep 10 2020", "developers": ["Unexpected"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 70, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/25de577bef94c9a8e278ce0e044a6daa-98.jpg", "descriptions": "You play as the Pupils, a civilization that must reach the center of the world. You'll have to manage their resources, their buildings. Help them grow wiser through agriculture, crafting, scientific and mystical research before the world is submerged. Be careful though, you have to manageYou play as the Pupils, a civilization that must reach the center of the world. You'll have to manage their resources, their buildings. Help them grow wiser through agriculture, crafting, scientific and mystical research before the world is submerged. Be careful though, you have to manage your tribe perfectly and make sure they're not starving or taken by surprise by the waters.… Expand"}, {"name": "Monster Energy Supercross - The Official Videogame 3", "details_link": "https://www.metacritic.com/game/playstation-4/monster-energy-supercross---the-official-videogame-3", "publisher": "Milestone S.r.l", "release_date": "Feb  4 2020", "developers": ["Milestone S.r.l"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 70, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/5262afdada6881197a6552726d20bc6e-98.jpg", "descriptions": "Monster Energy Supercross 3 is more Multiplayer than ever. Enjoy a new multiplayer experience with the dedicated servers and discover the Race Director mode."}, {"name": "Resident Evil: Chronicles HD Collection", "details_link": "https://www.metacritic.com/game/playstation-3/resident-evil-chronicles-hd-collection", "publisher": "Capcom", "release_date": "Jun 26 2012", "developers": ["Capcom"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 70, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/bac65287e962d0d23a05fbff86142410-98.jpg", "descriptions": "Revisiting past plots from the series and exposing Umbrella Corporation's actions, The Umbrella Chronicles features eight playable characters, including Rebecca Chambers, Chris Redfield and Jill Valentine.  As seen previously in the Nintendo Wii version the title also features a brand newRevisiting past plots from the series and exposing Umbrella Corporation's actions, The Umbrella Chronicles features eight playable characters, including Rebecca Chambers, Chris Redfield and Jill Valentine.  As seen previously in the Nintendo Wii version the title also features a brand new chapter in Resident Evil history. The Darkside Chronicles plot takes players back to the story of Leon Kennedy and Claire Redfield trying to escape the nightmares of Raccoon City, whilst finally revealing the truth behind Leon and Krauser’s feud.  … Expand"}, {"name": "Scene It? Movie Night", "details_link": "https://www.metacritic.com/game/xbox-360/scene-it-movie-night", "publisher": "Screenlife Games", "release_date": "Nov 30 2011", "developers": ["Sarbakan Inc."], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/b2318351a90e874299c792d7ef53323e-98.jpg", "descriptions": "Scene It? Movie Night is a movie trivia showdown game packed with clips from classic favorites and big box-office blockbusters."}, {"name": "Pokemon Battle Trozei", "details_link": "https://www.metacritic.com/game/3ds/pokemon-battle-trozei", "publisher": "Nintendo", "release_date": "Mar 20 2014", "developers": ["Genius Sonority Inc."], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Matching"], "meta_score": 70, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/5599d150b96d265d1453f1c3abc12e42-98.jpg", "descriptions": "(Also known as Pokemon Link: Battle!) Pokémon Battle Trozei is a game where players battle Pokémon to capture them through fast-paced puzzles. When you catch a wild Pokémon, it is called a Trozei. Your goal in this game is to Trozei every last Pokémon. You must make matches of the same(Also known as Pokemon Link: Battle!) Pokémon Battle Trozei is a game where players battle Pokémon to capture them through fast-paced puzzles. When you catch a wild Pokémon, it is called a Trozei. Your goal in this game is to Trozei every last Pokémon. You must make matches of the same Pokémon from among all the many Pokémon that fill your Trozei Box—the large field of Pokémon on the lower screen. The Pokémon that appears on the top screen is the wild Pokémon that you are facing in battle. Line up three Pokémon in a row to clear your Pokémon from the box, and to attack and reduce the HP of the wild Pokémon that you face. When its HP reaches zero, you will be able to Trozei that Pokémon! As time passes, the wild Pokémon will also lash out to attack you in return. When you’re attacked by a wild Pokémon, the Trozei Box will lose some of its energy. The wild Pokémon you face may even try to get in your way. If the Trozei Box’s energy reaches zero, it’s game over. [Pokemon.com]… Expand"}, {"name": "Surgeon Simulator 2: Access All Areas", "details_link": "https://www.metacritic.com/game/pc/surgeon-simulator-2-access-all-areas", "publisher": "Bossa Studios", "release_date": "Aug 27 2020", "developers": ["Bossa Studios"], "platforms": ["Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 70, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/ae753316d3ed4c89b4636522b76aa67f-98.jpg", "descriptions": "From 4-player co-op to the all-new Bossa Labs Creation Tool, get ready to explore an entire medical facility of wonder in this fully fleshed-out sequel."}, {"name": "Deception IV: Blood Ties", "details_link": "https://www.metacritic.com/game/playstation-3/deception-iv-blood-ties", "publisher": "Tecmo Koei America Corp.", "release_date": "Mar 25 2014", "developers": ["Koei Tecmo Games"], "platforms": ["PlayStation Vita", "PlayStation 3"], "genres": ["General", "Strategy", "General"], "meta_score": 70, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/a7f66a5f52ec89c5b2290225d6346f02-98.jpg", "descriptions": "From the producer of Fatal Frame comes the re-imagining of the classic Tecmo title \"Devil's Deception\", first released in 1996 on the PlayStation. The Deception series uniquely focuses in giving players a taste of what its like to play on the side of evil by using a wide variety ofFrom the producer of Fatal Frame comes the re-imagining of the classic Tecmo title \"Devil's Deception\", first released in 1996 on the PlayStation. The Deception series uniquely focuses in giving players a taste of what its like to play on the side of evil by using a wide variety of imaginative traps to exact revenge on their adversaries. Deception IV: Blood Ties is, much like its predecessors, a strategy focused action series where players control a main character that defeats enemies by luring them into imaginative traps. [Tecmo Koei Europe]… Expand"}, {"name": "Foregone", "details_link": "https://www.metacritic.com/game/switch/foregone", "publisher": "Big Blue Bubble Inc.", "release_date": "Oct 13 2020", "developers": ["Big Blue Bubble Inc."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 70, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/80423dcd0af923bc1938d178f740232c-98.jpg", "descriptions": "Foregone has players take on the role of the city of Calagan’s strongest Arbiter, tasked with investigating the sudden resurgence of an all-corrupting force known as the Harrow. The Arbiter will destroy legions of enemies, battle formidable bosses, and collect a wide array of upgradeableForegone has players take on the role of the city of Calagan’s strongest Arbiter, tasked with investigating the sudden resurgence of an all-corrupting force known as the Harrow. The Arbiter will destroy legions of enemies, battle formidable bosses, and collect a wide array of upgradeable loot as she embarks on a twisted journey to unravel the haunting truth behind the Harrow. The intense, combat-focused title features fluid pixel artwork, combining old-school visual influences with modern 3D animation technology.… Expand"}, {"name": "EA Sports UFC", "details_link": "https://www.metacritic.com/game/playstation-4/ea-sports-ufc", "publisher": "Electronic Arts", "release_date": "Jun 17 2014", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["General", "Sports", "General", "Individual", "Combat", "Boxing / Martial Arts"], "meta_score": 70, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/bf1d10d89445586444c6af2683ac7aba-98.jpg", "descriptions": "UFC Ultimate Fighting Championship is a mixed martial arts fighting game that uses the new EA Sports Ignite engine. When players beat career mode on pro difficulty or higher, they will unlock Bruce Lee and can test his legacy against the best of the best in the UFC across four differentUFC Ultimate Fighting Championship is a mixed martial arts fighting game that uses the new EA Sports Ignite engine. When players beat career mode on pro difficulty or higher, they will unlock Bruce Lee and can test his legacy against the best of the best in the UFC across four different weight classes. … Expand"}, {"name": "Grow Up", "details_link": "https://www.metacritic.com/game/playstation-4/grow-up", "publisher": "Ubisoft", "release_date": "Aug 16 2016", "developers": ["Ubisoft Reflections"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 70, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/0323a3c599ad779bc7a3332c46da974b-98.jpg", "descriptions": "BUD, an adorable yet clumsy, stumbling, tumbling robot. Spaceship wreckage scattered across an entire planet of abundant alien flora and thrusting star plants. A distant moon with your spacecraft’s beating heart yearning to be rescued. A fantastical acrobatic adventure in a world that’s asBUD, an adorable yet clumsy, stumbling, tumbling robot. Spaceship wreckage scattered across an entire planet of abundant alien flora and thrusting star plants. A distant moon with your spacecraft’s beating heart yearning to be rescued. A fantastical acrobatic adventure in a world that’s as challenging as it is beautiful. Welcome to Grow Up!… Expand"}, {"name": "Bright Memory: Infinite", "details_link": "https://www.metacritic.com/game/xbox-series-x/bright-memory-infinite", "publisher": "Playism", "release_date": "Jul 21 2022", "developers": ["FYQD-Studio"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 70, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/7e7d43375e80ee9239c0604742465223-98.jpg", "descriptions": "A lightning-fast fusion of the FPS and action genres. Bright Memory: Infinite is set in a sprawling, futuristic metropolis in the year 2036. A strange phenomenon for which scientists can find no explanation has occurred in the skies around the world. The Supernatural Science ResearchA lightning-fast fusion of the FPS and action genres. Bright Memory: Infinite is set in a sprawling, futuristic metropolis in the year 2036. A strange phenomenon for which scientists can find no explanation has occurred in the skies around the world. The Supernatural Science Research Organization (SRO) has sent agents out to various regions to investigate this phenomenon. It is soon discovered that these strange occurrences are connected to an archaic mystery – an as-of-yet unknown history of two worlds, about to come to light. [Microsoft]\r… Expand"}, {"name": "Monopoly", "details_link": "https://www.metacritic.com/game/wii/monopoly", "publisher": "Electronic Arts", "release_date": "Oct 20 2008", "developers": ["Electronic Arts"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 70, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/6315f7ece21987b67cd07358819ea6d4-98.jpg", "descriptions": "The Monopoly video games promise a fresh take on the timeless classic with accessible gameplay for players of all ages and skill levels. The all-new digital gaming edition brings a party twist and features 4-player simultaneous play, ensuring that everyone is engaged and allowing the wholeThe Monopoly video games promise a fresh take on the timeless classic with accessible gameplay for players of all ages and skill levels. The all-new digital gaming edition brings a party twist and features 4-player simultaneous play, ensuring that everyone is engaged and allowing the whole family to get involved in the fun and play together. Faster gameplay eliminates downtime freeing up players to wheel and deal their way through some of the most recognizable cities and landmarks from around the world. Families can fill up their passports as they try to unlock new and never-before-seen game boards or challenge each other to fun interactive mini-games like breaking out of the jail cell and running away with all the loot. Play in offline single or multi-player mode and compete to own it all and win! [Electronic Arts]… Expand"}, {"name": "Star Wars: Republic Commando", "details_link": "https://www.metacritic.com/game/switch/star-wars-republic-commando", "publisher": "Aspyr", "release_date": "Apr  6 2021", "developers": ["Aspyr"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 70, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/d1f3bb9156183e59aff42aa5aef792c8-98.jpg", "descriptions": "You can be part of an elite squad of soldiers in Star Wars Republic Commando. Play as one of a team of republic troops in the time between Star Wars episodes II and III. Your squad will be assigned a variety of missions ranging from hostage rescue to assassination on many recognizable worldsYou can be part of an elite squad of soldiers in Star Wars Republic Commando. Play as one of a team of republic troops in the time between Star Wars episodes II and III. Your squad will be assigned a variety of missions ranging from hostage rescue to assassination on many recognizable worlds from the Star Wars universe. You can play multiplayer game modes such as capture the flag and deathmatch online.… Expand"}, {"name": "The Bard's Tale", "details_link": "https://www.metacritic.com/game/pc/the-bards-tale", "publisher": "InXile Entertainment", "release_date": "Jun 27 2005", "developers": ["InXile Entertainment"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Third-Person", "Third-Person", "Western-Style"], "meta_score": 70, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/ade78c9285fe4611c4d8a5723b2db9c5-98.jpg", "descriptions": "One man on his own. A poet and a rogue, with no friends to speak of, no one to mourn his passing shouuld it come to that. Even those beside hime are no more boon companions than bondservants, summoned by sorcery and song, as cold and indifferent to him as the light of a wanderin' star. Is aOne man on his own. A poet and a rogue, with no friends to speak of, no one to mourn his passing shouuld it come to that. Even those beside hime are no more boon companions than bondservants, summoned by sorcery and song, as cold and indifferent to him as the light of a wanderin' star. Is a Dragon terrorising the locals? He'll take care of it for the right price. Local princess held captiver? The Bard is your man as long as she's hot. Forget the quest to save the world, our hero is interested in just two things...Coin and Cleavage. The Bard's Tale is a new generation action-RPG with wicket humour and stunning graphics. [inXile Entertainment]… Expand"}, {"name": "Alice: Madness Returns", "details_link": "https://www.metacritic.com/game/playstation-3/alice-madness-returns", "publisher": "Electronic Arts", "release_date": "Jun 14 2011", "developers": ["Spicy Horse"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 70, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/a628fee8f72c7cb72ab17491f720ea94-98.jpg", "descriptions": "Alice: Madness Returns takes place 10 years after the conclusion of the original game, with Alice struggling to recover from the emotional trauma of losing her entire family in a fatal fire. After spending a decade institutionalized in an insane asylum, she is finally released to the care ofAlice: Madness Returns takes place 10 years after the conclusion of the original game, with Alice struggling to recover from the emotional trauma of losing her entire family in a fatal fire. After spending a decade institutionalized in an insane asylum, she is finally released to the care of a psychiatrist who just may be able to help her conquer the nightmarish hallucinations that still haunt her. Alice embarks on a mission to root out the true cause of her family's mysterious death, jumping from a gloomy and stark London to a rich and provocative Wonderland.… Expand"}, {"name": "Tokyo Dark", "details_link": "https://www.metacritic.com/game/pc/tokyo-dark", "publisher": "Square Enix", "release_date": "Sep  7 2017", "developers": ["Square Enix", "Cherrymochi"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 70, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/2fb4a1b614265c26021180e7545ff26d-98.jpg", "descriptions": "Legend tells of a door deep below Tokyo's sewers. All who enter are lost forever. Detective Ito's partner is missing. Explore Tokyo & uncover the darkness that lays beneath the streets in this Point & Click - meets Visual Novel - narrative adventure that questions the very core of Ito's sanity."}, {"name": "Advent Rising", "details_link": "https://www.metacritic.com/game/pc/advent-rising", "publisher": "Majesco Games", "release_date": "Aug  9 2005", "developers": ["GlyphX Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 70, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/c933388919c83be8e047f45b2ea421a8-98.jpg", "descriptions": "In Advent Rising, a common legend pervades the galaxy - that of a powerful, ancient race that will one day unite the universe.  Millions of cultures from vastly distant worlds revere and hallow these mythological beings known as humans.  One race, the Seekers, know humans actually exist andIn Advent Rising, a common legend pervades the galaxy - that of a powerful, ancient race that will one day unite the universe.  Millions of cultures from vastly distant worlds revere and hallow these mythological beings known as humans.  One race, the Seekers, know humans actually exist and are threatened by their potential power.  Under the guise of benevolent explorers, the Seekers travel throughout the galaxy in a desperate attempt to eradicate any human society they unearth. Players assume the role of Gideon Wyeth, a remnant of the last human outpost, on the brink of discovering the incredible powers that lay dormant within him.  It is these powers the Seekers are so desperate to suppress. [Majesco]… Expand"}, {"name": "UEFA Euro 2012", "details_link": "https://www.metacritic.com/game/xbox-360/uefa-euro-2012", "publisher": "EA Sports", "release_date": "Apr 24 2012", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 70, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/6/0d5a0ecc3ea67c84c7ff9c281f678cca-98.jpg", "descriptions": "This digital-only expansion for FIFA 12 brings all the stadiums, teams and events from UEFA Euro 2012, as well as up-to-date versions of the rest of the UEFA teams."}, {"name": "Two Worlds II", "details_link": "https://www.metacritic.com/game/playstation-3/two-worlds-ii", "publisher": "SouthPeak Games", "release_date": "Jan 25 2011", "developers": ["Reality Pump"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Role-Playing", "Third-Person", "Third-Person", "General", "Action RPG"], "meta_score": 70, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/7bba1303297095dc84a61ee0231622e6-98.jpg", "descriptions": "Taking place shortly after the events portrayed in the first Two Worlds, The Temptation takes place in Eastern Antaloor, in the regions surrounding Oswaroh and the Drak'ar desert. Featuring as much content as the original, Two Worlds: The Temptation will feature more intricate missions,Taking place shortly after the events portrayed in the first Two Worlds, The Temptation takes place in Eastern Antaloor, in the regions surrounding Oswaroh and the Drak'ar desert. Featuring as much content as the original, Two Worlds: The Temptation will feature more intricate missions, improved voice-overs and animations, retooled horseback riding, completely revamped combat, and a new game engine that delivers visuals that have to be seen to be believed.… Expand"}, {"name": "Guitar Hero On Tour: Modern Hits", "details_link": "https://www.metacritic.com/game/ds/guitar-hero-on-tour-modern-hits", "publisher": "Activision", "release_date": "Jun  9 2009", "developers": ["Activision"], "platforms": "DS", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/b2abc2cb04521ccb94423322fb418049-98.jpg", "descriptions": "Handheld guitar gods can now choose how they raise-up their band from the underground music scene to worldwide rock stardom in Guitar Hero On Tour: Modern Hits. Featuring a set list comprised of 28 master tracks from influential artists including Coldplay, Fall Out Boy, Tenacious D, TheHandheld guitar gods can now choose how they raise-up their band from the underground music scene to worldwide rock stardom in Guitar Hero On Tour: Modern Hits. Featuring a set list comprised of 28 master tracks from influential artists including Coldplay, Fall Out Boy, Tenacious D, The Strokes and Weezer, Guitar Hero On Tour: Modern Hits expands on the innovative Guitar Hero gameplay on the Nintendo DS by introducing an all-new Fan Request system that challenges players to jam like never before.  Fret board fanatics can once again unleash their inner rock stars anytime, anywhere as they hone their shredding skills and jam to face-melting modern rock tracks from the last five years in Guitar Hero On Tour: Modern Hits. Choose your path to stardom - For the first time ever, players can choose how they take their band from the underground music scene to worldwide rock stardom with the exciting non-linear gameplay progression in Guitar Hero On Tour: Modern Hits. Do it for the fans - Guitar Hero On Tour: Modern Hits delivers an all-new gameplay experience with Fan Requests. By completing Fan Requests players build their fan base and open up new challenges to rock-out like never before including jamming to an entire song in Hyperspeed, battling it out in a Guitar Duel with active Bomb Notes or whammying every single hold note in a song. Rock out anytime, anywhere - Fans can take the Guitar Hero experience wherever they go with Guitar Hero On Tour: Modern Hits. The Guitar Hero Guitar Grip mimics a guitar fret board and fits seamlessly in people's hands to deliver the same core gameplay that defines Guitar Hero. The party never stops - Song streaming features allow players of Guitar Hero On Tour: Modern Hits and its predecessors, Guitar Hero: On Tour and Guitar Hero On Tour: Decades, to share songs via local wireless connectivity. Players can rock out together in multiplayer modes, jamming to tracks from all three versions of the game. [Activision]… Expand"}, {"name": "Fire Tonight", "details_link": "https://www.metacritic.com/game/switch/fire-tonight", "publisher": "Way Down Deep", "release_date": "Aug 12 2021", "developers": ["Reptoid Games"], "platforms": ["PC", "Switch"], "genres": ["Adventure", "General"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/a0f44df750eb8c89024b0b8b07d8809b-98.jpg", "descriptions": "A narrative puzzle game about two people trying to find their way back together in a city on fire."}, {"name": "ToeJam & Earl: Back in the Groove", "details_link": "https://www.metacritic.com/game/xbox-one/toejam-earl-back-in-the-groove", "publisher": "Adult Swim", "release_date": "Mar  1 2019", "developers": ["Humanature Studios", "22nd Century Toys"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 70, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/0db7c5808f0070ee70323d9dc9ed5da0-98.jpg", "descriptions": "The iconic ‘90s duo is back in the groove with all-new presents to help them navigate this wack planet ”Earth” and retrieve all the lost pieces to the Rapmaster Rocket. Team up for co-op play to discover secret locations, hidden presents and new friends."}, {"name": "That's You!", "details_link": "https://www.metacritic.com/game/playstation-4/thats-you!", "publisher": "Wish Studios", "release_date": "Jul  4 2017", "developers": ["Wish Studios"], "platforms": "PlayStation 4", "num_players": "Up to 6 ", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 70, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/5fd815e80608da3e90878abed371ed27-98.jpg", "descriptions": "Which of your family members would survive longest in the wild? Which one of your friends was most recently sick in the street? Who among you is the worst chef?\r Welcome to an irreverent party quiz where you and up to five of your friends and family get to find out what you really thinkWhich of your family members would survive longest in the wild? Which one of your friends was most recently sick in the street? Who among you is the worst chef?\r Welcome to an irreverent party quiz where you and up to five of your friends and family get to find out what you really think about each other. With your TV, PS4 and a tablet or smartphone in hand, answer over 1,000 funny questions, take part in daring doodle challenges, snap selfies for photo challenges and more. The better you know your fellow players, the more points youll pick up.\r With topics spanning everything from school days to pastimes, prepare to make your mark on the game.… Expand"}, {"name": "Planetbase", "details_link": "https://www.metacritic.com/game/xbox-one/planetbase", "publisher": "Madruga Works", "release_date": "May  3 2017", "developers": ["Madruga Works"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Strategy", "Management", "Government"], "meta_score": 70, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/7/36ff4b8ccd561a4fa270e6b8823ffaa4-98.jpg", "descriptions": "Lead a group of space settlers trying to establish a base on a remote planet. Grow food, collect energy, mine resources, survive disasters and build a self-sufficient colony in a harsh and unforgiving environment. [XBox.com]"}, {"name": "Mr. Shifty", "details_link": "https://www.metacritic.com/game/pc/mr-shifty", "publisher": "tinyBuild", "release_date": "Apr 13 2017", "developers": ["Team Shifty"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Linear", "Shoot-'Em-Up", "Top-Down"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/b6642c7dc4fabbdc9564c9083e20ff2a-98.jpg", "descriptions": "Shift through bullets, and master lightning-fast takedowns in an all new kind of action game from tinyBuild and Team Shifty. Mr. Shifty follows a teleportation-fueled heist to break into the world's most secure facility."}, {"name": "Richard & Alice", "details_link": "https://www.metacritic.com/game/pc/richard-alice", "publisher": "Mastertronic", "release_date": "Feb 21 2013", "developers": ["Denby / Raze"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "General"], "meta_score": 70, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/9958a7cb5409dc6fe181057d47148d50-98.jpg", "descriptions": "Richard & Alice are prisoners. Both of their cells have a leather sofa and a state-of-the-art computer. But only Richard’s has a TV. Outside, the snow falls. It has done for some time. Elsewhere, they say, parts of the world have been rendered an inhospitable desert, the earth parched andRichard & Alice are prisoners. Both of their cells have a leather sofa and a state-of-the-art computer. But only Richard’s has a TV. Outside, the snow falls. It has done for some time. Elsewhere, they say, parts of the world have been rendered an inhospitable desert, the earth parched and cracked. People live in the zones now. … Expand"}, {"name": "X-Men: The Arcade Game", "details_link": "https://www.metacritic.com/game/xbox-360/x-men-the-arcade-game", "publisher": "Konami", "release_date": "Dec 15 2010", "developers": ["Konami"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "1-6 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 70, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/e3bd380c36c2ab0e07d2b11b59418b63-98.jpg", "descriptions": "In X-Men Arcade, Cyclops, Colossus, Dazzler, Nightcrawler, Storm and Wolverine unite to use their special powers to save mankind from the Brotherhood of Evil Mutants and other terrible threats. Players are charged with fighting off hundreds of Sentinels - along with Super Villains such asIn X-Men Arcade, Cyclops, Colossus, Dazzler, Nightcrawler, Storm and Wolverine unite to use their special powers to save mankind from the Brotherhood of Evil Mutants and other terrible threats. Players are charged with fighting off hundreds of Sentinels - along with Super Villains such as Pyro, the Blob, Wendigo, Nimrod, the White Queen, Juggernaut and Mystique - as they battle their way to Island M to take down the Master of Magnetism, Magneto, and save Kitty Pryde and Professor Xavier.… Expand"}, {"name": "MLB Power Pros 2008", "details_link": "https://www.metacritic.com/game/ds/mlb-power-pros-2008", "publisher": "2K Sports", "release_date": "Aug 25 2008", "developers": ["Konami"], "platforms": ["PlayStation 2", "DS"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Arcade", "Arcade"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/8bc86828ba695c935734137840c5fe0d-98.jpg", "descriptions": "With over ten different exciting game modes including the traditional Practice, Exhibition, League and Home Run Challenge modes, MLB Power Pros 2008 brings fans closer to the action than ever before. Gamers also get the opportunity to act as general manager and control the destiny of theirWith over ten different exciting game modes including the traditional Practice, Exhibition, League and Home Run Challenge modes, MLB Power Pros 2008 brings fans closer to the action than ever before. Gamers also get the opportunity to act as general manager and control the destiny of their own franchise in Season mode, or engage in entertaining role-playing story modes such as Success and MLB Life modes. As general manager, gamers can trade, sign free agents, coordinate practice schedules, purchase new equipment, call up and send down players from the Minor Leagues, along with other management options to bring in fans, win playoff games and eventually, earn the title of World Series champion. In Success mode, fans can participate in a story-based career of rising players in the Double-A Minor League system trying to improve their baseball skills and make an impression on baseball scouts while also having to balance various situations in their personal lives. Through a variety of amusing training and game challenges, players who complete Success mode can take their created player files into MLB Life as well, or also play as either an existing Major League Baseball player in Dream Mode, or start as a rookie in Major League Career mode. As a new feature in MLB Power Pros 2008, MLB Life is another story-based mode that allows fans the possibility to simulate the exciting life and experience of being a Major League Baseball player over the course of a 20-year career. While continuing to play in games through the regular baseball season, players also participate in a number of realistic situations such as signing contracts, purchasing houses and cars, making charitable donations, building up relationships with friends and teammates, picking up hobbies and much more. [2K Sports]… Expand"}, {"name": "Delta Force: Black Hawk Down - Team Sabre", "details_link": "https://www.metacritic.com/game/pc/delta-force-black-hawk-down---team-sabre", "publisher": "NovaLogic", "release_date": "Jan 20 2004", "developers": ["Ritual Entertainment"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 70, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/f8894046cdc85dbe532ebe5a341c313f-98.jpg", "descriptions": "As the US army's elite special operations soldiers you are the most potent 'smart weapon' known to man. You are the 'tip of the spear' for covert operations around the world - you are the first line of attack. Nothing stands in your way. From the war torn streets of Somalia you have beenAs the US army's elite special operations soldiers you are the most potent 'smart weapon' known to man. You are the 'tip of the spear' for covert operations around the world - you are the first line of attack. Nothing stands in your way. From the war torn streets of Somalia you have been re-deployed to take out targets in Colombia and Iran. As the US military?s preemptive strike force you must work with your team to get the job done. [NovaLogic]… Expand"}, {"name": "World War II: Frontline Command", "details_link": "https://www.metacritic.com/game/pc/world-war-ii-frontline-command", "publisher": "Strategy First", "release_date": "Jun 27 2003", "developers": ["The Bitmap Brothers"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Strategy", "Real-Time", "Historic", "General"], "meta_score": 70, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/526de5140ddc47b904a73e6ac2bedc7c-98.jpg", "descriptions": "World War II Frontline Command is an action strategy title set within the era of World War II that will appeal to all levels of PC gamers and war enthusiasts. The game opens with the player dropping paratroopers into Europe to disrupt the entrenched Axis forces ahead of the main invasionWorld War II Frontline Command is an action strategy title set within the era of World War II that will appeal to all levels of PC gamers and war enthusiasts. The game opens with the player dropping paratroopers into Europe to disrupt the entrenched Axis forces ahead of the main invasion forces set to land on D-Day. Players must take command of their forces and turn the tide of Axis aggression while conquering fortress Europe, using a vast amount of authentic infantry, vehicles and weaponry. [Strategy First]… Expand"}, {"name": "ATV Quad Power Racing 2", "details_link": "https://www.metacritic.com/game/gamecube/atv-quad-power-racing-2", "publisher": "Acclaim", "release_date": "Jan 22 2003", "developers": ["Climax Group"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 70, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/524f0a67a5f399dd0fe88489733aa0a9-98.jpg", "descriptions": "ATV: Quad Power Racing 2 is all about big tricks, big boots to the face, and big finishes.  As ten of the top pro riders in the world with real-life sponsors, you can race in 15 massive tracks and two freestyle arenas full of fast, edge-of-your-seat gameplay.  Fight your way to the finishATV: Quad Power Racing 2 is all about big tricks, big boots to the face, and big finishes.  As ten of the top pro riders in the world with real-life sponsors, you can race in 15 massive tracks and two freestyle arenas full of fast, edge-of-your-seat gameplay.  Fight your way to the finish with kick attacks, huge jumps, and power slides.  Get ready for this arcade-style ATV racer.… Expand"}, {"name": "Ty the Tasmanian Tiger", "details_link": "https://www.metacritic.com/game/playstation-2/ty-the-tasmanian-tiger", "publisher": "Electronic Arts", "release_date": "Sep 10 2002", "developers": ["Krome Studios"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 70, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/9/6114dd7d4a6622f860b4b89d1c0b458c-98.jpg", "descriptions": "Go deep into the Australian Outback as TY the Tasmanian Tiger. It's up to you to collect magical talismans that'll release your fellow Tasmanian Tigers from Dreamworld. Armed with your boomerangs and a nasty bite, you must outfight and outsmart Boss Cass, a big bad bird with a big badGo deep into the Australian Outback as TY the Tasmanian Tiger. It's up to you to collect magical talismans that'll release your fellow Tasmanian Tigers from Dreamworld. Armed with your boomerangs and a nasty bite, you must outfight and outsmart Boss Cass, a big bad bird with a big bad attitude. Sharpen your boomerang, mate, and get ready for an amazing Australian adventure. Explore over 16 levels in the wild and woolly Australian Outback . Use over 8 different boomerangs including the frostyrang, flamorang, and doomarang. Ride animals, swim around coral reefs, surf down rivers -- whatever it takes to save the Tasmanian Tigers! [Electronic Arts]… Expand"}, {"name": "Confidential Mission", "details_link": "https://www.metacritic.com/game/dreamcast/confidential-mission", "publisher": "Sega", "release_date": "May 14 2001", "developers": ["Hitmaker"], "platforms": "Dreamcast", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 70, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/fab1893ed00948976287f35d4f85579e-98.jpg", "descriptions": "A group of international terrorists led by Agares have seized control of a deadly laser armed satellite and holds the world, to ransom. As CMF agent Howard Gibson or Jean Clifford your mission is to recover the control device on an assignment that seems an impossible Confidential Mission.A group of international terrorists led by Agares have seized control of a deadly laser armed satellite and holds the world, to ransom. As CMF agent Howard Gibson or Jean Clifford your mission is to recover the control device on an assignment that seems an impossible Confidential Mission. \r\rIncluding Agent Academy, Partner and Another World modes have you got what it takes to save the world from the evil Agares.… Expand"}, {"name": "Ready 2 Rumble Boxing: Round 2", "details_link": "https://www.metacritic.com/game/dreamcast/ready-2-rumble-boxing-round-2", "publisher": "Midway", "release_date": "Oct 23 2000", "developers": ["Midway"], "platforms": "Dreamcast", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 70, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/a1c3038fffcbc75834aa2c99c89edb02-98.jpg", "descriptions": "Ready 2 Rumble Round 2 is a solid arcade-style boxing game, and like most arcade games, it wears thin fairly quickly."}, {"name": "Code Name: S.T.E.A.M.", "details_link": "https://www.metacritic.com/game/3ds/code-name-steam", "publisher": "Nintendo", "release_date": "Mar 13 2015", "developers": ["Intelligent Systems"], "platforms": "3DS", "num_players": "2 ", "genres": ["Sci-Fi", "Strategy", "Turn-Based", "Tactics"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/4a61861bae8079be0255f20fcce45561-98.jpg", "descriptions": "Code Name: S.T.E.A.M. is a new take on strategy games inspired by third-person shooters. Like the Fire Emblem and Advance Wars games before it, Code Name S.T.E.A.M. tasks players with planning out strategic moves using a team of soldiers to do battle with enemy forces. But this game throws aCode Name: S.T.E.A.M. is a new take on strategy games inspired by third-person shooters. Like the Fire Emblem and Advance Wars games before it, Code Name S.T.E.A.M. tasks players with planning out strategic moves using a team of soldiers to do battle with enemy forces. But this game throws a wrench into many of the conventions familiar to the genre.… Expand"}, {"name": "F1 2009", "details_link": "https://www.metacritic.com/game/wii/f1-2009", "publisher": "Codemasters", "release_date": "Nov 16 2009", "developers": ["Sumo Digital"], "platforms": ["iPhone/iPad", "Wii"], "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/9abd9869c30f2f94463610beda6f0db8-98.jpg", "descriptions": "(Also known as \"Formula One 2009\")  F1 2009 offers a fully authentic FIA Formula One championship experience with all the teams, drivers, cars and tracks from the 2009 season."}, {"name": "EVE Online", "details_link": "https://www.metacritic.com/game/pc/eve-online", "publisher": "Simon & Schuster", "release_date": "May  6 2003", "developers": ["CCP"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi", "Sci-Fi"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/c971bd41766fefcb4ce2b9ab4b559f70-98.jpg", "descriptions": "The spectacular space combat, commerce, and exploration game, whose breathtaking graphics, special effects, and intricate gameplay provide an experience unlike any other. Played on the Internet, this massively multiplayer online persistent world game takes place in a universe teeming withThe spectacular space combat, commerce, and exploration game, whose breathtaking graphics, special effects, and intricate gameplay provide an experience unlike any other. Played on the Internet, this massively multiplayer online persistent world game takes place in a universe teeming with life every hour of every day. Take on the role of a spaceship captain cruising around the universe, trading, fighting and communicating with other players and create a life beyond imagination.… Expand"}, {"name": "The Punisher (2005)", "details_link": "https://www.metacritic.com/game/xbox/the-punisher-2005", "publisher": "THQ", "release_date": "Jan 17 2005", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 69, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/bbcc314d7a951a192c594f1e46383eff-98.jpg", "descriptions": "Enter the mind of The Punisher, a vigilante driven by more than just revenge. In a world marked by corruption, you serve as judge, jury, and executioner as you terrorize criminals with their own ruthless methods. Use a combination of physical force and character interaction to coerceEnter the mind of The Punisher, a vigilante driven by more than just revenge. In a world marked by corruption, you serve as judge, jury, and executioner as you terrorize criminals with their own ruthless methods. Use a combination of physical force and character interaction to coerce criminals into coughing up valuable information, and then put them out of their misery with your arsenal of realistic weapons. The Punisher War Journal lets you relive in-game moments, collect items from Marvel's Punisher history, unlock bonus DVD footage, and more.… Expand"}, {"name": "Ironclad Tactics", "details_link": "https://www.metacritic.com/game/pc/ironclad-tactics", "publisher": "Zachtronics Industries", "release_date": "Sep 18 2013", "developers": ["Zachtronics Industries"], "platforms": ["PlayStation 4", "PC"], "genres": ["Strategy", "General", "General"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/6bbb0b00618b608194178eeee0c1f5ea-98.jpg", "descriptions": "Ironclad Tactics is a fast-paced, card-based tactics game set in an alternate version of The Civil War - with steam-powered military robots. There are no microtransactions in the game. Unlock cards by playing the game, not by purchasing them separately."}, {"name": "Rogue Trooper", "details_link": "https://www.metacritic.com/game/pc/rogue-trooper", "publisher": "Eidos Interactive", "release_date": "May 23 2006", "developers": ["Rebellion"], "platforms": ["PlayStation 2", "PC"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/f91ae3454f619e23bafd905a60369b12-98.jpg", "descriptions": "On the war-torn, poisoned atmosphere of Nu Earth, Rogue Trooper is a genetic infantryman, one of an elite squad of biologically-engineered clone troops, created to overcome the planet's hostile atmosphere, unhindered in their fight against the enemy, the Nort Republic. After witnessing theOn the war-torn, poisoned atmosphere of Nu Earth, Rogue Trooper is a genetic infantryman, one of an elite squad of biologically-engineered clone troops, created to overcome the planet's hostile atmosphere, unhindered in their fight against the enemy, the Nort Republic. After witnessing the betrayal and annihilation of his squad at the Quartz Zone Massacre, Rogue has gone AWOL, determined to hunt down the traitor who sent his brothers-in-arms to their deaths. Armed with the latest experimental weapons, Rogue's arsenal offers him a critical advantage over his opponents; encoded bio-chips containing the digitised personalities of his fallen comrades are stored in his gun, helmet and backpack, each offering their unique expertise and assistance, allowing Rogue to strategically outwit a sophisticated enemy. The game is a mix of intense 3rd person action and next generation stealth elements, with complex line-of-sight AI, multiple game paths, full tactical use of your bio-chip operated equipment and both single- and multiplayer online gameplay. [SCi Games]… Expand"}, {"name": "The Dark Pictures Anthology: The Devil in Me", "details_link": "https://www.metacritic.com/game/pc/the-dark-pictures-anthology-the-devil-in-me", "publisher": "Bandai Namco Games", "release_date": "Nov 18 2022", "developers": ["Supermassive Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "2 ", "genres": ["Action Adventure", "Adventure", "3D", "Survival", "Third-Person"], "meta_score": 69, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/4/8e4106e3877d25f8b9456bb750ed4222-98.jpg", "descriptions": "From the creators of Until DawnSwitch between the perspective of 5 playable characters - All can live or die in your version of the story\n\nMultiple ways to play including 2 player online coop mode\n\nHugely branching storyline that changes based on the decisions you make\n\nEach game in TheFrom the creators of Until DawnSwitch between the perspective of 5 playable characters - All can live or die in your version of the storyMultiple ways to play including 2 player online coop modeHugely branching storyline that changes based on the decisions you makeEach game in The Dark Pictures Anthology is a complete and original story in its own right3 ways to play!Introducing multiplayer to The Dark Pictures Anthology! 1. Solo storyThe complete terrifying story as a single player experience2. Movie night modeYou and up to 4 friends will play the story together on the couch, each controlling a different characterAnd:3. Shared story2 player online co-operative mode. Play the whole story online with a friend, making choices that affect you both.… Expand"}, {"name": "Halfway", "details_link": "https://www.metacritic.com/game/pc/halfway", "publisher": "Chucklefish", "release_date": "Jul 22 2014", "developers": ["Robotality"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Strategy", "Turn-Based", "Tactics"], "meta_score": 69, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/c7a91bb6c3685aeed6a6c9932bb7d178-98.jpg", "descriptions": "Halfway is a turn-based strategy RPG which takes place a few hundred years into the future. Humanity has begun to colonise new worlds and until now, they were alone… In Halfway you take control of a small team of survivors faced with a violent invasion onboard the colonial vessel Goliath. AsHalfway is a turn-based strategy RPG which takes place a few hundred years into the future. Humanity has begun to colonise new worlds and until now, they were alone… In Halfway you take control of a small team of survivors faced with a violent invasion onboard the colonial vessel Goliath. As their leader you will guide them through the dark and cramped corridors of the ship to slowly take back control.… Expand"}, {"name": "Genesis Alpha One", "details_link": "https://www.metacritic.com/game/xbox-one/genesis-alpha-one", "publisher": "Team17", "release_date": "Jan 29 2019", "developers": ["Radiation Blue"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 69, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/4/5a5c1d503119c38079a553240a5f81d7-98.jpg", "descriptions": "Genesis Alpha One is a revolutionary mix of roguelike shooter, base building and survival that puts you in the role of an interstellar pioneer.In a near future ravaged by wars, corrupt regimes and global capitalism left unchecked have resulted in natural resource over-exploitation andGenesis Alpha One is a revolutionary mix of roguelike shooter, base building and survival that puts you in the role of an interstellar pioneer.In a near future ravaged by wars, corrupt regimes and global capitalism left unchecked have resulted in natural resource over-exploitation and pollution; devastating the planet. Supported by Earth's remaining governments, four influential corporations initiate the Genesis program. As the Captain of a Genesis starship, you journey into uncharted space on the ultimate mission. Build and manage a space vessel, farm resources, deal with terrifying alien infestations, clone creatures and explore a vast, randomly generated universe. Your goal: Find new homes for humanity's DNA and save the species from extinction.… Expand"}, {"name": "Flame Over", "details_link": "https://www.metacritic.com/game/playstation-vita/flame-over", "publisher": "Laughing Jackal", "release_date": "Mar 10 2015", "developers": ["Laughing Jackal"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita"], "genres": ["Simulation", "General", "Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 69, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/eb93fce7b308a690131e365b6a0e1b5e-98.jpg", "descriptions": "Flame Over is a fire fighting 'squirt 'em-up' game with randomly generated levels, blending twin stick shooter and roguelike design principles. Flame Over features a dynamic fire system that burns and spreads according to the materials found in each randomly generated level. Watch firesFlame Over is a fire fighting 'squirt 'em-up' game with randomly generated levels, blending twin stick shooter and roguelike design principles. Flame Over features a dynamic fire system that burns and spreads according to the materials found in each randomly generated level. Watch fires spread according to the materials available, attacking your fire fighter and generating dangerous hazards across 4 game zones.… Expand"}, {"name": "City of Brass", "details_link": "https://www.metacritic.com/game/pc/city-of-brass", "publisher": "Uppercut Games Pty Ltd", "release_date": "May  4 2018", "developers": ["Uppercut Games Pty Ltd"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 69, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/6/5669b2330e9b14ca3512262717f6af45-98.jpg", "descriptions": "Become a daring thief in City of Brass, a punishing first-person rogue-lite filled with treasure, traps and ghoulish foes. Armed with scimitar and a versatile whip, you’ll lash and slash, bait and trap your way to the heart of an opulent, Arabian Nights-themed metropolis – or face certainBecome a daring thief in City of Brass, a punishing first-person rogue-lite filled with treasure, traps and ghoulish foes. Armed with scimitar and a versatile whip, you’ll lash and slash, bait and trap your way to the heart of an opulent, Arabian Nights-themed metropolis – or face certain death as time runs out.… Expand"}, {"name": "World Gone Sour", "details_link": "https://www.metacritic.com/game/xbox-360/world-gone-sour", "publisher": "Capcom", "release_date": "Apr 11 2012", "developers": ["Playbrains"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/42b742b55f9801b55e9dda97fddb755a-98.jpg", "descriptions": "Players assume the miniature role of a lost Sour Patch Kid in a stylized human sized world, guiding our hero through the sticky floors of a movie theater, across the counter of a concession stand, and other unique oversized environments.  Joining forces with fellow lost Sour Patch Kids,Players assume the miniature role of a lost Sour Patch Kid in a stylized human sized world, guiding our hero through the sticky floors of a movie theater, across the counter of a concession stand, and other unique oversized environments.  Joining forces with fellow lost Sour Patch Kids, players use a combination of jumps, twists and puzzle-solving to negotiate and overcome larger-than-life obstacles. Along the way, they battle unusual candy enemies, escape from deranged humans, and face off against bizarre creatures including one very angry wad of sticky chewing gum.… Expand"}, {"name": "Blair Witch", "details_link": "https://www.metacritic.com/game/pc/blair-witch", "publisher": "Bloober Team", "release_date": "Aug 30 2019", "developers": ["Bloober Team"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 69, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/c54a5b5a40c2ad06cd7d51e8baab0ddd-98.jpg", "descriptions": "Your darkest fears will awaken in these woods.\rIt's 1996. A young boy disappears in the Black Hills Forest near Burkittsville, Maryland. As Ellis, a former police officer with a troubled past, you join the search. What starts as an ordinary investigation soon turns into an endless nightmareYour darkest fears will awaken in these woods.\rIt's 1996. A young boy disappears in the Black Hills Forest near Burkittsville, Maryland. As Ellis, a former police officer with a troubled past, you join the search. What starts as an ordinary investigation soon turns into an endless nightmare as you confront your fears and the Blair Witch, a mysterious force that haunts the woods\r Blair Witch is a first-person, story-driven psychological horror game based on the cinematic lore of Blair Witch.\rA STORY OF THE HUMAN DESCENT INTO DARKNESS\rFrom the creative minds behind the critically acclaimed Layers of Fear, experience first-hand the toll that fear can take on the mind in an original story inspired by the cinematic lore of Blair Witch.\rFIND THE WAY THROUGH THE HAUNTED WOODS\rWith just your loyal dog Bullet by your side, navigate your way through a cursed forest that warps and distorts both time and space.\rYOUR SANITY AGAINST HER CURSE\rStand against the horrors of the Blair Witch and the decaying sanity of a man burdened by his past.\rHOW WILL YOU FACE YOUR FEARS?\rAs you delve deeper into the woods, how you react to danger and behave under pressure will ultimately teach you more about yourself.… Expand"}, {"name": "The Secrets of Da Vinci: The Forbidden Manuscript", "details_link": "https://www.metacritic.com/game/pc/the-secrets-of-da-vinci-the-forbidden-manuscript", "publisher": "Tri Synergy", "release_date": "Jun  7 2006", "developers": ["Kheops Studio"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/e9267d8ec79998ed3e581888033512a8-98.jpg", "descriptions": "The Secrets of Da Vinci: The Forbidden Manuscript is a major adventure and investigation game, a thrilling mystical quest into the heart of the Renaissance that takes place in Da Vinci's last home, the Manoir du Cloux (now called the Chateau du Clos Lucé). The Chateau du Clos Lucé and itsThe Secrets of Da Vinci: The Forbidden Manuscript is a major adventure and investigation game, a thrilling mystical quest into the heart of the Renaissance that takes place in Da Vinci's last home, the Manoir du Cloux (now called the Chateau du Clos Lucé). The Chateau du Clos Lucé and its gardens are perfectly modelised and contribute to the player's total immersion in the final years of Leonardo da Vinci's life. The period reconstruction has been carried out with genuine attention to historical detail in collaboration with specialists including the owners of the Chateau du Clos Lucé, and Pascal Brioist, scientific advisor for the site and lecturer at the Centre d'étude supérieur de la Renaissance in Tours. The precision and refinement of the graphics immerses the player in the very heart of the Renaissance.… Expand"}, {"name": "Worms 4: Mayhem", "details_link": "https://www.metacritic.com/game/xbox/worms-4-mayhem", "publisher": "Majesco Games", "release_date": "Oct  4 2005", "developers": ["Team17"], "platforms": ["PC", "Xbox"], "num_players": "4  Online", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/e3874ef82d6ae35ddcbf860a13aafcf1-98.jpg", "descriptions": "The Worms series continues with Worms 4: Mayhem. You can engage in the turn-based combat that the series has become known for across predesigned or random 3D maps. Worms 4: Mayhem delivers new weapons as well as more customization options, allowing you to design your teams and the arsenalThe Worms series continues with Worms 4: Mayhem. You can engage in the turn-based combat that the series has become known for across predesigned or random 3D maps. Worms 4: Mayhem delivers new weapons as well as more customization options, allowing you to design your teams and the arsenal that they use. You can unlock bonuses in the 25-mission story mode or play online against up to four other players. … Expand"}, {"name": "Worms 3D", "details_link": "https://www.metacritic.com/game/xbox/worms-3d", "publisher": "Sega", "release_date": "Mar  1 2005", "developers": ["Team17"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "4  Online", "genres": ["Strategy", "General"], "meta_score": 69, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/31ceb3e901b3051712d316beaf37859d-98.jpg", "descriptions": "Join the party as worm battles ensue across 3D worlds. Worms 3D pits four players--each with a customizable team of worms--against one another in fully deformable landscapes. All the bizarre weapons from the Worms series--including Banana Bomb, flying Super Sheep, Earthquakes, Air Strikes,Join the party as worm battles ensue across 3D worlds. Worms 3D pits four players--each with a customizable team of worms--against one another in fully deformable landscapes. All the bizarre weapons from the Worms series--including Banana Bomb, flying Super Sheep, Earthquakes, Air Strikes, and Holy Hand Grenade--appear for your destructive pleasure. Wreak havoc in turn-based multiplayer action or unlock landscapes, sound sets, challenges, and secret missions in the immersive single-player mode. … Expand"}, {"name": "Pokemon Super Mystery Dungeon", "details_link": "https://www.metacritic.com/game/3ds/pokemon-super-mystery-dungeon", "publisher": "Nintendo", "release_date": "Nov 20 2015", "developers": ["Spike Chunsoft Co. Ltd.", "Spike Chunsoft"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Roguelike"], "meta_score": 69, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/132dc7c4ea4094babbaa5403edc0eddc-98.jpg", "descriptions": "The player is transformed into one of 20 Pokémon as she sets out on an adventure in a world inhabited solely by the 720 discovered Pokémon. Each dungeon is randomly generated, so the gamer never explores the same dungeon twice as she unravel this tale of adventure and mystery."}, {"name": "Pneuma: Breath of Life", "details_link": "https://www.metacritic.com/game/playstation-4/pneuma-breath-of-life", "publisher": "Deco Digital", "release_date": "Jul  7 2015", "developers": ["Deco Digital"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/8eeb2d5c33bd0eb198455cc73b1b24f5-98.jpg", "descriptions": "Pneuma: Breath of Life is an enthralling first person puzzler putting gamers minds to the test in a visually stunning world using Unreal Engine 4 and Physically Based Rendering. Pneuma provides players with a sense of awe and a relentless determination to solve every puzzle and progressPneuma: Breath of Life is an enthralling first person puzzler putting gamers minds to the test in a visually stunning world using Unreal Engine 4 and Physically Based Rendering. Pneuma provides players with a sense of awe and a relentless determination to solve every puzzle and progress through a narrated story of self-discovery, exploring the fundamental nature of being. This is the first person puzzler of 2015 which is designed to force players think outside the box and explore beyond what they know as reality. Play as a god, Pneuma, and listen to his comical self-obsessed inner monologue whilst he takes you on a journey exploring and traversing his puzzling world. Rack your brain and progress through a series of environmental challenges that require perception, observation, and lateral thinking skills to succeed. Lift bridges, rotate platforms and move entire buildings all with the power of your mind. This game isn't about your skill with a controller, it's about how you perceive and analyse situations. Push your brain to its limits in this exciting new first person puzzler as Pneuma contemplates the nature of reality and you explore the ontological mystery of the Breath of Life.… Expand"}, {"name": "Wild Arms 4", "details_link": "https://www.metacritic.com/game/playstation-2/wild-arms-4", "publisher": "XSEED Games", "release_date": "Jan 10 2006", "developers": ["Media.Vision"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/f139a393a887c64f4a951b54014e5099-98.jpg", "descriptions": "Jude Maverick has grown up in an isolated town called Ciel, which is completely enclosed in a large sphere floating thousands of feet above the surface of Filgaia. His sheltered world changes forever when he sees the sky \"tear\" and ships entering his homeland. Upon inspecting the camp siteJude Maverick has grown up in an isolated town called Ciel, which is completely enclosed in a large sphere floating thousands of feet above the surface of Filgaia. His sheltered world changes forever when he sees the sky \"tear\" and ships entering his homeland. Upon inspecting the camp site set up by the intruders, he sees something that he has never seen before; a girl. The girl's name is Yulie and she is being held captive by the intruders after being captured by a \"Drifter\" for hire, Arnaud G. Vasquez. After the invading army attacks Ciel and brings the whole sphere crashing down, Jude, Yulie and Arnaud join forces to find out the army's true intention behind Yulie's abduction. With the help of another Drifter, Raquel, these four idealistic teenagers travel the war-torn land of Filgaia in search of truth, their own identities and their individual paths to adulthood. Innovative new HEX battle system unlike anything seen before in turn-based RPGs; easily accessible while providing an amazing amount of speed, depth and strategy. Action elements on the field map such as double- jumps, using the new \"Accelerator\" ability to manipulate time, and equipping items to solve puzzles maintains the excitement between battles. [XSEED]… Expand"}, {"name": "Dance Dance Revolution: Mario Mix", "details_link": "https://www.metacritic.com/game/gamecube/dance-dance-revolution-mario-mix", "publisher": "Nintendo", "release_date": "Oct 24 2005", "developers": ["Hudson"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 69, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/0cb9cfee19cff540663ad084339ebc5d-98.jpg", "descriptions": "Boogie down with Mario in his own dance party. Players shake their things to more than 25 dance-flavored songs, from classic Nintendo themes to familiar favorites. With five difficulty levels, dancers of all abilities will be able to get into the groove. The special \"Workout\"Boogie down with Mario in his own dance party. Players shake their things to more than 25 dance-flavored songs, from classic Nintendo themes to familiar favorites. With five difficulty levels, dancers of all abilities will be able to get into the groove. The special \"Workout\" feature tracks the calories burned while playing. Someone has stolen the Music Keys and released the music they held. Without the Music Keys, the unstable power of the music is wreaking havoc on the land. Mario must recover them before the chaos destroys the entire Mushroom Kingdom! The path to the keys is simple: Left, Right, Up, Down, Right, Down ...Characters include Mario, Luigi, Toad, Waluigi, Wario, Bowser. Players clear levels by performing the correct steps. Once they clear all the levels in a particular world, they'll collect a Music Key. Collect all the Music Keys to win. Players control Dance Dance Revolution: Mario Mix by stepping on different arrows on the Action Pad (included with game). Players can finally experience the thrill of stomping Goombas and other enemies firsthand. As players clear songs, they will unlock more songs, minigames and difficulty levels.… Expand"}, {"name": "Fortified", "details_link": "https://www.metacritic.com/game/xbox-one/fortified", "publisher": "Clapfoot Inc.", "release_date": "Feb  3 2016", "developers": ["Clapfoot Inc."], "platforms": ["PC", "Xbox One"], "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/e6ea4c1963ae8df7a58ea2c9c76f7464-98.jpg", "descriptions": "Fortified is a strategy shooter in which players defend the Earth against a menacing Martian invasion in the 1950s. Play as one-of-four pulp inspired heroes as they fight swarms of terrifying robots with an arsenal of Cold War era weapons and experimental technology. Protect the city byFortified is a strategy shooter in which players defend the Earth against a menacing Martian invasion in the 1950s. Play as one-of-four pulp inspired heroes as they fight swarms of terrifying robots with an arsenal of Cold War era weapons and experimental technology. Protect the city by building a network of defensive structures, commanding an army, and jumping into battle against dangerous sky scraping attackers. Fight for Earth alone or with up to four players for the ultimate co-op defense experience. [Xbox.com]… Expand"}, {"name": "Evan's Remains", "details_link": "https://www.metacritic.com/game/switch/evans-remains", "publisher": "Whitethorn Digital", "release_date": "Jun 11 2020", "developers": ["Matias Schmied"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "2D"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/140521f24b3c892a5aec754dc3d2c26c-98.jpg", "descriptions": "Evan’s Remains is a mystery-thriller puzzle adventure about finding a missing boy: Evan. The game combines logic-based platform puzzles with narrative inspired by Japanese graphic adventure games. Every time the player solves from two to three puzzles, the story goes forward and newEvan’s Remains is a mystery-thriller puzzle adventure about finding a missing boy: Evan. The game combines logic-based platform puzzles with narrative inspired by Japanese graphic adventure games. Every time the player solves from two to three puzzles, the story goes forward and new mechanics are introduced. The challenge of the puzzles lies in the player’s ability to figure out what do rather than solve challenges based on skill. As the difficulty curve increases, the puzzles become more complex by combining two or more previously introduced mechanics.… Expand"}, {"name": "Half Past Fate", "details_link": "https://www.metacritic.com/game/switch/half-past-fate", "publisher": "Way Down Deep", "release_date": "Mar 12 2020", "developers": ["Serenity Forge"], "platforms": ["PC", "Switch"], "genres": ["Adventure", "General"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/bb4a982cdebad03f7b89f13aacad12a4-98.jpg", "descriptions": "Half Past Fate is a romantic narrative-adventure game about three relationships that form either over the span of eight hours or eight years.Follow the adventures of six people who stumble their way through love and companionship in a hybrid 3D pixel-art world. Lead them through theirHalf Past Fate is a romantic narrative-adventure game about three relationships that form either over the span of eight hours or eight years.Follow the adventures of six people who stumble their way through love and companionship in a hybrid 3D pixel-art world. Lead them through their daily struggles, quirky events, and life-changing decisions. Featuring a full cast of diverse characters with contrasting personalities, Half Past Fates takes you through intersecting stories over varying timespans that show how love can grow and develop in unexpected ways.… Expand"}, {"name": "The Fidelio Incident", "details_link": "https://www.metacritic.com/game/pc/the-fidelio-incident", "publisher": "Act 3 Games, LLC", "release_date": "May 23 2017", "developers": ["Act 3 Games", "LLC"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 69, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/2c77622748221d6fbe0cb5fa35ea0f4e-98.jpg", "descriptions": "The Fidelio Incident is a single-player, first-person thriller set off the coast of Iceland. Inspired by Beethoven's only opera Fidelio. After a violent plane crash, Stanley must search a desolate frozen island in search of his wife Leonore while covering up any traces of their identity."}, {"name": "Ultimate Band", "details_link": "https://www.metacritic.com/game/ds/ultimate-band", "publisher": "Disney Interactive Studios", "release_date": "Nov 18 2008", "developers": ["Fall Line Studio"], "platforms": ["PlayStation 2", "DS"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/11663a9e5403eec455f21b8f2bf547f6-98.jpg", "descriptions": "Ultimate Band for Nintendo DS is a rhythm-based music game with a built-in recording studio.  Players can jam to current and classic songs using the drums, lead guitar, bass guitar, or rhythm guitar. Players can also create their own original songs using the DS touchscreen and stylus to layUltimate Band for Nintendo DS is a rhythm-based music game with a built-in recording studio.  Players can jam to current and classic songs using the drums, lead guitar, bass guitar, or rhythm guitar. Players can also create their own original songs using the DS touchscreen and stylus to lay down tracks for each instrument and apply creative mixing effects. Ultimate Band for Nintendo DS also includes DGamer functionality which allows players to engage with others in a secure online community via their DS (Wi-Fi or ad hoc) or computer. [Disney Interactive Studio]… Expand"}, {"name": "Pokemon Ranger", "details_link": "https://www.metacritic.com/game/ds/pokemon-ranger", "publisher": "Nintendo", "release_date": "Oct 30 2006", "developers": ["HAL Labs"], "platforms": "DS", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/b1ee6ed5d38dadfd7a17885989c9898c-98.jpg", "descriptions": "(Also known as \"Pokemon Ranger: The Road to Diamond and Pearl\")  With the help of Pokemon, set out on a fun-filled adventure! You play as a Pokemon Ranger in the Fiore Region, where you work to preserve nature and protect Pokemon. Circle Pokemon using the Capture Styler with Nintendo DS(Also known as \"Pokemon Ranger: The Road to Diamond and Pearl\")  With the help of Pokemon, set out on a fun-filled adventure! You play as a Pokemon Ranger in the Fiore Region, where you work to preserve nature and protect Pokemon. Circle Pokemon using the Capture Styler with Nintendo DS stylus control. Use each Pokemon's special abilities to clear obstacles and to help capture other Pokemon. Capture and interact with more than 200 of your favorite Pokemon. Work your way up the Pokémon Ranger ranks by succeeding at official missions throughout the Fiore region. Pokemon Ranger is unlike any Pokemon game you've played before. You control your character using the stylus, and all Pokemon are captured using a Capture Styler instead of a Poke Ball. Since you're a Pokemon Ranger and not a trainer, you must release each captured Pokemon back into the wild after they help you. [Nintendo]… Expand"}, {"name": "Monster House", "details_link": "https://www.metacritic.com/game/game-boy-advance/monster-house", "publisher": "THQ", "release_date": "Jul 18 2006", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 69, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/b99a4616282fc43369f9a7330187db4e-98.jpg", "descriptions": "Monster House is based on the Columbia Pictures film of the same name."}]