[{"name": "Wallace & Gromit's Grand Adventures, Episode 3: Muzzled!", "details_link": "https://www.metacritic.com/game/pc/wallace-gromits-grand-adventures-episode-3-muzzled!", "publisher": "Telltale Games", "release_date": "Jun 15 2009", "developers": ["Telltale Games"], "platforms": ["Xbox 360", "PC"], "genres": ["Miscellaneous", "Adventure", "General", "Compilation"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/5571426c641484b3a5ac684652eb0fbf-98.jpg", "descriptions": "Monty Muzzle, a newcomer in town, is holding a grand fundraiser to rebuild the local dog shelter. Gromit soon realizes that Muzzle's intentions aren't exactly charitable and he must foil the huckster's plot to save the town's investment and rescue his canine friends. [Telltale Games]"}, {"name": "Digimon Story Cyber Sleuth", "details_link": "https://www.metacritic.com/game/playstation-4/digimon-story-cyber-sleuth", "publisher": "Bandai Namco Games", "release_date": "Feb  2 2016", "developers": ["Media.Vision"], "platforms": ["PlayStation Vita", "PlayStation 4"], "num_players": "2 ", "genres": ["Role-Playing", "Japanese-Style", "Trainer"], "meta_score": 75, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/2a08fe27ad07da2d0b30728fddf95b85-98.jpg", "descriptions": "Set in the not-too-distant future, the line between the real and digital worlds is blurred. Logging into cyberspace is part of everyday life. For one teenager, a harmless on-line chat spawns a chance encounter with a mysterious hacker. Little did this teen know, this brief meeting would leadSet in the not-too-distant future, the line between the real and digital worlds is blurred. Logging into cyberspace is part of everyday life. For one teenager, a harmless on-line chat spawns a chance encounter with a mysterious hacker. Little did this teen know, this brief meeting would lead to a digi-monumental adventure. In Digimon Story Cyber Sleuth, scan, raise, and train your faithful Digimon companions to battle by your side against a group of hackers. Do you have what it takes to crack this digi-case? … Expand"}, {"name": "Norn9: Var Commons", "details_link": "https://www.metacritic.com/game/playstation-vita/norn9-var-commons", "publisher": "Aksys Games", "release_date": "Nov  3 2015", "developers": ["Idea Factory", "Otomate"], "platforms": ["Switch", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Visual Novel"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/9dd1197a194b182785d294f9adc69c60-98.jpg", "descriptions": "While on a school field trip, child prodigy Sorata Suzuhara wanders off after hearing a mysterious song and blacks out. When he comes to, he finds himself in unfamiliar place, and soon encounters a girl who informs him that hes currently in turn of the century Japan! In order to help him getWhile on a school field trip, child prodigy Sorata Suzuhara wanders off after hearing a mysterious song and blacks out. When he comes to, he finds himself in unfamiliar place, and soon encounters a girl who informs him that hes currently in turn of the century Japan! In order to help him get home, Sorata follows her to a ship that shes waiting for but when it appears it is not a wooden sailing ship, but a round aircraft that flies using technology that is beyond Soratas imagination. Even stranger, he discovers that the other 12 passengers  3 young women and 9 men  are all supposedly espers with special powers, and are on some kind of journey at the behest of a multinational entity only known as The World.\r What is the purpose of their journey? What is their destination? Who is The World? Before Sorata can even begin to take stock of his situation, the ship is attacked, and the mystery surrounding the ship only deepens. Delve into the story of the ship and its occupants through the point of views of each of the three girls, and unravel the mysteries trapped within.… Expand"}, {"name": "Noby Noby Boy", "details_link": "https://www.metacritic.com/game/playstation-3/noby-noby-boy", "publisher": "Bandai Namco Games", "release_date": "Feb 19 2009", "developers": ["Bandai Namco Games"], "platforms": "PlayStation 3", "genres": ["Action", "General", "General"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/fb1aa028ee68b849dbf446f87dbb8618-98.jpg", "descriptions": "[Playstation Network]  The latest game from Katamari Damacy creator Keita Takahashi, NOBY NOBY BOY lets players expand their imaginations as they stretch a creature named BOY to incredible lengths across the playground-like planets of the solar system. Offering a unique play experience from[Playstation Network]  The latest game from Katamari Damacy creator Keita Takahashi, NOBY NOBY BOY lets players expand their imaginations as they stretch a creature named BOY to incredible lengths across the playground-like planets of the solar system. Offering a unique play experience from one of the video game industry's most creative minds, NOBY NOBY BOY gives players complete freedom to create gameplay suited to their tastes. As BOY, players can eat and spit out nearly everything they encounter in the game, from people and animals to trees and buildings, helping them to gain length as they stretch their elongated body. Players can control BOY’s front and back ends using the Playstation 3 controller's two analog sticks, allowing for detailed movements such as tying themselves into knots or threading BOY through holes in the environment. NOBY NOBY BOY allows players to record video footage as they play and upload it directly to YouTube for easy viewing. Delivering a new and innovate approach to online gaming, NOBY NOBY BOY lets players collaborate to unlock new game stages. As players stretch BOY in their individual play sessions, the lengths to which they grow are uploaded to a persistent character known as GIRL, who grows at the same rate as the combined length of all the players in the world. GIRL starts at Earth and expands through the solar system as more games are played and BOYs from all players continue to grow. When GIRL reaches a new milestone in the solar system, these areas are unlocked as playable stages in the game for everyone around the world. [Namco Bandai Games]… Expand"}, {"name": "Tempest 4000", "details_link": "https://www.metacritic.com/game/playstation-4/tempest-4000", "publisher": "Nighthawk Interactive", "release_date": "Jul 17 2018", "developers": ["Llamasoft"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 75, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/61e7e20768ad8515111add3f87732707-98.jpg", "descriptions": "Tempest 4000 is an action-packed tube shooter based on the classic hit arcade game, Tempest."}, {"name": "Prince of Persia: The Forgotten Sands", "details_link": "https://www.metacritic.com/game/playstation-3/prince-of-persia-the-forgotten-sands", "publisher": "Ubisoft", "release_date": "May 18 2010", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/45c66af78bfedcb84e5716063778d958-98.jpg", "descriptions": "Prince of Persia: The Forgotten Sands is the next chapter in the Sands of Time universe. Visiting his brother's kingdom following his adventure in Azad, the Prince finds the royal palace under siege from a mighty army bent on its destruction. When the decision is made to use the ancientPrince of Persia: The Forgotten Sands is the next chapter in the Sands of Time universe. Visiting his brother's kingdom following his adventure in Azad, the Prince finds the royal palace under siege from a mighty army bent on its destruction. When the decision is made to use the ancient power of the Sand in a desperate gamble to save the kingdom from total annihilation, the Prince embarks on an epic adventure in which he learns to bear the mantle of true leadership, and discover that great power often comes with a great cost. [Ubisoft]… Expand"}, {"name": "Shardlight", "details_link": "https://www.metacritic.com/game/pc/shardlight", "publisher": "Wadjet Eye Games", "release_date": "Mar  8 2016", "developers": ["Wadjet Eye Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 75, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/c55504b01bc6a1a59257592dd678760f-98.jpg", "descriptions": "Amy Wellard is dying. Twenty years after a cataclysmic disaster leveled her city, Green Lung is wiping out the population at an alarming rate and vaccine is in short supply, rationed by a government that favors the rich. Amy may not have money or status, but she has something more important:Amy Wellard is dying. Twenty years after a cataclysmic disaster leveled her city, Green Lung is wiping out the population at an alarming rate and vaccine is in short supply, rationed by a government that favors the rich. Amy may not have money or status, but she has something more important: hope. And if there's a cure out there, she's going to find it. Step into Amy's worn shoes to explore a dying city, navigate its social hierarchy, and expose the secrets that plague a community still suffering from the devastation of war. Shardlight is from the studio behind the Blackwell mysteries, A Golden Wake, and many other indie adventures released over the past ten years.… Expand"}, {"name": "Naruto: Ultimate Ninja 3", "details_link": "https://www.metacritic.com/game/playstation-2/naruto-ultimate-ninja-3", "publisher": "Namco Bandai Games America", "release_date": "Mar 25 2008", "developers": ["CyberConnect2"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 75, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/96c95997092728d1520c6a36211aa33e-98.jpg", "descriptions": "NARUTO: Ultimate Ninja 3 makes leaps in the franchise with a host of “firsts” for the series. Players can now live through and be a part of all the major events that defined Story Arc 1 in Heroes History mode. Also, ninja-in-training can customize their characters with the Ultimate JutsuNARUTO: Ultimate Ninja 3 makes leaps in the franchise with a host of “firsts” for the series. Players can now live through and be a part of all the major events that defined Story Arc 1 in Heroes History mode. Also, ninja-in-training can customize their characters with the Ultimate Jutsu which gives them that extra bit of edge during battle and allows them to earn points towards upgrading their strength, defense, chakra, agility and other special abilities. Turn playable characters into more powerful ninja of unprecedented size or summon giant creatures as allies with the new Summoning mode. In addition, NARUTO fans throughout North America can experience the game in both English and original Japanese voice over. In keeping with the tradition of the series, an exclusive and original story has players exploring the massive 3D rendered Hidden Leaf Village, participating in battle royale matches and completing more than 55 missions. The experience doesn’t stop there as tons of unlockable content are available to offer loads of replay value including movies, music and cards. [Namco Bandai Games]… Expand"}, {"name": "Tropico 3", "details_link": "https://www.metacritic.com/game/xbox-360/tropico-3", "publisher": "Kalypso", "release_date": "Feb 16 2010", "developers": ["Haemimont", "Haemimont Games"], "platforms": ["iPhone/iPad", "PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Government"], "meta_score": 75, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/0a5f5678d251d018cc214e8d505af6ae-98.jpg", "descriptions": "As in the original Tropico, the player again is able to play the role of \"El Presidente\" taking over the control of a tropical island. You decide whether you want to use your army to secure your power base in the best traditions of corrupt, unscrupulous tyrants everywhere, or alternativelyAs in the original Tropico, the player again is able to play the role of \"El Presidente\" taking over the control of a tropical island. You decide whether you want to use your army to secure your power base in the best traditions of corrupt, unscrupulous tyrants everywhere, or alternatively to lead your people to prosperity in your role as generous elder statesman. Danger lurks on every corner. There are militant rebels planning a Coup d'Etat for a communistic Junta, while in the background there are two lurking superpowers, the USA and the Soviet Union, who would perhaps prefer a more pliable president in the strategically important island of Tropico! [Kalypso]… Expand"}, {"name": "Atelier Mysterious Trilogy Deluxe Pack", "details_link": "https://www.metacritic.com/game/playstation-4/atelier-mysterious-trilogy-deluxe-pack", "publisher": "Koei Tecmo Games", "release_date": "Apr 22 2021", "developers": ["Gust"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/48b7cf499d3a9beeda43da7c51e0faaa-98.jpg", "descriptions": "Atelier Sophie DX - Atelier Firis DX - Atelier Lydie & Suelle DX - with brand new content and various DLCs. The definitive edition fo the Atlier \"Myserious\" series is now available."}, {"name": "LUNA The Shadow Dust", "details_link": "https://www.metacritic.com/game/pc/luna-the-shadow-dust", "publisher": "Coconut Island Games", "release_date": "Feb 13 2020", "developers": ["Lantern Studio"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/34285fa824e43f3fbdf49043c00a0d15-98.jpg", "descriptions": "LUNA The Shadow Dust is a fully hand-animated Point&Click puzzle adventure, brought to life through wordless storytelling, beautiful cinematics and a breathtaking original soundtrack."}, {"name": "Sonic & All-Stars Racing Transformed", "details_link": "https://www.metacritic.com/game/playstation-vita/sonic-all-stars-racing-transformed", "publisher": "Sega", "release_date": "Dec 18 2012", "developers": ["Sumo Digital"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "Wii U", "Xbox 360", "PlayStation Vita"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart", "Automobile"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/24589697cbda6ab5f4ff762887a0d66f-98.jpg", "descriptions": "Sonic and the All-Stars cast battle for supremacy across land, water and air in transforming vehicles that change from cars to boats to planes mid-race."}, {"name": "Buffy the Vampire Slayer: Chaos Bleeds", "details_link": "https://www.metacritic.com/game/gamecube/buffy-the-vampire-slayer-chaos-bleeds", "publisher": "Sierra Entertainment", "release_date": "Aug 28 2003", "developers": ["Eurocom Entertainment Software"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 75, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/863859d81d157056f83e854327f1c30b-98.jpg", "descriptions": "Buffy the Vampire Slayer: Chaos Bleeds lets you play as six characters from the TV show--Buffy, Faith, Willow, Xander, Spike, and a friend from the past. Use each character's unique abilities to defeat an ancient evil that threatens to destroy them and their world. Set in both familiar andBuffy the Vampire Slayer: Chaos Bleeds lets you play as six characters from the TV show--Buffy, Faith, Willow, Xander, Spike, and a friend from the past. Use each character's unique abilities to defeat an ancient evil that threatens to destroy them and their world. Set in both familiar and new locations, the game challenges you to overcome a variety of challenges. Chaos Bleeds also features several multiplayer modes, including Domination, Last Man Standing, Bunny Catcher, and Slayer Challenge.… Expand"}, {"name": ".hack//Infection Part 1", "details_link": "https://www.metacritic.com/game/playstation-2/hackinfection-part-1", "publisher": "Bandai", "release_date": "Feb 10 2003", "developers": ["CyberConnect2"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/aebcbbccda27a18733e4abd65f3ce2ec-98.jpg", "descriptions": "A fourteen year old boy named Kite is invited by his schoolmate, Orca, to play the online game The World. While playing the game both Kite and his friend are attacked by an unknown monster. As a result, Orca becomes comatose in the real world. Despite his friend's condition, Kite continuesA fourteen year old boy named Kite is invited by his schoolmate, Orca, to play the online game The World. While playing the game both Kite and his friend are attacked by an unknown monster. As a result, Orca becomes comatose in the real world. Despite his friend's condition, Kite continues to play The World believing he'll find a way to revive Orca. While playing, Kite accepts Book of Twilight from a mysterious girl in white. Kite is transformed into an outlaw player within the game wielding the very same power responsible for Orca's condition. [Bandai]… Expand"}, {"name": "Sonic Mega Collection", "details_link": "https://www.metacritic.com/game/gamecube/sonic-mega-collection", "publisher": "Sega", "release_date": "Nov 10 2002", "developers": ["Sonic Team"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 75, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/447b763b06bf1b3a516a5aef60befb5a-98.jpg", "descriptions": "Sonic has appeared in many games in the last decade, and now you can relive seven of them from Sonic Mega Collection. This compilation includes the first three Sonic the Hedgehog titles, plus Sonic & Knuckles, Sonic 3D Flickies' Island, Sonic the Hedgehog Spinball, and Dr. Robotnik's MeanSonic has appeared in many games in the last decade, and now you can relive seven of them from Sonic Mega Collection. This compilation includes the first three Sonic the Hedgehog titles, plus Sonic & Knuckles, Sonic 3D Flickies' Island, Sonic the Hedgehog Spinball, and Dr. Robotnik's Mean Bean Machine. With additional content such as character illustrations, movies, and comic-book covers, this game celebrates Sonic's long career and introduces his world to new generation of gamers.… Expand"}, {"name": "Burnout", "details_link": "https://www.metacritic.com/game/xbox/burnout", "publisher": "Acclaim", "release_date": "Apr 29 2002", "developers": ["Criterion Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 75, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/178a96f608a86b64049ed7c5ef77fefa-98.jpg", "descriptions": "Burnout brings high-energy, arcade-style street racing to your gaming console.  Drive more than 300 realistic vehicles, and then crash them in spectacular, slow-motion fashion.  Burnout monitors your driver's heart rate: You're rewarded for near-misses and the more risks you take.   CruiseBurnout brings high-energy, arcade-style street racing to your gaming console.  Drive more than 300 realistic vehicles, and then crash them in spectacular, slow-motion fashion.  Burnout monitors your driver's heart rate: You're rewarded for near-misses and the more risks you take.   Cruise the United States and Europe on 14 awesome, traffic-filled courses, through cities and into the countryside. Instant replays allow you to relive your handiwork from multiple angles, in all of its cringe-inducing, metal-bashing glory.… Expand"}, {"name": "Jackie Chan Adventures", "details_link": "https://www.metacritic.com/game/game-boy-advance/jackie-chan-adventures", "publisher": "Activision", "release_date": "Nov  6 2001", "developers": ["Torus Games"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 75, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/7597facdc04ad67fb782f19a6b67b306-98.jpg", "descriptions": "Based on the animated show of the same name, Jackie Chan Adventures follows the exploits of Jackie Chan, an expert in ancient artifacts and, at times, a secret government agent. This time, Jackie's mission is nothing less than saving the world from an evil power known only as the Dark Hand.Based on the animated show of the same name, Jackie Chan Adventures follows the exploits of Jackie Chan, an expert in ancient artifacts and, at times, a secret government agent. This time, Jackie's mission is nothing less than saving the world from an evil power known only as the Dark Hand. To be successful, Jackie needs your help in finding the magical talismans from around the world and fighting off villains with kung fu.… Expand"}, {"name": "Le Mans 24 Hours", "details_link": "https://www.metacritic.com/game/playstation-2/le-mans-24-hours", "publisher": "Atari", "release_date": "Aug 13 2001", "developers": ["Atari"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/1b92a6fd8d1151d69b92bedac0b57f9f-98.jpg", "descriptions": "Race over 70 licensed cars (including 30 new vehicles from the 2000 race such as the Viper Team Oreca, Corvette Racing, and Team Cadillac); 12 real-world tracks; unique \"Day-to-Night-to-Day\" racing with changing weather patterns; newly animated drivers and pit crew; advanced AI; new carRace over 70 licensed cars (including 30 new vehicles from the 2000 race such as the Viper Team Oreca, Corvette Racing, and Team Cadillac); 12 real-world tracks; unique \"Day-to-Night-to-Day\" racing with changing weather patterns; newly animated drivers and pit crew; advanced AI; new car settings and real-time lighting. [Infogrames]… Expand"}, {"name": "Army Men: Air Attack 2", "details_link": "https://www.metacritic.com/game/playstation-2/army-men-air-attack-2", "publisher": "3DO", "release_date": "Mar 23 2001", "developers": ["3DO"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/21c5beeb6c5f7ec0f93e58a7731d19a6-98.jpg", "descriptions": "The first appearance of the little plastic \"Army Men\" on the PS2 is the sequel to arguably the best game of the series.  Captain Blade and his helicopter copilots in the Alpha Wolf Squadron blast their way through the tan army during over two dozen missions."}, {"name": "Indiana Jones and the Infernal Machine", "details_link": "https://www.metacritic.com/game/nintendo-64/indiana-jones-and-the-infernal-machine", "publisher": "LucasArts", "release_date": "Dec 14 2000", "developers": ["Factor 5"], "platforms": ["PC", "Nintendo 64"], "genres": ["Action Adventure", "Historic"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/41290c3cf424fa93b2fcb1d8b3a2dadb-98.jpg", "descriptions": "1947. The nazis have been crushed, the Cold War has begun and Soviet agents are sniffing around an ancient ruin. Grab your whip and fedora and join Indy in a globespanning race to unearth the mysterious \"Infernal Machine\". Survive the challenges of unusual beasts, half the Red Army1947. The nazis have been crushed, the Cold War has begun and Soviet agents are sniffing around an ancient ruin. Grab your whip and fedora and join Indy in a globespanning race to unearth the mysterious \"Infernal Machine\". Survive the challenges of unusual beasts, half the Red Army and more (including - oh no - snakes!) . Puzzle your way through 17 chapters of an action-packed story. Travel the world to exotic locales, from the ruins of Babylon to Egyptian deserts. All the weapons you'll need, including firearms, explosives-and of course Indy's trusty whip and revolver.… Expand"}, {"name": "Jazzpunk", "details_link": "https://www.metacritic.com/game/pc/jazzpunk", "publisher": "Adult Swim", "release_date": "Feb  7 2014", "developers": ["Necrophone"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "3D", "First-Person", "Sci-Fi"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/2a7d84f97cdf707d3efbf93111f2c9ae-98.jpg", "descriptions": "Jazzpunk is a stylized first-person adventure comedy. As the mysterious Agent Polyblank, you’ll explore a variety of retro-futuristic locations, and perform all manner of gadget-driven capers. The tone of the game is cartoon cyberpunk; dense technology-infused locales, dripping with a freshJazzpunk is a stylized first-person adventure comedy. As the mysterious Agent Polyblank, you’ll explore a variety of retro-futuristic locations, and perform all manner of gadget-driven capers. The tone of the game is cartoon cyberpunk; dense technology-infused locales, dripping with a fresh coat of colour and humour.… Expand"}, {"name": "GhostWire: Tokyo", "details_link": "https://www.metacritic.com/game/playstation-5/ghostwire-tokyo", "publisher": "Bethesda Softworks", "release_date": "Mar 22 2022", "developers": ["Tango Gameworks"], "platforms": ["PC", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Visual Novel"], "meta_score": 75, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/2f80a266bb00d535bda5d968a23e1c58-98.jpg", "descriptions": "After strange disappearances hit Tokyo’s population, it’s up to you to uncover the source and purge the city of a strange, new evil. Armed with your own mysterious abilities, you will face down the occult, unravel conspiracy theories and experience urban legends like never before.\rDon’t After strange disappearances hit Tokyo’s population, it’s up to you to uncover the source and purge the city of a strange, new evil. Armed with your own mysterious abilities, you will face down the occult, unravel conspiracy theories and experience urban legends like never before.\rDon’t fear the unknown. Attack it.… Expand"}, {"name": "Amnesia: Rebirth", "details_link": "https://www.metacritic.com/game/playstation-4/amnesia-rebirth", "publisher": "Frictional Games", "release_date": "Oct 20 2020", "developers": ["Frictional Games"], "platforms": ["PC", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/8dcfbfce2b660c024866cab230d4412a-98.jpg", "descriptions": "You can't let out a breath. The creature is only inches away. Its sole purpose - to feed off your terror. And so you crouch in the dark, trying to stop the fear rising, trying to silence what lies within you. \"I know you. I know what you're capable of.\" In Amnesia: Rebirth, you are TasiYou can't let out a breath. The creature is only inches away. Its sole purpose - to feed off your terror. And so you crouch in the dark, trying to stop the fear rising, trying to silence what lies within you. \"I know you. I know what you're capable of.\" In Amnesia: Rebirth, you are Tasi Trianon, waking up deep in the desert of Algeria. Days have passed. Where have you been? What did you do? Where are the others? Retrace your journey, pull together the fragments of your shattered past; it is your only chance to survive the pitiless horror that threatens to devour you.\r \"Do not allow yourself anger, do not allow yourself to fear.\"\r Time is against you. Step into Tasi's shoes and guide her through her personal terror and pain. While you struggle to make your way through a desolate landscape, you must also struggle with your own hopes, fears, and bitter regrets. And still you must continue, step by step, knowing that if you fail you will lose everything.\r * First-person narrative horror experience\r* Explore environments and uncover their histories.\r* Overcome puzzles that stand in your way.\r* Carefully manage your limited resources, both physical and mental.\r* Encounter horrific creatures and use your wits and understanding of the world to escape them.… Expand"}, {"name": "The Long Dark", "details_link": "https://www.metacritic.com/game/playstation-4/the-long-dark", "publisher": "Hinterland", "release_date": "Aug  1 2017", "developers": ["Hinterland"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Simulation", "Action Adventure", "General", "Survival"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/0829238e83ae833016228c60b0343dd5-98.jpg", "descriptions": "The Long Dark is a thoughtful, exploration-survival experience that challenges solo players to think for themselves as they explore an expansive frozen wilderness. Monitor your Condition, search for life-saving supplies, and master survival skills like fire-building, maintaining your gear,The Long Dark is a thoughtful, exploration-survival experience that challenges solo players to think for themselves as they explore an expansive frozen wilderness. Monitor your Condition, search for life-saving supplies, and master survival skills like fire-building, maintaining your gear, hunting, fishing, and landmark-based navigation. There are no zombies -- only you, the cold, and everything Mother Nature can throw at you. The hit Steam Early Access sandbox becomes the first survival game available on Xbox One!… Expand"}, {"name": "Asterigos: Curse of the Stars", "details_link": "https://www.metacritic.com/game/playstation-5/asterigos-curse-of-the-stars", "publisher": "tinyBuild", "release_date": "Oct 11 2022", "developers": ["Acme Gamestudio"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Open-World"], "meta_score": 75, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/8946aeaea5cb1628019b7777a408d89a-98.jpg", "descriptions": "Welcome to Aphes – a city-state full of magic and wonder inspired by ancient Rome and classical Greek designs. From the mist-covered bazaar streets to gloomy sewers, the enigmatic forests at the city’s outskirts to deep chasms full of glittering crystals, the landscapes of Aphes are full ofWelcome to Aphes – a city-state full of magic and wonder inspired by ancient Rome and classical Greek designs. From the mist-covered bazaar streets to gloomy sewers, the enigmatic forests at the city’s outskirts to deep chasms full of glittering crystals, the landscapes of Aphes are full of beauty and dangers. Choose from a variety of ranged and melee weapons on the go and combine them as you wish! The talent system allows you to pick and expand your combat style by choosing two out of six completely different weapons: sword and shield, dual blades, spear, hammer, staff or even magic bracelets. Equip a magical staff to obliterate your foes from the distance or switch to a gigantic battle hammer to squish them in a close combat. Whilst Aphes might distract you with its breathtaking views, this city is not for the faint of heart. Fight your way through 60 different monsters and encounter 22 unique bosses – each with its own unique battle mechanics. Every choice and every decision you make matters. Your journey in Aphes will lead you to discover the truth behind the city’s curse, letting you piece together its history through conversations, discovered documents and cinematics, as well as Hilda’s own diary, which she’ll update with sketches and observations. The world of Asterigos is full of secrets and untold stories. Find over 100 collectibles, complete numerous side quests and build on your legacy in the New Game+ mode!… Expand"}, {"name": "Gran Turismo Sport", "details_link": "https://www.metacritic.com/game/playstation-4/gran-turismo-sport", "publisher": "SCEA", "release_date": "Oct 17 2017", "developers": ["Polyphony Digital"], "platforms": "PlayStation 4", "num_players": "Up to 24 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 75, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/c062aa3e37b9d6b4785921b06cc2044a-98.jpg", "descriptions": "The latest instalment of the Gran Turismo franchise is coming to PlayStation4 with the name Gran Turismo SPORT. The graphics, sound and physics engine promise to be the most realistic ever experienced in a driving simulator thanks to the new platform and the new technologies, but that aloneThe latest instalment of the Gran Turismo franchise is coming to PlayStation4 with the name Gran Turismo SPORT. The graphics, sound and physics engine promise to be the most realistic ever experienced in a driving simulator thanks to the new platform and the new technologies, but that alone would be a too obvious improvement: the way driving games are played also promise to undergo a revolution with Gran Turismo SPORT. This is a vision that invokes the rebirth of motorsports. The major difference between real life motorsports and Gran Turismo SPORT is in the fact that anyone, from children to the elderly, can participate and enjoy racing. Even players who have never played driving games until now can discover how fun it is to drive. Whilst at the same time, it promises the depth and complexity to meet the expectations of the existing Gran Turismo fans.… Expand"}, {"name": "MIND: Path to Thalamus", "details_link": "https://www.metacritic.com/game/pc/mind-path-to-thalamus", "publisher": "Carlos Coronado", "release_date": "Aug  5 2014", "developers": ["Carlos Coronado"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 75, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/4e07ecdfaae356c8bf4f82ecc554a6e6-98.jpg", "descriptions": "MIND: Path to Thalamus is a First Person Puzzler that throws you into a fantastic and surreal environment. You will bend the natural elements to your will in order to progress in this emotive, mindbending tale."}, {"name": "I Am Alive", "details_link": "https://www.metacritic.com/game/playstation-3/i-am-alive", "publisher": "Ubisoft", "release_date": "Apr  3 2012", "developers": ["Ubisoft Shanghai"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 75, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/c264a15533fffe4fdaa0cde014a968c1-98.jpg", "descriptions": "One year after a worldwide cataclysmic event that wiped out most of the human race, a man struggles for his survival in a desolate city as he tries to reunite with his long lost family. In this post-apocalyptic tale, there are no supernatural threats, just an everyman who faces a decayingOne year after a worldwide cataclysmic event that wiped out most of the human race, a man struggles for his survival in a desolate city as he tries to reunite with his long lost family. In this post-apocalyptic tale, there are no supernatural threats, just an everyman who faces a decaying and hazardous world and humanity’s darkest inclinations. Will you cling to your humanity and help strangers or are you ready to sacrifice others in order to survive? [Ubisoft]… Expand"}, {"name": "Etrian Odyssey", "details_link": "https://www.metacritic.com/game/ds/etrian-odyssey", "publisher": "Atlus", "release_date": "May 15 2007", "developers": ["Lancarse", "Atlus"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 75, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/03cc9bb86e60489c2590e3e6f6743b66-98.jpg", "descriptions": "(Also known as \"Sekaiju no Meikyuu\" in Japan)  In a vast and fertile land lies a small town known as Etria, a peaceful village that became famous for a startling discovery. A crack in the vast forest opened at Etria's edge, leading downward like a gaping maw. It all began there... Your(Also known as \"Sekaiju no Meikyuu\" in Japan)  In a vast and fertile land lies a small town known as Etria, a peaceful village that became famous for a startling discovery. A crack in the vast forest opened at Etria's edge, leading downward like a gaping maw. It all began there... Your salvation in the labyrinth is in your own hands: Create your own team of adventurers to withstand the maze’s fierce battles, while creating your own dungeon maps using the Nintendo DS touch screen outside of combat. Lush 3D graphics and a world-class soundtrack puts an exquisite face on the mortal danger that lurks at every step. [Atlus Software]… Expand"}, {"name": "Fallout 4: Far Harbor", "details_link": "https://www.metacritic.com/game/playstation-4/fallout-4-far-harbor", "publisher": "Bethesda Softworks", "release_date": "May 19 2016", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Western-Style"], "meta_score": 75, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/539e3b7afedb66da38c54afe28bd08b0-98.jpg", "descriptions": "A new case from Valentine’s Detective Agency leads you on a search for a young woman and a secret colony of synths. Travel off the coast of Maine to the mysterious island of Far Harbor, where higher levels of radiation have created a more feral world. Navigate through the growing conflictA new case from Valentine’s Detective Agency leads you on a search for a young woman and a secret colony of synths. Travel off the coast of Maine to the mysterious island of Far Harbor, where higher levels of radiation have created a more feral world. Navigate through the growing conflict between the synths, the Children of Atom, and the local townspeople. Will you work towards bringing peace to Far Harbor, and at what cost? Far Harbor features the largest landmass for an add-on that we’ve ever created, filled with new faction quests, settlements, lethal creatures and dungeons. Become more powerful with new, higher-level armor and weapons. The choices are all yours.… Expand"}, {"name": "Bejeweled 3", "details_link": "https://www.metacritic.com/game/ds/bejeweled-3", "publisher": "PopCap", "release_date": "Nov 15 2011", "developers": ["PopCap"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/cb0834eef425821253053172eb0afb71-98.jpg", "descriptions": "The biggest, brightest Bejeweled ever! Discover all-new ways to play the world's #1 puzzle game. Find your perfect match with 8 breathtaking game modes that meet all your moods ease into Classic Bejeweled for cascades of fun, journey through 40 challenging Quest puzzles, charge into theThe biggest, brightest Bejeweled ever! Discover all-new ways to play the world's #1 puzzle game. Find your perfect match with 8 breathtaking game modes that meet all your moods ease into Classic Bejeweled for cascades of fun, journey through 40 challenging Quest puzzles, charge into the electrifying Lightning for non-stop action, and tailor your experience in Zen for a revolutionary new way to relax.… Expand"}, {"name": "Bomberman", "details_link": "https://www.metacritic.com/game/ds/bomberman", "publisher": "Ubisoft", "release_date": "Jun 21 2005", "developers": ["Racjin"], "platforms": "DS", "num_players": "1-8 ", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "General", "Action"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/f7b1ba067347f3f56b37970433c5afd8-98.jpg", "descriptions": "The Bomberman series returns with Bomberman for the Nintendo DS, boasting the first eight-player wireless LAN action for the Nintendo DS and strategy and action will keep puzzle fans and players of all ages and skill levels drawn to the 100 stages of gameplay. Multiplayer action: EightThe Bomberman series returns with Bomberman for the Nintendo DS, boasting the first eight-player wireless LAN action for the Nintendo DS and strategy and action will keep puzzle fans and players of all ages and skill levels drawn to the 100 stages of gameplay. Multiplayer action: Eight players can battle it out simultaneously via a wireless LAN connection. Bomberman challenges even the most die-hard Bomberman and puzzle-game fans with 100 stages to test their gaming reflexes and strategic minds. Bomberman creates massive mazes by using the DS dual-screen capabilities. Bomberman supports the DS microphone via sound-recognition, allowing players to call out battle commands to their Bomberman. Single-Card Play Ensures friends will be able to get in on the multiplayer action for up to eight players. [Ubisoft]… Expand"}, {"name": "Field of Glory II: Medieval", "details_link": "https://www.metacritic.com/game/pc/field-of-glory-ii-medieval", "publisher": "Slitherine", "release_date": "Feb  4 2021", "developers": ["Slitherine"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/8808ed9f5f8a21df11f0d2cdbbe4b2c2-98.jpg", "descriptions": "Field of Glory II Medieval is a turn-based tactical game set in the High Middle Ages from 1040 AD to 1270 AD. Developed by legendary designer Richard Bodley Scott it brings the best from the tabletop world into the best digital framework."}, {"name": "Worms W.M.D", "details_link": "https://www.metacritic.com/game/xbox-one/worms-wmd", "publisher": "Team17", "release_date": "Aug 23 2016", "developers": ["Team17"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Strategy", "Turn-Based", "Artillery"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/80acb7e4552afd9e02ba1c18bad08929-98.jpg", "descriptions": "With a hand-drawn 2D look, brand new weapons, the introduction of crafting, vehicles and buildings plus the return of some classic weapons and gameplay, Worms W.M.D is back."}, {"name": "Figment", "details_link": "https://www.metacritic.com/game/switch/figment", "publisher": "Bedtime Digital Games", "release_date": "Jun 28 2018", "developers": ["Bedtime Digital Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/2d80df45f2abf07c39200ae01d02f3bb-98.jpg", "descriptions": "Figment is a whimsical-looking adventure game that is also a full-fledged musical."}, {"name": "Atom Zombie Smasher", "details_link": "https://www.metacritic.com/game/pc/atom-zombie-smasher", "publisher": "Blendo Games", "release_date": "Jan 23 2011", "developers": ["Blendo Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "General"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/d5d467afa7a69841cfcd813d9ef12336-98.jpg", "descriptions": "Players must save survivors from the 1961 zombie apocalypse by assembling an army of mercenaries and firing nuclear missiles from orbit to destroy the oncoming horde."}, {"name": "Left 4 Dead 2: The Passing", "details_link": "https://www.metacritic.com/game/pc/left-4-dead-2-the-passing", "publisher": "Electronic Arts", "release_date": "Apr 22 2010", "developers": ["Valve Software"], "platforms": ["Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Tactical"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/bb09e9090dded67621fdb57139ae3ec8-98.jpg", "descriptions": "(Dowloadable Content)  Left 4 Dead 2’s \"The Passing\" brings the original Left 4 Dead Survivors down south for a meeting with the L4D2 cast, while delivering new single-player, multiplayer and co-operative gameplay."}, {"name": "Bugsnax", "details_link": "https://www.metacritic.com/game/playstation-5/bugsnax", "publisher": "Young Horses, Inc", "release_date": "Nov 12 2020", "developers": ["Young Horses", "Inc"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Action Adventure", "Adventure", "3D", "Open-World", "First-Person"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/cb545a1718f9bbef47b15b0895d0ec67-98.jpg", "descriptions": "Explore whimsical Snaktooth Island in search of answersand a snack, maybe. \r\rIn this first-person adventure, you play as a journalist who receives a mysterious film from the disgraced explorer, Elizabert Megafig. She's invited you to Snaktooth Island to witness her latest and greatestExplore whimsical Snaktooth Island in search of answersand a snack, maybe. \r\rIn this first-person adventure, you play as a journalist who receives a mysterious film from the disgraced explorer, Elizabert Megafig. She's invited you to Snaktooth Island to witness her latest and greatest discovery: Bugsnax! Lured by the promise of a great story, you travel to the island to interview Elizabert and her group of misfit grumpuses. In the pursuit of your big scoop, you get caught up in hunting Bugsnax, feeding grumpuses, and solving the mysteries of the island\r * What are these half-bug half-snack creatures, really?\r* How do they affect the bodies of those who eat them?\r* And most importantly, why do they taste SO GOOD!?… Expand"}, {"name": "Beyond Blue", "details_link": "https://www.metacritic.com/game/playstation-4/beyond-blue", "publisher": "E-Line Media", "release_date": "Jun 11 2020", "developers": ["E-Line Media"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "General", "3D", "Third-Person"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/94792f23db91dc23449a834a3e834122-98.jpg", "descriptions": "Beyond Blue takes players into the near future, where they will have the opportunity to explore the mysteries of our ocean through the eyes of Mirai, a deep-sea explorer and scientist. She and her newly-formed research team will use groundbreaking technologies to see, hear, and interact withBeyond Blue takes players into the near future, where they will have the opportunity to explore the mysteries of our ocean through the eyes of Mirai, a deep-sea explorer and scientist. She and her newly-formed research team will use groundbreaking technologies to see, hear, and interact with the ocean in a more meaningful way than has ever been attempted. The game features an evocative narrative and exploration of an untouched world. Embracing the same inclusive development process that was used to create Never Alone (Kisima Ingitchuna), E-Line’s BAFTA award-winning game about Alaska Native culture, the company partnered with BBC Studios (developers of the acclaimed Blue Planet II), OceanX Media, world-class game makers, and some of science’s leading ocean experts to craft an experience that reflects the awesome wonder and unbounded mystery that infuses our planet’s beating blue heart.… Expand"}, {"name": "Batman: The Telltale Series - Episode 5: City of Light", "details_link": "https://www.metacritic.com/game/pc/batman-the-telltale-series---episode-5-city-of-light", "publisher": "Telltale Games", "release_date": "Dec 13 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 75, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/f811a54ca1b6d83002366f118082743c-98.jpg", "descriptions": "Enter the fractured psyche of Bruce Wayne and discover the powerful and far-reaching consequences of your choices as the Dark Knight. The fate of Bruce Wayne, his dark persona, Batman, and Gotham hang in the balance."}, {"name": "Blade Strangers", "details_link": "https://www.metacritic.com/game/switch/blade-strangers", "publisher": "Nicalis", "release_date": "Aug 28 2018", "developers": ["Studio Saizensen"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action", "Fighting", "2D"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/d793b7d49093087f34fc59c19d1450a0-98.jpg", "descriptions": "Developed by Studio Saizensen, Blade Strangers is a hardcore old-school fighting game. The streamlined four button control scheme makes it easy for beginners to deal out damage from day one...but the intricate combos, counters and specials give tournament-caliber players plenty ofDeveloped by Studio Saizensen, Blade Strangers is a hardcore old-school fighting game. The streamlined four button control scheme makes it easy for beginners to deal out damage from day one...but the intricate combos, counters and specials give tournament-caliber players plenty of opportunities for frame counting, chain construction and hit-box science.… Expand"}, {"name": "Unreal II: The Awakening", "details_link": "https://www.metacritic.com/game/pc/unreal-ii-the-awakening", "publisher": "Atari", "release_date": "Feb  3 2003", "developers": ["Legend Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 75, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/e75dd5f8947a54c2927ffd142adb57b5-98.jpg", "descriptions": "As a Terran Colonial Authority Marshall, you're patrolling a sector of the frontier with three crew members when an interstellar war erupts about you! Rumors of powerful and ancient alien artifacts have driven rival factions to war in an attempt to find and control the objects. You mustAs a Terran Colonial Authority Marshall, you're patrolling a sector of the frontier with three crew members when an interstellar war erupts about you! Rumors of powerful and ancient alien artifacts have driven rival factions to war in an attempt to find and control the objects. You must locate these artifacts, determine their purpose and restore order to the sector - before it's too late. [Infogrames]… Expand"}, {"name": "Bulletstorm: Full Clip Edition", "details_link": "https://www.metacritic.com/game/playstation-4/bulletstorm-full-clip-edition", "publisher": "Epic Games", "release_date": "Apr  7 2017", "developers": ["People Can Fly"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/ebf33fafa3f1034575bd3f958a16bdc6-98.jpg", "descriptions": "Step into the boots of Grayson Hunt after a crash landing on an abandoned resort planet forces him to make a hard choice: survival or revenge. An exiled member of the elite assassin group Dead Echo, Graysons blind desire for vengeance finds his crew stranded on Stygia where he can finallyStep into the boots of Grayson Hunt after a crash landing on an abandoned resort planet forces him to make a hard choice: survival or revenge. An exiled member of the elite assassin group Dead Echo, Graysons blind desire for vengeance finds his crew stranded on Stygia where he can finally confront the commander behind his betrayalor get his team off the planet alive.\r Battle your way through throngs of Stygias mutated inhabitants, performing masterful kills throughout the single-player campaignor one of 30 competitive score-challenge or 12 co-operative multiplayer mapsusing Bulletstorm: Full Clip Editions unique Skillshot system that rewards you for executing the most creative and deadly kills imaginable.\r Bulletstorm: Full Clip edition is the definitive Bulletstorm experience that includes all existing Bulletstorm add-ons, plus brand-new content exclusive to Full Clip!… Expand"}, {"name": "Stikbold! A Dodgeball Adventure", "details_link": "https://www.metacritic.com/game/playstation-4/stikbold!-a-dodgeball-adventure", "publisher": "Reign Bros", "release_date": "Apr  5 2016", "developers": ["Reign Bros"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Arcade"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/7d1cf1d2008a3303c877a16a10f0c200-98.jpg", "descriptions": "Take charge of Stikbold superstars Bjorn & Jerome as they set out on a heroic rescue missoin in the name of love... and glory! Partake on an epic journey that will test your skill as well as your friendship, and remember - \"no one is a team alone!\""}, {"name": "Atelier Sophie: The Alchemist of the Mysterious Book", "details_link": "https://www.metacritic.com/game/playstation-4/atelier-sophie-the-alchemist-of-the-mysterious-book", "publisher": "Koei Tecmo Games", "release_date": "Jun  7 2016", "developers": ["Gust"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/719299af111bdd4abfecf015b45f587b-98.jpg", "descriptions": "The nubie alchemist Sophie of Kirchen Bell meets the Mysterious Book called Plachta and embarks on a wonderful adventure."}, {"name": "Inazuma Eleven Go: Shadow", "details_link": "https://www.metacritic.com/game/3ds/inazuma-eleven-go-shadow", "publisher": "Nintendo", "release_date": "Jun 13 2014", "developers": ["Level 5"], "platforms": "3DS", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/59c309e758c8819ab34df42d4a9f6161-98.jpg", "descriptions": "Inazuma Eleven Go puts you at the center of a huge football adventure, recruiting the ultimate team to save your school club from closure. Learn powerful Special Moves, then take on rival teams as you shoot for the top."}, {"name": "WWE All Stars", "details_link": "https://www.metacritic.com/game/xbox-360/wwe-all-stars", "publisher": "THQ", "release_date": "Mar 29 2011", "developers": ["THQ"], "platforms": ["3DS", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/4b928e6abba3bf612702bc5cdb796d9e-98.jpg", "descriptions": "WWE All Stars will deliver one of the greatest rosters ever assembled in a wrestling-centric videogame.  Renowned WWE Legends will align with todayâ€™s most prominent Superstars, inviting players to generate fantasy matches and ultimately determine the greatest competitors of all time.WWE All Stars will deliver one of the greatest rosters ever assembled in a wrestling-centric videogame.  Renowned WWE Legends will align with todayâ€™s most prominent Superstars, inviting players to generate fantasy matches and ultimately determine the greatest competitors of all time.  In addition, each Legend and Superstar will boast a distinctive and highly stylized appearance, adding to the overall atmosphere and intrepid attitude exuding from the on-screen action.… Expand"}, {"name": "Magic: The Gathering - Duels of the Planeswalkers 2012", "details_link": "https://www.metacritic.com/game/xbox-360/magic-the-gathering---duels-of-the-planeswalkers-2012", "publisher": "Wizards of the Coast", "release_date": "Jun 15 2011", "developers": ["Stainless Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/52afedb0da9c367a6fe3ec6674f45828-98.jpg", "descriptions": "Building on the success of the original Duels of the Planeswalkers, Duels of the Planeswalkers 2012 will introduce all new game modes, Planeswalker opponents, decks, puzzle challenges and other exciting new features including a new-to-digital multiplayer game mode called Archenemy whereBuilding on the success of the original Duels of the Planeswalkers, Duels of the Planeswalkers 2012 will introduce all new game modes, Planeswalker opponents, decks, puzzle challenges and other exciting new features including a new-to-digital multiplayer game mode called Archenemy where players gather up to two allies and team up against the AI.… Expand"}, {"name": "Life is Strange: Episode 1 - Chrysalis", "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-episode-1---chrysalis", "publisher": "Square Enix", "release_date": "Jan 30 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/3fa0dc2187f06b71f823af332513b808-98.jpg", "descriptions": "Chrysalis is an introduction to the world of Life is Strange. You’ll see Max and Chloe reunite and you’ll make important choices that will influence their destiny. You will observe some of the short-term consequences of those choices but know that there are also mid and long-termChrysalis is an introduction to the world of Life is Strange. You’ll see Max and Chloe reunite and you’ll make important choices that will influence their destiny. You will observe some of the short-term consequences of those choices but know that there are also mid and long-term repercussions that will pan out over the course of the later episodes, in a butterfly effect manner. [DONTNOD]… Expand"}, {"name": "Star Wars Battlefront", "details_link": "https://www.metacritic.com/game/xbox-one/star-wars-battlefront", "publisher": "Electronic Arts", "release_date": "Nov 17 2015", "developers": ["EA DICE"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 40 ", "genres": ["General", "General", "Action", "Shooter", "First-Person", "Tactical"], "meta_score": 75, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/3/bf2ea306bd2cfc3981901ad9974cab60-98.jpg", "descriptions": "Star Wars Battlefront lets players live out a broad array of heroic moments and intense battle fantasies of their own – firing blasters, riding speeder bikes and snow speeders, commanding AT-ATs and piloting TIE fighters and the Millennium Falcon. These battles will take place on the iconicStar Wars Battlefront lets players live out a broad array of heroic moments and intense battle fantasies of their own – firing blasters, riding speeder bikes and snow speeders, commanding AT-ATs and piloting TIE fighters and the Millennium Falcon. These battles will take place on the iconic planets of the Star Wars universe, including Endor, Hoth, Tatooine and the previously unexplored planet, Sullust. Gamers can play as the memorable characters from the original trilogy such as Darth Vader and Boba Fett. Star Wars Battlefront features a wide range of modes tailored for different types of battles, from larger 40-person competitive multiplayer to crafted missions that are played solo, with a partner via split-screen offline or co-operatively online. [EA/Lucasfilm] … Expand"}, {"name": "Yooka-Laylee", "details_link": "https://www.metacritic.com/game/switch/yooka-laylee", "publisher": "Team17", "release_date": "Dec 14 2017", "developers": ["Playtonic Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/c848ff727eb90bfd0adfa6c2c8bdb7b9-98.jpg", "descriptions": "Yooka-Laylee is an all-new 3D platformer from the creative talent behind the Banjo-Kazooie and Donkey Kong Country games. Weve come together to form Playtonic Games and create a spiritual successor to our most cherished work from the past!\r Our new heroes, Yooka (the green bloke with noYooka-Laylee is an all-new 3D platformer from the creative talent behind the Banjo-Kazooie and Donkey Kong Country games. Weve come together to form Playtonic Games and create a spiritual successor to our most cherished work from the past!\r Our new heroes, Yooka (the green bloke with no pants) and Laylee (the wisecracking lady-bat with the big nose) were conceptualised from the ground up for stellar platforming gameplay, created by the same character artist behind the rebooted Donkey Kong family and legendary N64 heroes Banjo and Kazooie.\r Using an arsenal of special moves like Yookas tongue grapple and Laylees tactical sonar blast, players will explore  and expand  gorgeous 3D worlds drawn up by esteemed environment artist Steven Hurst (Banjo-Kazooie series, Viva Pinata) and through skill discover the plethora of delicious collectibles hidden within.\r FEATURES:\r * Heroes Built for Fun: Our new buddy-duo were dreamed up specifically for entertaining platforming gameplay and exceptional colour coordination. We think we've captured the spirit of our past heroes while introducing our most inventive moves yet.\r * An Arsenal of Abilities: Sonar blasting, tongue whipping, sky soaring a move roster built for platforming fun  and unlocked with added freedom. Additionally, there may or may not be a move involving a giant fart bubble.\r * A Dream Soundtrack: David Wise (Donkey Kong Country) and Grant Kirkhope (Banjo-Kazooie) combine in what's sure to be a melodic masterpiece! Seriously, clean out your ears - they're in for a treat.\r * Collect-em-up 2.0: A roster of shiny collectibles with gameplay progression at their core (as well as other, more valuable materials). Every collectible type in our new game will expand gameplay in a meaningful way. Yes, we employ the man responsible for DK64's myriad of trinkets, but we've had a stern word. Our main collectible, Pagies, are used to unlock and expand new worlds in Yooka-Laylee.\r * Expandable Worlds: Experience more of the playgrounds you love by spending collectibles to expand your favourites into bigger, more challenging worlds.\r * A Cast to Last: A huge cast of memorable characters to meet (or beat) brought to life by the art and audio teams behind Banjo-Kazooie and destined to endure in future games as part of Playtonic Universe. Expect all manner of grunts, squeaks and squawks.\r * Introducing Play Tonics: Discover these unique gameplay modifiers and use them to customise gameplay to suit your style. Will you run faster, hit harder or fly further? Also, are they named after our studio or vice versa? We'll never know.\r * Arcade machines: Each world hides at least one secret arcade game encasing old-school gaming goodness. Complete its retro-tastic challenge to claim your Pagie!… Expand"}, {"name": "Dance Dance Revolution Ultramix 3", "details_link": "https://www.metacritic.com/game/xbox/dance-dance-revolution-ultramix-3", "publisher": "Konami", "release_date": "Nov 15 2005", "developers": ["Konami"], "platforms": "Xbox", "num_players": "4  Online", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 75, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/d5c5295a36f75320bf8a5948475c63c5-98.jpg", "descriptions": "Dance Dance Revolution Ultramix 3 allows players to compete online and go head-to-head with other DDR fans from around the globe, talk live to other DDR players as well as download new songs and other content. Ultramix 3 also features never-before-seen offline modes that cater to the casual,Dance Dance Revolution Ultramix 3 allows players to compete online and go head-to-head with other DDR fans from around the globe, talk live to other DDR players as well as download new songs and other content. Ultramix 3 also features never-before-seen offline modes that cater to the casual, beginner and advanced dancers. 'Freestyle Mode' lets newcomers to the series dance to any song without having to follow specific dance steps on the screen. Although players are not beholden to any choreographed moves, the game recognizes their dance patterns and will reward players for completing different step combinations. More seasoned players can enjoy the 'Quest Mode' where they can travel from city to city and build the ultimate dance team by completing challenging songs and routines. The game's 'Jukebox Mode' allows players to enjoy more than 65 upbeat tracks from the game and use them as background music. By serving up the hottest dance tunes, comprised of remixes, dance anthems and popular hits, DDR keeps everyone moving and grooving. DDR also returns with the classic 'Workout Mode,' which gives gamers a method to track the progress of their dance/exercise routines and see how many calories they have burned.… Expand"}, {"name": "Two Worlds II", "details_link": "https://www.metacritic.com/game/pc/two-worlds-ii", "publisher": "TopWare Interactive", "release_date": "Feb  3 2011", "developers": ["Reality Pump"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Third-Person", "Third-Person", "General", "Action RPG"], "meta_score": 75, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/f35503f43c3c19dd3610b7a2af0e2d86-98.jpg", "descriptions": "Taking place shortly after the events portrayed in the first Two Worlds, The Temptation takes place in Eastern Antaloor, in the regions surrounding Oswaroh and the Drak’ar Desert. Featuring as much content as the original, Two Worlds: The Temptation features more intricate missions, improvedTaking place shortly after the events portrayed in the first Two Worlds, The Temptation takes place in Eastern Antaloor, in the regions surrounding Oswaroh and the Drak’ar Desert. Featuring as much content as the original, Two Worlds: The Temptation features more intricate missions, improved voice-overs and animations, retooled horseback riding, completely revamped combat, and a new game engine that delivers improved visuals. [SouthPeak Interactive]… Expand"}, {"name": "Cloudberry Kingdom", "details_link": "https://www.metacritic.com/game/playstation-3/cloudberry-kingdom", "publisher": "Ubisoft", "release_date": "Jul 30 2013", "developers": ["Pwnee Studios"], "platforms": ["PC", "Wii U", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 75, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/428e77ffffe725d5f6f34681e6aee688-98.jpg", "descriptions": "Cloudberry Kingdom, the land where good heroes go to die, and Bob is the best of them all. Bob sits on the precipice of retirement, recliner ready, but first he must get back what he lost years ago. Jump and dodge your way through billions of levels on a last ditch mission to conquerCloudberry Kingdom, the land where good heroes go to die, and Bob is the best of them all. Bob sits on the precipice of retirement, recliner ready, but first he must get back what he lost years ago. Jump and dodge your way through billions of levels on a last ditch mission to conquer infinity. The quest was never over. The princess was never saved. A challenge is waiting, are you ready?… Expand"}, {"name": "Tiger Woods PGA Tour 13", "details_link": "https://www.metacritic.com/game/playstation-3/tiger-woods-pga-tour-13", "publisher": "Electronic Arts", "release_date": "Mar 27 2012", "developers": ["Electronic Arts"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 75, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/9/6b3609b160bde2d942612301ab961327-98.jpg", "descriptions": "Swing Tempo - For the 1st time in Tiger Woods PGA TOUR history, the tempo and speed of your swing is going to directly influence the power of your shot. Fast tempo will add more distance to shots. Slow tempo will result in less distance. Shot Setup – Create all possible shot types from oneSwing Tempo - For the 1st time in Tiger Woods PGA TOUR history, the tempo and speed of your swing is going to directly influence the power of your shot. Fast tempo will add more distance to shots. Slow tempo will result in less distance. Shot Setup – Create all possible shot types from one shot setup. Drag your aiming marker forward and back to blend between full , ¾ , pitch, and chip shots. Create draw and fade shots by opening and closing your golfer’s stance. Affect the launch trajectory by moving the ball forward or backward in your stance to create flop and punch shots. The possibilities are endless, allowing any real shot to be created in the game. Strike Meter – Using the all-new Strike Meter, place the sweet spot of the club precisely where you wish to hit the ball. While a center strike is the most common, you can use low and high strikes to alter power, spin and trajectory. Swing Arc – The visualization of the golfer’s swing is shown in the form of an arc. Use this arc as a guide to execute your swing with the proper power, trajectory and shot shape. All-New Animations – Utilizing the latest version of EA’s sophisticated ANT animation system, you’ll be able to see in real-time whether your golf swing is on or off plane through your golfer’s on-screen animations. [Electronic Arts]\r… Expand"}, {"name": "Far Cry New Dawn", "details_link": "https://www.metacritic.com/game/xbox-one/far-cry-new-dawn", "publisher": "Ubisoft", "release_date": "Feb 15 2019", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "2 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/4/94f70ec1fc3aa65958884d98df20bd08-98.jpg", "descriptions": "Seventeen years after a nuclear doomsday, Hope County, Montana, has changed in unexpected ways. Nuclear winter has given way to a \"superbloom,\" creating a lush, colourful landscape that survivors have begun to re-populate with makeshift buildings. It's a lawless frontier where people areSeventeen years after a nuclear doomsday, Hope County, Montana, has changed in unexpected ways. Nuclear winter has given way to a \"superbloom,\" creating a lush, colourful landscape that survivors have begun to re-populate with makeshift buildings. It's a lawless frontier where people are struggling to get by - and you'll be able to experience it all with a friend in co-op, or on your own as a lone gunslinger. After living through the apocalypse, the survivors in Hope County now face a new threat: the nihilistic Highwaymen, vicious scavengers intent on bleeding the county dry. When the survivors put out a call for help to combat this deadly threat, you are quickly thrust into the middle of a new battle for the future of Hope County. Since the nuclear apocalypse, survivors have been piecing their shelter, tools, and weapons together from the broken remnants of the old world. The results may look ramshackle, but they'll keep you alive in a fight. Your Homebase will let you construct powerful weapons and vehicles, giving you more options than ever for explosive, over-the-top action. When anything and everything can happen, it is never too much to have someone watching your back. Whether it's Hurk, a boar, or whoever you want, you can recruit an eclectic cast of Guns and Fangs for Hire to fight by your side. You can even play with a friend in co-op.… Expand"}, {"name": "Zubo", "details_link": "https://www.metacritic.com/game/ds/zubo", "publisher": "Electronic Arts", "release_date": "Mar 10 2009", "developers": ["EA Bright Light"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/0a80f8e23ed6b4c9164858898b84dd66-98.jpg", "descriptions": "Zubo is a music-based rhythm-action game featuring a unique set of characters. Players enter the world of Zubalon to help the colorful and zany inhabitants, the Zubos, defeat an evil force which is bent on world domination. Players can befriend the Zubos they meet along the way, feed andZubo is a music-based rhythm-action game featuring a unique set of characters. Players enter the world of Zubalon to help the colorful and zany inhabitants, the Zubos, defeat an evil force which is bent on world domination. Players can befriend the Zubos they meet along the way, feed and nurture them, help them gain skills and strength, and assist them in their battles with the enemy, the dastardly Zombos. A key element to Zubo is music, which is intrinsic to Zubalon from its tuneful plant life through to its currency of musical notes. The player uses the music to drive the battles forward, synchronizing their stylus action and tapping in time with the musical beats to win. With 55 Zubos available to find and recruit to a player’s squad, plus a wealth of interactions and mini-games, and the world of Zubalon to explore, Zubo offers a rewarding Nintendo DS experience. [Electronic Arts]… Expand"}, {"name": "Grow Home", "details_link": "https://www.metacritic.com/game/pc/grow-home", "publisher": "Ubisoft", "release_date": "Feb  4 2015", "developers": ["Ubisoft Reflections"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox", "Open-World"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/14a0de7e6b7f72e02adb73c2c0f3ac43-98.jpg", "descriptions": "Feel the freedom of unbounded climbing as you take control of BUD, a procedurally animated robot on a quest to save his planet. Create your own path through an alien world as you control and ride a giant plant on a vertical journey to the stars."}, {"name": "LEGO Bricktales", "details_link": "https://www.metacritic.com/game/pc/lego-bricktales", "publisher": "Thunderful", "release_date": "Oct 12 2022", "developers": ["ClockStone Studio"], "platforms": ["PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 75, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/4548e613e22226d7c5f494f5c8a8f70a-98.jpg", "descriptions": "Your grandfather, a genius inventor, has called you for help! His beloved amusement park is about to close as the mayor is threatening to shut everything down and seize the land if the necessary repairs aren't made to bring it up to code. With the help of your powerful little robot buddy,Your grandfather, a genius inventor, has called you for help! His beloved amusement park is about to close as the mayor is threatening to shut everything down and seize the land if the necessary repairs aren't made to bring it up to code. With the help of your powerful little robot buddy, you can restore it using a mysterious device based on alien technology.As a source of power, the device needs happiness crystals, which you can harvest by making people happy and solving their problems. With the aid of a portal, travel to different locations all around the world to help people and collect their happiness crystals. Strap in for the ultimate building adventure and save your grandfather's amusement park!In this puzzle-adventure, use an intuitive brick-by-brick building mechanic to solve puzzles and bring your creations to life! Experience a charming story as you explore beautiful LEGO dioramas and help the people inhabiting them.… Expand"}, {"name": "The House of the Dead: Overkill - Extended Cut", "details_link": "https://www.metacritic.com/game/playstation-3/the-house-of-the-dead-overkill---extended-cut", "publisher": "Sega", "release_date": "Oct 25 2011", "developers": ["Headstrong Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Light Gun", "Light Gun"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/17095d2284ea54e5139357e65b050146-98.jpg", "descriptions": "Using a host of weapons, watch your back as mutants go mad for blood! Blast bloody pieces out of their wretched bodies to save you and a friend's life as you work to uncover the mystery behind the outbreak. New goodies like PlayStation trophies, new game modes and new content are outnumberedUsing a host of weapons, watch your back as mutants go mad for blood! Blast bloody pieces out of their wretched bodies to save you and a friend's life as you work to uncover the mystery behind the outbreak. New goodies like PlayStation trophies, new game modes and new content are outnumbered by only one thing: Bullets. Will you defeat everything this freakish nightmare town throws at you or will you become mutant chowder?… Expand"}, {"name": "DiRT Showdown", "details_link": "https://www.metacritic.com/game/playstation-3/dirt-showdown", "publisher": "Codemasters", "release_date": "Jun 12 2012", "developers": ["Codemasters"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 75, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/ec2269e9d74df1b52d068d91f2dad7a1-98.jpg", "descriptions": "Dirt Showdown is an arcade spin-off of the Dirt series featuring over-the-top Hoonigan, Demolition, and Race events."}, {"name": "Wild Hearts", "details_link": "https://www.metacritic.com/game/pc/wild-hearts", "publisher": "Electronic Arts", "release_date": "Feb 17 2023", "developers": ["Omega Force"], "platforms": ["PlayStation 5", "Xbox Series X", "PC"], "num_players": "Up to 3 ", "genres": ["Action Adventure", "General", "Role-Playing", "Action RPG"], "meta_score": 75, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/a315be9869fa5137b16fb22a15ebf87e-98.jpg", "descriptions": "Master ancient tech to hunt down giant beasts through a fantasy world inspired by feudal Japan. WILD HEARTS is a unique twist on the hunting genre where technology gives you a fighting chance against fearsome beasts infused with the ferocious power of nature itself.  Take on these creaturesMaster ancient tech to hunt down giant beasts through a fantasy world inspired by feudal Japan. WILD HEARTS is a unique twist on the hunting genre where technology gives you a fighting chance against fearsome beasts infused with the ferocious power of nature itself.  Take on these creatures alone or hunt with friends in seamless co-op. Developed by Omega Force, the Japanese studio behind the Dynasty Warriors franchise and in partnership with EA Originals, WILD HEARTS takes you on an epic adventure set in a fantasy world inspired by feudal Japan.\r… Expand"}, {"name": "Fable III", "details_link": "https://www.metacritic.com/game/pc/fable-iii", "publisher": "Microsoft Game Studios", "release_date": "May 17 2011", "developers": ["Lionhead Studios"], "platforms": ["Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 75, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/4/36d2e3323945a29995b2f6e8850b7498-98.jpg", "descriptions": "Fans new and returning will now embark on an epic adventure, where the race for the crown is only the beginning of your spectacular journey. Five decades have passed since the events of \"Fable II,\" and Albion has matured into an industrial revolution, but the fate of the kingdom isFans new and returning will now embark on an epic adventure, where the race for the crown is only the beginning of your spectacular journey. Five decades have passed since the events of \"Fable II,\" and Albion has matured into an industrial revolution, but the fate of the kingdom is at peril. In \"Fable III,\" you will be called upon to rally and fight alongside your people, ascend to the seat of power, and experience the true meaning of love and loss. The choices and sacrifices you make while fanning the flames of revolution, and then as you rule as King or Queen or Albion, will lead to an ever evolving world of consequences that will be felt across your entire land. This sets the stage for unparalleled action and adventure that offers even more ways to fight and engage than ever before. Throughout your journey, you will encounter a colorful cast of characters that fans have come to expect from the off-beat style and humor in the “Fable” games. After determining whether these characters are your friends or foes, you will either join them or fight against them in explosive combat, alone or with a friend on Xbox LIVE. In your quest to plant the seeds of revolution, seize power and rule over your kingdom, the choices you make will change the world around you, for the greater good or your own personal gain. Who will you become? A rebel without a cause, the tyrant you rebelled against, or the greatest ruler to ever live? … Expand"}, {"name": "Figment 2: Creed Valley", "details_link": "https://www.metacritic.com/game/pc/figment-2-creed-valley", "publisher": "Bedtime Digital Games", "release_date": "Mar  9 2023", "developers": ["Bedtime Digital Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/729b3a60097ccd2224c2fb3a5bb161e3-98.jpg", "descriptions": "Piano bridges, dancing plants and musical showdowns, ready to dive into The Mind? Nightmares have shattered the Moral Compass, making The Mind unable to function properly. Dusty and his ever-optimistic sidekick, Piper, must travel to Creed Valley, where The Mind's ideals are formed toPiano bridges, dancing plants and musical showdowns, ready to dive into The Mind? Nightmares have shattered the Moral Compass, making The Mind unable to function properly. Dusty and his ever-optimistic sidekick, Piper, must travel to Creed Valley, where The Mind's ideals are formed to restore peace. \r\rFigment 2: Creed Valley is an action-adventure game set in the human mind. Nightmares are spreading chaos and have overrun once-peaceful lands. Join Dusty, The Mind's courage, as you make your way through puzzles, musical boss fights and unique environments.\r Face your fears head-on.… Expand"}, {"name": "Contraband Police", "details_link": "https://www.metacritic.com/game/pc/contraband-police", "publisher": "PlayWay", "release_date": "Mar  8 2023", "developers": ["Crazy Rocks"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "3D", "Virtual", "First-Person", "Career"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/4b031ca9f34c7b188b82032c4144ee4b-98.jpg", "descriptions": "You are a border police inspector in a communist country of the early 1980s. Every second driver is a smuggler and the vehicles are stuffed with hidden contraband. Documents, vehicles, cargo.. everything is a subject to detailed control..."}, {"name": "Tentacular", "details_link": "https://www.metacritic.com/game/playstation-5/tentacular", "publisher": "Devolver Digital", "release_date": "Feb 22 2023", "developers": ["Firepunchd"], "platforms": ["PC", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 75, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/cb92eb67f9b8eed7da54b8149c0a38e9-98.jpg", "descriptions": "Ever felt like a squid out of water?Tentacular plunges you into the ocean-dwelling hulk of a gigantic, kind-hearted tentacled beast trying to figure out its place in the world.\n\nRaised among humans on the bustling and eccentric island of La Kalma, the time has finally come to unravel theEver felt like a squid out of water?Tentacular plunges you into the ocean-dwelling hulk of a gigantic, kind-hearted tentacled beast trying to figure out its place in the world.Raised among humans on the bustling and eccentric island of La Kalma, the time has finally come to unravel the secrets of your mysterious origin while working as the world's strongest handyman. Help your human friends to research a strange and an incredibly powerful energy source through a colossal collection of action-based activities and constructions puzzles, using your titanic tentacles to aid your quest for answers and unlock elements for your very own playground in the creative sandbox mode.… Expand"}, {"name": "Lost Eidolons", "details_link": "https://www.metacritic.com/game/pc/lost-eidolons", "publisher": "Ocean Drive Studio", "release_date": "Oct 13 2022", "developers": ["Ocean Drive Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/cba50bc584cc084c172449914f051543-98.jpg", "descriptions": "The land of Benerio was once a shining kingdom by the sea. Then an iron-fisted conqueror, Ludivictus, set the world on fire and redrew the maps. Now Benerio is one downtrodden province in a crumbling Empire where the only true master is corruption.Enter Eden, a charming mercenary captainThe land of Benerio was once a shining kingdom by the sea. Then an iron-fisted conqueror, Ludivictus, set the world on fire and redrew the maps. Now Benerio is one downtrodden province in a crumbling Empire where the only true master is corruption.Enter Eden, a charming mercenary captain forced to become a rebel commander when his village is thrust headfirst into war. Now Eden must rally his allies and stand tall against an imperial army, fearsome monsters, and enemies within.Lost Eidolons is a turn-based tactical RPG with a gripping cinematic narrative, set in a waning empire riven by civil war. Take on the role of a charming mercenary captain, Eden, and lead his band of allies through epic encounters on a classic turn-based battlefield.… Expand"}, {"name": "Asterigos: Curse of the Stars", "details_link": "https://www.metacritic.com/game/xbox-series-x/asterigos-curse-of-the-stars", "publisher": "tinyBuild", "release_date": "Oct 11 2022", "developers": ["Acme Gamestudio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Open-World"], "meta_score": 75, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/4/ee96667191f9dd0bff32aa10cb960d73-98.jpg", "descriptions": "Embark on a journey full of danger in this action RPG, inspired by Greek and Roman mythologies. Explore the breathtaking city of Aphes and forge your way through legions of unique foes and mythical bosses to discover the truth behind the city’s curse."}, {"name": "Jack Move", "details_link": "https://www.metacritic.com/game/pc/jack-move", "publisher": "HypeTrain Digital", "release_date": "Sep  8 2022", "developers": ["So Romantic"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 75, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/c6fb07db7733fd75e9ca1bab239a8e0f-98.jpg", "descriptions": "Jack Move is a unique blend of gritty cyberpunk story telling, turn based battles and beautiful modern pixel art. Take on the role of Noa, a vigilante hacker determined to rescue her kidnapped father and take down the overreaching Monomind corporation.They whisper her name on the streets:Jack Move is a unique blend of gritty cyberpunk story telling, turn based battles and beautiful modern pixel art. Take on the role of Noa, a vigilante hacker determined to rescue her kidnapped father and take down the overreaching Monomind corporation.They whisper her name on the streets: Solares. A mysterious veteran of the Data Wars, Noa Solares keeps the fight against the Corporations alive as a vigilante hacker-for-hire, empowering the downtrodden and undermining those with power. When she receives an emergency message from her estranged father - the eccentric Dr. Abner Solares, whose wife's death spurred him to become the leading researcher of 'digital reanimation' - Noa is thrust into a world of murder, kidnapping, dark research, and the corporation that would steal it for their own ends: Monomind.What starts as fight to save your father will become a fight for the future of mankind itself...… Expand"}, {"name": "JoJo's Bizarre Adventure: All-Star Battle R", "details_link": "https://www.metacritic.com/game/xbox-series-x/jojos-bizarre-adventure-all-star-battle-r", "publisher": "Bandai Namco Games", "release_date": "Sep  2 2022", "developers": ["CyberConnect2"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 75, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/a93a5255a58fe33bd113faba64fbf6de-98.jpg", "descriptions": "All JOJOs Unite! Fight for Your Destiny!Jonathan Joestar, Jotaro Kujo, DIO, Jolyne Cujoh, and other characters from JoJo's Bizarre Adventure gather across multiple generations! With 50 playable characters from all arcs, you can experience popular battles from each story, and see charactersAll JOJOs Unite! Fight for Your Destiny!Jonathan Joestar, Jotaro Kujo, DIO, Jolyne Cujoh, and other characters from JoJo's Bizarre Adventure gather across multiple generations! With 50 playable characters from all arcs, you can experience popular battles from each story, and see characters from different universes interact for the first time!This title is based on the All Star Battle fighting system that was released in 2012. The game design of JoJo's Bizarre Adventure: All Star Battle R reinvigorates the experience with adjustments to the fighting tempo and the addition of hit stops and jump dashes.With new audio recordings from the Part 6 anime voice actors, the full atmosphere of the animated series is realized. Both fans who have played the original All Star Battle and newcomers will be able to enjoy the experience.… Expand"}, {"name": "Cloud Gardens", "details_link": "https://www.metacritic.com/game/switch/cloud-gardens", "publisher": "Coatsink Software", "release_date": "Jun 16 2022", "developers": ["Noio"], "platforms": ["PC", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/551ee7bfb1c88655b7dc36edaa08c5dc-98.jpg", "descriptions": "Harness the power of nature to overgrow lo-fi scenes of urban decay and manufactured landscapes. Create small overgrown dioramas of brutalism and beauty by planting seeds, repurposing hundreds of discarded objects and creating unique structures for nature to reclaim. Dive into a relaxingHarness the power of nature to overgrow lo-fi scenes of urban decay and manufactured landscapes. Create small overgrown dioramas of brutalism and beauty by planting seeds, repurposing hundreds of discarded objects and creating unique structures for nature to reclaim. Dive into a relaxing sandbox mode with no goals, or take on a multi-chapter \"campaign\" where the task is to strike a balance between the natural and the manufactured. Adding objects will encourage lush vegetation to grow, but each object must be covered in foliage in order to proceed.… Expand"}, {"name": "After the Fall", "details_link": "https://www.metacritic.com/game/pc/after-the-fall", "publisher": "Vertigo Games", "release_date": "Dec  9 2021", "developers": ["Vertigo Games"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/a8f377f2a98419b2c03abfaa2edc53d7-98.jpg", "descriptions": "From the creators of Arizona Sunshine comes an epic VR action FPS with intense co-op gameplay at its core that pits up to 4 players against a post-apocalyptic VR world filled with ferocious undead, mutated and twisted by the relentless cold.Set in the ice-covered ruins of 1980s LA nearlyFrom the creators of Arizona Sunshine comes an epic VR action FPS with intense co-op gameplay at its core that pits up to 4 players against a post-apocalyptic VR world filled with ferocious undead, mutated and twisted by the relentless cold.Set in the ice-covered ruins of 1980s LA nearly 20 years after the apocalypse, After the Fall combines an evolving VR world shared with players on all platforms with action-packed co-op gameplay, built from the ground up for VR.Venture out into the remains of post-apocalyptic LA, wield deadly weapons and devastating powers with real-life movements as you develop your combat style, and join forces with players worldwide. Go head to head with hordes and towering bosses in a bid to leave the city a better place than your predecessors.… Expand"}, {"name": "Heavenly Bodies", "details_link": "https://www.metacritic.com/game/playstation-5/heavenly-bodies", "publisher": "2pt Interactive", "release_date": "Dec  7 2021", "developers": ["2pt Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "General", "Virtual", "Career"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/5e4dcc70e2d09888695d31dcbf83c036-98.jpg", "descriptions": "Discover the ever-changing nuances of weightless motion in this challenging physics game, featuring a collection of stellar scenarios inspired by the feats of space explorers and researchers throughout history. Wrangle control of your cosmonaut’s arms with the left and right thumbsticks toDiscover the ever-changing nuances of weightless motion in this challenging physics game, featuring a collection of stellar scenarios inspired by the feats of space explorers and researchers throughout history. Wrangle control of your cosmonaut’s arms with the left and right thumbsticks to push, pull, and clamber through fully physically simulated scenarios aboard a scientific research station, alone or with a friend via local co-op. With only radio contact with mission control as your aid, you will have to use your sharp mind and dexterous limbs to assemble space telescopes, maintain delicate solar arrays and research cosmic botany. But without gravity, nothing is still, nothing is secure, and nothing is simple. At first you might fumble in the vastness of space, but in time you will grasp weightless motion with grace.… Expand"}, {"name": "Crysis Remastered Trilogy", "details_link": "https://www.metacritic.com/game/switch/crysis-remastered-trilogy", "publisher": "Crytek", "release_date": "Oct 15 2021", "developers": ["Crytek"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/2246de989194c52e49243282197edb77-98.jpg", "descriptions": "The classic first person shooter from Crytek is back with the action packed gameplay, sandbox world, and thrilling epic battles you loved the first time around. Crysis Remastered Trilogy includes each of the single player campaigns from the legendary first person shooters Crysis, Crysis 2,The classic first person shooter from Crytek is back with the action packed gameplay, sandbox world, and thrilling epic battles you loved the first time around. Crysis Remastered Trilogy includes each of the single player campaigns from the legendary first person shooters Crysis, Crysis 2, and Crysis 3, optimized for today's hardware. Relive the adventure in this great value all in one bundle.Features:* Crysis Remastered: What begins as a simple rescue mission becomes the battleground of a new war as alien invaders swarm over a chain of Lingshan islands. Playing as super soldier Nomad, you are armed with a powerful Nanosuit equipped with Speed, Strength, Armor, and Cloaking abilities. Use avast arsenal of modular weaponry and adapt your tactics and gear to dominate enemies in an enormous sandbox world.* Crysis 2 Remastered: Aliens have returned to a world ravaged by climate disasters. As the invaders lay waste to New York and begin an assault that threatens the total annihilation of humankind, only you have the technology to lead the fightback. Equipped with the upgraded Nanosuit 2.0, customize your suit and weapons in real time and unlock powerful new abilities in the battle for humanity's survival.* Crysis 3 Remastered: Returning to the fight as super soldier Prophet, the search for the alien Alpha Ceph continues, but now you must also expose the truth behind the C.E.L.L. corporation, which has turned New York City into a sprawling urban rainforest sheltered by a giant nanodome. Fight through seven distinct districts and decimate your opponents in a blaze of brute force using the Nanosuit's superior technology, or use stealth to achieve your goals and become humanity's silent savior. Equipped with your powerful and deadly new Predator Bow, there's no wrong way to save the world.… Expand"}, {"name": "The Jackbox Party Pack 8", "details_link": "https://www.metacritic.com/game/pc/the-jackbox-party-pack-8", "publisher": "Jackbox Games, Inc.", "release_date": "Oct 14 2021", "developers": ["Jackbox Games", "Inc."], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/40203d41df2ca756a5a2ebc1543b1c6c-98.jpg", "descriptions": "The eighth installment of the beloved Jackbox Party Pack franchise is here! Five hilarious new games will energize your next game night, holiday party, happy hour, or video call. No extra controllers needed - players use their phones or tablets to play along! Got a bigger group? Play with upThe eighth installment of the beloved Jackbox Party Pack franchise is here! Five hilarious new games will energize your next game night, holiday party, happy hour, or video call. No extra controllers needed - players use their phones or tablets to play along! Got a bigger group? Play with up to 10 players and up to 10,000 audience members. The Jackbox Party Pack 8 is currently in English only. This game does not support online matchmaking but can still be enjoyed remotely using livestreaming services or video conferencing tools.\r About Each Game\r Drawful Animate (3 -10 players) - It’s alive! The guessing game with terrible drawings and hilariously wrong answers makes a dynamic return. In this revamped title, players create looping, two-frame animations based on weird and random titles.\r Job Job (3-10 players) - Use other people’s words to create unique and funny answers to classic job interview questions. Go head to head to see who scores the job!\r The Poll Mine (2-10 players) - A survey game that’s all about YOU! Split into teams and see who can escape from the witch’s lair! Players individually rank their choices to a difficult question, then must guess how the group answered as a whole. How well do you know your friends?!\r Weapons Drawn (4-8 players) - A social deduction game where everyone is both a murderer and a detective. Players doodle all the clues, hiding a letter from their name in the weapon drawings. Can you solve murders while trying to get away with your own?\r The Wheel of Enormous Proportions (4-8 players) - Trivia has never been so large! A fantastic, mystical wheel challenges you with a variety of trivia prompts. Winners are awarded slices of the Wheel’s face with a chance to win big with each nail-biting spin. In the end, one player will have their most burning question answered by the great Wheel.… Expand"}, {"name": "Lemnis Gate", "details_link": "https://www.metacritic.com/game/pc/lemnis-gate", "publisher": "Ratloop Games Canada", "release_date": "Sep 28 2021", "developers": ["Ratloop Games Canada"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/4cd392fd255fddc8efa5be950edd44f6-98.jpg", "descriptions": "Lemnis Gate is a time-warping, turn-based combat strategy FPS. Over five alternating turns taking place in a 25” time-loop, you are called to master the unique abilities of a varied cast of deep-space operatives and outskill, outsmart, and outmanoeuvre your opponent in mind-bendingLemnis Gate is a time-warping, turn-based combat strategy FPS. Over five alternating turns taking place in a 25” time-loop, you are called to master the unique abilities of a varied cast of deep-space operatives and outskill, outsmart, and outmanoeuvre your opponent in mind-bending four-dimensional battles. Lemnis Gate twists time to subvert one of the world’s most popular game genres and offers a relentlessly inventive multiplayer experience deeply rooted in tactical FPS gameplay. Challenge yourself to think across four dimensions as you embark on the ultimate test of cognition and combat.\r Matches in Lemnis Gate take place within time loops. You have 25 seconds to execute your action, be it blasting an enemy, manoeuvring your operative, or setting up your next move. After all players have taken turns, the next 25-second round begins. Now you’ll face what has happened while setting up what will happen. Each of the five rounds is your chance to alter the timeline as past, present, and future converge.\r STRATEGIC COMBAT IN THE FOURTH DIMENSION\rVictory doesn’t rely on shooting supremacy. You’ll have to use skill and strategy to create unstoppable game plans and get the drop on opponents. It’s all about non-linear logic, abstract thinking, and outlandish manoeuvres. Execute audacious acts and think several moves ahead to get the win.\r A TIME-BENDING TACTICAL SHOOTER\rWith a varied cast of characters to choose from, how you play is up to you. Lay damaging toxic waste in your enemy’s path, slow time to land the perfect shot, or deploy protective orbs to assist your future self. Every operative possesses a distinctive loadout and special ability that proves decisive on the battlefield.\r TEAM UP WITH YOURSELF\rWelcome to the team comprised entirely of one: you. With Lemnis Gate’s innovative auto co-op feature, you command every member of your side. Auto co-op gives you total control of five deep-space operatives, effectively enabling two competitors to duke it out in bustling ten-character matches. Become a literal one-person army.\r COUNTLESS POSSIBILITIES, ENDLESS OUTCOMES\rFrom the first second to the last, anything can happen in Lemnis Gate. Each round is a fresh chance to implement an unbeatable new strategy – or earn redemption from an earlier error. Predict hostiles’ routes, infiltrate enemy lines, and develop multi-layered gameplans by co-operating with yourself. Experiment both in and outside time, and get creative with causality.… Expand"}, {"name": "Hot Wheels Unleashed", "details_link": "https://www.metacritic.com/game/playstation-5/hot-wheels-unleashed", "publisher": "Milestone S.r.l", "release_date": "Sep 27 2021", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/76093b9c9e68004b32aa6dd00b378597-98.jpg", "descriptions": "Drive the cars of your dreams! The coolest, the fastest, the most unique badass vans and jaw-dropping muscle cars are waiting for you. Take the wheel of tons of vehicles with their own personality and style, different traits, and levels of rarity. The very best of the hot wheels universe isDrive the cars of your dreams! The coolest, the fastest, the most unique badass vans and jaw-dropping muscle cars are waiting for you. Take the wheel of tons of vehicles with their own personality and style, different traits, and levels of rarity. The very best of the hot wheels universe is here! Prove you're the best and unlock Premium cars and extraordinary items and with the livery editor make your ride a one-of-a-kind masterpiece of speed. Race like everyone's watching! Get ready for pure fun and show off your driving skills! Drift like a pro, charge your boost and blast through the loops to beat time, rivals and gravity itself! Are you up for a challenge? Boom, jackpot: race side by side a friend in the 2-player local split-screen mode or face up to 12 players online in a worldwide event. The harder the challenge, the more glorious the triumph! Unleash your creativity! Massive, themed playgrounds are ready to host the most immersive races. Have fun on and off the track with these beautifully detailed and interactive environments, where any object can play a role and be an actual part of your circuit! You can even build a racetrack inside your very own room, a space to customize with furniture and the items you will collect during your journey. And thanks to the incredibly powerful editor, building the craziest tracks has never been easier! Bend and stretch the iconic Orange track piece to create your unique design and then add special Boosters, loops, obstacles, and exclusive interactive elements to build your own racing paradise. Share your creations with the world Or enjoy tracks made by other crazy players like you. Now it's time to unleash the fun! … Expand"}, {"name": "Road 96", "details_link": "https://www.metacritic.com/game/switch/road-96", "publisher": "Digixart Entertainment", "release_date": "Aug 16 2021", "developers": ["Digixart Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/2dbc48f746c94e4bb875ba57dda64aaf-98.jpg", "descriptions": "Hitchhike your way to freedom in this crazy procedurally generated road trip made by renowned indie creators. No one's road is the same!\r Summer 1996, Today is the day!\r\n\r\nYou hit the road. Adventure. Freedom. Escape. Run. Flee the Regime. Try to survive.\r\n\r\nOn this risky road trip to theHitchhike your way to freedom in this crazy procedurally generated road trip made by renowned indie creators. No one's road is the same!\r Summer 1996, Today is the day!\r You hit the road. Adventure. Freedom. Escape. Run. Flee the Regime. Try to survive.\r On this risky road trip to the border, you’ll meet incredible characters, and discover their intertwined stories and secrets in an ever-evolving adventure.\r But every mile opens up a choice to make. Your decisions will change your adventure, change the people you meet, maybe even change the world.\r There are thousands of roads across the authoritarian nation of Petria.\r Which one will you take?… Expand"}, {"name": "The Falconeer: Warrior Edition", "details_link": "https://www.metacritic.com/game/playstation-5/the-falconeer-warrior-edition", "publisher": "Wired Productions", "release_date": "Aug  5 2021", "developers": ["Tomas Sala"], "platforms": ["PlayStation 4", "Stadia", "Switch", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Combat"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/66b91dcba297dc7dc74b8a9fc0855c94-98.jpg", "descriptions": "Soar through the skies aboard a giant warbird in this BAFTA nominated air combat game. Soar through the skies aboard a majestic warbird, explore a stunning oceanic world and engage in epic aerial dogfights, in this BAFTA nominated air combat game from solo developer, Tomas Sala.  You take onSoar through the skies aboard a giant warbird in this BAFTA nominated air combat game. Soar through the skies aboard a majestic warbird, explore a stunning oceanic world and engage in epic aerial dogfights, in this BAFTA nominated air combat game from solo developer, Tomas Sala.  You take on the role of Falconeer, a powerful airborne warrior traversing a vast oceanic world torn apart by generations of poisonous decisions and dissent. Throughout multiple campaigns, you will experience life from many different perspectives and loyalties as you embark on a journey of discovery, and solve the mystery of the Ursee, its people and history.  Progress through perilous missions and side quests, wielding your lightning caster to protect ships against pirates, kraken and other threats. Dive through the deep ocean depths, soar above the clouds to do battle with giant crab cities or engage in furious dogfights against the mysterious Mancer Order that controls and regulates technology. The Falconeer: Warrior Edition includes the fully updated game, plus 'The Hunter' DLC, adding a new player class with a flyable Ormir dragon and a set of pyro pot guided rockets, and the new 'Edge of the World' DLC, containing 3 additional side quests and new boss encounters.… Expand"}, {"name": "Evil Genius 2: World Domination", "details_link": "https://www.metacritic.com/game/pc/evil-genius-2-world-domination", "publisher": "Rebellion", "release_date": "Mar 30 2021", "developers": ["Rebellion"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 75, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/9/5b80ee2b2538b7541424015c4f6acb01-98.jpg", "descriptions": "A satirical spy-fi lair builder where YOU are the criminal mastermind! Construct your base, train your minions, defend your operations from the Forces of Justice, and achieve global domination."}, {"name": "Yupitergrad", "details_link": "https://www.metacritic.com/game/playstation-4/yupitergrad", "publisher": "Gamedust", "release_date": "Feb 25 2021", "developers": ["Gamedust"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Shooter", "First-Person", "3D", "Arcade"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/eedff8e0496c637cc617ec011d7d140a-98.jpg", "descriptions": "Brave dream of VR gaming. Grappling hooks, wacky humor, spatial stunts, motion sickness countermeasures, Dieselpunk adventure, space acrobatics, and out-of-the-box puzzles. Yupitergrad has it ALL."}, {"name": "Blizzard Arcade Collection", "details_link": "https://www.metacritic.com/game/switch/blizzard-arcade-collection", "publisher": "Activision", "release_date": "Feb 19 2021", "developers": ["Blizzard Entertainment", "Digital Eclipse"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 75, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/4/3fbac78e4c7f6e11e7bbe7634f33d418-98.jpg", "descriptions": "Relive the Legacy: Experience a blast from Blizzard's past! The Blizzard® Arcade Collection brings three of our classic console games to modern platforms and new audiences. INCLUDED GAMES:\r • Blackthorne®: As mercenary captain Kyle Blackthorne, traverse an alien planet, liberate theRelive the Legacy: Experience a blast from Blizzard's past! The Blizzard® Arcade Collection brings three of our classic console games to modern platforms and new audiences. INCLUDED GAMES:\r • Blackthorne®: As mercenary captain Kyle Blackthorne, traverse an alien planet, liberate the Androthi people, and claim your destiny.\r • The Lost Vikings®: Help three Vikings—Erik, Baleog, and Olaf—overcome challenging platforms and puzzles to find their way back home.\r • Rock N Roll Racing®: Rock out in the raddest vehicular destruction derby this side of 1993. RNRR is back with original rock and metal soundtrack hits plus a few new surprises.\r LEVEL UP THE LEGACY:\r The Blizzard Arcade Collection contains two different Original Editions of each game plus a new Definitive Edition!\r • The Original Editions are the games as you remember them but with new quality of life improvements included—like the ability to set custom keybindings, rewind your gameplay up to 10 seconds, save and load your game as well as watch playthroughs of Blackthorne and The Lost Vikings (and then jump in to play at any point). Improvements may vary by game and game edition.… Expand"}, {"name": "The Sinking City", "details_link": "https://www.metacritic.com/game/playstation-5/the-sinking-city", "publisher": "Frogwares", "release_date": "Feb 19 2021", "developers": ["Frogwares"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/9154891f91b6640d79c3477166cc91ae-98.jpg", "descriptions": "The Sinking City is an action/investigation game set in an open world inspired by the universe of H.P. Lovecraft. In this new type of adventure, you take on the role of Charles W. Reed, an investigator in the 1920s United States. No sooner have you arrived in Oakmont, Massachusetts, than youThe Sinking City is an action/investigation game set in an open world inspired by the universe of H.P. Lovecraft. In this new type of adventure, you take on the role of Charles W. Reed, an investigator in the 1920s United States. No sooner have you arrived in Oakmont, Massachusetts, than you are led to investigate a mysterious flood inundating the city, in the hopes of shedding light on the darkness that has seized the place and corrupted the minds of the inhabitants - and yours...* An oppressive atmosphere and story inspired by the universe of H.P. Lovecraft.* A vast open world that can be explored on foot, by boat, in a diving suit* High replay value thanks to an open investigation system: each case can be solved in a number of ways, with different possible endings depending on your actions.* An arsenal of weapons from the 1920s with which to take on nightmarish creatures.* Manage your mental health to untangle the truth behind the madness.… Expand"}, {"name": "Shiren The Wanderer: The Tower of Fortune and the Dice of Fate", "details_link": "https://www.metacritic.com/game/switch/shiren-the-wanderer-the-tower-of-fortune-and-the-dice-of-fate", "publisher": "Spike Chunsoft", "release_date": "Dec  2 2020", "developers": ["Spike Chunsoft"], "platforms": ["PC", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Roguelike"], "meta_score": 75, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/0feea526a472941f757d7c3ec991e88e-98.jpg", "descriptions": "Climb the Tower of Fortune and Challenge Reeva, the God of Destiny!\r After stopping the revival of a demon god at the Magic Castle of the Desert, Shiren and Koppa set off in search of new adventures. Soon thereafter, our heroes wandered into small village. This village, Inori, has a legendClimb the Tower of Fortune and Challenge Reeva, the God of Destiny!\r After stopping the revival of a demon god at the Magic Castle of the Desert, Shiren and Koppa set off in search of new adventures. Soon thereafter, our heroes wandered into small village. This village, Inori, has a legend that claims, If you climb the Tower of Fortune that soars above the enchanted land and face Reeva, the god of Destiny, you can change your fate. Shiren and Koppa, having confirmed many mysterious legends throughout their journeys, decide to embrace this new challenge.\r Is there really an entity determining peoples fates? And is it possible for a person to change their fate? What adventures await Shiren and his friends in the tower?… Expand"}, {"name": "QV", "details_link": "https://www.metacritic.com/game/switch/qv", "publisher": "CFK", "release_date": "Nov 26 2020", "developers": ["Izzle"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "3D"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/100c1693e6efc4ba3f251ef64bffdb86-98.jpg", "descriptions": "Start a dimension-jumping adventure with Quby!\r In a universe, dimensions are connected to each other.\r\n\r\nIn the center of the passages lies Dimensional Core, keeping the balance between dimensions.\r\n\r\nThis balance began to collapse when the Core stopped working.\r\n\r\nUnless someoneStart a dimension-jumping adventure with Quby!\r In a universe, dimensions are connected to each other.\r In the center of the passages lies Dimensional Core, keeping the balance between dimensions.\r This balance began to collapse when the Core stopped working.\r Unless someone gives a helping hand, soon the universe will follow.\r The Gate doesn't let anyone into the Dimensional Core.\r But Quby, as the last descendant of Chosen Ones, can access the Gate.\r To restore the balance between dimensions, Quby opens a portal to the Gate.\r With Varon, the talking penguin, she must explore the long-forgotten ruins of her ancestors and find a way to reactivate the Core.\r Let the journey begin!\r… Expand"}, {"name": "Cake Bash", "details_link": "https://www.metacritic.com/game/switch/cake-bash", "publisher": "Coatsink Software", "release_date": "Nov 19 2020", "developers": ["Coatsink Software"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/c2aa989a116e005a68a8490e141fd824-98.jpg", "descriptions": "Fight to be the tastiest cake! A party game for up to four players, complete with very unique hazards - bash your friends, dash away from danger and have a delicious time!"}, {"name": "ScourgeBringer", "details_link": "https://www.metacritic.com/game/xbox-one/scourgebringer", "publisher": "Flying Oak Games", "release_date": "Oct 21 2020", "developers": ["Flying Oak Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "PlayStation Vita", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 75, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/eaa1e4951ff14e5081dc9e333c617beb-98.jpg", "descriptions": "ScourgeBringer is a fast-paced free-moving roguelite platformer. Help Kyhra to explore the unknown and slash her way through ancient machines guarding the seal of her past, and maybe the redemption of humanity."}, {"name": "Drake Hollow", "details_link": "https://www.metacritic.com/game/xbox-one/drake-hollow", "publisher": "The Molasses Flood", "release_date": "Aug 28 2020", "developers": ["The Molasses Flood"], "platforms": ["PC", "Xbox One"], "num_players": "", "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/c91f535d8d82805c13d53ed81bf918d6-98.jpg", "descriptions": "What are drakes? Drakes are the friendly native creatures who need your help for survival. Alongside basic needs such as hunger, thirst, and shelter, drakes want to have fun and be protected from the creatures that threaten their blighted home. Build up and secure your base, createWhat are drakes? Drakes are the friendly native creatures who need your help for survival. Alongside basic needs such as hunger, thirst, and shelter, drakes want to have fun and be protected from the creatures that threaten their blighted home. Build up and secure your base, create resources, bond with the drakes, and help keep these vegetable folk entertained. There’s always something to do or someone to defend in Drake Hollow. … Expand"}, {"name": "Death Come True", "details_link": "https://www.metacritic.com/game/switch/death-come-true", "publisher": "Izanagi Games", "release_date": "Jun 24 2020", "developers": ["Izanagi Games", "Too Kyo Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 75, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/7/91caffaf32ff2509e2f381250608885a-98.jpg", "descriptions": "A new wave interactive movie game where your actions, and the ending of the story, are determined by your choices.\r A completely new science fiction mystery, in full-length live-action movie format, from genius creator of the \"Danganronpa\" series, Kazutaka Kodaka.\r\n\r\nPlayer controls areA new wave interactive movie game where your actions, and the ending of the story, are determined by your choices.\r A completely new science fiction mystery, in full-length live-action movie format, from genius creator of the \"Danganronpa\" series, Kazutaka Kodaka.\r Player controls are simple and straightforward: just swipe to look around and tap to make a selection. Even if you are a beginner, you can enjoy the game as if you were watching a movie.\r The protagonist acts as you make choices in each scene, moving the story forward.\rWhat ending awaits you after you've made your choices?… Expand"}, {"name": "Evan's Remains", "details_link": "https://www.metacritic.com/game/pc/evans-remains", "publisher": "Whitethorn Digital", "release_date": "Jun 11 2020", "developers": ["Matias Schmied"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "2D"], "meta_score": 75, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/7d62f61022a690077649e195dc2eddfc-98.jpg", "descriptions": "Evan's Remains is a mystery-thriller puzzle adventure about finding a missing boy: Evan. The game combines logic-based platform puzzles with narrative inspired by Japanese graphic adventure games."}, {"name": "Arcade Spirits", "details_link": "https://www.metacritic.com/game/switch/arcade-spirits", "publisher": "PQube", "release_date": "May  1 2020", "developers": ["Fiction Factory Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/5c44ffb3840511e9adc64b837969422f-98.jpg", "descriptions": "What if the 1983 video game market crash never happened? Set in 20XX, Arcade Spirits is a visual novel romantic comedy with an alternative history, where arcades still reign supreme as the ultimate place to play. After a period of turbulent employment, your character starts an exciting newWhat if the 1983 video game market crash never happened? Set in 20XX, Arcade Spirits is a visual novel romantic comedy with an alternative history, where arcades still reign supreme as the ultimate place to play. After a period of turbulent employment, your character starts an exciting new job at the Funplex: a popular local arcade with a team of staff that are as eccentric as the customers. But where will this new-found employment opportunity take you? Who will you meet along the way? And will you finally find the romance you’ve been seeking? … Expand"}, {"name": "Yes, Your Grace", "details_link": "https://www.metacritic.com/game/pc/yes-your-grace", "publisher": "No More Robots", "release_date": "Mar  6 2020", "developers": ["Brave at Night"], "platforms": ["Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/6fb564240f2897500d85e48535f604ef-98.jpg", "descriptions": "These are troubling times, Your Grace. The petitioners’ petty matters exceed our limited resources, to say nothing of the war. A careful balance must be struck. Your throne awaits."}, {"name": "Candleman", "details_link": "https://www.metacritic.com/game/switch/candleman", "publisher": "Spotlightor Interactive", "release_date": "Oct  3 2019", "developers": ["Spotlightor Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 75, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/39239e38ce24bf5968f46970d416d9b1-98.jpg", "descriptions": "Candleman is an action adventure story entwined with low-light gameplay. Acting as a little candle who can burn for only 10 seconds, players will venture through unsettling darkness. Struggle to overcome obstacles based on the mechanics of light and shadow. Explore a wide range of enchantedCandleman is an action adventure story entwined with low-light gameplay. Acting as a little candle who can burn for only 10 seconds, players will venture through unsettling darkness. Struggle to overcome obstacles based on the mechanics of light and shadow. Explore a wide range of enchanted environments while seeking distant light. Unveil the hidden treasure that concerns us all.… Expand"}, {"name": "Headliner: NoviNews", "details_link": "https://www.metacritic.com/game/switch/headliner-novinews", "publisher": "Unbound Creations", "release_date": "Sep  5 2019", "developers": ["Unbound Creations"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/c84fce20642ed4f41ae2df079766f243-98.jpg", "descriptions": "An adventure where you control the news and its impact on society, your friends and career. Different choices lead to unique combinations of endings. Share your story with the community, and see what the players before you did."}, {"name": "We. The Revolution", "details_link": "https://www.metacritic.com/game/switch/we-the-revolution", "publisher": "Klabater", "release_date": "Jun 25 2019", "developers": ["Polyslash"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/90551e74813aba6c0a41960894e7ed9d-98.jpg", "descriptions": "We. The Revolution is a unique game with a singular art style set in the blood-soaked and paranoid world of the French Revolution, where often you could not tell a friend from an enemy. As a judge of the Revolutionary Tribunal, you will pass sentences and play a dangerous political game. AtWe. The Revolution is a unique game with a singular art style set in the blood-soaked and paranoid world of the French Revolution, where often you could not tell a friend from an enemy. As a judge of the Revolutionary Tribunal, you will pass sentences and play a dangerous political game. At the end of a day you will also confront your decisions with your family. The power over human life and death is a heavy burden that can affect the fate of the revolution. Keep that in mind each time when passing sentence in the courtroom, while assigning tasks to your agents, and weaving political intrigue. We. The Revolution is addressed chiefly to players who enjoy moral dilemmas, complex personal choices, and want to immerse themselves in the world of sophisticated intrigue.… Expand"}, {"name": "MotoGP 19", "details_link": "https://www.metacritic.com/game/xbox-one/motogp-19", "publisher": "Milestone S.r.l", "release_date": "Jun  6 2019", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/a4cc3f2f2f452d433d10b4526446c154-98.jpg", "descriptions": "Remember when you were the king of the race? Old times: thanks to the Neural AI and to the Machine Learning, you’ll now face smarter, faster opponents who will exploit your mistakes. The challenge is about to get real."}, {"name": "X-Morph: Defense", "details_link": "https://www.metacritic.com/game/switch/x-morph-defense", "publisher": "EXOR Studios", "release_date": "Feb 21 2019", "developers": ["EXOR Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/82275bd6e4dd88373f30ca85079fc0f4-98.jpg", "descriptions": "Unique fusion of a top down shooter and tower defense strategy. You are the X-Morph - an alien species that invades Earth to harvest its resources and terraform the surface. Strategize in the build mode by carefully selecting various types of alien towers or throw yourself right into heat ofUnique fusion of a top down shooter and tower defense strategy. You are the X-Morph - an alien species that invades Earth to harvest its resources and terraform the surface. Strategize in the build mode by carefully selecting various types of alien towers or throw yourself right into heat of the battle. Build mazes for incoming enemies in an environment that provides exceptional planning freedom. Tear down buildings and collapse bridges to support your defense or to simply indulge in a spectacle of unprecedented destruction. Possess a range of unique alien weapons and use defense strategies like you've never seen before in this genre.… Expand"}, {"name": "City of Brass", "details_link": "https://www.metacritic.com/game/switch/city-of-brass", "publisher": "Uppercut Games", "release_date": "Feb  8 2019", "developers": ["Uppercut Games Pty Ltd"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/da6bb870a4a19ec242a92d55daf8b936-98.jpg", "descriptions": "Become a daring thief in City of Brass, a first-person action adventure from senior BioShock developers. Armed with scimitar and a versatile whip, you’ll lash and slash, bait and trap your way to the heart of an opulent, Arabian Nights-themed metropolis – or face certain death as time runs out."}, {"name": "The Council - Episode 4: Burning Bridges", "details_link": "https://www.metacritic.com/game/playstation-4/the-council---episode-4-burning-bridges", "publisher": "Focus Home Interactive", "release_date": "Sep 25 2018", "developers": ["Big Bad Wolf"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 75, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/37b38a0e64c4ef2ebbb6ed1fb8f8ae32-98.jpg", "descriptions": "Experience a fresh take on the Narrative Adventure where your choices and character growth truly matter. Louis de Richet enters the depths of Lord Mortimer’s island hunting truths about his mother and the other guests. The mausoleum he finds there contains more secrets than he could possiblyExperience a fresh take on the Narrative Adventure where your choices and character growth truly matter. Louis de Richet enters the depths of Lord Mortimer’s island hunting truths about his mother and the other guests. The mausoleum he finds there contains more secrets than he could possibly have predicted…… Expand"}, {"name": "Labyrinth of Refrain: Coven of Dusk", "details_link": "https://www.metacritic.com/game/switch/labyrinth-of-refrain-coven-of-dusk", "publisher": "NIS America", "release_date": "Sep 18 2018", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Adventure", "General", "Japanese-Style"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/8de8e9816f2a96ea48c8dbac54a747ae-98.jpg", "descriptions": "Become the living book, Tractatus de Monstrum, and command a brigade of puppet soldiers as you navigate the twisting passageways of the labyrinth of Refrain.When at your base, prepare for your journey by upgrading your brigade! Create new puppet soldiers, assign them different squads andBecome the living book, Tractatus de Monstrum, and command a brigade of puppet soldiers as you navigate the twisting passageways of the labyrinth of Refrain.When at your base, prepare for your journey by upgrading your brigade! Create new puppet soldiers, assign them different squads and formations, synthesize better equipment, take requests from townsfolk, and get assistance from Dronya in the form of Witch Petitions.Once you've entered the labyrinth, be sure to search every nook and cranny as you jump over barricades, solve puzzles, and smash your way through walls to delve further and further downward in search of treasure and rare artefacts. But be careful, the more riches you obtain, the more vicious the dungeon becomes. Can you survive long enough to bring your haul back?Fight past terrifying monsters by giving orders to your puppet brigade. Change their formation, use special skills, or call for an all out attack! The battles you face will be challenging, so your success depends on your preparation and your strategy.… Expand"}]