[{"name": "The Sims 2: Pets", "details_link": "https://www.metacritic.com/game/gamecube/the-sims-2-pets", "publisher": "EA Games", "release_date": "Oct 17 2006", "developers": ["Maxis"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/6fd4905e4c7faf55db65684be34fa710-98.jpg", "descriptions": "Sims Have New Friends - Pets! Sims can share their lives with their new pets and add more fun to the Sims experience. From dogs, cats, caged animals and more, your Sims share new friends to experience life's precious moments. With so many different animals to choose from, there's no tellingSims Have New Friends - Pets! Sims can share their lives with their new pets and add more fun to the Sims experience. From dogs, cats, caged animals and more, your Sims share new friends to experience life's precious moments. With so many different animals to choose from, there's no telling what unpredictable experiences could occur. Create-A-Pet: Choose from dozens of dog and cat breeds or customize features for a one-of-a-kind pet. You can even modify your pet's body shape by choosing from specific colors and unique markings. Don't like the way they act? Change their personality - from smart and sweet to silly and sloppy - anyone can create their ideal animal friend in The Sims 2 Pets. Your Sims can encourage and discipline pets, training them to shake, roll over, play dead, and more. Unruly pets might dig in the yard, claw the sofa, or topple the trash. Thankfully, a little training can go a long way. Create and control digital characters over a lifetime, setting their goals in life from popularity and romance, to fortune and family- their stories are in your hands. Use special codes to share unlockable pet accessories, fur types or markings with other The Sims 2 Pets players. Take your Sims and their pet for a romp at any of the nearby park areas, or head to the Central Town Park which is a favorite of pet owners. While there, watch your pet play well with others while your Sim can meet others and socialize with fellow animal lovers. Visit the adjoining Town Center, a great gathering spot for Sims that evolves over time. Once you've seen the latest styles and decided on a purchase, deck your pet out in the latest clothing and accessories around. From geek to chic and cool to casual, your Sim can customize their pet's look with one stop in the Town Center.… Expand"}, {"name": "The DioField Chronicle", "details_link": "https://www.metacritic.com/game/pc/the-diofield-chronicle", "publisher": "Square Enix", "release_date": "Sep 22 2022", "developers": ["Square Enix", "Lancarse"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Real-Time", "General", "Tactics"], "meta_score": 66, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/1/b9828803081bca95d969fe7fc020206e-98.jpg", "descriptions": "The world of men is mired by an age of war which rages for year on end. A band of elite mercenaries calling themselves Blue Fox arise amidst the flames and the chaos, their fates and valiant deeds to be sung of in ages yet to come.But when all is said and done, will the name \"Blue Fox\"The world of men is mired by an age of war which rages for year on end. A band of elite mercenaries calling themselves Blue Fox arise amidst the flames and the chaos, their fates and valiant deeds to be sung of in ages yet to come.But when all is said and done, will the name \"Blue Fox\" come to signify hope or darkest tragedy?An all-new Strategy RPG that chronicles an epic tale of war and honour. Featuring a unique and beautiful world that blends fantasy, medieval and modern-day influences, and a deep yet innovative real-time battle system.… Expand"}, {"name": "The Smurfs: Mission Vileaf", "details_link": "https://www.metacritic.com/game/switch/the-smurfs-mission-vileaf", "publisher": "Microids", "release_date": "Nov 16 2021", "developers": ["OSome Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "3D"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/6068a13ef9fee4f4cf5344400e03b645-98.jpg", "descriptions": "Go on an adventure to save your forest!Gargamel, the evil sorcerer just created the EVILEAF, a plant that has the ability to attract and capture the Smurfs... but it's also TOXIC!Embody 4 iconic Smurfs and heal the plants on your way to Gargamel's hovel: the whole forest depends on you!"}, {"name": "ToeJam & Earl: Back in the Groove", "details_link": "https://www.metacritic.com/game/playstation-4/toejam-earl-back-in-the-groove", "publisher": "Adult Swim", "release_date": "Feb 15 2019", "developers": ["Humanature Studios", "22nd Century Toys"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 66, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/2c4e0eaaa0ae05b8fc7fd23992527be1-98.jpg", "descriptions": "The iconic ‘90s duo is back in the groove with all-new presents to help them navigate this wack planet ”Earth” and retrieve all the lost pieces to the Rapmaster Rocket. Team up for co-op play to discover secret locations, hidden presents and new friends."}, {"name": "AO International Tennis", "details_link": "https://www.metacritic.com/game/xbox-one/ao-international-tennis", "publisher": "Big Ant Studios", "release_date": "May  9 2018", "developers": ["Big Ant Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Tennis"], "meta_score": 66, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/6f547322953e590192e7eb8918010953-98.jpg", "descriptions": "Supported by a community, download and play with thousands of players created by other AO International Tennis fans, including photo-realistic players created through Big Ant Studios’ proprietary PlayFace application."}, {"name": "Mr. Shifty", "details_link": "https://www.metacritic.com/game/switch/mr-shifty", "publisher": "tinyBuild", "release_date": "Apr 13 2017", "developers": ["Team Shifty"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Linear", "Shoot-'Em-Up", "Top-Down"], "meta_score": 66, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/77c13e8f1bb3d68e6cf8f95a7f4351ef-98.jpg", "descriptions": "Shift through bullets, and master lightning-fast takedowns in an all new kind of action game from tinyBuild and Team Shifty. Mr. Shifty follows a teleportation-fueled heist to break into the world's most secure facility."}, {"name": "Sherlock Holmes: The Devil's Daughter", "details_link": "https://www.metacritic.com/game/xbox-one/sherlock-holmes-the-devils-daughter", "publisher": "Bigben Interactive", "release_date": "Jun 10 2016", "developers": ["Frogwares"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Adventure", "General", "3D", "Third-Person"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/a90c436167d4aea1812d6e136ecbcbd1-98.jpg", "descriptions": "Sherlock Holmes: The Devil’s Daughter, the eighth game in the series, is an incredible adventure game with unique gameplay blending investigation, action and exploration for an extraordinary experience that will test the limits of players' nerves and intelligence. Playing as the greatSherlock Holmes: The Devil’s Daughter, the eighth game in the series, is an incredible adventure game with unique gameplay blending investigation, action and exploration for an extraordinary experience that will test the limits of players' nerves and intelligence. Playing as the great detective, they will have to track down evil in the darkest corners of London and the human spirit, freely exploring several neighbourhoods in the city in search of clues and suspects while they untangle a web of intrigue leading to the final stunning revelation.… Expand"}, {"name": "One Piece: Unlimited World Red", "details_link": "https://www.metacritic.com/game/wii-u/one-piece-unlimited-world-red", "publisher": "Bandai Namco Games", "release_date": "Jul  8 2014", "developers": ["Ganbarion"], "platforms": ["3DS", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/c32eb06cbc59a2a7dd3de71f2df6d85c-98.jpg", "descriptions": "Set sail on a gripping adventure in the New World with the beloved Straw Hat Crew in ONE PIECE Unlimited World Red. Dive into a wayfaring journey with fun-filled escapades, action-packed battles and powerful comrades in a whole new never-before- seen scenario. Play as members of the StrawSet sail on a gripping adventure in the New World with the beloved Straw Hat Crew in ONE PIECE Unlimited World Red. Dive into a wayfaring journey with fun-filled escapades, action-packed battles and powerful comrades in a whole new never-before- seen scenario. Play as members of the Straw Hat crew and progress through the episodic storyline with encounters against famous bosses like Rob Lucci, Caesar Clown, and more. Master a large variation of flashy combos and test your reflexes by pressing the right button at the right time to counter, dodge or otherwise interact with enemies. Enjoy endless playability by exploring the central town and taking on quests to assist the townfolk and gain more rewards and items.… Expand"}, {"name": "Flockers", "details_link": "https://www.metacritic.com/game/pc/flockers", "publisher": "Team17", "release_date": "May  6 2014", "developers": ["Team17"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action"], "meta_score": 66, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/5/4ebb7fd6e4b01bd18f7201f101608bd3-98.jpg", "descriptions": "Flockers is a modern day take on the classic A to B puzzle genre with a generous helping of dark humour for good measure."}, {"name": "Sniper Elite V2", "details_link": "https://www.metacritic.com/game/pc/sniper-elite-v2", "publisher": "Rebellion", "release_date": "Apr 30 2012", "developers": ["Rebellion"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Historic", "Historic"], "meta_score": 66, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/160dae7762cb8fc946c92bf8887391c9-98.jpg", "descriptions": "Sniper Elite V2 will be a modern take on the critically and publically acclaimed classic Sniper Elite for the current generation of consoles – revitalising a genre all of its own when it is released in 2012."}, {"name": "Memento Mori", "details_link": "https://www.metacritic.com/game/pc/memento-mori", "publisher": "Got Game Entertainment", "release_date": "Jul 29 2009", "developers": ["Cinemax", "Centauri Production"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Modern", "Modern"], "meta_score": 66, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/b08481d98c80ac2caa93ee273ea1508e-98.jpg", "descriptions": "In the time-honoured Hermitage of St. Petersburg three precious paintings have been substituted by valueless copies. At first it appears to be just a normal art robbery, but Colonel Ostankovic, head of the art robbery department in St. Petersburg, thinks otherwise - he suspects a mysteriousIn the time-honoured Hermitage of St. Petersburg three precious paintings have been substituted by valueless copies. At first it appears to be just a normal art robbery, but Colonel Ostankovic, head of the art robbery department in St. Petersburg, thinks otherwise - he suspects a mysterious secret society behind it. The game Memento Mori refers to the relatively unknown fraternity of the same name. Their prime objective is keeping certain paintings in secret; therefore they stash artworks away for hundreds of years. Colonel Ostankovic knows this and raises an alarm. He assigns the case to Larisa Ivanovna Svetlova, one of his best colleagues. Larisa contacts Maxim Durand as a 'helping hand'. He is a former counterfeiter with numerous, valuable connections in the art scene. In the new adventure game, Memento Mori, two playable protagonists await the player. The player's goal is to solve the secrets of the art robbery, the mysterious secret society and its intrigues.… Expand"}, {"name": "3D Ultra MiniGolf Adventures", "details_link": "https://www.metacritic.com/game/xbox-360/3d-ultra-minigolf-adventures", "publisher": "Sierra Online", "release_date": "Apr 18 2007", "developers": ["Wanako Studios"], "platforms": ["PC", "Xbox 360"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Individual", "Golf", "Arcade", "Arcade"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/f6e28e4532f52cea6b83a4c31db0e76b-98.jpg", "descriptions": "[Xbox Live Arcade]  Ready to tee off for a quick fun match in 3D Ultra Minigolf Adventure? Style and play all four animated characters as you putt your way through 36 holes of manic minigolf on three-dimensional courses with crazy obstacles. Choose from an array of different[Xbox Live Arcade]  Ready to tee off for a quick fun match in 3D Ultra Minigolf Adventure? Style and play all four animated characters as you putt your way through 36 holes of manic minigolf on three-dimensional courses with crazy obstacles. Choose from an array of different environments—Classic Carnival, The Old West, or Outer Space. Enjoy sweeping, panoramic views of the holes and mind-bending course designs. Four-player multiplayer mode: Choose from four highly detailed playable characters, each with their own personality and distinctive animations. Creative game additions: Collect over-the-top power-ups and avoid imaginative traps to keep the game exciting and unpredictable. Customizable course editor: Build your own course designs by mixing and matching combinations of tees, straights, corners, cups, junctions, and ramps. [Microsoft]… Expand"}, {"name": "Monster Kingdom: Jewel Summoner", "details_link": "https://www.metacritic.com/game/psp/monster-kingdom-jewel-summoner", "publisher": "Atlus", "release_date": "Feb 19 2007", "developers": ["Gaia (Sony)"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Role-Playing", "General", "General"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/bfb39e8167bbb91c1a89ef7c1cc53f16-98.jpg", "descriptions": "There was a time when mankind and monsters coexisted in peace, but The Great Disaster put an end to that era. The world changed radically, with all the planet’s monsters disappearing in an instant, leaving behind only jewels that radiated tremendous energy. This energy source became known asThere was a time when mankind and monsters coexisted in peace, but The Great Disaster put an end to that era. The world changed radically, with all the planet’s monsters disappearing in an instant, leaving behind only jewels that radiated tremendous energy. This energy source became known as jewel power and enabled the survivors to revive their civilization. Now, the peace achieved through jewel power has been endangered by a new threat. Strange Abominations have mysteriously appeared and unleashed legions of monsters on the helpless populace. To combat them, an organization known as the Order was established to study jewels and harness their power. Their research led to the formation of an elite class of warriors called Jewel Summoners, those with the power to summon monsters from jewels and control them in combat. With the aid of the Order, it is up to these powerful Jewel Summoners to restore peace once again. Use the power of amalgamy to evolve your monsters and create a creature with unrivaled power. Collect, trade, and battle monsters with your friends for ultimate bragging rights. [Atlus Software]… Expand"}, {"name": "Dynasty Warriors 5", "details_link": "https://www.metacritic.com/game/xbox/dynasty-warriors-5", "publisher": "Koei", "release_date": "Sep 13 2005", "developers": ["Omega Force"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 66, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/89e2c685b5c45e25f7faac49b8eb9d6e-98.jpg", "descriptions": "In Dynasty Warriors 5, you can become a hero in feudal Japan. Combat enemy armies using weapons, mounts, and special attacks. Dynasty Warriors 5 adds new playable characters, weapons, combos, maps, and game modes. Now, maps are larger, and the enemies are smarter. Dynasty Warriors 5 alsoIn Dynasty Warriors 5, you can become a hero in feudal Japan. Combat enemy armies using weapons, mounts, and special attacks. Dynasty Warriors 5 adds new playable characters, weapons, combos, maps, and game modes. Now, maps are larger, and the enemies are smarter. Dynasty Warriors 5 also adds animal teammates and a revamped weapon system to your arsenal to help you conquer 38 newly-designed maps.… Expand"}, {"name": "Tony Hawk's Pro Skater HD", "details_link": "https://www.metacritic.com/game/xbox-360/tony-hawks-pro-skater-hd", "publisher": "Activision", "release_date": "Jul 18 2012", "developers": ["Robomodo"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Sports", "Alternative", "Individual", "Skating", "Skating", "Skate / Skateboard"], "meta_score": 66, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/4a0f3576d4faabde9020020803845524-98.jpg", "descriptions": "Tony Hawk's Pro Skater HD returns to controllers and focuses on the satisfaction of linking sick tricks for maximum points."}, {"name": "Tomb Raider Underworld: Lara's Shadow", "details_link": "https://www.metacritic.com/game/xbox-360/tomb-raider-underworld-laras-shadow", "publisher": "Eidos Interactive", "release_date": "Mar 10 2009", "developers": ["Crystal Dynamics"], "platforms": "Xbox 360", "genres": ["Action Adventure", "Adventure", "General", "General", "Modern"], "meta_score": 66, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "[Downloadable Content] Exclusive to Xbox Live, Tomb Raider: Underworld - Lara's Shadow allows gamers to experience Lara's universe from an entirely new perspective; that of the Doppelganger. With faster movement, shadow powers and a melee attack that decimates enemies with devastating[Downloadable Content] Exclusive to Xbox Live, Tomb Raider: Underworld - Lara's Shadow allows gamers to experience Lara's universe from an entirely new perspective; that of the Doppelganger. With faster movement, shadow powers and a melee attack that decimates enemies with devastating accuracy and speed, the Doppelganger opens up all new gameplay mechanics, areas and puzzles which wouldn't be possible while playing as Lara Croft. [Eidos Interactive]… Expand"}, {"name": "Super Monkey Ball: Banana Splitz", "details_link": "https://www.metacritic.com/game/playstation-vita/super-monkey-ball-banana-splitz", "publisher": "Sega", "release_date": "Oct 23 2012", "developers": ["Marvelous AQL"], "platforms": "PlayStation Vita", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/98b91793b71baf018c6787bfccef7cc4-98.jpg", "descriptions": "The puzzling primates return with all-new worlds, original mini-games and updated graphics adding a fresh new vibrancy to Super Monkey Ball for PlayStation Vita. Players can manage each monkey's momentum to navigate narrow ledges, moving platforms and loads of challenging obstacles. RollThe puzzling primates return with all-new worlds, original mini-games and updated graphics adding a fresh new vibrancy to Super Monkey Ball for PlayStation Vita. Players can manage each monkey's momentum to navigate narrow ledges, moving platforms and loads of challenging obstacles. Roll your chosen ape to the goal by taking full advantage of the capabilities offered by the innovative new PSVITA handheld console and challenge up to four friends in Wi-Fi enabled multiplayer modes. Fans can also enjoy revamped classic games such as the much-loved Monkey Target, along with brand new additions. … Expand"}, {"name": "Home Sweet Home", "details_link": "https://www.metacritic.com/game/playstation-4/home-sweet-home", "publisher": "Mastiff", "release_date": "Oct 16 2018", "developers": ["Mastiff"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival", "Adventure", "3D", "First-Person"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/0786693234f75a9ea03c937eb1dca132-98.jpg", "descriptions": "Inspired by Thai mythology and beliefs, Home Sweet Home throws players into a dark and twisted labyrinth, where a miasma of fear fills the air, dread bleeds through cracks in the ceiling and seeps down through broken floorboards."}, {"name": "R: Racing Evolution", "details_link": "https://www.metacritic.com/game/playstation-2/r-racing-evolution", "publisher": "Namco", "release_date": "Dec  9 2003", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 66, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/2c692463bc23c6e6bedb940aa61bfbdd-98.jpg", "descriptions": "R: Racing Evolution is an extraordinary action-racing experience featuring authentic licensed cars and daring, real-world tracks. Combining awesome graphical quality and high performance driving physics with a spectacular story line, R: Racing Evolution chronicles the intense competition andR: Racing Evolution is an extraordinary action-racing experience featuring authentic licensed cars and daring, real-world tracks. Combining awesome graphical quality and high performance driving physics with a spectacular story line, R: Racing Evolution chronicles the intense competition and deep rivalries found only within the professional racing circuit. New exciting features such as the Interactive Driver AI System and in-game radio communications bring players closer to racing action than ever before! 14 tracks from real-world and fantasy locations. 8 different racing styles, including GT, Rally, and Drag. 4 game modes including Racing Life (Story Mode), Time Attack, Arcade, and Versus. New \"Interactive Driver AI System\" enhances realistic racing situations. [Namco]… Expand"}, {"name": "Onslaught", "details_link": "https://www.metacritic.com/game/wii/onslaught", "publisher": "Hudson Entertainment", "release_date": "Feb 23 2009", "developers": ["Hudson Entertainment"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 66, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/c6e213129da264c7ca17f9ca4038dacf-98.jpg", "descriptions": "[WiiWare]  Onslaught is a FPS that puts you in the middle of a futuristic war between humans and insectoid aliens. You become part of the Elite Interstellar Strike Force, fighting against an overwhelming onslaught of alien lifeforms. Enjoy the rush of mowing down wave after wave of aliens[WiiWare]  Onslaught is a FPS that puts you in the middle of a futuristic war between humans and insectoid aliens. You become part of the Elite Interstellar Strike Force, fighting against an overwhelming onslaught of alien lifeforms. Enjoy the rush of mowing down wave after wave of aliens with machine guns, grenades, and more. Feel your heart pound as you battle gigantic boss aliens. Besides the normal game, Onslaught includes modes that let you play with rivals from around the world using Nintendo Wi-Fi Connection. Team up with up to 3 other people in Free Battle Mode. Or compete on special maps to see who can get the most points by killing enemies before time runs out in Nintendo Wi-Fi Connection Ranking Battle Mode. [Nintendo]… Expand"}, {"name": "The Yawhg", "details_link": "https://www.metacritic.com/game/pc/the-yawhg", "publisher": "damiansommer", "release_date": "Jun 14 2013", "developers": ["damiansommer"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 66, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/69798e5eb523486e3a01a7c26d0342db-98.jpg", "descriptions": "The evil Yawhg is returning. How will the towns locals lead their lives in the meanwhile, and what will they do when the dreaded Yawhg finally arrives? The fate of a community hinges on the characters actions, and the decisions of their players. The Yawhg is a one- to four-playerThe evil Yawhg is returning. How will the towns locals lead their lives in the meanwhile, and what will they do when the dreaded Yawhg finally arrives? The fate of a community hinges on the characters actions, and the decisions of their players. The Yawhg is a one- to four-player choose-your-own-adventure game that randomizes a unique story every time you play.… Expand"}, {"name": "Shattered Union", "details_link": "https://www.metacritic.com/game/xbox/shattered-union", "publisher": "2K Games", "release_date": "Oct 17 2005", "developers": ["PopTop Software"], "platforms": ["PC", "Xbox"], "num_players": "2  Online", "genres": ["Strategy", "Turn-Based", "Historic"], "meta_score": 66, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/a27860af6e59d41d1b7156e46a4c3c57-98.jpg", "descriptions": "In Shattered Union, you can try to reunify the United States after a tragic series of events leaves it shattered into a half-dozen nation-states. Shattered Union is a turn-based strategy game where you can assume control of any of the nation-states or a European peacekeeping force. You getIn Shattered Union, you can try to reunify the United States after a tragic series of events leaves it shattered into a half-dozen nation-states. Shattered Union is a turn-based strategy game where you can assume control of any of the nation-states or a European peacekeeping force. You get to observe the repercussions of your actions as you watch them unfold in 3D, and these decisions affect how the plot unfolds. Shattered Union also supports up to four players both online and offline.… Expand"}, {"name": "Pupperazzi", "details_link": "https://www.metacritic.com/game/xbox-one/pupperazzi", "publisher": "Kitfox Games", "release_date": "Jan 20 2022", "developers": ["Sundae Month"], "platforms": ["PC", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Action Adventure", "Open-World"], "meta_score": 66, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/c046f302ee8268dc08b28c7706c46fd0-98.jpg", "descriptions": "Put your love for pups to the test - we have a bunch of dogs that need their photos taken, doggone it! Photograph and catalogue the finest (and derpiest) dogs to build your career, upgrade your camera, and discover new canines. WOOF."}, {"name": "Button City", "details_link": "https://www.metacritic.com/game/playstation-5/button-city", "publisher": "Subliminal", "release_date": "Aug 10 2021", "developers": ["Subliminal"], "platforms": ["PC", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/5875052cd1b7381ee86ba32fc9b3a329-98.jpg", "descriptions": "Button City is a colorful low poly narrative adventure game about a fox and his friends banding together to save their local arcade! Explore a diorama world, play exciting arcade games, complete quirky quests and meet cute animal friends."}, {"name": "Detached", "details_link": "https://www.metacritic.com/game/playstation-4/detached", "publisher": "Anshar Studios", "release_date": "Jul 24 2018", "developers": ["Anshar Studios"], "platforms": ["PC", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Simulation", "Adventure", "General", "3D", "Space", "First-Person", "Combat"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/39bdf355f4a40fa59db18ea9c30ed482-98.jpg", "descriptions": "Detached is a space exploration VR game that demands tactics and skill to survive. Strap yourself in for hardcore gameplay uniquely designed for VR headsets.\rTrapped in an abandoned space station, you must race against borrowed time to find your crew before your oxygen supply runs out. AsDetached is a space exploration VR game that demands tactics and skill to survive. Strap yourself in for hardcore gameplay uniquely designed for VR headsets.\rTrapped in an abandoned space station, you must race against borrowed time to find your crew before your oxygen supply runs out. As you solve puzzles to open airlocks, locate power cores and disable transmitters, something tells you that you wont be alone when you finally escape into the universes deep infinity.… Expand"}, {"name": "Sonic Unleashed", "details_link": "https://www.metacritic.com/game/wii/sonic-unleashed", "publisher": "Sega", "release_date": "Nov 18 2008", "developers": ["Sonic Team"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "2D", "3D"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/c86f76eb9eaf669c484dd3e935e16501-98.jpg", "descriptions": "Having been broken apart by the evil Dr. Eggman, it's up to Sonic to put the pieces of the world back together again by retrieving the power of the chaos emeralds! In doing so, Sonic finds himself in a race against time and faced with an unusual situation that challenge hims in ways neverHaving been broken apart by the evil Dr. Eggman, it's up to Sonic to put the pieces of the world back together again by retrieving the power of the chaos emeralds! In doing so, Sonic finds himself in a race against time and faced with an unusual situation that challenge hims in ways never before seen. Both day and night play different, yet important, roles in Sonic's newest quest... as the sun sets, a new adventure awakens. By completing a wide variety of action-packed stages, spanning the seven broken continents of the world, gamers unleash Sonic’s amazing abilities to save the world, and himself! In addition to running at high speeds, which is highlighted in four new speed mechanics, combat fighting now becomes possible. New combat, movement, functional abilities and platforming are introduced to offer increased depth and variety. Sonic Unleashed offers a re-defined experience for fans and newcomers of the franchise alike by combing picturesque & detailed scenery, an expansive world with multiple paths to choose from and dynamic viewpoints for an immersive and renewed gaming atmosphere. Along with seamless 3D to classic 2D camera transitions, the game is built on a powerful, new proprietary \"Hedgehog Engine,\" which introduces impressive lighting abilities and new technology tailor made for Sonic’s new speed capabilities. [Sega]… Expand"}, {"name": "Ape Escape: On the Loose", "details_link": "https://www.metacritic.com/game/psp/ape-escape-on-the-loose", "publisher": "SCEA", "release_date": "Mar 22 2005", "developers": ["SCEA", "SIMS"], "platforms": "PSP", "num_players": "2 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/a4fd7e07f9157f3de905122926763b6a-98.jpg", "descriptions": "(Also known as \"Ape Escape P\" in the UK/EU)  Ape Escape: On the Loose provides players the challenge of capturing more than 200 monkeys in eight vibrant worlds spanning across more than 20 levels in order to prevent them from changing history! When a trouble-making monkey named Specter gets(Also known as \"Ape Escape P\" in the UK/EU)  Ape Escape: On the Loose provides players the challenge of capturing more than 200 monkeys in eight vibrant worlds spanning across more than 20 levels in order to prevent them from changing history! When a trouble-making monkey named Specter gets hold of the Professor's Peak Point Helmet, chaos ensues. The powerful device, which can increase a human's intelligence, has a disastrous effect on Specter, transforming him from a sweet, mischievous monkey to a power-hungry monster who has his heart set on ruling the world. The power of the helmet enabled Specter to break free from his cage while also allowing him to free hundreds of other monkeys at the zoo. Specter and the monkeys escape to a nearby laboratory where the Professor, who created the Peak Point Helmet, is working on his latest invention, a time machine. Taking control of the laboratory, Specter and the other monkeys use the time machine to escape into the past. The adventure begins when the player takes on the role of a brave young boy named Spike, a friend of the Professor. Spike's mission is to pursue Specter and the monkeys who have fled to the past in order to prevent them from changing history and taking over the world. [SCEA]… Expand"}, {"name": "Agatha Christie: The ABC Murders", "details_link": "https://www.metacritic.com/game/xbox-one/agatha-christie-the-abc-murders", "publisher": "Microids", "release_date": "Feb 23 2016", "developers": ["Microids"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 66, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/d75c0251be55dc051589e0d492f04805-98.jpg", "descriptions": "The ABC Murders is an adventure and investigation game adapted from the classic Agatha Christie novel. Assume the role of the famous private detective Hercule Poirot and, once again, you find yourself up against a mysterious serial killer who goes by the name of \"ABC\"."}, {"name": "Halo: Spartan Strike", "details_link": "https://www.metacritic.com/game/pc/halo-spartan-strike", "publisher": "Microsoft Game Studios", "release_date": "Apr 16 2015", "developers": ["343 Industries", "Vanguard Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Scrolling", "Action", "Shooter", "Shoot-'Em-Up", "Top-Down", "Vertical"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/77e2df4fb797e7dc878c6330e355e3f9-98.jpg", "descriptions": "Halo: Spartan Strike is a top-down shooter."}, {"name": "Destiny of Spirits", "details_link": "https://www.metacritic.com/game/playstation-vita/destiny-of-spirits", "publisher": "SCEA", "release_date": "Mar 25 2014", "developers": ["Q Entertainment"], "platforms": "PlayStation Vita", "genres": ["Action", "General", "Strategy", "Turn-Based", "General", "Fantasy"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/97ad5264171d23677272712669bc7b4c-98.jpg", "descriptions": "It’s a free-to-play location-based strategy and RPG game in which you work together with friends and other players across the globe to summon, trade, merge and rent Spirits to use in battle."}, {"name": "NaissanceE", "details_link": "https://www.metacritic.com/game/pc/naissancee", "publisher": "Limasse Five", "release_date": "Feb 13 2014", "developers": ["Limasse Five"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Adventure", "3D", "First-Person", "Sci-Fi"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/27930e79e2f2888062649fe1e3687528-98.jpg", "descriptions": "NaissanceE is a first person exploration PC game developed on UDK by Limasse Five with the participation of Pauline Oliveros, Patricia Dallio and Thierry Zaboitzeff. The adventure takes place in a primitive mysterious structure and the game mainly consists to explore and feel the deep andNaissanceE is a first person exploration PC game developed on UDK by Limasse Five with the participation of Pauline Oliveros, Patricia Dallio and Thierry Zaboitzeff. The adventure takes place in a primitive mysterious structure and the game mainly consists to explore and feel the deep and strong ambiance of this atemporal world but platforming and puzzles areas will also enrich the experience. … Expand"}, {"name": "Madden NFL Arcade", "details_link": "https://www.metacritic.com/game/xbox-360/madden-nfl-arcade", "publisher": "EA Sports", "release_date": "Nov 24 2009", "developers": ["EA Tiburon"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade"], "meta_score": 66, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/c679e4a16820533ae71c7a496977012a-98.jpg", "descriptions": "[Xbox Live Arcade]  Feel the excitement of the NFL with a fun, fast-paced, 5-on-5 football experience. Madden NFL Arcade for brings the 10 best players from each of the 32 NFL teams on offense and defense together to battle it out on the gridiron. No penalties, no clock, just pure[Xbox Live Arcade]  Feel the excitement of the NFL with a fun, fast-paced, 5-on-5 football experience. Madden NFL Arcade for brings the 10 best players from each of the 32 NFL teams on offense and defense together to battle it out on the gridiron. No penalties, no clock, just pure adrenaline, as each team has four downs to march 60 yards downfield for the score. Madden NFL Arcade takes everything you love about your favorite NFL stars and stadiums and brings them to life in a fun, high-scoring gridiron battle! [Electronic Arts]… Expand"}, {"name": "Disney's A Christmas Carol", "details_link": "https://www.metacritic.com/game/ds/disneys-a-christmas-carol", "publisher": "Disney Interactive Studios", "release_date": "Nov  3 2009", "developers": ["Sumo Digital"], "platforms": "DS", "genres": ["Adventure", "General", "General"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/f789a565c8b573a20beea5dbc2f5189c-98.jpg", "descriptions": "This is a puzzle-adventure game of the the feature-length movie, Disney's A Christmas Carol."}, {"name": "The Cameron Files: The Secret at Loch Ness", "details_link": "https://www.metacritic.com/game/pc/the-cameron-files-the-secret-at-loch-ness", "publisher": "DreamCatcher Interactive", "release_date": "Jan 24 2002", "developers": ["Galilea Multimedia"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Modern", "Modern"], "meta_score": 66, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/ff5d10ef1cd601cf8c1989d5ddf28bfa-98.jpg", "descriptions": "Hidden away in the Scottish countryside above Loch Ness, sits serene Devil's Ridge Manor. But its tranquillity is deceptive. For some time now there has been an increasing number of ghosts and supernatural phenomena at the manor. At the request of the famous physicist and owner of the manorHidden away in the Scottish countryside above Loch Ness, sits serene Devil's Ridge Manor. But its tranquillity is deceptive. For some time now there has been an increasing number of ghosts and supernatural phenomena at the manor. At the request of the famous physicist and owner of the manor Allister Mac Farley, private investigator Alan P. Cameron leaves his Chicago office for the mists of his ancestral land. Does the fabled sea monster play a part in the goings-on? Confronted by strange phenomena, the player must help Cameron with his investigation, from the obscure corners of the Medieval castle, to the old scientist's secret laboratory and finally to the troubled waters of Loch Ness to solve the mystery. [DreamCatcher Interactive]… Expand"}, {"name": "Someday You'll Return", "details_link": "https://www.metacritic.com/game/pc/someday-youll-return", "publisher": "CBE software", "release_date": "May  5 2020", "developers": ["CBE software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 66, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/8fb914f884463cf4279a2d28a9571346-98.jpg", "descriptions": "Someday You'll Return is a story-driven psychological horror game about a desperate search for a missing daughter deep in the woods where you swore you'd never return, brought to you by the creative duo behind J.U.L.I.A.: Among the Stars."}, {"name": "Kane & Lynch 2: Dog Days", "details_link": "https://www.metacritic.com/game/pc/kane-lynch-2-dog-days", "publisher": "Square Enix", "release_date": "Aug 17 2010", "developers": ["Nixxes Software"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 66, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/51c9ad2a916e9fa158288cd770bd3810-98.jpg", "descriptions": "Kane & Lynch 2: Dog Days is a raw and brutal crime shooter designed to take players on an even more intense story experience, following two of gaming's most disturbed criminals, through the gritty Shanghai underworld."}, {"name": "Inferno Pool", "details_link": "https://www.metacritic.com/game/playstation-3/inferno-pool", "publisher": "Dark Energy Digital", "release_date": "Oct 28 2009", "developers": ["Dark Energy Digital"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "1-4 ", "genres": ["Sports", "Miscellaneous", "Parlor", "Individual", "Billiards", "Billiards"], "meta_score": 66, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/b7134cd02d21b3da6701282ee3c5e3c7-98.jpg", "descriptions": "This isn't Pool as you know it. Multiplayer mayhem awaits 1-4 local or online players, in a race to clear the most balls from your table. Pot balls to fire at your opponents, or stockpile balls to unleash an onslaught. Master Jump Shots, Combos, Bank Shots, Kick Shots and build yourThis isn't Pool as you know it. Multiplayer mayhem awaits 1-4 local or online players, in a race to clear the most balls from your table. Pot balls to fire at your opponents, or stockpile balls to unleash an onslaught. Master Jump Shots, Combos, Bank Shots, Kick Shots and build your multiplayer with an unbroken potting streak to unleash the devastating Inferno Mode. Alliances will be formed, friends will be betrayed, and the battle isn't over until the stat screen appears. [Dark Energy]… Expand"}, {"name": "Saints Row IV: Re-Elected & Gat Out of Hell", "details_link": "https://www.metacritic.com/game/playstation-4/saints-row-iv-re-elected-gat-out-of-hell", "publisher": "Deep Silver", "release_date": "Jan 20 2015", "developers": ["Volition Inc."], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "General", "Modern", "Open-World"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/b07206d1cf9e3daaae5d2dd5c635cf5c-98.jpg", "descriptions": "Saints Row IV: Re-Elected + Gat out of Hell find you leaping over buildings, singing songs, fight in a 2D side-scroller, cure cancer, save Santa Claus... all this and more awaits you when you play Saints Row IV: Re-Elected, a special bundle that includes Saints Row IV and all of its' DLC.Saints Row IV: Re-Elected + Gat out of Hell find you leaping over buildings, singing songs, fight in a 2D side-scroller, cure cancer, save Santa Claus... all this and more awaits you when you play Saints Row IV: Re-Elected, a special bundle that includes Saints Row IV and all of its' DLC. After saving the world from a terrorist attack the leader of the 3rd Street Saints is elected to become President of the United States. Things go reasonably well for The President until an alien warlord named Zinyak attacks the white house and abducts his entire cabinet. Now stuck inside a reality bending simulation, the President and the Saints fight to save themselves, Earth, and the entire galaxy.… Expand"}, {"name": "WWF Royal Rumble", "details_link": "https://www.metacritic.com/game/dreamcast/wwf-royal-rumble", "publisher": "THQ", "release_date": "Aug  1 2000", "developers": ["Yuke's"], "platforms": "Dreamcast", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/4549a8dbdcb40b1feaa6374b146afb6f-98.jpg", "descriptions": "Immerse yourself in the chaos of a \"Royal Rumble\" match with up to 9 Superstars in the ring at one time. Better watch your back, because in this type of match there are no allegiances or friendships."}, {"name": "EA Playground", "details_link": "https://www.metacritic.com/game/wii/ea-playground", "publisher": "Electronic Arts", "release_date": "Oct 22 2007", "developers": ["EA Canada"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "General", "General"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/6d8edacd72d78b21c9441f4b6f052406-98.jpg", "descriptions": "EA Playground features games that are easy to pick-up-and-play by fully capitalizing on the unique control mechanics of both the Wii and the Nintendo DS. Swing the Wii remote to excel in tetherball, blow into the Nintendo DS mic to fire spitballs or battle your friends and family inEA Playground features games that are easy to pick-up-and-play by fully capitalizing on the unique control mechanics of both the Wii and the Nintendo DS. Swing the Wii remote to excel in tetherball, blow into the Nintendo DS mic to fire spitballs or battle your friends and family in dodgeball. Every game brings its own twist to the controls for the ultimate, all-ages, party game. In EA Playground, you don't always have to be playing with your friends and family in order to have fun. Explore the world on your own as you enter different locations, unlocking new activities, making wacky in-game friends and collecting rewards and stickers to upgrade your abilities along the way. [Electronic Arts]… Expand"}, {"name": "Gotham Knights", "details_link": "https://www.metacritic.com/game/pc/gotham-knights", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 21 2022", "developers": ["WB Games Montreal", "Warner Bros. Games Montreal"], "platforms": ["PlayStation 5", "Xbox Series X", "PC"], "num_players": "2 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 66, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/3/1dc41c9dde8652f55365edbd9592f91f-98.jpg", "descriptions": "Batman is dead. It is now up to the Batman Family - Batgirl, Nightwing, Red Hood and Robin - to protect Gotham City, bring hope to its citizens, discipline to its cops, and fear to its criminals. You must evolve into the new Dark Knight and save Gotham from chaos. Your legacy begins now.Batman is dead. It is now up to the Batman Family - Batgirl, Nightwing, Red Hood and Robin - to protect Gotham City, bring hope to its citizens, discipline to its cops, and fear to its criminals. You must evolve into the new Dark Knight and save Gotham from chaos. Your legacy begins now. Step into the Knight. Gotham Knights is a brand-new open world, third-person action RPG featuring the Batman Family as players step into the roles of Batgirl, Nightwing, Red Hood and Robin, a new guard of trained DC Super Heroes who must rise up as the protectors of Gotham City in the wake of Batman's death. An expansive, criminal underworld has swept through the streets of Gotham, and it is now up to these new heroes to protect the city, bring hope to its citizens, discipline to its cops and fear to its criminals. Players must save Gotham from descent into chaos and reinvent themselves into their own version of the Dark Knight.… Expand"}, {"name": "Carnival Island", "details_link": "https://www.metacritic.com/game/playstation-3/carnival-island", "publisher": "SCEA", "release_date": "Nov 15 2011", "developers": ["Magic Pixel Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 66, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/4/d13a4936cb837cae80e231fa8d164e9b-98.jpg", "descriptions": "Sony Computer Entertainment America LLC (SCEA) teams up with Magic Pixel Games to bring the fun and excitement of carnivals right into your own living room with Carnival Island.  Carnival Island invites you to take a trip to a magic carnival and experience the joy of classic family-friendlySony Computer Entertainment America LLC (SCEA) teams up with Magic Pixel Games to bring the fun and excitement of carnivals right into your own living room with Carnival Island.  Carnival Island invites you to take a trip to a magic carnival and experience the joy of classic family-friendly fun in over 35 carnival attractions.  Utilizing the PlayStation®Move controller’s precise tracking technology, every toss, roll, throw, spin and slam is translated directly into the game for accurate and responsive gameplay. \r\rExplore Carnival Island alone or with friends, while playing games such as minibowl, ring toss, throwdown, and frogbog to earn tickets redeemable for prizes and collectibles.  By completing challenges, players can create their own cheering squad consisting of lovable pets throughout their experience.  Players can also have fun by interacting with fun house mirrors, photo cut-outs and upload snapshots of their experiences directly onto Facebook or send to a PlayStation®Network (PSN) friend.\r… Expand"}, {"name": "The Magnificent Trufflepigs", "details_link": "https://www.metacritic.com/game/pc/the-magnificent-trufflepigs", "publisher": "AMC Games", "release_date": "Jun  2 2021", "developers": ["Thunkd"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 66, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/9/042954f2846068129760c54416534ee4-98.jpg", "descriptions": "The Magnificent Trufflepigs is a first-person, romantic, metal-detecting game. You play as Adam, a sharp-witted but compassionate man returning to his childhood village of Stanning. There he'll help a woman named Beth on her mission to unearth a local treasure. As cracks begin to appear inThe Magnificent Trufflepigs is a first-person, romantic, metal-detecting game. You play as Adam, a sharp-witted but compassionate man returning to his childhood village of Stanning. There he'll help a woman named Beth on her mission to unearth a local treasure. As cracks begin to appear in Beth's fairy tale plan for everything, you'll delve into her history and discover all may not be as it seems. And you'll have to choose how Adam responds to Beth as she faces her demons.Gameplay combines laid-back metal detecting and exploration with a strong interpersonal narrative, all set in a beautiful English countryside. The Magnificent Trufflepigs is a game about trying to find something, and the tone it sets is like a typical English summer: mostly pleasant, but with stormy moments that threaten to ruin everything.… Expand"}, {"name": "Black Knight Sword", "details_link": "https://www.metacritic.com/game/playstation-3/black-knight-sword", "publisher": "D3Publisher", "release_date": "Dec 11 2012", "developers": ["Digital Reality", "Grasshopper Manufacture"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 66, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/ef0863757acdaf38ba117c4adeb542ad-98.jpg", "descriptions": "Black Knight Sword 2D is a side-scrolling platformer from Suda-51's development house Grasshopper Manufacture."}, {"name": "Teenage Mutant Ninja Turtles: 1989 Classic Arcade", "details_link": "https://www.metacritic.com/game/xbox-360/teenage-mutant-ninja-turtles-1989-classic-arcade", "publisher": "Ubisoft", "release_date": "Mar 14 2007", "developers": ["Konami", "Digital Eclipse"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 66, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/b3332be35743cbe9b363bfe3b4a2be65-98.jpg", "descriptions": "[Xbox Live Arcade]  The 1989 Classic Arcade game, originally published by Konami and most recently developed for Xbox LIVE Arcade by Digital Eclipse, has come to the Xbox LIVE Arcade. The TMNT arcade game brings the nostalgia of the early coin-op arcade days of gaming and features the[Xbox Live Arcade]  The 1989 Classic Arcade game, originally published by Konami and most recently developed for Xbox LIVE Arcade by Digital Eclipse, has come to the Xbox LIVE Arcade. The TMNT arcade game brings the nostalgia of the early coin-op arcade days of gaming and features the original seven levels, two- to four-player co-op modes and voice- chat capabilities and be available for download for 400 Microsoft Points ($5 U.S.). Different turtles: Choose from one of four Ninja Turtles—Leonardo, Michelangelo, Donatello or Raphael—and master their unique ninja butt-kickin' abilities. Comic book characters: Interact with unforgettable characters, including Splinter, Casey Jones, April O'Neal, Baxter Stockman, and Shredder. [Ubisoft]… Expand"}, {"name": "American Fugitive", "details_link": "https://www.metacritic.com/game/playstation-4/american-fugitive", "publisher": "Curve Digital", "release_date": "May 21 2019", "developers": ["Fallen Tree Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox", "Open-World"], "meta_score": 66, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/134f6e4a62ea54ea8734507f18a8e0a7-98.jpg", "descriptions": "A modern take on classic sandbox action. Framed for your father’s murder, you’ll need to do whatever it takes to unveil the real culprit. Tackle thrilling missions for the criminal underworld — just don’t let the cops track you down! Set in the deep south of the 80s, American Fugitive is aA modern take on classic sandbox action. Framed for your father’s murder, you’ll need to do whatever it takes to unveil the real culprit. Tackle thrilling missions for the criminal underworld — just don’t let the cops track you down! Set in the deep south of the 80s, American Fugitive is a love-letter to the classic movies and games of old.… Expand"}, {"name": "Juka and the Monophonic Menace", "details_link": "https://www.metacritic.com/game/game-boy-advance/juka-and-the-monophonic-menace", "publisher": "SouthPeak Games", "release_date": "Oct 24 2006", "developers": ["Orbital Media", "Inc."], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/5e4424906d6b3f16ec0a4c1128169c7f-98.jpg", "descriptions": "Juka and the Monophonic Menace is an action game featuring interactive environments, an original pattern-based combat and a rich, fantastic world and characters. Set in the strange and wonderful world of Obla, the game revolves around the journey of a young Alchemist named Juka who sets outJuka and the Monophonic Menace is an action game featuring interactive environments, an original pattern-based combat and a rich, fantastic world and characters. Set in the strange and wonderful world of Obla, the game revolves around the journey of a young Alchemist named Juka who sets out to rescue the people of his village from the clutches of the evil Monophonic Menace.… Expand"}, {"name": "The Outer Worlds", "details_link": "https://www.metacritic.com/game/switch/the-outer-worlds", "publisher": "Private Division", "release_date": "Jun  5 2020", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 66, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/3/4c35a41aa0c9b43bea494e25f75a80ff-98.jpg", "descriptions": "The Outer Worlds is a new single-player first-person sci-fi RPG from Obsidian Entertainment and Private Division. Lost in transit while on a colonist ship bound for the furthest edge of the galaxy, you awake decades later only to find yourself in the midst of a deep conspiracy threatening toThe Outer Worlds is a new single-player first-person sci-fi RPG from Obsidian Entertainment and Private Division. Lost in transit while on a colonist ship bound for the furthest edge of the galaxy, you awake decades later only to find yourself in the midst of a deep conspiracy threatening to destroy the Halcyon colony. As you explore the furthest reaches of space and encounter various factions, all vying for power, the character you decide to become will determine how this player-driven story unfolds. In the corporate equation for the colony, you are the unplanned variable.\r Key Features:\r * The player-driven story RPG: In keeping with the Obsidian tradition, how you approach The Outer Worlds is up to you. Your choices affect not only the way the story develops; but your character build, companion stories, and end game scenarios.\r* You can be flawed, in a good way: New to The Outer Worlds is the idea of flaws. A compelling hero is made by the flaws they carry with them. While playing The Outer Worlds, the game tracks your experience to find what you aren't particularly good at. Keep getting attacked by Raptidons? Taking the Raptiphobia flaw gives you a debuff when confronting the vicious creatures, but rewards you with an additional character perk immediately. This optional approach to the game helps you build the character you want while exploring Halcyon.\r* Lead your companions: During your journey through the furthest colony, you will meet a host of characters who will want to join your crew. Armed with unique abilities, these companions all have their own missions, motivations, and ideals. It's up to you to help them achieve their goals, or turn them to your own ends.\r* Explore the corporate colony: Halcyon is a colony at the edge of the galaxy owned and operated by a corporate board. They control everything... except for the alien monsters left behind when the terraforming of the colony's two planets didn't exactly go according to plan. Find your ship, build your crew, and explore the settlements, space stations, and other intriguing locations throughout Halcyon.… Expand"}, {"name": "Destiny 2: Lightfall", "details_link": "https://www.metacritic.com/game/pc/destiny-2-lightfall", "publisher": "Bungie", "release_date": "Feb 28 2023", "developers": ["Bungie"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action", "First-Person", "Shooter", "Arcade"], "meta_score": 66, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/8/dea2b349c077261dd6bd5207c519c6c9-98.jpg", "descriptions": "The last stand against Calus--who became the latest disciple of The Witness at the end of Season of the Haunted--and a \"pivotal\" moment for the Destiny franchise as it heads to the end of the Light and Darkness saga. Lightfall takes place in a new city on Neptune, Neomuna, which has aThe last stand against Calus--who became the latest disciple of The Witness at the end of Season of the Haunted--and a \"pivotal\" moment for the Destiny franchise as it heads to the end of the Light and Darkness saga. Lightfall takes place in a new city on Neptune, Neomuna, which has a pristine and retro-futuristic design. As for the fifth subclass that was briefly seen, this new Darkness power is called Strand and allows for new traversal methods in Neomuna. The city is inhabited by a new race known as Cloudstriders, who managed to escape The Collapse of the solar system and remain hidden from the Darkness. With The Witness having discovered the city, it has come under siege from Calus, the Shadow Legion, and gigantic Pyramid Demons that can use a scythe to attack from a distance and drain your life-force.… Expand"}, {"name": "Company of Crime", "details_link": "https://www.metacritic.com/game/pc/company-of-crime", "publisher": "1C Entertainment", "release_date": "Aug  7 2020", "developers": ["Resistance Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/bd0105bd24bf48da372e7aabc5393d75-98.jpg", "descriptions": "Company of Crime places you in the heart of 1960s London. Will you build an influential criminal empire, or head up an elite Scotland Yard task force and crack down on the rising tide of corruption? Case out targets, then dive into the melee with your hand-picked team of gangsters or detectives."}, {"name": "Might & Magic: Heroes VI - Shades of Darkness", "details_link": "https://www.metacritic.com/game/pc/might-magic-heroes-vi---shades-of-darkness", "publisher": "Ubisoft", "release_date": "May  2 2013", "developers": ["Virtuos"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Fantasy", "General"], "meta_score": 66, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/a73bc58179ab2d7c49e092e443d63122-98.jpg", "descriptions": "This fully fledged expansion will feature a new fan-favorite faction to Heroes VI, Dungeon, led by the Dark Elves. The Dark Elves have left the forests of Irollan, made a pact with the mysterious Faceless and escaped extermination by becoming underground renegades - stealthy and reveredThis fully fledged expansion will feature a new fan-favorite faction to Heroes VI, Dungeon, led by the Dark Elves. The Dark Elves have left the forests of Irollan, made a pact with the mysterious Faceless and escaped extermination by becoming underground renegades - stealthy and revered assassins.  This faction is introduced into an epic campaign that not only unveils unexplored territories of Ashan, but also recounts the mysterious origins of their people.… Expand"}, {"name": "Izuna: Legend of the Unemployed Ninja", "details_link": "https://www.metacritic.com/game/ds/izuna-legend-of-the-unemployed-ninja", "publisher": "Atlus", "release_date": "Feb 20 2007", "developers": ["Ninja Studio"], "platforms": "DS", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Roguelike"], "meta_score": 66, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/6a72b3261b4f4c4e49ba8175d09ff743-98.jpg", "descriptions": "Finally, a dungeon RPG strong enough for a man... but played as a hot chick! Drop your stylus, you pansy, and get back to the old school, hardcore, monster bashing we all grew up on! See if you have what it takes to conquer the impossible levels and gruesome bosses. After all, does it getFinally, a dungeon RPG strong enough for a man... but played as a hot chick! Drop your stylus, you pansy, and get back to the old school, hardcore, monster bashing we all grew up on! See if you have what it takes to conquer the impossible levels and gruesome bosses. After all, does it get any better than the feeling of cold steel at the palm of your hands? Hi there! I'm Izuna! So you see, we were canned because \"Ninjas are sooo yesterday,\" and now we're looking for a nice place to settle down... That stupid lord... Just wait'll I get my hands on that jerk! So anyways, we found this quaint little village, but... Everyone's actin' all weird. Grandboss's acting like a kid... Shino-Sis's all mean... What's going on!? I mean, what is up with this place!? Features deep, challenging labyrinths that change every time you enter. Use Talismans to cast spells or power up your equipment. Customize and power up your weapons, which gain strength over time. [Atlus USA]… Expand"}, {"name": "Point Blank DS", "details_link": "https://www.metacritic.com/game/ds/point-blank-ds", "publisher": "Namco Bandai Games", "release_date": "Jun 13 2006", "developers": ["TOSE"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Light Gun", "Light Gun"], "meta_score": 66, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/cc35d50e9b52ad8891e8f93de2b5ecf9-98.jpg", "descriptions": "With over 40 stages from all three games in the series being included, fans of the popular shooting series will have their hand-eye coordination tested, by using the DS stylus as their weapon of choice to shoot down everything from clay pigeons to aliens in the fun mini games of Point BlankWith over 40 stages from all three games in the series being included, fans of the popular shooting series will have their hand-eye coordination tested, by using the DS stylus as their weapon of choice to shoot down everything from clay pigeons to aliens in the fun mini games of Point Blank DS. The portable return of the retro series will also boast five different modes including: Arcade: Play through four different levels of difficulty in a variety of mini shooting games. VS:  Challenge your friends using the wireless feature to find out who’s the quickest draw (requires only one game card). Brain Massage: Play through various stages while the game analyzes your abilities and gives you feedback. Freeplay: Select any stage at any time to challenge your best score. [Namco Bandai]… Expand"}, {"name": "Dragon Ball Z: Budokai 2", "details_link": "https://www.metacritic.com/game/gamecube/dragon-ball-z-budokai-2", "publisher": "Atari", "release_date": "Dec 15 2004", "developers": ["Pyramid"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 66, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/86f33f01083d4b57dce14bc28d166ea1-98.jpg", "descriptions": "Go to the next level in the Dragon Ball Z saga.  Dragon Ball Z: Budokai 2 improves upon the first installment by adding an all-new single player mode, new characters and explosive attacks.  Experience the new match-ups, character cameos and challenging missions in \"Dragon World.\"Go to the next level in the Dragon Ball Z saga.  Dragon Ball Z: Budokai 2 improves upon the first installment by adding an all-new single player mode, new characters and explosive attacks.  Experience the new match-ups, character cameos and challenging missions in \"Dragon World.\" Pick your favorite DBZ hero or enemy and take on a friend in \"Vs.\" and \"Tournament\" modes.  If you're really good, you will soon come face-to-face with Buu, the most lethal DBZ villain.… Expand"}, {"name": "Soundfall", "details_link": "https://www.metacritic.com/game/pc/soundfall", "publisher": "Noodlecake Studios", "release_date": "May 11 2022", "developers": ["Drastic Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Action Adventure", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/758d3061329c81dd393f84f706e74eaf-98.jpg", "descriptions": "Soundfall is a dungeon crawler that combines looter-shooter action with rhythm-based gameplay. Venture out solo or with up to 4 friends locally or online. Collect loot and time your actions to the beat to become all powerful. Play the Campaign Mode, Free Play 100's of songs or import your Soundfall is a dungeon crawler that combines looter-shooter action with rhythm-based gameplay. Venture out solo or with up to 4 friends locally or online. Collect loot and time your actions to the beat to become all powerful. Play the Campaign Mode, Free Play 100's of songs or import your own music! … Expand"}, {"name": "Punch Line", "details_link": "https://www.metacritic.com/game/playstation-4/punch-line", "publisher": "PQube", "release_date": "Oct  9 2018", "developers": ["5pb"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Visual Novel"], "meta_score": 66, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/2/95e91d2770db2f47407ad08d8ee38427-98.jpg", "descriptions": "Punch Line is the newest visual novel adventure from the creators of Zero Escape and the Science Adventure series."}, {"name": "Scribblenauts Showdown", "details_link": "https://www.metacritic.com/game/xbox-one/scribblenauts-showdown", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Mar  6 2018", "developers": ["Warner Bros. Interactive Entertainment", "Shiver Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/3ca098f3cfd39b3c755ff97ffc0584f6-98.jpg", "descriptions": "The game is designed primarily to be played with friends: up to four players can partake in \"more than\" 25 mini-games, which are served up in different forms depending on which mode you select. Showdown is a competitive mode in which finding the best word the quickest is the key, whileThe game is designed primarily to be played with friends: up to four players can partake in \"more than\" 25 mini-games, which are served up in different forms depending on which mode you select. Showdown is a competitive mode in which finding the best word the quickest is the key, while Versus supplies various mini-games for you and one other friend to battle in, one-vs-one. Sandbox is a more traditional Scribblenauts mode that will be familiar to fans of the series. Here you can summon a variety of objects--publisher Warner Bros. says over 35,000 items are available in-game--to solve objectives either by yourself or with a friend. Eight new levels are included, as are hidden collectibles and achievements.… Expand"}, {"name": "This is the Police", "details_link": "https://www.metacritic.com/game/switch/this-is-the-police", "publisher": "Nordic Games Publishing", "release_date": "Oct 24 2017", "developers": ["Weappy Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 66, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/49ba892af547f005a77adaf0a1b8602a-98.jpg", "descriptions": "This Is the Police is a strategy/adventure game set in a city spiraling the drain. Youll come face to face with the ugly underbelly of Freeburg, taking the role of gritty Police Chief Jack Boyd (portrayed by Jon St. John, the voice of Duke Nukem).\r Dive into a deep story of corruption,This Is the Police is a strategy/adventure game set in a city spiraling the drain. Youll come face to face with the ugly underbelly of Freeburg, taking the role of gritty Police Chief Jack Boyd (portrayed by Jon St. John, the voice of Duke Nukem).\r Dive into a deep story of corruption, crime and intrigues. You are taking the role of gritty Police Chief Jack Boyd  youll come face to face with the ugly underbelly of Freeburg, a city spiraling the drain. Will Jack see his retirement with a nice sum of money waiting to be spend or will he end up broken  or even worse?\r Immerse yourself in a controversial tale of corruption, crime, and political intrigue. Manage your staff, respond to emergencies, and investigate crimes in a city on the brink of chaos. The mafia underworld maneuvers behind the scenes, sinking their claws ever deeper into the city, even as the mayor is ready to exploit every situation to his political advantage.\r Choose your approach to each situation as it unfolds. Sometimes youll be responding to a developing crisis at a crime scene, or negotiating with Freeburgs crime bosses. Sometimes youll find yourself dodging questions in the press room, or even the occasional cross-examination in the witness box. Can you keep this pressure cooker from exploding, at least for long enough to stash away a nice retirement nest egg? Or will you land yourself behind bars  or worse?… Expand"}, {"name": "Ride 2", "details_link": "https://www.metacritic.com/game/xbox-one/ride-2", "publisher": "Square Enix", "release_date": "Feb 14 2017", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/3171a9ff201a3fe2d39aa0de10502204-98.jpg", "descriptions": "Welcome to the temple of motorcycles, the only digital garage that will allow you to discover, transform and test the world’s fastest, most iconic and original vehicles. The top of the range of the most famous brands will await you to compete against each other in a unique videogame and showWelcome to the temple of motorcycles, the only digital garage that will allow you to discover, transform and test the world’s fastest, most iconic and original vehicles. The top of the range of the most famous brands will await you to compete against each other in a unique videogame and show the world their full potential. Over 200 bikes are the undisputed protagonists of the new chapter of this long-waited two-wheel racing game! Feel the adrenaline rush through your veins and face the most dreadful bends with the passion and the boldness of a professional rider. [Milestone]… Expand"}, {"name": "Concursion", "details_link": "https://www.metacritic.com/game/pc/concursion", "publisher": "Mastertronic", "release_date": "Jun  6 2014", "developers": ["Puuba"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Platformer", "2D"], "meta_score": 66, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/d41f448f244421fd962e96b5bebf4781-98.jpg", "descriptions": "Concursion is a multi-genre game played on the boundaries between worlds. Steer your hero through a dangerous interdimensional universe, switching between different genres on the fly, pulling off feats of tight aerial acrobatics otherwise unattainable in one genre alone."}, {"name": "Harry Potter and the Goblet of Fire", "details_link": "https://www.metacritic.com/game/pc/harry-potter-and-the-goblet-of-fire", "publisher": "Electronic Arts", "release_date": "Nov  8 2005", "developers": ["Electronic Arts"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-3 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 66, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/1/fbd49dec682d76d08c8507a478a0a065-98.jpg", "descriptions": "In Harry Potter and the Goblet of Fire, Harry is mysteriously selected as the fourth competitor in the dangerous Triwizard Tournament. Each contestant in this international competition must confront a fire-breathing dragon, rescue friends from the icy depths of the Black Lake, and navigateIn Harry Potter and the Goblet of Fire, Harry is mysteriously selected as the fourth competitor in the dangerous Triwizard Tournament. Each contestant in this international competition must confront a fire-breathing dragon, rescue friends from the icy depths of the Black Lake, and navigate the twisting mysteries of a vast, dangerous maze. Players experience all the thrills of the movie - from the Quidditch World Cup campsite to a heart-stopping duel with Lord Voldemort himself. Harry, Ron, and Hermione are all playable characters, modeled after their big-screen counterparts. In this game, an all-new spell-casting system allows players to feel the magic for the first time as the controller shakes and reacts with every flick of the wand. Players can also team up with friends in co-operative play to combine their magic and produce more powerful spells than ever before. [Electronic Arts]… Expand"}, {"name": "Trivial Pursuit", "details_link": "https://www.metacritic.com/game/xbox-360/trivial-pursuit", "publisher": "Electronic Arts", "release_date": "Mar 10 2009", "developers": ["EA Bright Light"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/6addc49b7efe7f272e704ecd7fa50aae-98.jpg", "descriptions": "The console version of Trivial Pursuit brings the party to the living room TV allowing players to customize the experience with several ways to play. Players can connect with friends in classic Trivial Pursuit mode, hone their knowledge with the single player mode, and gather their buddiesThe console version of Trivial Pursuit brings the party to the living room TV allowing players to customize the experience with several ways to play. Players can connect with friends in classic Trivial Pursuit mode, hone their knowledge with the single player mode, and gather their buddies and bet on their brains with the high stakes mode where every answer counts. [Electronic Arts]… Expand"}, {"name": "Tokobot Plus: Mysteries of the Karakuri", "details_link": "https://www.metacritic.com/game/playstation-2/tokobot-plus-mysteries-of-the-karakuri", "publisher": "Tecmo", "release_date": "Oct 24 2006", "developers": ["Tecmo"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 66, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/05c623e3b250834b586a7d052220e194-98.jpg", "descriptions": "Welcome to the Tokobot Revolution! Control a whole team of Tokobots to help you on your quest. Master the Karakuri combination and send them into OVERDRIVE, turning your Tokobots into the ultimate weapons ilke the Samurai Hover, Mega Hammer, or SuperTank. 10 new stages specially designed andWelcome to the Tokobot Revolution! Control a whole team of Tokobots to help you on your quest. Master the Karakuri combination and send them into OVERDRIVE, turning your Tokobots into the ultimate weapons ilke the Samurai Hover, Mega Hammer, or SuperTank. 10 new stages specially designed and created for the PS2 with a Treasure Hunting mini-game that allows for the purchase of Tokobot and Bolt power upgrades. New characters, such as an \"Instructor,\" and a rival character among others, creating a more dramatic and entertaining extension to the original Tokobot adventure. Over 30 different types of enemies with 16 boss enemies creating havoc in the ruins. (10 from the original PSP system version and 6 exclusive to the PS2.) Time Attack Mode: Unlock the Time Attach mode and replay your favorite stages while discovering rare treasures only found while in this mode. [Tecmo]… Expand"}, {"name": "Ninja Gaiden Sigma 2 Plus", "details_link": "https://www.metacritic.com/game/playstation-vita/ninja-gaiden-sigma-2-plus", "publisher": "Tecmo Koei America Corp.", "release_date": "Feb 26 2013", "developers": ["Team Ninja"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 66, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/755242228254f4dddc4812494e849a75-98.jpg", "descriptions": "NINJA GAIDEN SIGMA 2 PLUS brings the most intense, action-packed ninja adventure to PS Vita with stunning graphics, new modes, and plenty of blood. In the game, Ryu Hayabusa, the iconic super ninja of the Ninja Gaiden franchise, returns to the Sigma series to prevent the resurrection of theNINJA GAIDEN SIGMA 2 PLUS brings the most intense, action-packed ninja adventure to PS Vita with stunning graphics, new modes, and plenty of blood. In the game, Ryu Hayabusa, the iconic super ninja of the Ninja Gaiden franchise, returns to the Sigma series to prevent the resurrection of the evil Archfiend by hunting down the Demon Statue stolen by the wicked Black Spider Ninja Clan. Players will battle from Tokyo to New York as Ryu encounters vicious enemies and acquires an extensive assortment of ninja weaponry along the way. The action lights up the Vita's impressive OLED screen with graphical quality exceeding the original Ninja Gaiden Sigma Plus. An intuitive control system uses the front and rear touch screens and motion controls of the PS Vita, and new players will appreciate the inclusion of Hero Mode, which automatically boosts their attacks when their health is low. New modes include \"Ninja Race,\" where players compete with enemies at breakneck speed to reach the end goal, and \"Tag Mission,\" in which players can switch between two ninjas in real-time while defending the AI-controlled partner.… Expand"}, {"name": "Rotastic", "details_link": "https://www.metacritic.com/game/xbox-360/rotastic", "publisher": "Focus Home Interactive", "release_date": "Sep 21 2011", "developers": ["Dancing Dots"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/d744a0b6f8c161681982b7a24c79b6b4-98.jpg", "descriptions": "Rotastic is an addictive 2D arcade/puzzle game developed by Dancing Dots and published by Focus Home Interactive, coming soon to Xbox LIVE Arcade, PlayStation Network and PC. Offering accessible, innovative gameplay and a huge dose of fun, Rotastic does not take itself too seriously.Rotastic is an addictive 2D arcade/puzzle game developed by Dancing Dots and published by Focus Home Interactive, coming soon to Xbox LIVE Arcade, PlayStation Network and PC. Offering accessible, innovative gameplay and a huge dose of fun, Rotastic does not take itself too seriously. Discover Rotastic today with the very first images of the game. Players can also visit the official website for gameplay information, exclusive images, the official forums and more!… Expand"}, {"name": "Barnyard", "details_link": "https://www.metacritic.com/game/gamecube/barnyard", "publisher": "THQ", "release_date": "Aug  1 2006", "developers": ["Blue Tongue Entertainment"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 66, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/88c09266d3b4dc24d853769540ad95b4-98.jpg", "descriptions": "Bring the Barnyard movie to life! Battle the coyote invaders, tee up for a game of golf, target the bulls eye with your flying chicken and race downhill on your speedy bike. Explore a fully interactive, 3D world and prove they have what it takes to be the biggest party animal of them all."}, {"name": "Mega Man Battle Network 5: Team Colonel", "details_link": "https://www.metacritic.com/game/game-boy-advance/mega-man-battle-network-5-team-colonel", "publisher": "Capcom", "release_date": "Jun 21 2005", "developers": ["Capcom"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/4ec1987bac0457aa41276c8cfbe2dc5e-98.jpg", "descriptions": "Team Colonel is the second edition of Mega Man Battle Network 5. In the game, you can join forces with characters from previous installments of the Mega Man Battle series, and you can play in a new fighting mode. Team up with other cyberheroes in an effort to stop an evil organization fromTeam Colonel is the second edition of Mega Man Battle Network 5. In the game, you can join forces with characters from previous installments of the Mega Man Battle series, and you can play in a new fighting mode. Team up with other cyberheroes in an effort to stop an evil organization from taking control of the global Internet.… Expand"}, {"name": "Strike Suit Zero", "details_link": "https://www.metacritic.com/game/pc/strike-suit-zero", "publisher": "Born Ready Games", "release_date": "Jan 23 2013", "developers": ["Born Ready Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/817df5e4ecee7662faacd66ecc64bf6a-98.jpg", "descriptions": "Strike Suit Zero is an action-packed arcade game set in the final hours of a future Earth.  The clock is ticking; your planet is about to be destroyed and its only hope is the Strike Suit; an advanced, transforming spacecraft that empowers the player with ludicrous firepower and awesomeStrike Suit Zero is an action-packed arcade game set in the final hours of a future Earth.  The clock is ticking; your planet is about to be destroyed and its only hope is the Strike Suit; an advanced, transforming spacecraft that empowers the player with ludicrous firepower and awesome abilities. Every second is precious; you’ll be forced to fight with fury, choose targets on instinct and make snap decisions that will not only affect the outcome of your mission but your path through the game and the ultimate destiny of seven billion lives.… Expand"}, {"name": "Burnout Crash!", "details_link": "https://www.metacritic.com/game/xbox-360/burnout-crash!", "publisher": "Electronic Arts", "release_date": "Sep 21 2011", "developers": ["Criterion Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Driving", "Car Combat", "Arcade", "Car Combat"], "meta_score": 66, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/1da10b5429704497e4a0f1ed040d8024-98.jpg", "descriptions": "This is an action game in which players earn points for creating traffic pileups. From a top-down perspective, players initiate crashes by driving 'cartoony' vehicles (e.g., cars, trucks, vans, buses) into busy intersections; multiple crashes trigger score multipliers and rack up largeThis is an action game in which players earn points for creating traffic pileups. From a top-down perspective, players initiate crashes by driving 'cartoony' vehicles (e.g., cars, trucks, vans, buses) into busy intersections; multiple crashes trigger score multipliers and rack up large 'bills' of property damage. Each level is accompanied by crashing sounds, small explosions, and vocal encouragement (e.g., 'Cool,' 'Maximum Carnage!'). In some levels, players are instructed to crash into police cars (e.g., 'Crash them before they bust you!'); in other sequences, oversized airplanes, tornados, lobster monsters, and UFOs slide across the screen, destroying any vehicles in their path.… Expand"}, {"name": "Wolfenstein: Youngblood", "details_link": "https://www.metacritic.com/game/switch/wolfenstein-youngblood", "publisher": "Bethesda Softworks", "release_date": "Jul 26 2019", "developers": ["Panic Button", "MachineGames"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 66, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/4/7674c581c46b548450fa367ff12918a8-98.jpg", "descriptions": "Wolfenstein®: Youngblood is a brand-new co-op experience from MachineGames, the award-winning studio that developed the critically acclaimed Wolfenstein® II: The New Colossus.Set in 1980, 19 years after BJ Blazkowicz ignited the second American Revolution, Wolfenstein®: YoungbloodWolfenstein®: Youngblood is a brand-new co-op experience from MachineGames, the award-winning studio that developed the critically acclaimed Wolfenstein® II: The New Colossus.Set in 1980, 19 years after BJ Blazkowicz ignited the second American Revolution, Wolfenstein®: Youngblood introduces the next Blazkowicz generation to the fight against the Nazis. Play as one of BJ's twin daughters, Jess and Soph, as you search for your missing father in Nazi-occupied Paris.… Expand"}, {"name": "Oceanhorn: Monster of Uncharted Seas", "details_link": "https://www.metacritic.com/game/playstation-4/oceanhorn-monster-of-uncharted-seas", "publisher": "Cornfox & Bros.", "release_date": "Sep  7 2016", "developers": ["Cornfox & Bros."], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 66, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/4a2487a4326a27017d009adabd5087d5-98.jpg", "descriptions": "You wake up and find a letter from your father. He is gone The only lead is his old notebook and a mysterious necklace. What happened? Oceanhorn: Monster of Uncharted Seas is an epic action-adventure experience. In the game you explore the islands of Uncharted Seas, a world filled with manyYou wake up and find a letter from your father. He is gone The only lead is his old notebook and a mysterious necklace. What happened? Oceanhorn: Monster of Uncharted Seas is an epic action-adventure experience. In the game you explore the islands of Uncharted Seas, a world filled with many dangers, puzzles and secrets. You must fight monsters, learn to use magic and discover ancient treasures, which will help you on your quest. Use all of your wits and skill to unravel the mysteries of the ancient kingdom of Arcadia and the sea monster, Oceanhorn.… Expand"}, {"name": "The Black Eyed Peas Experience", "details_link": "https://www.metacritic.com/game/xbox-360/the-black-eyed-peas-experience", "publisher": "Ubisoft", "release_date": "Nov  8 2011", "developers": ["iNiS"], "platforms": "Xbox 360", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 66, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/79d8f4fdaab8a4950854edc8cffb1962-98.jpg", "descriptions": "Ubisoft is making a rhythm game based on and featuring the likenesses of the pop-rap group the Black Eyed Peas."}, {"name": "Karaoke Revolution", "details_link": "https://www.metacritic.com/game/playstation-3/karaoke-revolution", "publisher": "Konami", "release_date": "Nov 24 2009", "developers": ["Blitz Games Studios"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/a764280449e88e668c958c4aec12ccad-98.jpg", "descriptions": "Transforming video game consoles into a high-end interactive karaoke machine, Karaoke Revolution's expanded multiplayer modes allows players to throw karaoke parties with their friends where they can perform as teams or choose to play in the single player career mode. If you just want toTransforming video game consoles into a high-end interactive karaoke machine, Karaoke Revolution's expanded multiplayer modes allows players to throw karaoke parties with their friends where they can perform as teams or choose to play in the single player career mode. If you just want to hear your favorite songs in succession, create a playlist and whenever you're ready to perform, pick up the microphone and jump in at anytime! Players can join together on a wide variety of contemporary hits and classic favorites from licensed master recordings. Additionally, those using either the Xbox 360 or the Playstation 3 can utilize the co-op Party Mode with multiple game modes for up to 16 players or battle with or against each other in the ultimate competition. Also new to this year's version is the custom venue and custom character creators which allow singers to design and personalize their venues and characters in ways that will catch the attention of the crowd. Karaoke Revolution also offers singers to almost create  a virtual representation of themselves with the abundance of character customization and record themselves with the Xbox LIVE Vision Camera or the Playstation Eye to incorporate themselves right on screen inside their custom venues! Additionally, Xbox 360 and PS3 gamers can also select and download licensed master tracks, share exclusive venues and additional clothing and accessories. Like all versions from this acclaimed franchise, Karaoke Revolution features a proprietary voice recognition technology which accurately recognizes and scores vocal pitch and rhythm. Real-time feedback is offered by the dynamic crowds that fill each virtual venue. The game comes packaged with a microphone for players to be ready to perform. [Konami]… Expand"}, {"name": "Smurfs Kart", "details_link": "https://www.metacritic.com/game/switch/smurfs-kart", "publisher": "Microids", "release_date": "Nov 15 2022", "developers": ["Eden Games Mobile"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/734cb7774093033435767b9df7eed4f9-98.jpg", "descriptions": "It's time to heat up your engines! Choose your Smurf - each one having their own kart and unique ability - and take part in wild races.Start off strong, find shortcuts, use the right items at the right time to pass your opponents and become the village's best kart driver!\n\nPlay solo orIt's time to heat up your engines! Choose your Smurf - each one having their own kart and unique ability - and take part in wild races.Start off strong, find shortcuts, use the right items at the right time to pass your opponents and become the village's best kart driver!Play solo or with friends and family, should you be a beginner or the most trained driver... get the pole position and show others who is the fastest Smurf of all time!… Expand"}, {"name": "Sackboy's Prehistoric Moves", "details_link": "https://www.metacritic.com/game/playstation-3/sackboys-prehistoric-moves", "publisher": "SCEA", "release_date": "Dec 14 2010", "developers": ["Media Molecule"], "platforms": "PlayStation 3", "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 66, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/fbfd2d4efa33c998a1a55aaeb4c86dfe-98.jpg", "descriptions": "A brand new spin-off PSN title that gives a taste of the fun that can happen when Sackboy gets his hands on the PlayStation Move motion controller."}, {"name": "F1 2011", "details_link": "https://www.metacritic.com/game/playstation-vita/f1-2011", "publisher": "Codemasters", "release_date": "Feb 15 2012", "developers": ["Codemasters"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360", "PlayStation Vita"], "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/4928a89ad414e3258d03cd73ce34fc0a-98.jpg", "descriptions": "Compete on the go with F1 2011 The official game of FORMULA ONE includes all the cars, stars and circuits from the 2011 FIA FORMULA ONE WORLD CHAMPIONSHIP. Go for motorsport's ultimate prize across a full season, enter individual GRAND PRIX, or get a quick FORMULA ONE fix with Time TrialsCompete on the go with F1 2011 The official game of FORMULA ONE includes all the cars, stars and circuits from the 2011 FIA FORMULA ONE WORLD CHAMPIONSHIP. Go for motorsport's ultimate prize across a full season, enter individual GRAND PRIX, or get a quick FORMULA ONE fix with Time Trials and Challenge mode. Then race sport's fastest racing cars in F1 2011's multiplayer modes including four player races and an innovative 2 vs. 2 co-op mode. [Sony]… Expand"}, {"name": "Transformers: Revenge of the Fallen - Decepticons", "details_link": "https://www.metacritic.com/game/ds/transformers-revenge-of-the-fallen---decepticons", "publisher": "Activision", "release_date": "Jun 23 2009", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Action", "Adventure", "Shooter", "Beat-'Em-Up", "Sci-Fi", "Sci-Fi", "Third-Person", "3D", "Arcade"], "meta_score": 66, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/2/f859993cb97c42ab37f3354cf1062a1c-98.jpg", "descriptions": "The fate of the earth and the survival of the human race hang in the balance in Transformers: Revenge of the Fallen: AUTOBOTS and Transformers: Revenge of the Fallen: DECEPTICONS for the Nintendo DS. Gamers get to choose to protect the earth as AUTOBOTS or destroy it as DECEPTICONS,The fate of the earth and the survival of the human race hang in the balance in Transformers: Revenge of the Fallen: AUTOBOTS and Transformers: Revenge of the Fallen: DECEPTICONS for the Nintendo DS. Gamers get to choose to protect the earth as AUTOBOTS or destroy it as DECEPTICONS, embarking on a journey where every second and every choice makes the difference between mankind’s salvation and annihilation. Take On TRANSFORMERS from Around the Globe - Nintendo Wi-Fi Connection allows players to help their side win the epic battle by engaging in global \"AUTOBOT vs. DECEPTICON\" competitions through downloadable challenge missions. Play as Your Own Personalized TRANSFORMERS Robot - For the first time, players can customize their own TRANSFORMERS robot with a modular body part system. Throughout the game, players have the ability to scan objects to unlock new parts and upgrade their character by installing new unlockable parts in the Medical Bay as they progress through the game. Diverse Missions and Locales - Players will drive, fly and fight their way through over 25 single player levels across different world locations as they fight to decide the fate of the human race as the AUTOBOTS or DECEPTICONS. Battle With Friends - Players can challenge friends to intense, head-to-head battles through local wireless multiplayer in Deathmatch mode. [Activision]… Expand"}, {"name": "Kingdom Hearts Re:coded", "details_link": "https://www.metacritic.com/game/ds/kingdom-hearts-recoded", "publisher": "Square Enix", "release_date": "Jan 11 2011", "developers": ["Square Enix", "h.a.n.d. Inc."], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 66, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/19e581b26bc847d7877b3912f67e422b-98.jpg", "descriptions": "Sora's journey in KINGDOM HEARTS II has drawn to a close, and now a new tale is set to begin.Jiminy Cricket is looking over the journal he used to document his first adventure with Sora when he discovers a mysterious message. He didn't write it - so how on earth did it get there? King MickeySora's journey in KINGDOM HEARTS II has drawn to a close, and now a new tale is set to begin.Jiminy Cricket is looking over the journal he used to document his first adventure with Sora when he discovers a mysterious message. He didn't write it - so how on earth did it get there? King Mickey is determined to find out, so he and his friends decide to digitize the journal and delve into its deepest secrets. Inside this \"datascape\" dwells a second Sora who is about to embark on a grand adventure of his very own.… Expand"}, {"name": "Monopoly Streets", "details_link": "https://www.metacritic.com/game/xbox-360/monopoly-streets", "publisher": "Electronic Arts", "release_date": "Oct 26 2010", "developers": ["Electronic Arts"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/a64a395fa8d87c36a289b1e06e28fa72-98.jpg", "descriptions": "To celebrate its 75th anniversary, the world of Monopoly comes to life through a living, breathing city that you can build, own, and monopolize. MONOPOLY STREETS has everything you love about the board game, presented as a street level tour of Mr. Monopoly's fully animated world."}, {"name": "Pac-Man World 3", "details_link": "https://www.metacritic.com/game/gamecube/pac-man-world-3", "publisher": "Namco", "release_date": "Nov 17 2005", "developers": ["Blitz Games"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "24  Online", "genres": ["Action", "Platformer", "3D"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/030638db612fa583d04c84341e09f16c-98.jpg", "descriptions": "The classic gaming character Pac-Man is back for the third iteration of the Pac-Man World series. The game features the classic Pac-Man powers and adds a few new abilities--such as superstomp and electric shock--to assist the yellow-ball-like hero against his ghost foes. You will also beThe classic gaming character Pac-Man is back for the third iteration of the Pac-Man World series. The game features the classic Pac-Man powers and adds a few new abilities--such as superstomp and electric shock--to assist the yellow-ball-like hero against his ghost foes. You will also be able to take control of two different ghost characters. The game takes place in both 2D and 3D and includes the original Pac-Man arcade game. … Expand"}, {"name": "Superstars V8 Racing", "details_link": "https://www.metacritic.com/game/playstation-3/superstars-v8-racing", "publisher": "O-Games", "release_date": "Oct 26 2010", "developers": ["Milestone S.r.l"], "platforms": "PlayStation 3", "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 66, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/c75029b1d63a5f0acad6425e002e36e7-98.jpg", "descriptions": "Get back to 4 wheels and test your skills with V8 engines for the next racing challenge! Superstars V8 Racing is based on the license of the car racing Italian Championship that Black Bean Games has signed off with Superstars International Development. Powered by some of the most importantGet back to 4 wheels and test your skills with V8 engines for the next racing challenge! Superstars V8 Racing is based on the license of the car racing Italian Championship that Black Bean Games has signed off with Superstars International Development. Powered by some of the most important car manufacturers in the whole world, such as BMW, Audi and Jaguar, and sporting top class production cars it delivers a breathtaking driving experience.\rSuperstars V8 Racing offers the utmost realistic impression of the Championship. From car design to technical engine features, from the setting of the races to the turns of the tracks, everything has been designed in great detail. Every single car behaves in a complete different way accordingly to its real technical features and the settings tuned by each team competing for the title in order to get the best performance out of the powerful engine. \rGame play mode variety is enriched by each own cars' peculiarity and it can be appreciated for the pick up'n play game mechanics, thought for the casual gamers, as well as for the top notch quality of the most experienced ones. [Black Bean Games]… Expand"}, {"name": "Monster Truck Championship", "details_link": "https://www.metacritic.com/game/xbox-one/monster-truck-championship", "publisher": "Maximum Games", "release_date": "Oct 20 2020", "developers": ["Teyon"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Simulation", "Vehicle", "Civilian"], "meta_score": 66, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/6417e674c9f0bac64976be5eff9a62ab-98.jpg", "descriptions": "From Las Vegas to Orlando, go head-to-head against experienced drivers in drag races and freestyle competitions. But, before you can pull off donuts, wheelies, and bicycles, you must first tune your truck to perfection. These machines are spectacular and impressive, yet highly technical toFrom Las Vegas to Orlando, go head-to-head against experienced drivers in drag races and freestyle competitions. But, before you can pull off donuts, wheelies, and bicycles, you must first tune your truck to perfection. These machines are spectacular and impressive, yet highly technical to drive. The game faithfully reproduces all the unique demands of mastering these powerful trucks, including independent front and rear-wheel management, mass transfer anticipation in bends, and predicting bounces after jumps. … Expand"}, {"name": "Warborn", "details_link": "https://www.metacritic.com/game/switch/warborn", "publisher": "PQube", "release_date": "Jun 12 2020", "developers": ["Raredrop Games Ltd"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/8b87d6140d9fc5304aaaace7bd80a1d6-98.jpg", "descriptions": "RISE UP - Rise up and deploy for battle in the Variable Armour, a technologically advanced suit of war. As the political climate between factions is thrown out of balance and the solar system is engulfed in conflict, lead your strike force of deadly mecha towards victory in turn-basedRISE UP - Rise up and deploy for battle in the Variable Armour, a technologically advanced suit of war. As the political climate between factions is thrown out of balance and the solar system is engulfed in conflict, lead your strike force of deadly mecha towards victory in turn-based tactical combat. … Expand"}, {"name": "Riverbond", "details_link": "https://www.metacritic.com/game/playstation-4/riverbond", "publisher": "Cococucumber", "release_date": "Jun  9 2019", "developers": ["Cococucumber"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 66, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/8a59652fbd3bc2f0fa98526869f75b28-98.jpg", "descriptions": "The Knight has imprisoned the leaders of the Eight Worlds, causing chaos, droughts and disarray! Adventure together to defeat evil and help the charming citizens of Riverbond in this action-packed journey through beautiful, hand-crafted worlds."}, {"name": "Naruto to Boruto: Shinobi Striker", "details_link": "https://www.metacritic.com/game/pc/naruto-to-boruto-shinobi-striker", "publisher": "Bandai Namco Games", "release_date": "Aug 30 2018", "developers": ["CyberConnect2", "Soleil", "Soleil Ltd."], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 66, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/d30a2a3786eb518655089c00a3d523dd-98.jpg", "descriptions": "The Naruto franchise is back with a brand new experience in Naruto to Boruto: Shinobi Striker! This new game lets gamers battle as a team of 4 to compete against other teams online! Graphically, Shinobi Striker is also built from the ground up in a completely new graphic style. Lead yourThe Naruto franchise is back with a brand new experience in Naruto to Boruto: Shinobi Striker! This new game lets gamers battle as a team of 4 to compete against other teams online! Graphically, Shinobi Striker is also built from the ground up in a completely new graphic style. Lead your team and fight online to see who the best ninjas are!FEATURES:* 4 vs. 4 team based gameplay with 8 ninjas fighting simultaneously; play co-op with your friends to become the best ninjas online.* Enjoy a new graphic style with more vivid colors for characters, maps and ninjutsu.* Dynamic 3rd person ninja gameplay lets players take advantage of an arena environment with vertical running and jumping.* Features favorite Naruto characters and teams from the series including Naruto, Sasuke, and Team 7.… Expand"}, {"name": "FOX n FORESTS", "details_link": "https://www.metacritic.com/game/switch/fox-n-forests", "publisher": "Bonus Level Entertainment", "release_date": "May 17 2018", "developers": ["Bonus Level Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/dec22889e63068aec660e673561fe0eb-98.jpg", "descriptions": "Shoot, slash, switch and snatch to unveil the mystery of the 5th season in the most retrotaining 16-Bit action platformer ever to be made…"}, {"name": "Nights of Azure 2: Bride of the New Moon", "details_link": "https://www.metacritic.com/game/switch/nights-of-azure-2-bride-of-the-new-moon", "publisher": "Koei Tecmo Games", "release_date": "Oct 24 2017", "developers": ["Gust"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/d8670b8268110b84051a7c3867752e67-98.jpg", "descriptions": "Standalone sequel to the gothic fairy tale action RPG from developer GUST Studios, Nights of Azure, is now available in Western territories as Nights of Azure 2: Bride of the New Moon. Introducing a new and colorful cast featuring; Alushe Anatoria, Liliana Selphin and Ruhenheid AriarodStandalone sequel to the gothic fairy tale action RPG from developer GUST Studios, Nights of Azure, is now available in Western territories as Nights of Azure 2: Bride of the New Moon. Introducing a new and colorful cast featuring; Alushe Anatoria, Liliana Selphin and Ruhenheid Ariarod alongside a first look at the demon-ridden setting where their narrative unfolds. Step into this story with the knight protector Alushe and uncover the shocking truth behind the mysterious Queen of the Moon.\r… Expand"}, {"name": "Bounty Train", "details_link": "https://www.metacritic.com/game/pc/bounty-train", "publisher": "Daedalic Entertainment", "release_date": "May 16 2017", "developers": ["Corbie Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Vehicle", "Train"], "meta_score": 66, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/bd3521dff0017a13391a2843f43f2ac8-98.jpg", "descriptions": "Simulation-tactics roguelike RPG about railroad in the US"}, {"name": "Unepic", "details_link": "https://www.metacritic.com/game/playstation-4/unepic", "publisher": "A Crowd of Monsters", "release_date": "Mar 29 2016", "developers": ["A Crowd of Monsters"], "platforms": ["PC", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PlayStation 4"], "genres": ["Action", "Role-Playing", "Platformer", "Action RPG", "2D"], "meta_score": 66, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/6952ca7cd67ef346c62b48bb4741df17-98.jpg", "descriptions": "Unepic is a combination of platforming and role playing games. There are many hilarious references throughout the game. The game takes place in Harnakon, a huge medieval castle.\r It is set in the hardcore NES Style, yet refined with the latest features. This makes Unepic a very unique game."}, {"name": "Adventure Time: Finn and Jake Investigations", "details_link": "https://www.metacritic.com/game/xbox-one/adventure-time-finn-and-jake-investigations", "publisher": "Little Orbit", "release_date": "Oct 20 2015", "developers": ["Vicious Cycle"], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One"], "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 66, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/31fc1be2eb75bf747867f41e1d81d72f-98.jpg", "descriptions": "Adventure Time: Finn and Jake Investigations is an all-new, real-time, fully 3D action-oriented twist on the classic story-driven graphic adventure game.  Finn and Jake decide to carry on the profession of Finn's foster parents, who were Professional Investigators.  Confronted withAdventure Time: Finn and Jake Investigations is an all-new, real-time, fully 3D action-oriented twist on the classic story-driven graphic adventure game.  Finn and Jake decide to carry on the profession of Finn's foster parents, who were Professional Investigators.  Confronted with mysterious Land of Ooo disappearances and strange events, players will interrogate colorful inhabitants, dispatch evil doers in fast-paced combat, solve mind-bending puzzles, explore new and familiar locations, and genuinely feel as if they have stepped into their own personal episode of Adventure Time.… Expand"}, {"name": "Citizens of Earth", "details_link": "https://www.metacritic.com/game/pc/citizens-of-earth", "publisher": "Atlus", "release_date": "Jan 20 2015", "developers": ["Eden Industries"], "platforms": ["3DS", "PlayStation 4", "PlayStation Vita", "Wii U", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Japanese-Style"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/dca543a11bbdccccbe0f6b1d7bcedce7-98.jpg", "descriptions": "In Citizens of Earth take on the role of the vice president, where you return to the hometown of our \"hero\", only to uncover strange things are afoot."}, {"name": "A.R.E.S. Extinction Agenda EX", "details_link": "https://www.metacritic.com/game/xbox-360/ares-extinction-agenda-ex", "publisher": "Aksys Games", "release_date": "Oct  2 2013", "developers": ["ORiGO GAMES"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "2D", "3D", "2D"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/39b424604d0085cacf40fb166bbcfaef-98.jpg", "descriptions": "In the year 2060 Earth has reached the stars, during that time an alliance was formed with a Robotic Alien race which the humans call Atzai. The Atzai gave humans the means to end the pollution plaguing their planet by building the Minos Space Station, which the waste of Earth is used toIn the year 2060 Earth has reached the stars, during that time an alliance was formed with a Robotic Alien race which the humans call Atzai. The Atzai gave humans the means to end the pollution plaguing their planet by building the Minos Space Station, which the waste of Earth is used to form efficient forms of energy for space travel. For once Earth was at peace, and a strong bond forged between Human and Machine. However not all Atzai agreed with helping the warmonger human race, and slowly rebel factions formed inside the Atzai ranks.\r \rNow the year is 2094 and the rebel faction Leader Zytron has attacked and taken control of all the machines onboard the Minos station. Atzai Command receives a distress call from Dr. Julia Carson a chief engineer revealing that there are still survivors on board at that Zytron has a secret Extinction Agenda for mankind. Atzai Command sends their best option to infiltrate and retake Minos from enemy hands, with the priority of saving the hostages at all cost.\r \rTake control of Ares and newcomer Taurus for two separate story arcs, and uncover the conspiracy behind Zytron's invasion of Minos Station.\r \rAres is a combat specialist built to run faster, jump higher, and fire quicker. And Taurus who is a battle veteran built for giving and taking damage with his tank like body. Together with their orbital handler Valkyl, they must race against the clock to save the survivors and stop Zytron's Extinction Agenda at any cost.… Expand"}, {"name": "Ghost Pirates of Vooju Island", "details_link": "https://www.metacritic.com/game/pc/ghost-pirates-of-vooju-island", "publisher": "THQ", "release_date": "Aug 30 2010", "developers": ["Autumn Moon"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Point-and-Click", "First-Person", "Sci-Fi", "Sci-Fi"], "meta_score": 66, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/98f93bede93866e2dfb4fb894b741073-98.jpg", "descriptions": "Explore beautifully hand-painted locations and get acquainted with a cast of salty sea dogs as the story unfolds with hilarious tongue-in-cheek twists and turns."}, {"name": "Air Traffic Chaos", "details_link": "https://www.metacritic.com/game/ds/air-traffic-chaos", "publisher": "Majesco Games", "release_date": "Sep  9 2008", "developers": ["Sonic Powered"], "platforms": "DS", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 66, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/f83b939a165a226bee372045c2eee36e-98.jpg", "descriptions": "Do you have the nerves to be an air traffic controller and manage a myriad of takeoffs and landings at once?  Find out in Air Traffic Chaos, the new management simulation where you are solely responsible for directing tons of airplane steel and the passengers within. It will take a sharpDo you have the nerves to be an air traffic controller and manage a myriad of takeoffs and landings at once?  Find out in Air Traffic Chaos, the new management simulation where you are solely responsible for directing tons of airplane steel and the passengers within. It will take a sharp memory and smooth sense of control to get these massive vessels on and off the ground safely. [Majesco]… Expand"}, {"name": "Heroes of Mana", "details_link": "https://www.metacritic.com/game/ds/heroes-of-mana", "publisher": "Square Enix", "release_date": "Aug 14 2007", "developers": ["Brownie Brown"], "platforms": "DS", "num_players": "2 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/a95084c6e0dfe86e0d322f6420866baf-98.jpg", "descriptions": "Breathing new life into the vaunted Mana franchise, Heroes of Mana takes the series into an entirely new dimension. Generals plan, plot and strategize their way to victory on the battlefield. Command an army of heroes, creatures and beloved rabites with the use of the Nintendo DS TouchBreathing new life into the vaunted Mana franchise, Heroes of Mana takes the series into an entirely new dimension. Generals plan, plot and strategize their way to victory on the battlefield. Command an army of heroes, creatures and beloved rabites with the use of the Nintendo DS Touch Screen, and experience an all-new perspective on the ever-evolving battle for the Mana Tree. Skilled players can see how they rank among other players around the world through the Nintendo Wi-Fi ranking system. [Square Enix]… Expand"}, {"name": "Sonic Heroes", "details_link": "https://www.metacritic.com/game/pc/sonic-heroes", "publisher": "Sega", "release_date": "Nov 17 2004", "developers": ["Sonic Team"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/4a7ad984742a462ece791772c6773ca8-98.jpg", "descriptions": "In Sonic's most exciting adventure yet, you maneuver a team of three Sonic characters through massive levels to overcome the ultimate evil! You guessed it, Dr. Eggman is on the loose once again, but this time he'll have to take on three powerful characters at once. Whether he's trying toIn Sonic's most exciting adventure yet, you maneuver a team of three Sonic characters through massive levels to overcome the ultimate evil! You guessed it, Dr. Eggman is on the loose once again, but this time he'll have to take on three powerful characters at once. Whether he's trying to outrun Sonic, or dodge Knuckles punches, he'll have plenty to contend with. All twelve characters have unique strengths that you'll take full advantage of to get your team through the course at full speed. Whether you choose Team Sonic, Team Dark, Team Rose, or Team Chaotix, you'll be off on a wild journey filled with challenging missions unique to each team. [Sega]… Expand"}, {"name": "Pitfall: The Lost Expedition", "details_link": "https://www.metacritic.com/game/game-boy-advance/pitfall-the-lost-expedition", "publisher": "Activision", "release_date": "Feb 18 2004", "developers": ["Torus Games"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/fcf472bd7e12b6075ac2ae818385ef65-98.jpg", "descriptions": "Delving deep in the Peruvian Jungle, you assume the role of Pitfall Harry--a fearless, rough-and-ready treasure seeker who battles evil using his athletic ability and a knapsack filled with adventure gear.  Your mission: Race against a rival explorer to find hidden treasures, which couldDelving deep in the Peruvian Jungle, you assume the role of Pitfall Harry--a fearless, rough-and-ready treasure seeker who battles evil using his athletic ability and a knapsack filled with adventure gear.  Your mission: Race against a rival explorer to find hidden treasures, which could spell doom for you and your friends if they fall into the wrong hands.  The game challenges you to explore an obstacle-filled world featuring over 50 perilous levels, including lush rainforests, creature-ridden caves and vast glacial mountains.  You'll be swinging on vines, avoiding crocodiles and dodging rolling logs as you unearth artifacts and use your cunning to defeat dangerous foes.  … Expand"}, {"name": "AirForce Delta Strike", "details_link": "https://www.metacritic.com/game/playstation-2/airforce-delta-strike", "publisher": "Konami", "release_date": "Feb  3 2004", "developers": ["KCE Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Flight", "Modern Jet"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/7a19b946e29c0ca385cad8519873ecdd-98.jpg", "descriptions": "(Also known as \"Airforce Delta Blue Wing Knights\") Strap in and take off. The latest addition to the successful AirForce Delta franchise flies onto the Sony PlayStation®2 Entertainment System with AirForce Delta Strike. Join a cast of highly skilled pilots and get lost in this gripping(Also known as \"Airforce Delta Blue Wing Knights\") Strap in and take off. The latest addition to the successful AirForce Delta franchise flies onto the Sony PlayStation®2 Entertainment System with AirForce Delta Strike. Join a cast of highly skilled pilots and get lost in this gripping universe with multiple endings and non-stop action. AFDS flies into uncharted territory with its unique brand of action flight combat, interplanetary missions, compelling characters and intense futuristic storyline. [Konami]… Expand"}, {"name": "Crash Nitro Kart", "details_link": "https://www.metacritic.com/game/gamecube/crash-nitro-kart", "publisher": "VU Games", "release_date": "Nov 11 2003", "developers": ["Vicarious Visions"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 66, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/278eff0418c1ab7d9772b373d4b71a8c-98.jpg", "descriptions": "Crash hits the track in his fastest adventure yet--Crash Nitro Kart.  Kidnapped by the ruthless Emperor Velo and forced to race in his galactic coliseum, Crash must race his way to victory in order to save the Earth from destruction--but it won't be easy, as he must compete against foes bothCrash hits the track in his fastest adventure yet--Crash Nitro Kart.  Kidnapped by the ruthless Emperor Velo and forced to race in his galactic coliseum, Crash must race his way to victory in order to save the Earth from destruction--but it won't be easy, as he must compete against foes both old and new before a final showdown with Velo himself.  Crash Nitro Kart mixes 18 rollercoaster raceways, devastating weapons, a variety of single and multiplayer modes and maps, and customizable arenas, and a cast of unique characters into a game that showcases kart-racing at its best.… Expand"}, {"name": "American Conquest: Fight Back", "details_link": "https://www.metacritic.com/game/pc/american-conquest-fight-back", "publisher": "cdv Software", "release_date": "Sep 29 2003", "developers": ["GSC Game World"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "Historic", "Command"], "meta_score": 66, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/9e214cae6fdacc973e85955e4595e331-98.jpg", "descriptions": "Three centuries of war continue - with even more frantic combat and more desperate power struggles raging across the American continent. The Spanish sound the attack on Yucatan amidst fierce Maya and Aztec resistance. The Germans put all their efforts into finding the legendary Eldorado. TheThree centuries of war continue - with even more frantic combat and more desperate power struggles raging across the American continent. The Spanish sound the attack on Yucatan amidst fierce Maya and Aztec resistance. The Germans put all their efforts into finding the legendary Eldorado. The Pontiac Uprising ends in a terrifying bloodbath between Native Americans and the British. And the Russians will do anything to conquer Alaska at the cost of the Haida. There is a fantastic bonus for shrewd strategists: the great new \"battlefield\" mode in single-player and multiplayer modes! Tactical skill alone will determine victory or defeat in single-player and multiplayer games. So, plunge into battle! [CDV Software]… Expand"}]