[{"name": "The King's Bird", "details_link": "https://www.metacritic.com/game/pc/the-kings-bird", "publisher": "Serenity Forge", "release_date": "Aug 23 2018", "developers": ["Serenity Forge"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/e80246d46e477dfc6f3331eca60c1c0f-98.jpg", "descriptions": "The King's Bird is a momentum-based precision-platformer that seamlessly combines parkour with aerial movement."}, {"name": "Crossing Souls", "details_link": "https://www.metacritic.com/game/switch/crossing-souls", "publisher": "Devolver Digital", "release_date": "Jul 26 2018", "developers": ["Fourattic"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 67, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/de62b47ad44347edf7f2c8faf5c188b3-98.jpg", "descriptions": "We're back to 1986 in California. A group of friends discovers a strange pink stone that allows to travel between two realms. This gang will live the summer of their lives in an adventure that will get them involved in a government conspiracy. Control 5 kids with special skills whileWe're back to 1986 in California. A group of friends discovers a strange pink stone that allows to travel between two realms. This gang will live the summer of their lives in an adventure that will get them involved in a government conspiracy. Control 5 kids with special skills while fighting and solving puzzles in order to save their families and the world. Crossing Souls is an action-adventure set in a California suburb in the midst of a supernatural event that rocks the small community as grand forces siege the town. Control five characters: Chris, Matt, Charlie, Big Joe and Kevin, each one with their own skills and combat styles. Change characters on the fly and use each character's specialties to overcome any obstacle and target your foe's weaknesses. Fight in real-time, solve clever puzzles, face off against powerful bosses and play special levels inspired by 80's arcade video games. … Expand"}, {"name": "Tyranny: Bastard's Wound", "details_link": "https://www.metacritic.com/game/pc/tyranny-bastards-wound", "publisher": "Paradox Interactive", "release_date": "Sep  7 2017", "developers": ["Obsidian Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/0647c3e35af3011dfd89824decdebee6-98.jpg", "descriptions": "Experience a new chapter of Tyranny, the critically-acclaimed role-playing game (RPG), in Bastard’s Wound, a new expansion that builds upon the game’s compelling story. Tyranny, an original RPG from Obsidian Entertainment, invites the player to make their mark on a world conquered by evil,Experience a new chapter of Tyranny, the critically-acclaimed role-playing game (RPG), in Bastard’s Wound, a new expansion that builds upon the game’s compelling story. Tyranny, an original RPG from Obsidian Entertainment, invites the player to make their mark on a world conquered by evil, and the Bastard’s Wound expansion opens up a new area of the Tiers where refugees from the war-torn world have established a haven in secret. Delve deeper into the mysteries of Terratus as you bring Kyros' justice (or your own version of it) to a new corner of the Tiers. In addition to the new region, Bastard's Wound gives you a chance to learn more about your party in a trio of companion quests featuring Lantry, Verse, and Barik.… Expand"}, {"name": "NBA Playgrounds", "details_link": "https://www.metacritic.com/game/pc/nba-playgrounds", "publisher": "Saber Interactive", "release_date": "May  9 2017", "developers": ["Saber Interactive"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Sports", "Team", "Basketball", "Arcade"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/76ea92d3c90e663691e0abd4921b8147-98.jpg", "descriptions": "Classic NBA arcade action is back! Take your “A” game to the playground and beat the best in high-flying 2-on-2 basketball action. Practice your skills offline, play with up to three others and take your talents online to posterize your opponents with acrobatic jams and ridiculous displaysClassic NBA arcade action is back! Take your “A” game to the playground and beat the best in high-flying 2-on-2 basketball action. Practice your skills offline, play with up to three others and take your talents online to posterize your opponents with acrobatic jams and ridiculous displays of skill.… Expand"}, {"name": "Dungeon Souls", "details_link": "https://www.metacritic.com/game/pc/dungeon-souls", "publisher": "Black Shell Games", "release_date": "Dec  2 2016", "developers": ["Mike Studios"], "platforms": "PC", "genres": ["Role-Playing", "Action RPG"], "meta_score": 67, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/9b35e9a8c95d8b538de829c6f95c7a51-98.jpg", "descriptions": "Dungeon Souls is a two-dimensional hack n' slash roguelike dungeon crawler. Explore randomly generated dungeons, collect legendary items, and upgrade six unique heroes to conquer the dark forces that roam the depths below."}, {"name": "Sebastien Loeb Rally Evo", "details_link": "https://www.metacritic.com/game/pc/sebastien-loeb-rally-evo", "publisher": "Milestone S.r.l", "release_date": "Jan 29 2016", "developers": ["Milestone S.r.l"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Racing", "General"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/89e515216615b19eb90f7caf19d106a9-98.jpg", "descriptions": "Sebastien Loeb Rally Evo is an off-road racing game experience that teams players with the greatest racer in Rally history: Se?bastien Loeb."}, {"name": "Dragon Ball: Xenoverse", "details_link": "https://www.metacritic.com/game/xbox-one/dragon-ball-xenoverse", "publisher": "Bandai Namco Games", "release_date": "Feb 24 2015", "developers": ["Dimps Corporation"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 67, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/fd7fef16cba7a92cb111c17a430de5d9-98.jpg", "descriptions": "DRAGON BALL XENOVERSE brings all the frenzied battles between Goku and his fiercest rivals, such as Vegeta, Frieza, Cell and many more, with new gameplay design. Players revisit all famous battles from the series through their own custom-created Avatars, which are connected to Trunks andDRAGON BALL XENOVERSE brings all the frenzied battles between Goku and his fiercest rivals, such as Vegeta, Frieza, Cell and many more, with new gameplay design. Players revisit all famous battles from the series through their own custom-created Avatars, which are connected to Trunks and many other characters. With the help of Trunks, travel through time and intervene with the past to restore Dragon Ball history. DRAGON BALL XENOVERSE take the universe from series' creator Akira Toriyama by storm and breaks tradition with a new world setup, the mysterious Toki Toki City.… Expand"}, {"name": "Football Manager Classic 2014", "details_link": "https://www.metacritic.com/game/playstation-vita/football-manager-classic-2014", "publisher": "Sega", "release_date": "Apr 11 2014", "developers": ["Sports Interactive"], "platforms": "PlayStation Vita", "genres": ["Sports", "Traditional", "Soccer", "Management"], "meta_score": 67, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/4623b5a852fe2a3ed87dedb54258336a-98.jpg", "descriptions": "Designed specifically for faster career progression with the main focus on the key areas of football management such as; tactics, transfers and managing your team on matchdays. Areas such as media handling, training and finance are much more streamline and designed not to slow downDesigned specifically for faster career progression with the main focus on the key areas of football management such as; tactics, transfers and managing your team on matchdays. Areas such as media handling, training and finance are much more streamline and designed not to slow down progression to those all-important match days.… Expand"}, {"name": "Platformines", "details_link": "https://www.metacritic.com/game/pc/platformines", "publisher": "Namco Bandai Games", "release_date": "Mar 28 2014", "developers": ["Magiko Gaming"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "2D"], "meta_score": 67, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/486cdcf81ec2ac08e11f887f17fb10b8-98.jpg", "descriptions": "Platformines is a unique 2D platformer packed with exploration, RPG and shooter elements, set in a vast 16-bit underground world! Customise your character, master all difficulty levels and literally jump to the top of the leaderboards to prove your skills!"}, {"name": "DOOM 3 BFG Edition", "details_link": "https://www.metacritic.com/game/xbox-360/doom-3-bfg-edition", "publisher": "Bethesda Softworks", "release_date": "Oct 16 2012", "developers": ["id Software"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox One", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "Miscellaneous", "Shooter", "Shooter", "Compilation", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 67, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/4b7430f417b919daa4232435ba6008c0-98.jpg", "descriptions": "Re-mastered for Xbox 360 and PlayStation 3, this game and its expansion pack offers enhanced graphics, immersing the player in the demonic world of this terrifying horror game. Players experience a never-before-seen single-player story, 'The Lost Mission,' featuring seven new levels."}, {"name": "The Urbz: Sims in the City", "details_link": "https://www.metacritic.com/game/ds/the-urbz-sims-in-the-city", "publisher": "EA Games", "release_date": "Nov 17 2004", "developers": ["Griptonite Games"], "platforms": ["PlayStation 2", "DS"], "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 67, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/6356460994889a869f91398ca4952dd7-98.jpg", "descriptions": "Urbz aren't typical Sims; they have a completely new look, attitude and outlook on life. Roaming through the rough-and-tumble city streets, Urbz are all about their friends, their pets and building their reputation. This highly-anticipated title benefits from the unique Nintendo DSUrbz aren't typical Sims; they have a completely new look, attitude and outlook on life. Roaming through the rough-and-tumble city streets, Urbz are all about their friends, their pets and building their reputation. This highly-anticipated title benefits from the unique Nintendo DS capabilities by offering players a touch-screen input and a multitude of in-game features that are not available in any other version of the game.  Exclusive features for the Nintendo DS include 24 objects, a unique touch-screen menu system, 5 minigames, 7 characters and 5 pet species that players can create with the special in-game ?gene manipulator?. [Electronic Arts]… Expand"}, {"name": "Fisherman's Challenge", "details_link": "https://www.metacritic.com/game/playstation-2/fishermans-challenge", "publisher": "Konami", "release_date": "Jan 19 2003", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Nature", "Fishing"], "meta_score": 67, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/913503e784550e56ea997211f6d8ef87-98.jpg", "descriptions": "Whether you consider yourself an expert angler or a bassin' beginner, you'll have the time of your life with Fisherman's Challenge, the most complete virtual fishing experience available for the PS2. For experts, Fisherman's Challenge offers 5 lakes, 7 species of game fish and over 110Whether you consider yourself an expert angler or a bassin' beginner, you'll have the time of your life with Fisherman's Challenge, the most complete virtual fishing experience available for the PS2. For experts, Fisherman's Challenge offers 5 lakes, 7 species of game fish and over 110 lures... plus over 100 rod and reel combinations. For beginners, Fish Mood Indicators give insight into why fish are biting and how they feel about your offering. [Konami]… Expand"}, {"name": "AquaNox", "details_link": "https://www.metacritic.com/game/pc/aquanox", "publisher": "Fishtank Interactive", "release_date": "Nov 19 2001", "developers": ["Massive Development"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Simulation", "Sci-Fi", "Marine", "Futuristic Sub", "Futuristic Sub", "Combat"], "meta_score": 67, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/e298826a343f7eba2fa85ddec81d668c-98.jpg", "descriptions": "Come aboard and explore the dangerous and merciless deep sea with all its adventures. Features over 30 single-player-missions; 9 completely different playerships; over 40 different enemies, including gigantic creatures; gripping story and detailed world with over 70 NPCs; and deathmatch andCome aboard and explore the dangerous and merciless deep sea with all its adventures. Features over 30 single-player-missions; 9 completely different playerships; over 40 different enemies, including gigantic creatures; gripping story and detailed world with over 70 NPCs; and deathmatch and teambased multiplayer modes. [Fishtank Interactive]… Expand"}, {"name": "Kirby's Dream Buffet", "details_link": "https://www.metacritic.com/game/switch/kirbys-dream-buffet", "publisher": "Nintendo", "release_date": "Aug 17 2022", "developers": ["HAL Labs"], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/58fb5aa0d8266e0badfb228abde16d30-98.jpg", "descriptions": "Snack your way to victory in a jam-packed race to claim a mountain of strawberries in Kirby's Dream Buffet for Nintendo Switch. Roll down delicious courses against another player locally or versus a whole gang of colourful, hungry Kirbys online. Snack on strawberries to increase your size.Snack your way to victory in a jam-packed race to claim a mountain of strawberries in Kirby's Dream Buffet for Nintendo Switch. Roll down delicious courses against another player locally or versus a whole gang of colourful, hungry Kirbys online. Snack on strawberries to increase your size. The bigger you are, the faster you'll roll downhill. The most well-rounded (and heaviest) Kirby wins the race!\r Want to turn the tables on your opponents? Grab Food Boxes to unlock delicious Copy Food abilities.… Expand"}, {"name": "Mario & Sonic at the London 2012 Olympic Games", "details_link": "https://www.metacritic.com/game/wii/mario-sonic-at-the-london-2012-olympic-games", "publisher": "Sega", "release_date": "Nov 15 2011", "developers": ["Racjin", "Sega Sports R&D"], "platforms": ["3DS", "Wii"], "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 66, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/321cafc2bb6bc223e07a620e175c66a6-98.jpg", "descriptions": "Mario & Sonic at the London 2012 Olympic Games contains over 50 original Olympic themed events playable in both single and multiplayer modes. Bringing a whole new dimension to the Mario & Sonic universe, the glasses-free 3D visuals and the unique control systems mean there are plentyMario & Sonic at the London 2012 Olympic Games contains over 50 original Olympic themed events playable in both single and multiplayer modes. Bringing a whole new dimension to the Mario & Sonic universe, the glasses-free 3D visuals and the unique control systems mean there are plenty of new and exciting ways to compete for a coveted gold medal!… Expand"}, {"name": "Galaga", "details_link": "https://www.metacritic.com/game/xbox-360/galaga", "publisher": "Namco Bandai Games", "release_date": "Jul 26 2006", "developers": ["Namco Bandai Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 4", "Switch", "Xbox One", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Vertical"], "meta_score": 66, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/6430adf2512446fca42599f277458391-98.jpg", "descriptions": "[Xbox Live Arcade]  Galaga was released in the arcades in 1981 and became an instant classic. This exciting title soon became know for its innovative fighter combination system and the varied enemy attack patterns. Take control of a fighter space craft and shoot down the invading aliens.[Xbox Live Arcade]  Galaga was released in the arcades in 1981 and became an instant classic. This exciting title soon became know for its innovative fighter combination system and the varied enemy attack patterns. Take control of a fighter space craft and shoot down the invading aliens. Watch out for the swooping motherships, which will try to steal your fighter. Rescue captured fighters to double your firepower. Earn Perfect Bonuses as you battle your way through wave after wave in different challenging stages. [Namco Bandai]… Expand"}, {"name": "Crash Tag Team Racing", "details_link": "https://www.metacritic.com/game/playstation-2/crash-tag-team-racing", "publisher": "VU Games", "release_date": "Oct 19 2005", "developers": ["Radical Entertainment"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Car Combat"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/29d7503ec0f38d5e0ee4c3be0cc09ce9-98.jpg", "descriptions": "For the first time ever in a racing game, players will be able to fuse two cars together on the fly to form a super vehicle with the all-new \"clashing\" technology. In Crash Tag Team Racing, players can combine their car with an opponent’s mid-race to make a super-car equipped with a powerfulFor the first time ever in a racing game, players will be able to fuse two cars together on the fly to form a super vehicle with the all-new \"clashing\" technology. In Crash Tag Team Racing, players can combine their car with an opponent’s mid-race to make a super-car equipped with a powerful turret gun. When clashed, players can either get behind the wheel and drive or fire an onboard weapon.  Each character has his or her own uniquely deadly 360? rotating turret.  Players can continue the action out of the car where they can explore the entire world on foot and collect upgrades for their cars and unlock bonus tracks. [Vivendi Universal]… Expand"}, {"name": "Fallout: Brotherhood of Steel", "details_link": "https://www.metacritic.com/game/xbox/fallout-brotherhood-of-steel", "publisher": "Interplay", "release_date": "Jan 14 2004", "developers": ["Interplay"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/20f039e383f005410841ee0e7565ae44-98.jpg", "descriptions": "In this gritty and darkly humorous third-person action adventure, players join the courageous Brotherhood of Steel, whose mission is to maintain peace in the grim post-nuclear world of Fallout.  Challenged by hordes of ghouls, mutants, and other radioactive nightmares, players utilize aIn this gritty and darkly humorous third-person action adventure, players join the courageous Brotherhood of Steel, whose mission is to maintain peace in the grim post-nuclear world of Fallout.  Challenged by hordes of ghouls, mutants, and other radioactive nightmares, players utilize a combination of intense combat strategies including melee, ranged weapons and explosives to fulfill their daunting task of defeating the mutant army in hopes of restoring humanity in a nearly unlivable universe.  Welcome to the wasteland.… Expand"}, {"name": "Capcom Classics Mini Mix", "details_link": "https://www.metacritic.com/game/game-boy-advance/capcom-classics-mini-mix", "publisher": "Capcom", "release_date": "Sep 19 2006", "developers": ["Sensory Sweep"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Miscellaneous", "Compilation"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/bc3d1c60687b3cfa43af2cf69a4d8a5b-98.jpg", "descriptions": "An action-packed compilation of three of Capcom's most popular titles, originally released for the Nintendo Entertainment System. The trio of old school action titles includes \"Bionic Commando,\" \"Strider\" and \"Mighty Final Fight,\" all faithfully recreated andAn action-packed compilation of three of Capcom's most popular titles, originally released for the Nintendo Entertainment System. The trio of old school action titles includes \"Bionic Commando,\" \"Strider\" and \"Mighty Final Fight,\" all faithfully recreated and available to play in either the original aspect ratio or stretched to fill the handheld's widescreen display.… Expand"}, {"name": "Outlaw Tennis", "details_link": "https://www.metacritic.com/game/xbox/outlaw-tennis", "publisher": "Global Star Software", "release_date": "Jul 26 2005", "developers": ["Hypnotix"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-10 ", "genres": ["Sports", "Traditional", "Tennis"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/5cc6b725b7179d2ba84965d0ba21d595-98.jpg", "descriptions": "Step onto the tennis court with the cast from the Outlaw series of games. You can choose one of 16 playable characters with different attributes, and then you can participate in six gameplay modes, including exhibition, tour, and drills. As in previous Outlaw games, Outlaw Tennis features aStep onto the tennis court with the cast from the Outlaw series of games. You can choose one of 16 playable characters with different attributes, and then you can participate in six gameplay modes, including exhibition, tour, and drills. As in previous Outlaw games, Outlaw Tennis features a fighting system that lets you beat up your opponents to gain an advantage. You can play in both singles and doubles matches in several match modes, such as hot potato, casino, baseball, and cash zones.… Expand"}, {"name": "Double Dragon: Neon", "details_link": "https://www.metacritic.com/game/xbox-360/double-dragon-neon", "publisher": "Majesco Games", "release_date": "Sep 12 2012", "developers": ["WayForward"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/a9524c425f6d797653278f6d6e0dedc3-98.jpg", "descriptions": "Billy & Jimmy Lee have returned to save their shared love interest Marian from the evil Skullmageddon across sixteen brawling levels filled with elaborate missions, malicious enemies and over-the-top battles. Trained by their sensei in a special class of martial arts, Billy & Jimmy areBilly & Jimmy Lee have returned to save their shared love interest Marian from the evil Skullmageddon across sixteen brawling levels filled with elaborate missions, malicious enemies and over-the-top battles. Trained by their sensei in a special class of martial arts, Billy & Jimmy are equipped with lethal combat skills and weaponry to crush some faces and battle the baddest goons around as they barnstorm across the galaxy to rescue the love of their lives.… Expand"}, {"name": "Chinatown Detective Agency", "details_link": "https://www.metacritic.com/game/pc/chinatown-detective-agency", "publisher": "General Interactive Co.", "release_date": "Apr  7 2022", "developers": ["General Interactive Co."], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 66, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/5/7c73e75f5324e720b20292aa92004173-98.jpg", "descriptions": "Midnight in Singapore. Your contact's a no show, your client wants answers and your empty bank balance hangs over you like a neon-tinted Sword of Damocles. Welcome to 2032. Welcome to Chinatown Detective Agency. The world is in a state of flux as the global economy nears the nadir of itsMidnight in Singapore. Your contact's a no show, your client wants answers and your empty bank balance hangs over you like a neon-tinted Sword of Damocles. Welcome to 2032. Welcome to Chinatown Detective Agency. The world is in a state of flux as the global economy nears the nadir of its decade-long collapse. Singapore stands as a last refuge of order but even here the government struggles on the brink of chaos. Private detectives are now the first call for those citizens able to afford a semblance of justice.\r That's where you come in. You are Amira Darma, once a rising star at INTERPOL, now a freshly minted Private Investigator in the heart of Chinatown, and your first client is about to walk through your door...\r Inspired by the classic Carmen Sandiego games of the 80s and 90s, Chinatown Detective Agency is a mystery adventure game that will take you across Singapore and the world in hot pursuit of criminals, witnesses and clues. Solve puzzles and uncover leads using real research and investigation, and manage your time and money to solve cases from clients both well-intentioned and nefarious. Along the way, untangle a web of conspiracies and plots that threaten to push the Lion City over the edge.… Expand"}, {"name": "Silence of the Sleep", "details_link": "https://www.metacritic.com/game/pc/silence-of-the-sleep", "publisher": "Jesse Makkonen", "release_date": "Oct  1 2014", "developers": ["Jesse Makkonen"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 66, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/7d0b282ea6708aea2a2e3291944bf648-98.jpg", "descriptions": "Assume the role of a man called Jacob Reeves. A man who has lost his reason to live. He throws himself into a blackness to end his misery, but instead of it being the end he wakes up without a memory of his life before."}, {"name": "Fitness Boxing 2: Rhythm & Exercise", "details_link": "https://www.metacritic.com/game/switch/fitness-boxing-2-rhythm-exercise", "publisher": "Nintendo", "release_date": "Dec  4 2020", "developers": ["Nintendo", "Jupiter Corporation", "Imagineer Co.,Ltd."], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Exercise / Fitness"], "meta_score": 66, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/0/571a860a0c9d2624eefec1fc646de300-98.jpg", "descriptions": "Work out at home and punch to the beat. Jab, uppercut, dodge, and more to catchy pop tunes in this rhythmic boxing game. Pass a Joy-Con™ controller to an exercise buddy and box to the beat together. Customize your workout with the help of a virtual instructor. Choose from nine virtualWork out at home and punch to the beat. Jab, uppercut, dodge, and more to catchy pop tunes in this rhythmic boxing game. Pass a Joy-Con™ controller to an exercise buddy and box to the beat together. Customize your workout with the help of a virtual instructor. Choose from nine virtual instructors, select a challenge level from light to heavy and have a workout prepared for you by your trainer, or create one all by yourself from scratch in Free Training. Check out detailed examples, practice specific moves, and receive helpful feedback from your instructor to get the most out of your workout. Warm up with the original Fitness Boxing game and then transfer your profile to the Fitness Boxing 2: Rhythm and Exercise game. Keep your progress from the original Fitness Boxing game and transfer your profile to the Fitness Boxing 2: Rhythm and Exercise game. Get your daily workout on and box (and bop) to the beat. Pass a Joy-Con controller (or two) to a workout partner to enjoy a 2-player boxing session lead by your in-game instructor. These virtual trainers have different personalities and styles, so try them out and find the one that suits you best! Complete achievements to receive tickets you can redeem for outfits to deck out your trainer in fitness fashion.\r Whatever difficulty you play on, you can revisit specific exercises for practice or watch detailed examples to observe perfect form.\r Fitness Boxing 2: Rhythm & Exercise is a way to get in a guided workout, track your activity, and listen to some popular, upbeat jams.\r… Expand"}, {"name": "Star Wars Battlefront II", "details_link": "https://www.metacritic.com/game/xbox-one/star-wars-battlefront-ii", "publisher": "Electronic Arts", "release_date": "Nov 17 2017", "developers": ["EA DICE"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 40 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 66, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/0/693d4526ad905fd5671331bdd2fc424a-98.jpg", "descriptions": "Star Wars Battlefront II allows players to experience the untold story of an Imperial elite special forces soldier in an all-new single player campaign. In epic multiplayer battles, players pilot a First Order TIE fighter through intense dogfights in space, and play as ground troopers orStar Wars Battlefront II allows players to experience the untold story of an Imperial elite special forces soldier in an all-new single player campaign. In epic multiplayer battles, players pilot a First Order TIE fighter through intense dogfights in space, and play as ground troopers or iconic heroes and villains, such as Yoda and Darth Maul, across all three Star Wars eras. Featuring new characters created by Motive in close partnership with the story group at Lucasfilm, the Star Wars Battlefront II single player campaign delivers a new story to the Star Wars universe. Taking place in the 30 years between the destruction of Death Star II and through the rise of the First Order, the single player story introduces Iden Versio, the leader of Inferno Squad, an elite special forces unit of the Galactic Empire, who are equally lethal on the ground and in space. In addition to Iden, players also encounter and play as other iconic Star Wars heroes and villains like Luke Skywalker and Kylo Ren during the campaign. [Electronic Arts]… Expand"}, {"name": "WWE 2K18", "details_link": "https://www.metacritic.com/game/playstation-4/wwe-2k18", "publisher": "2K Games", "release_date": "Oct 13 2017", "developers": ["Yuke's"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Sports", "Individual", "Combat", "Wrestling"], "meta_score": 66, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/57bf1db56b3dc1cc31bdcc3836c710a3-98.jpg", "descriptions": "A new MyCAREER experience puts you on the path to greatness as you journey along on the road to WrestleMania. Explore WWE through free-roaming backstage, conversing with WWE Superstars, forming alliances, making enemies, seeking out quests, and strategizing for upcoming matches. Road toA new MyCAREER experience puts you on the path to greatness as you journey along on the road to WrestleMania. Explore WWE through free-roaming backstage, conversing with WWE Superstars, forming alliances, making enemies, seeking out quests, and strategizing for upcoming matches. Road to Glory - Can your MyPlayer make it to the WWE Hall of Fame? Introducing the all-new Road to Glory. Compete with opponents online to improve your MyPlayer by earning unlockables, boosts and upgrades all while securing your entry into Special Events that are held alongside real-life WWE special events, such as pay-per-views. … Expand"}, {"name": "Monochroma", "details_link": "https://www.metacritic.com/game/xbox-one/monochroma", "publisher": "Nowhere Studios", "release_date": "Jun 24 2016", "developers": ["Nowhere Studios"], "platforms": ["PC", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/2672db38446284715991ee3ebb15d17c-98.jpg", "descriptions": "Monochroma is a cinematic puzzle platformer that takes place in an industrial-alchemic setting. It's about being a child, having a little brother, growing up, falling down and solving some other puzzles. Monochroma offers a deeply visual, intellectual, and emotional experience. The gameMonochroma is a cinematic puzzle platformer that takes place in an industrial-alchemic setting. It's about being a child, having a little brother, growing up, falling down and solving some other puzzles. Monochroma offers a deeply visual, intellectual, and emotional experience. The game tells it story without using any written or spoken words. It has black and white graphics only coloured with red. Monochroma features realistic locations and puzzles modelled with accurate physics. Puzzle designs are far from arbitrary trial-and-error gameplay. [Xbox.com]… Expand"}, {"name": "Age of Mythology: Extended Edition", "details_link": "https://www.metacritic.com/game/pc/age-of-mythology-extended-edition", "publisher": "Microsoft Game Studios", "release_date": "May  8 2014", "developers": ["Ensemble Studios"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "General", "Fantasy"], "meta_score": 66, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/d1704af6d0e7311c6aa6c1ae59dc7b45-98.jpg", "descriptions": "The classic real time strategy game that transports players to a time when heroes did battle with monsters of legend and the gods intervened in the affairs of mortals. Use mythological creatures like Minotaurs and Cyclopes to bolster your armies' strength. Call upon the gods for assistanceThe classic real time strategy game that transports players to a time when heroes did battle with monsters of legend and the gods intervened in the affairs of mortals. Use mythological creatures like Minotaurs and Cyclopes to bolster your armies' strength. Call upon the gods for assistance in flattening enemy towns with meteors or scatter opposing troops with lightning storms. The Extended Edition includes: Age of Mythology Age of Mythology: The Titans Golden Gift Campaign… Expand"}, {"name": "Terminator 3: The Redemption", "details_link": "https://www.metacritic.com/game/xbox/terminator-3-the-redemption", "publisher": "Atari", "release_date": "Sep  2 2004", "developers": ["Paradigm Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/f103ee8196d0f630d8e03154a4faf660-98.jpg", "descriptions": "Step into the shoes of the Terminator in a postapocalyptic universe. With machines and vehicles straight from the Terminator films, you'll engage enemies in ground and air combat. As humanity's most powerful weapon, you can perform a variety of actions--including ripping out opposingStep into the shoes of the Terminator in a postapocalyptic universe. With machines and vehicles straight from the Terminator films, you'll engage enemies in ground and air combat. As humanity's most powerful weapon, you can perform a variety of actions--including ripping out opposing Terminators' power cells and using them as high-powered explosive devices, using dismantled Endoskeletons as shields, and smashing opponents to pieces with metal-bending hand-to-hand moves. Fight for the cause through three distinct timelines across massive worlds. … Expand"}, {"name": "Ghost in the Shell: Stand Alone Complex (2004)", "details_link": "https://www.metacritic.com/game/playstation-2/ghost-in-the-shell-stand-alone-complex-2004", "publisher": "Bandai", "release_date": "Nov  8 2004", "developers": ["Cavia Inc."], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/8a5706ed6201c81f85cc541ed7319c50-98.jpg", "descriptions": "Ghost in The Shell is a fast-action 3rd person shooter for up to 4 players, with a feature set and presentation that will satisfy even the most hardened gamer. Play as \"Major\" Motoko Kusanagi, Batou and Tachikoma. Over 20 minutes of beautifully rendered CGI Ghost in the Shell FMV. 15 WeaponGhost in The Shell is a fast-action 3rd person shooter for up to 4 players, with a feature set and presentation that will satisfy even the most hardened gamer. Play as \"Major\" Motoko Kusanagi, Batou and Tachikoma. Over 20 minutes of beautifully rendered CGI Ghost in the Shell FMV. 15 Weapon types to choose from. From sniper rifles to sub-machine guns and missile launchers! Hack into machinery, computers, and control your enemies' minds from a distance. Engaging single player story mode with an informative tutorial that gets you into martial arts action quickly. Multiplayer combat for up to 4 players including both team matches and battle royal. Complete the Story Mode to unlock additional features. Different playable characters in the VS mode. Different costumes for each character. An additional stage in the VS mode. Additional weapons in the VS mode. 3 Difficulty Levels to challenge even the most experienced gamers. 12 Stages of enemies and obstacles to overcome. [Bandai]… Expand"}, {"name": "Pro Cycling Manager Season 2015", "details_link": "https://www.metacritic.com/game/pc/pro-cycling-manager-season-2015", "publisher": "Focus Home Interactive", "release_date": "Jun 18 2015", "developers": ["Cyanide"], "platforms": "PC", "genres": ["Sports", "Individual", "Biking"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/7263da71179984e0b49248982f9e35b5-98.jpg", "descriptions": null}, {"name": "Among the Sleep", "details_link": "https://www.metacritic.com/game/pc/among-the-sleep", "publisher": "Krillbite Studio", "release_date": "May 29 2014", "developers": ["Krillbite Studio"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Modern", "Adventure", "3D", "First-Person", "Modern"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/38e17bf4d84c1e07913807c230a08619-98.jpg", "descriptions": "Among The Sleep invites you into the mind and body of a two year old child. After being put to bed one evening, mysterious things start to happen. Played in first person, the game lets its players immerse themselves in a child's limitless imagination. This is a perspective we all have aAmong The Sleep invites you into the mind and body of a two year old child. After being put to bed one evening, mysterious things start to happen. Played in first person, the game lets its players immerse themselves in a child's limitless imagination. This is a perspective we all have a distant familiarity with, but few can clearly remember what it felt like. In the borderland between dream and reality, surreal creatures and diverse environments will present you with both physical and mental obstacles that challenge your creativity.… Expand"}, {"name": "Madden NFL 06", "details_link": "https://www.metacritic.com/game/ds/madden-nfl-06", "publisher": "EA Sports", "release_date": "Aug  8 2005", "developers": ["Exient Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 66, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/a9c87ee93b46e6e5b1ebd8952b262235-98.jpg", "descriptions": "For 16 years, Madden NFL football has been the definitive gridiron video game experience."}, {"name": "Sonic Generations", "details_link": "https://www.metacritic.com/game/3ds/sonic-generations", "publisher": "Sega", "release_date": "Nov 22 2011", "developers": ["Sega", "Dimps Corporation"], "platforms": ["PC", "PC", "PlayStation 3", "Xbox 360", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 66, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/94e366be92ee0841f60180774ff06aa0-98.jpg", "descriptions": "Sonic Generations brings a mix of classic and newer Sonic levels, letting you play through them in classic 2D or full 3D."}, {"name": "Save me Mr Tako: Tasukete Tako-San", "details_link": "https://www.metacritic.com/game/switch/save-me-mr-tako-tasukete-tako-san", "publisher": "Nicalis", "release_date": "Oct 30 2018", "developers": ["Nicalis", "Christophe Galati"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 66, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/6d9cbdd75edf0d31705aa2e15d505adf-98.jpg", "descriptions": "In a world where humans and octopi are at war, Mr Tako is a persistently helpful little octopus who rescues a woman from drowning one stormy night. A fairy sees this act of bravery and grants him the ability to survive on land, where he can turn enemies into platforms by spitting ink atIn a world where humans and octopi are at war, Mr Tako is a persistently helpful little octopus who rescues a woman from drowning one stormy night. A fairy sees this act of bravery and grants him the ability to survive on land, where he can turn enemies into platforms by spitting ink at them. As he travels across the surface world, Mr Tako defies his family and his people to try to resolve conflicts between humans and octopi. … Expand"}, {"name": "Culpa Innata", "details_link": "https://www.metacritic.com/game/pc/culpa-innata", "publisher": "Strategy First", "release_date": "Nov  2 2007", "developers": ["Momentum DMT"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Sci-Fi", "Sci-Fi", "Third-Person"], "meta_score": 66, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/b083f91b932f21684963f97731ff4cf1-98.jpg", "descriptions": "A World Union citizen is murdered in Russia, one of the few remaining Rogue States. This murder oddly coincides with the accidental death of a prominent professor in Adrianopolis, an important border town between the World Union and Russia.  Peace Officer Phoenix Wallis is assigned to leadA World Union citizen is murdered in Russia, one of the few remaining Rogue States. This murder oddly coincides with the accidental death of a prominent professor in Adrianopolis, an important border town between the World Union and Russia.  Peace Officer Phoenix Wallis is assigned to lead the investigation of the murder.  Still young and inexperienced, she will soon make discoveries beyond her wildest imagination, as skilled hackers and subversive characters begin taking an inexplicable interest in Phoenix.  Her investigation reveals enigmatic clues that lead her deeper and deeper into a mystery that challenges not only her case, but her very beliefs in the worldview she has sworn to protect. This story-driven, third person game uses a 3D engine with dynamic cameras and other technologies developed by Momentum AS. The game features a wide variety of organic obstacles ranging from logic puzzles to hi-tech gadget manipulation to dialogue and inventory challenges. [Strategy First]… Expand"}, {"name": "Heroes of Might and Magic V: Hammers of Fate", "details_link": "https://www.metacritic.com/game/pc/heroes-of-might-and-magic-v-hammers-of-fate", "publisher": "Ubisoft", "release_date": "Nov 14 2006", "developers": ["Nival Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 66, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/acb85f581d8c49e57a66a8dde749dca1-98.jpg", "descriptions": "Key features of the expansion pack include: New faction: Introducing the brand-new Dwarves faction, made up of heroic warriors and rune magic adepts who stalk Ashan's deepest mountains and most hostile regions. A brand-new adventure: Featuring 15 new missions, new heroes, and improvedKey features of the expansion pack include: New faction: Introducing the brand-new Dwarves faction, made up of heroic warriors and rune magic adepts who stalk Ashan's deepest mountains and most hostile regions. A brand-new adventure: Featuring 15 new missions, new heroes, and improved cut-scenes, the new campaign will lead players even deeper into the dramatic events that began with Heroes of Might and Magic V. Extended game experience: Includes a wealth of new spells and abilities, 5 new single-player maps, 10 new multiplayer maps, new buildings, new artifacts, and new neutral creatures, Heroes of Might and Magic V: Hammers of Fate gives players the tools to develop new tactics and further their game experience both online and offline. Improved mechanics and gameplay: New features, such as Caravans and a random map generator, allow players to have unlimited replay options and an even smoother gameplay experience. In addition, the simultaneous turn feature will speed up online games. [Ubisoft]… Expand"}, {"name": "Batman Begins", "details_link": "https://www.metacritic.com/game/gamecube/batman-begins", "publisher": "EA Games", "release_date": "Jun 14 2005", "developers": ["Eurocom Entertainment Software"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/d77d7322204340a4fb06244f070d0b8f-98.jpg", "descriptions": "Step into the shadows of Gotham City's dangerous criminal underworld as Batman. Based on the movie of the same name, Batman Begins lets you explore both the origins of the \"dark knight\" and his transformation into a superhero. As Batman, you must use your strength and an array ofStep into the shadows of Gotham City's dangerous criminal underworld as Batman. Based on the movie of the same name, Batman Begins lets you explore both the origins of the \"dark knight\" and his transformation into a superhero. As Batman, you must use your strength and an array of high-tech gadgets to fight the evil forces that threaten the city, including Scarecrow, Ra's Al Ghul, and Carmine Falcone.… Expand"}, {"name": "Mobile Suit Gundam: Battle Operation Code Fairy", "details_link": "https://www.metacritic.com/game/playstation-5/mobile-suit-gundam-battle-operation-code-fairy", "publisher": "Bandai Namco Games", "release_date": "Nov  5 2021", "developers": ["Bandai Namco Games"], "platforms": ["PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Vehicle", "Combat"], "meta_score": 66, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/995c18f974800b3af09d6522f5e0754c-98.jpg", "descriptions": "Mobile Suit Gundam: Battle Operation Code Fairy tells the story of the “Noisy Fairy”—a secret unit led by Alma and under the direct control of Kycilia of the Principality of Zeon. During the “One Year War,” the unit struggles to break through the North America continent. The game featuresMobile Suit Gundam: Battle Operation Code Fairy tells the story of the “Noisy Fairy”—a secret unit led by Alma and under the direct control of Kycilia of the Principality of Zeon. During the “One Year War,” the unit struggles to break through the North America continent. The game features the top-notch action of Mobile Suit Gundam: Battle Operation 2, while providing a deep and extensive side story for both fans and newcomers alike. Explore the world of Code Fairy as unbreakable bonds are formed in the midst of the brutality of war.… Expand"}, {"name": "Potata: Fairy Flower", "details_link": "https://www.metacritic.com/game/switch/potata-fairy-flower", "publisher": "Potata Company", "release_date": "Jun  6 2020", "developers": ["OverGamez"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 66, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/4319f993101fccd0ca62fecae28641db-98.jpg", "descriptions": "Reveal secrets, uncover hidden treasure, and don’t forget to save the world!\r Potata is a puzzle-platformer adventure story about a little girl’s magical journey through a world filled with good and evil. Play as the oddly-named Potata, a novice witch who is still getting a handle on herReveal secrets, uncover hidden treasure, and don’t forget to save the world!\r Potata is a puzzle-platformer adventure story about a little girl’s magical journey through a world filled with good and evil. Play as the oddly-named Potata, a novice witch who is still getting a handle on her powers. Help Potata save her village from stinky spores, evil mushrooms, spiders, and other dark forest spirits.\r The game world is inhabited by fantastic creatures, each with their own personality and story. Learn what secrets your village is hiding and make new friends — or maybe new enemies.\r Gameplay involves traditional platformer mechanics, puzzles, boss battles, conversations with village inhabitants and forest exploration. Some careful thought is necessary, and the hardest moments may leave you racking your brain to find the solution.\r… Expand"}, {"name": "Windscape", "details_link": "https://www.metacritic.com/game/switch/windscape", "publisher": "Headup Games", "release_date": "Mar 27 2019", "developers": ["Magic Sandbox"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 66, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/4/491bf45403cf80d9730e7ff14c50156d-98.jpg", "descriptions": "In Windscape you play as a young girl living on your parents farm, set in a lovely world made up of floating islands in the sky. As you discover the world you learn that something has gone terribly wrong - islands are breaking apart and falling from the sky!"}, {"name": "Impact Winter", "details_link": "https://www.metacritic.com/game/playstation-4/impact-winter", "publisher": "Bandai Namco Games", "release_date": "Apr  5 2018", "developers": ["Mojo Bones"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 66, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/3/f424cf53bf4e36850d4e328edec9cfcc-98.jpg", "descriptions": "A mysterious radio transmission claims that help is inbound. Assume the role of Jacob Solomon: leader of a makeshift team trying to survive the aftermath of a devastating asteroid collision. The world you once knew is no more – buried deep beneath the constant snowfall. Your goal: keep yourA mysterious radio transmission claims that help is inbound. Assume the role of Jacob Solomon: leader of a makeshift team trying to survive the aftermath of a devastating asteroid collision. The world you once knew is no more – buried deep beneath the constant snowfall. Your goal: keep your companions alive until a rescue is imminent.… Expand"}, {"name": "Earthlock: Festival of Magic", "details_link": "https://www.metacritic.com/game/xbox-one/earthlock-festival-of-magic", "publisher": "Snow Castle Games", "release_date": "Sep  1 2016", "developers": ["Snow Castle Games"], "platforms": ["PC", "PlayStation 4", "Wii U", "Xbox One"], "genres": ["Role-Playing", "General"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/fb3bb7d31685fa724ebdcfa0c76dfd59-98.jpg", "descriptions": "Desert scavenger Amon soon finds himself in his life's adventure when he crosses paths with a most peculiar creature back home in Zaber. Join Amon and other heroes in this turn-based fantasy RPG, on a journey across the world of Umbra; a mysterious, beautiful but harsh planet that stoppedDesert scavenger Amon soon finds himself in his life's adventure when he crosses paths with a most peculiar creature back home in Zaber. Join Amon and other heroes in this turn-based fantasy RPG, on a journey across the world of Umbra; a mysterious, beautiful but harsh planet that stopped spinning thousands of cycles ago. With a unique set of customizable characters, all with their own personalities and journeys of self-discovery, you will scavenge, explore and fight your way from the everlasting day-side and into the darkness of perpetual night. To save Umbra you must unlock its secrets, expose the shadows, and defeat a growing evil. [Snowcastle]… Expand"}, {"name": "Foul Play", "details_link": "https://www.metacritic.com/game/playstation-4/foul-play", "publisher": "Devolver Digital", "release_date": "Feb 23 2016", "developers": ["Mediatonic"], "platforms": ["PC", "PlayStation Vita", "Xbox 360", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 66, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/7/7003b2d96f34b096de2c45bf2182f35b-98.jpg", "descriptions": "Prepare for DRAMA as the Baron's tale unfolds, from the harsh deserts of Cairo, to the shady streets of Victorian London... and beyond. The finest actors and actresses of the day have been employed to ensure the ABSOLUTE authenticity of the story. Prepare to play out the most spectacular andPrepare for DRAMA as the Baron's tale unfolds, from the harsh deserts of Cairo, to the shady streets of Victorian London... and beyond. The finest actors and actresses of the day have been employed to ensure the ABSOLUTE authenticity of the story. Prepare to play out the most spectacular and explosive moments of the Baron's life; improbable beasts, astonishing villainy, and at the heart of it all - the mysterious Foul Play.… Expand"}, {"name": "The Sims 4: Outdoor Retreat", "details_link": "https://www.metacritic.com/game/pc/the-sims-4-outdoor-retreat", "publisher": "Electronic Arts", "release_date": "Jan 13 2015", "developers": ["Maxis"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 66, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/81e914eeae2746398c5675e86e55dc79-98.jpg", "descriptions": "Take your Sims camping and explore the all-new destination of Granite Falls in The Sims 4 Outdoor Retreat! Venture into the deep woods to discover new surprises, including dangerous and wondrous herbs, new species of fish, creepy insects and…bears? Hang out by the campfire before trying toTake your Sims camping and explore the all-new destination of Granite Falls in The Sims 4 Outdoor Retreat! Venture into the deep woods to discover new surprises, including dangerous and wondrous herbs, new species of fish, creepy insects and…bears? Hang out by the campfire before trying to find the hermit rumored to live in the deepest parts of the forest.… Expand"}, {"name": "Sparkle 2", "details_link": "https://www.metacritic.com/game/playstation-4/sparkle-2", "publisher": "10tons Ltd", "release_date": "May 20 2014", "developers": ["10tons Ltd", "10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 5", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Puzzle", "General", "Matching"], "meta_score": 66, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/d87fe5d1adb1c6c6299c8e282f5319c1-98.jpg", "descriptions": "Sparkle 2 is a match-three puzzle game set in a mysterious world of magic and wonder."}, {"name": "True Swing Golf", "details_link": "https://www.metacritic.com/game/ds/true-swing-golf", "publisher": "Nintendo", "release_date": "Jan 23 2006", "developers": ["T&E Soft"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Arcade", "Arcade", "Sim"], "meta_score": 66, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/9753102f7f8d4e4a267d6a605a75085f-98.jpg", "descriptions": "(Also know as \"Touch Golf\") Experience the feel and finesse of real golf on beautiful 3D courses with True Swing Golf. In this dual-screened Nintendo DS golf game, using the touch screen and the stylus is almost like swinging a golf club in real life. The longer players slide a stylus across(Also know as \"Touch Golf\") Experience the feel and finesse of real golf on beautiful 3D courses with True Swing Golf. In this dual-screened Nintendo DS golf game, using the touch screen and the stylus is almost like swinging a golf club in real life. The longer players slide a stylus across the touch screen, the harder they smack the ball. Players also can curve their swings to slice or fade shots and alter the angle of the club head for sharpshooter-like accuracy. True Swing Golf features multiple game modes, character customization and wireless multiplayer support for up to four players with just one game card. [Nintendo]… Expand"}, {"name": "Transformers: Decepticons", "details_link": "https://www.metacritic.com/game/ds/transformers-decepticons", "publisher": "Activision", "release_date": "Jun 19 2007", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "num_players": "1-4 ", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 66, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/751750d377005ed3de0bf8e9fb1a1709-98.jpg", "descriptions": "Based on the 2007 live-action feature film, Transformers: Deceptions lets gamers control the outcome in the battle for Earth as they choose to protect it as Autobots or destroy it as Decepticons. Players experience the unstoppable power and massive scale of their favorite Robots in DisguiseBased on the 2007 live-action feature film, Transformers: Deceptions lets gamers control the outcome in the battle for Earth as they choose to protect it as Autobots or destroy it as Decepticons. Players experience the unstoppable power and massive scale of their favorite Robots in Disguise such as BumbleBee, Barricade and others. As the Transformers robot's war comes to Earth, gamers make the choice to join the Autobots in protecting our planet or to join the Decepticons in destroying it. With dual campaigns, the fate of the world is in players' hands. Instantly change from a larger than life robot to a high-powered vehicle such as a sports car, fighter jet or helicopter. Players crush, topple and wreck every object, including buildings and vehicles, in their path or use the objects as weapons. [Activision]… Expand"}, {"name": "Geist", "details_link": "https://www.metacritic.com/game/gamecube/geist", "publisher": "Nintendo", "release_date": "Aug 15 2005", "developers": ["n-Space"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 66, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/329e52a3ff34c361dd7b7bac372e22c5-98.jpg", "descriptions": "As a spectral operative, you must search for your physical body, which is mysteriously being kept alive somewhere in an expansive complex. While exploring, you must collect the energies of indigenous spirits to help unravel a mystery and build your own power. You can possess a variety ofAs a spectral operative, you must search for your physical body, which is mysteriously being kept alive somewhere in an expansive complex. While exploring, you must collect the energies of indigenous spirits to help unravel a mystery and build your own power. You can possess a variety of creatures from human soldiers to dogs. You'll see the world in different ways as you travel through cracks, interfere with electronics, move objects, and more. Be careful--while some spirits are helpful, others are not. Defeat evil spirits with an array of weapons, equipment, and skills.… Expand"}, {"name": "The Sims 4", "details_link": "https://www.metacritic.com/game/xbox-one/the-sims-4", "publisher": "Electronic Arts", "release_date": "Nov 17 2017", "developers": ["Maxis"], "platforms": ["PC", "PlayStation 4", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 66, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/1/73aff9c21b8f518821f60d752eff0378-98.jpg", "descriptions": "The Sims 4 is the highly anticipated life simulation game that lets you play with life like never before. Create new Sims with intelligence and emotion. Experience all new intuitive and fun creative tools to sculpt your Sims and build unique homes. Control the mind, body, and heart of yourThe Sims 4 is the highly anticipated life simulation game that lets you play with life like never before. Create new Sims with intelligence and emotion. Experience all new intuitive and fun creative tools to sculpt your Sims and build unique homes. Control the mind, body, and heart of your Sims, and bring your stories to life.… Expand"}, {"name": "Rubik's World", "details_link": "https://www.metacritic.com/game/ds/rubiks-world", "publisher": "The Game Factory", "release_date": "Oct 28 2008", "developers": ["Two Tribes"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/6d17b33a57c3440dcd9719dbec108081-98.jpg", "descriptions": "Welcome to Rubik's Puzzle World - an abstract environment populated by \"Cubies\" which make up the game's DNA. Rubik's Puzzle World takes the shape, functionality and concept behind the famous Rubik's Cube but twists and turns the rules to transform it into a unique Puzzle filled gameWelcome to Rubik's Puzzle World - an abstract environment populated by \"Cubies\" which make up the game's DNA. Rubik's Puzzle World takes the shape, functionality and concept behind the famous Rubik's Cube but twists and turns the rules to transform it into a unique Puzzle filled game experience for players of all ages. Get ready for a collection of games infused with the mental challenges which made the original Rubik's Cube such a hit. The construction of the games will challenge your brain, enable you to solve increasingly difficult puzzles, and develop your logical capabilities - while having lots of fun! So take a trip inside the Rubik's Cube and enter an abstract world of Rubik's themed puzzles - each as addictive as the original cube we know and love. [The Game Factory]… Expand"}, {"name": "Tales of the World: Radiant Mythology", "details_link": "https://www.metacritic.com/game/psp/tales-of-the-world-radiant-mythology", "publisher": "Namco Bandai Games America", "release_date": "Jul 17 2007", "developers": ["Alfa System"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 66, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/ae46f5ebdd025710e25b1866fc746ce2-98.jpg", "descriptions": "Along with the fast-paced battles the Tales series is known for, Tales of the World: Radiant Mythology also lets players create their own hero. Choose from a host of options, such as voice, hairstyle and class, to start a hero or heroine on their epic journey. Then through your adventures,Along with the fast-paced battles the Tales series is known for, Tales of the World: Radiant Mythology also lets players create their own hero. Choose from a host of options, such as voice, hairstyle and class, to start a hero or heroine on their epic journey. Then through your adventures, find, customize, or create hundreds of items to equip in order to make the ideal character, or trade your items using the PSP system wireless functionality. In Tales of the World: Radiant Mythology, the player's own creation--the player's own hero--will embark on an epic quest to save the world. Along with its RPG game play, Tales of the World: Radiant Mythology features the largest collection of both old and new characters to be incorporated into the storyline. Experience the storyline as beloved Tales characters such as Stahn Aileron from Tales of Destiny, Reid Hershel from Tales of Destiny II, Lloyd Irving from Tales of Symphonia and Luke fon Fabre from Tales of the Abyss, and many more, join the player in battle and aid them on this new quest.  All the new and classic Tales characters come together to weave a tale in this addition to the renowned Tales series. [Namco Bandai Games]… Expand"}, {"name": "Tom Clancy's Ghost Recon Advanced Warfighter", "details_link": "https://www.metacritic.com/game/xbox/tom-clancys-ghost-recon-advanced-warfighter", "publisher": "Ubisoft", "release_date": "Mar  9 2006", "developers": ["Ubisoft Shanghai"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 66, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/cd3d4cd78bd627b97c3d34b36d6b1622-98.jpg", "descriptions": "In Tom Clancy's Ghost Recon Advanced Warfighter you can play as a Ghost, the best trained and equipped soldier the US Army has to offer. The year is 2013 and an insurgency has broken out in Mexico City, and it is your job to infiltrate the city and attempt to restore order. You will need toIn Tom Clancy's Ghost Recon Advanced Warfighter you can play as a Ghost, the best trained and equipped soldier the US Army has to offer. The year is 2013 and an insurgency has broken out in Mexico City, and it is your job to infiltrate the city and attempt to restore order. You will need to rely on your superior equipment, weaponry, and training to succeed against a larger force of enemies. Ghost Recon Advanced Warfighter also features both cooperative and competitive multiplayer. … Expand"}, {"name": "DreamWorks Madagascar", "details_link": "https://www.metacritic.com/game/ds/dreamworks-madagascar", "publisher": "Activision", "release_date": "May 23 2005", "developers": ["Vicarious Visions"], "platforms": ["PC", "DS"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "3D"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/d137242d1013bd6e54499fba43050e0a-98.jpg", "descriptions": "Based on the animated feature film from DreamWorks, Madagascar is the only game that lets players enter the world of four hilarious Central Park Zoo animals - a personality-packed crew made up of a lion, zebra, giraffe and hippo. Players must master each animal's natural skills whileBased on the animated feature film from DreamWorks, Madagascar is the only game that lets players enter the world of four hilarious Central Park Zoo animals - a personality-packed crew made up of a lion, zebra, giraffe and hippo. Players must master each animal's natural skills while adventuring through the exciting city of New York and the dangerous island of Madagascar, interacting with other animals and tackling obstacles and enemies in scenarios from the movie and beyond. [Activision]… Expand"}, {"name": "Loot River", "details_link": "https://www.metacritic.com/game/xbox-series-x/loot-river", "publisher": "SUPERHOT PRESENTS", "release_date": "May  3 2022", "developers": ["straka.studio"], "platforms": ["PC", "Xbox One", "Xbox Series X"], "genres": ["Role-Playing", "Roguelike"], "meta_score": 66, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/9906776e7de8695fbe735345b12b1d86-98.jpg", "descriptions": "Explore procedurally generated labyrinths in a dungeon crawling action roguelike that combines tense, real-time combat with spatial block-shifting - slide blocks of ancient ruins, fight bestial abominations, loot, explore, level-up, strategize, cast powerful spells, die and wake up anew."}, {"name": "Redeemer: Enhanced Edition", "details_link": "https://www.metacritic.com/game/xbox-one/redeemer-enhanced-edition", "publisher": "Buka Entertainment", "release_date": "Jul 19 2019", "developers": ["Sobaka"], "platforms": ["PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 66, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/d97ef2eefbb5cf367619792c27f780fb-98.jpg", "descriptions": "Brutal, bloody beat-’em-up action without compromise. Redeemer: Enhanced Edition is an explosive top-down action shooter in which you fight your way through hordes of opponents in a variety of different ways. Play alone or in local co-op mode by turning your living room into an arena."}, {"name": "Red Faction: Guerrilla - Demons of the Badlands", "details_link": "https://www.metacritic.com/game/xbox-360/red-faction-guerrilla---demons-of-the-badlands", "publisher": "THQ", "release_date": "Aug 13 2009", "developers": ["Volition Inc."], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 66, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/9/ec85645ef7afa7ae149d6120f9452551-98.jpg", "descriptions": "[Dowloadable Content]  Demons of the Badlands features a new single-player story arc that takes place in a new environment not covered by the original game's open world."}, {"name": "Devil May Cry 3: Special Edition", "details_link": "https://www.metacritic.com/game/pc/devil-may-cry-3-special-edition", "publisher": "Ubisoft", "release_date": "Oct 16 2006", "developers": ["Sourcenext"], "platforms": ["PlayStation 2", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Fantasy", "Beat-'Em-Up", "Fantasy", "Linear"], "meta_score": 66, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/1c5378123c2ffe1667c06c2b4c7ec78a-98.jpg", "descriptions": "Devil May Cry 3 marks the return of the world’s toughest demon slayer, Dante, in a riveting new game marked by complex storylines, striking graphics and unadulterated stylistic action. As a prequel to the first Devil May Cry, the story unfolds an earlier chapter in Dante’s history, to aDevil May Cry 3 marks the return of the world’s toughest demon slayer, Dante, in a riveting new game marked by complex storylines, striking graphics and unadulterated stylistic action. As a prequel to the first Devil May Cry, the story unfolds an earlier chapter in Dante’s history, to a fateful clash with his evil twin brother. In addition to its characteristic fast paced action, the game increases the intensity with a new \"style\" system. It adds more depth to gameplay and allows players to choose between short-range, long-range, defensive or evasive play styles. Each system has its own range of features and players can power up their favorite style for increased special attack abilities. Special Edition feature: Now play as Dante’s twin Vergil! [Capcom]… Expand"}, {"name": "Scooby-Doo! Night of 100 Frights", "details_link": "https://www.metacritic.com/game/xbox/scooby-doo!-night-of-100-frights", "publisher": "THQ", "release_date": "Aug 27 2003", "developers": ["THQ"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/58c215c4197d6a302ef8c26ce30da315-98.jpg", "descriptions": "The Mastermind has kidnapped Mystery Inc, and it's up to Scooby-Doo to search for his lost friends. Guide Scooby through 12 huge levels that include a creepy mansion, a spooky cave, a ghostly graveyard, and a perilous pier. As you search for clues, you must avoid classic Scooby-Doo monsters,The Mastermind has kidnapped Mystery Inc, and it's up to Scooby-Doo to search for his lost friends. Guide Scooby through 12 huge levels that include a creepy mansion, a spooky cave, a ghostly graveyard, and a perilous pier. As you search for clues, you must avoid classic Scooby-Doo monsters, use wacky inventions, eat Scooby Snacks, and gather power-ups. Do you have what it takes to foil the Mastermind's plan to rid the world of Mystery Inc?… Expand"}, {"name": "Blood Omen 2", "details_link": "https://www.metacritic.com/game/pc/blood-omen-2", "publisher": "Eidos Interactive", "release_date": "Mar 25 2002", "developers": ["Crystal Dynamics", "Nixxes Software"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 66, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/e14414d9f980e88bdea3c65a2c2a04b4-98.jpg", "descriptions": "400 years have passed since the vampire Kain damned the world in the original Blood Omen, choosing to rule the world in damnation then die for it?s salvation. Now Kain, who once controlled the land of Nosgoth with his vampire armies, finds his brethren slain and his dark powers stripped by a400 years have passed since the vampire Kain damned the world in the original Blood Omen, choosing to rule the world in damnation then die for it?s salvation. Now Kain, who once controlled the land of Nosgoth with his vampire armies, finds his brethren slain and his dark powers stripped by a mysterious figure. To reclaim his rule and exact his vengeance, Kain must dispatch armies of zealot soldiers and overcome legions of demons in order to uncover the ominous plot that threatens the land he seeks to conquer. [Eidos Interactive]… Expand"}, {"name": "F1 Championship Season 2000", "details_link": "https://www.metacritic.com/game/playstation/f1-championship-season-2000", "publisher": "EA Sports", "release_date": "Sep 30 2000", "developers": ["Visual Sciences"], "platforms": ["PC", "PlayStation 2", "PlayStation"], "genres": ["Driving", "Racing", "Formula One"], "meta_score": 66, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/1bf1527a398644482a18d648eb0fd3bd-98.jpg", "descriptions": "EA has created the best-looking and best-sounding PlayStation Formula One title to date, and it has excellent gameplay and features to boot."}, {"name": "City Life 2008 Edition", "details_link": "https://www.metacritic.com/game/pc/city-life-2008-edition", "publisher": "Paradox Interactive", "release_date": "Jul 29 2008", "developers": ["Paradox Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "City Building", "Management", "Modern", "Modern", "Government"], "meta_score": 66, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/fab5dba68173da151c1513b638f055b6-98.jpg", "descriptions": "The game puts players in the role of an urban planner and real estate developer, designing, building and maintaining every aspect of their creation. The latest version contains an additional 23 maps as well as the possibility to import satellite maps. There are also 60 new buildingsThe game puts players in the role of an urban planner and real estate developer, designing, building and maintaining every aspect of their creation. The latest version contains an additional 23 maps as well as the possibility to import satellite maps. There are also 60 new buildings including London landmarks such as St. Paul’s Cathedral and the Royal Opera House. [Ascaron]… Expand"}, {"name": "EQQO", "details_link": "https://www.metacritic.com/game/switch/eqqo", "publisher": "Nakana.io", "release_date": "Feb  7 2020", "developers": ["Parallel Studio"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["General", "Puzzle", "Adventure", "Point-and-Click"], "meta_score": 66, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/d882c77b157e94600487c0d06367c988-98.jpg", "descriptions": "The heartening tale of a mother, a blind child and an Egg - voiced and captioned in many languages.\r A multi-layered story full of symbols and metaphors about hope, love, nature and everything that connects us."}, {"name": "Dragon Ball Z: Supersonic Warriors 2", "details_link": "https://www.metacritic.com/game/ds/dragon-ball-z-supersonic-warriors-2", "publisher": "Atari", "release_date": "Nov 20 2005", "developers": ["Arc System Works"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 66, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/a3bcb17720660a8fcd041465d83fe904-98.jpg", "descriptions": "Dragon Ball Z: Supersonic Warriors 2 features explosive three-on-three tag team battles and offers gamers the opportunity to experience Dragon Ball content via \"what if\" storylines. With multiple gameplay modes, a plethora of playable DBZ characters and the use of Devastating, Ultimate, andDragon Ball Z: Supersonic Warriors 2 features explosive three-on-three tag team battles and offers gamers the opportunity to experience Dragon Ball content via \"what if\" storylines. With multiple gameplay modes, a plethora of playable DBZ characters and the use of Devastating, Ultimate, and Team attacks to defeat opponents, the game enables fans who own a DS to engage in exciting DBZ battles at home and on the go. [Atari]… Expand"}, {"name": "Nights of Azure 2: Bride of the New Moon", "details_link": "https://www.metacritic.com/game/playstation-4/nights-of-azure-2-bride-of-the-new-moon", "publisher": "Koei Tecmo Games", "release_date": "Oct 24 2017", "developers": ["Gust"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/b9872532693ce8ac18d19a037fb408fd-98.jpg", "descriptions": "Standalone sequel to the gothic fairy tale action RPG from developer GUST Studios, Nights of Azure, is now available in Western territories as Nights of Azure 2: Bride of the New Moon. Introducing a new and colorful cast featuring; Alushe Anatoria, Liliana Selphin and Ruhenheid AriarodStandalone sequel to the gothic fairy tale action RPG from developer GUST Studios, Nights of Azure, is now available in Western territories as Nights of Azure 2: Bride of the New Moon. Introducing a new and colorful cast featuring; Alushe Anatoria, Liliana Selphin and Ruhenheid Ariarod alongside a first look at the demon-ridden setting where their narrative unfolds. Step into this story with the knight protector Alushe and uncover the shocking truth behind the mysterious Queen of the Moon.\r… Expand"}, {"name": "Quantum Break", "details_link": "https://www.metacritic.com/game/pc/quantum-break", "publisher": "Microsoft Game Studios", "release_date": "Apr  5 2016", "developers": ["Remedy Entertainment"], "platforms": ["Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 66, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/44065cddd13cac7dc5e978a3c62d8ca6-98.jpg", "descriptions": "Quantum Break blurs the line between television and gameplay, integrating the two into one seamless, uniquely immersive experience. Quantum Break weaves the cinematic action of intense gameplay with the tension and drama of scripted television, creating a world where each has a direct impactQuantum Break blurs the line between television and gameplay, integrating the two into one seamless, uniquely immersive experience. Quantum Break weaves the cinematic action of intense gameplay with the tension and drama of scripted television, creating a world where each has a direct impact on the other.… Expand"}, {"name": "Nine Parchments", "details_link": "https://www.metacritic.com/game/switch/nine-parchments", "publisher": "Frozenbyte, Inc.", "release_date": "Dec  5 2017", "developers": ["Frozenbyte", "Inc."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/34e65dc1eeffabc61b0d4d038a8e6d52-98.jpg", "descriptions": "Nine Parchments is a co-op action-RPG game of magic mayhem from Frozenbyte, the creators of the Trine series. A group of runaway wizard apprentices decide to skip their training to search for the Nine Parchments. As the wannabe wizards rapidly discover powerful new spells and ignore allNine Parchments is a co-op action-RPG game of magic mayhem from Frozenbyte, the creators of the Trine series. A group of runaway wizard apprentices decide to skip their training to search for the Nine Parchments. As the wannabe wizards rapidly discover powerful new spells and ignore all safety aspects, it's natural that their hasty progress results in lots of deadly accidents... … Expand"}, {"name": "Time Crisis: Crisis Zone", "details_link": "https://www.metacritic.com/game/playstation-2/time-crisis-crisis-zone", "publisher": "Namco", "release_date": "Oct 19 2004", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/294190213ffb292f43a134c674575a0e-98.jpg", "descriptions": "The action takes place in Garland Square, on the outskirts of London. The newly opened complex has been taken over by a terrorist group, and it's up to you to liberate it. Enjoy an unprecedented level of interaction with the background: shoot CDs and books off of store shelves, burn racks ofThe action takes place in Garland Square, on the outskirts of London. The newly opened complex has been taken over by a terrorist group, and it's up to you to liberate it. Enjoy an unprecedented level of interaction with the background: shoot CDs and books off of store shelves, burn racks of clothing, break glass, or slice through metal bars. Blaze through levels using double-gun shooting action with two GunCon2s to take down enemies. Several gameplay modes and score rankings add to the game's replayability. Players weapons have a realistic effect on almost everything in the environment, including items on shelves and tables, glass windows and doors, metal bars and even racks of clothing. Players who have two Guncon2s can select a single- or double-gun game. Double-gun shooting action lets players equip two GunCon2s to take down enemies John Woo style, adding a fun and unique element to the game. Many unlockable features have been included in the game, such as extra play modes, special game settings, and even new enemies, giving the game high replay value. [Namco]… Expand"}, {"name": "Pitfall: The Lost Expedition", "details_link": "https://www.metacritic.com/game/pc/pitfall-the-lost-expedition", "publisher": "Aspyr", "release_date": "Oct 15 2004", "developers": ["Beenox"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/a8611748e585dcd8a12754d60b87aa6f-98.jpg", "descriptions": "Deep in the Peruvian Jungle, assume the role of Pitfall Harry, a fearless, rough-and-ready treasure seeker who battles evil using his athletic ability and a knapsack filled with adventure gear. Your mission: race against a rival explorer to find hidden treasures, which in the wrong handsDeep in the Peruvian Jungle, assume the role of Pitfall Harry, a fearless, rough-and-ready treasure seeker who battles evil using his athletic ability and a knapsack filled with adventure gear. Your mission: race against a rival explorer to find hidden treasures, which in the wrong hands could spell doom for you and your friends. Featuring over 50 perilous levels, including lush rain forests, creature-ridden caves and vast glacial mountains, you are challenged to explore a dynamic obstacle-filled world. Adventure your way through a vast landscape, from forests to ancient ruins to subterranean mines. With fast-paced action pathways and a host of obstacles and challenges, you must face the consequences of your every decision. Crossing treacherous jungle terrain and dark areas filled with puzzles, tricks and traps, you'll be swinging on vines, avoiding crocodiles and dodging rolling logs as you unearth artifacts and use your cunning to defeat dangerous foes. Laugh in the face of danger! [Activision]… Expand"}, {"name": "MediEvil: Resurrection", "details_link": "https://www.metacritic.com/game/psp/medievil-resurrection", "publisher": "SCEA", "release_date": "Sep 13 2005", "developers": ["SCEE"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 66, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/eb4788ecf1448d89fabc2336b591f040-98.jpg", "descriptions": "One hundred years have passed since the evil Sorcerer Zarok was defeated at the Battle of Gallowmere, heroically cut down by a mortally wounded Sir Daniel Fortesque. Or at least, that's what the people were told; in fact poor Sir Dan was a bit of a coward, falling in the very first wave ofOne hundred years have passed since the evil Sorcerer Zarok was defeated at the Battle of Gallowmere, heroically cut down by a mortally wounded Sir Daniel Fortesque. Or at least, that's what the people were told; in fact poor Sir Dan was a bit of a coward, falling in the very first wave of arrows. Now Zarok has returned, turning day into night, and raising an undead army to conquer the land. As a side effect Dan has also been resurrected... now, he has the chance to defeat Zarok and in death become the hero he never was in life. Follow Dan's quest across the magical land of Gallowmere, taking in oodles of varied levels, gazillions of combat moves and bucketloads of weapons. As the enchanting storyline unfolds, become enthralled in the MediEvil universe; a weird and wonderful place bursting with action and boundless humour. Two handfuls of multiplayer mini-games, with WiFi compatible multiplayer support. In-game help system in the form of the Voodoo Witch and in-game manual located in Dan's crypt. [SCEE]… Expand"}, {"name": "Stonefly", "details_link": "https://www.metacritic.com/game/switch/stonefly", "publisher": "MWM Interactive", "release_date": "Jun  1 2021", "developers": ["Flight School Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 66, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/3297429517bf997d6d1697ba41d6dcfb-98.jpg", "descriptions": "Harness the wind and soar through the wilderness of Stonefly, a chill and tranquil action-adventure game about self-discovery, legacy, and belonging. Glide your mech strategically among beautiful flora and dangerous fauna, confronting hungry bugs, adventures, and memorable characters."}, {"name": "Rust: Console Edition", "details_link": "https://www.metacritic.com/game/playstation-4/rust-console-edition", "publisher": "Koch Media", "release_date": "May 21 2021", "developers": ["Facepunch Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Massively Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 66, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/4/870208468a030575776ad64f309f7a11-98.jpg", "descriptions": "The only aim in Rust is to survive.\r To do this you will need to overcome struggles such as hunger, thirst and cold. Build a fire. Build a shelter. Kill animals for meat. Protect yourself from other players, and kill them for meat. Create alliances with other players and form a town.The only aim in Rust is to survive.\r To do this you will need to overcome struggles such as hunger, thirst and cold. Build a fire. Build a shelter. Kill animals for meat. Protect yourself from other players, and kill them for meat. Create alliances with other players and form a town. \r\rWhatever it takes to survive.… Expand"}, {"name": "LEGO Worlds", "details_link": "https://www.metacritic.com/game/playstation-4/lego-worlds", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Mar  7 2017", "developers": ["TT Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "Sandbox"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/d0d945783855b112646ff21e1c2e77d5-98.jpg", "descriptions": "LEGO Worlds is an open environment of procedurally-generated Worlds made entirely of LEGO bricks which you can freely manipulate and dynamically populate with LEGO models. Create anything you can imagine one brick at a time, or use large-scale landscaping tools to create vast mountain rangesLEGO Worlds is an open environment of procedurally-generated Worlds made entirely of LEGO bricks which you can freely manipulate and dynamically populate with LEGO models. Create anything you can imagine one brick at a time, or use large-scale landscaping tools to create vast mountain ranges and dot your world with tropical islands. Drop in prefabricated structures to build and customize any world to your liking. Explore using helicopters, dragons, motorbikes or even gorillas and unlock treasures that enhance your gameplay. Watch your creations come to life through characters and creatures that interact with you and each other in unexpected ways. In LEGO Worlds, anything is possible!… Expand"}, {"name": "BlazeRush", "details_link": "https://www.metacritic.com/game/pc/blazerush", "publisher": "Targem Games", "release_date": "Oct 28 2014", "developers": ["Targem Games"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "PC"], "genres": ["Driving", "Racing", "Arcade", "Automobile"], "meta_score": 66, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/ca47484865ac4068f926b94c4331f0e6-98.jpg", "descriptions": "Welcome to the world of racing and frantic fun!\r BlazeRush is a dynamic arcade racing survival game with no health, no levelling and no brakes!\r\nYou can assemble a team of friends to play in local or online multiplayer, choose a car to your taste and chase, blow up and cut off!\r\n\r\nAdaptWelcome to the world of racing and frantic fun!\r BlazeRush is a dynamic arcade racing survival game with no health, no levelling and no brakes!\rYou can assemble a team of friends to play in local or online multiplayer, choose a car to your taste and chase, blow up and cut off!\r Adapt your style and tactics to new enemies, obstacles and tracks.… Expand"}, {"name": "Kirby Fighters Deluxe", "details_link": "https://www.metacritic.com/game/3ds/kirby-fighters-deluxe", "publisher": "Nintendo", "release_date": "Aug 29 2014", "developers": ["HAL Labs"], "platforms": "3DS", "genres": ["Action", "Fighting", "2D"], "meta_score": 66, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/6f3fdbeb59ef7c6936b20ed516614764-98.jpg", "descriptions": "Duke it out with up to 4 players in Kirby Fighters Deluxe!\r Duke it out with your favorite pink puffball in a fierce 4-player battle action game! Team up or go solo as you battle in new and classic Kirby arenas. Choose from powerful copy abilities like Sword, Ninja, Hammer and more as youDuke it out with up to 4 players in Kirby Fighters Deluxe!\r Duke it out with your favorite pink puffball in a fierce 4-player battle action game! Team up or go solo as you battle in new and classic Kirby arenas. Choose from powerful copy abilities like Sword, Ninja, Hammer and more as you take your fighting skills to the limit!\r Based on the wild battle mode introduced in Kirby: Triple Deluxe, this standalone game contains expanded gameplay features, the ability to play as a team, new arenas and more. Join up with a buddy and fire the powerful new Team Cannon to blast opponents with mega-damage! Earn rare copy ability hats for defeating Kracko and the King Dedede army in the single-player gauntlet. Owners of Kirby: Triple Deluxe can also access two bonus copy abilities plus an exclusive arena - Waddle Dee Train Tracks!… Expand"}, {"name": "Black The Fall", "details_link": "https://www.metacritic.com/game/playstation-4/black-the-fall", "publisher": "Square Enix", "release_date": "Jul 11 2017", "developers": ["Sand Sailor Studio"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "3D"], "meta_score": 66, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/14717f025b1a2981f3d96bc67ef33d8a-98.jpg", "descriptions": "After decades of toil, an old machinist plots his escape from the oppressive grasp of the Communist regime. Through hidden passages, shadow and grief, he struggles. Ingenuity, reflexes and deception are his tools."}, {"name": "Saints Row: Gat Out of Hell", "details_link": "https://www.metacritic.com/game/pc/saints-row-gat-out-of-hell", "publisher": "Deep Silver", "release_date": "Jan 20 2015", "developers": ["Volition Inc."], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action Adventure", "General", "Modern", "Open-World"], "meta_score": 66, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/cdad93b53967fe76144502e9103fa00e-98.jpg", "descriptions": "Get with Johnny Gat & Kinzie Kensington as you tear apart Hell in a mission to save the Boss’ soul. Historic icons, old friends, older enemies, a talking gun, a full length musical number and more shenanigans await you."}, {"name": "Nibiru: Age of Secrets", "details_link": "https://www.metacritic.com/game/pc/nibiru-age-of-secrets", "publisher": "The Adventure Company", "release_date": "Aug 31 2005", "developers": ["Future Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 66, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/feb03727204e9c2e9410b268517c8b68-98.jpg", "descriptions": "Martin Holan, a linguistics and archeology student has been contacted by his uncle to examine a mysterious World War II tunnel unearthed while building a new highway in Bohemia. A friend of Martin’s uncle is supposed to meet Martin upon his arrival to brief him on the mysterious discovery,Martin Holan, a linguistics and archeology student has been contacted by his uncle to examine a mysterious World War II tunnel unearthed while building a new highway in Bohemia. A friend of Martin’s uncle is supposed to meet Martin upon his arrival to brief him on the mysterious discovery, however when he arrives in Prague he discovers she has been murdered. What begins as a short expedition to Prague to examine an enigmatic tunnel turns into a dangerous and thrilling mystery, where murder, deception, the deep dark secrets of the Nazis, and the demise of the Mayan civilization, have our hero reeling into the heart of an exhilarating adventure. [Adventure Company]… Expand"}, {"name": "Black Rock Shooter: The Game", "details_link": "https://www.metacritic.com/game/psp/black-rock-shooter-the-game", "publisher": "NIS America", "release_date": "Apr 23 2013", "developers": ["Image Epoch", "Imageepoch"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Action", "General", "General"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/cbfd5474c40eb1f0e58ef5c064b906a9-98.jpg", "descriptions": "Black Rock Shooter: The Game has players take the role of BRS to try and save humanity from extinction."}, {"name": "Tecmo Bowl: Kickoff", "details_link": "https://www.metacritic.com/game/ds/tecmo-bowl-kickoff", "publisher": "Tecmo", "release_date": "Nov 18 2008", "developers": ["Polygon Magic"], "platforms": "DS", "num_players": "1 Player", "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/49eba21c8b326e6fc03d5b417480fe98-98.jpg", "descriptions": "Based on the most popular Tecmo Super Bowl, Tecmo Bowl: Kickoff delivers to long time fans and newcomers easy to employ controls, fun, huge plays and exciting cut-scenes. The classic, over-the-top, all-American football game enables players of all levels to engage in a fun filled, fastBased on the most popular Tecmo Super Bowl, Tecmo Bowl: Kickoff delivers to long time fans and newcomers easy to employ controls, fun, huge plays and exciting cut-scenes. The classic, over-the-top, all-American football game enables players of all levels to engage in a fun filled, fast paced, arcade style of football. Tecmo Bowl: Kickoff brings a host of new features that will further enhance the gameplay experience, including: Customizable Teams: Choose team colors, emblems, player names, team cities and abilities. Super Abilities: Tactically use over-the-top plays to take over a game. Wi-Fi and Wireless Multiplayer: Play against friends across the country or across the room. Variety of Teams: Choose from 32 different teams across the country. Cut-Scenes: All-new cut-scenes showing off the dramatic presentation of various plays. Stylus Control: Feel the action by using the stylus to control your player. Customizable Playbook: Choose four running and four passing plays to your liking. Music and Sound Effects: Turn up the heat on your opponent as you play the game to rock ‘n’ roll remixes of the most memorable tunes in football gaming history. [Tecmo]… Expand"}, {"name": "Broken Pieces", "details_link": "https://www.metacritic.com/game/pc/broken-pieces", "publisher": "Elseware Experience", "release_date": "Sep  9 2022", "developers": ["Elseware Experience"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/c735b1b1c0b2bbc90f4902b24ae32f34-98.jpg", "descriptions": "When Elise and her fiance decided to leave urban life and settle near the French coast, she could not imagine that she would end up completely alone.Now, surrounded by strange phenomena in a dark, post-Cold War climate, Elise will have to investigate and unravel the mysteries surroundingWhen Elise and her fiance decided to leave urban life and settle near the French coast, she could not imagine that she would end up completely alone.Now, surrounded by strange phenomena in a dark, post-Cold War climate, Elise will have to investigate and unravel the mysteries surrounding the region of Saint-Exil, its ritualistic cult, and its lighthouse overlooking the coast.Broken Pieces is an action-packed investigative and adventure video game set in France. The game puts you in the shoes of Elise, a woman in her thirties who finds herself in the village of Saint-Exil in an imaginary region reminiscent of Brittany. Following an unexplained paranormal phenomenon, Elise is stuck, completely alone and out of time.… Expand"}, {"name": "Submerged: Hidden Depths", "details_link": "https://www.metacritic.com/game/pc/submerged-hidden-depths", "publisher": "Uppercut Games Pty Ltd", "release_date": "Mar 10 2022", "developers": ["Uppercut Games Pty Ltd"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 66, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/5f92d04c0d58f895e149993834a45048-98.jpg", "descriptions": "Boat, climb, interact and explore in the beautiful ruins of a sunken world."}, {"name": "The Sinking City", "details_link": "https://www.metacritic.com/game/xbox-one/the-sinking-city", "publisher": "Bigben Interactive", "release_date": "Jun 25 2019", "developers": ["Frogwares"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 66, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/314e9777952ecbe270fca434dd63f5be-98.jpg", "descriptions": "The Sinking City is an adventure and investigation game set in an open world inspired by the universe of H.P. Lovecraft, the master of Horror. The half-submerged city of Oakmont is gripped by supernatural forces. You’re a private investigator, and you have to uncover the truth of what hasThe Sinking City is an adventure and investigation game set in an open world inspired by the universe of H.P. Lovecraft, the master of Horror. The half-submerged city of Oakmont is gripped by supernatural forces. You’re a private investigator, and you have to uncover the truth of what has possessed the city… and the minds of its inhabitants.… Expand"}, {"name": "Fallen Legion+", "details_link": "https://www.metacritic.com/game/pc/fallen-legion+", "publisher": "YummyYummyTummy", "release_date": "Jan  5 2018", "developers": ["YummyYummyTummy"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/5ec4d06ab81f18158c3163662683afb9-98.jpg", "descriptions": "Fallen Legion is an intense action RPG where every battle is a heart-pounding fight and each gut-wrenching choice impacts the realm."}, {"name": "Oceanhorn: Monster of Uncharted Seas", "details_link": "https://www.metacritic.com/game/switch/oceanhorn-monster-of-uncharted-seas", "publisher": "FDG Entertainment", "release_date": "Jun 22 2017", "developers": ["Cornfox & Bros."], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/422744a84641a657e99a9ff6d0a53eb0-98.jpg", "descriptions": "You wake up and find a letter from your father. He is gone The only lead is his old notebook and a mysterious necklace. What happened?\r Oceanhorn: Monster of Uncharted Seas combines captivating storytelling, breathtaking 3D visuals and exciting gameplay into one epic action-adventureYou wake up and find a letter from your father. He is gone The only lead is his old notebook and a mysterious necklace. What happened?\r Oceanhorn: Monster of Uncharted Seas combines captivating storytelling, breathtaking 3D visuals and exciting gameplay into one epic action-adventure experience. In the game you explore the islands of Uncharted Seas, a world filled with many dangers, puzzles and secrets. You must fight monsters, learn to use magic and discover ancient treasures, which will help you on your quest. Use all of your wits and skill to unravel the mysteries of the ancient kingdom of Arcadia and the sea monster, Oceanhorn.\r FEATURE OVERVIEW:\r - 15+ hours of story driven gameplay\r- Master magic and swordfight\r- Find ancient items to help you on your quest\r- Steam Achievements and Leaderboards\r- Steam Cloud\r- Steam Trading Cards\r- Full controller support\r- Enchanting original soundtrack… Expand"}, {"name": "Animal Crossing: Happy Home Designer", "details_link": "https://www.metacritic.com/game/3ds/animal-crossing-happy-home-designer", "publisher": "Nintendo", "release_date": "Sep 25 2015", "developers": ["Nintendo"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 66, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/000d6ead47dad2c1fb49257474de8366-98.jpg", "descriptions": "Show off your style by designing homes for all of your favorite Animal Crossing villagers! Use your creativity to design the perfect house-inside and out-for both old and new friends. With the new amiibo cards, you can call your favorite villagers into the game."}, {"name": "Back to the Future: The Game", "details_link": "https://www.metacritic.com/game/wii/back-to-the-future-the-game", "publisher": "Telltale Games", "release_date": "Oct 25 2011", "developers": ["Iron Galaxy Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "Adventure", "Sci-Fi", "Compilation", "3D", "Compilation", "Third-Person"], "meta_score": 66, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/8/b9f8b2f8a5a9b1895579a40f632c056d-98.jpg", "descriptions": "Back to the Future: The Game is the first title by Telltale Games to be published by Nintendo."}, {"name": "Zombie Apocalypse", "details_link": "https://www.metacritic.com/game/xbox-360/zombie-apocalypse", "publisher": "Konami", "release_date": "Sep 23 2009", "developers": ["Nihilistic"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 66, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/a3734a8206f69838f16c70dbd93e23c6-98.jpg", "descriptions": "[Xbox Live Arcade]  As the zombie infection spreads uncontrollably and the undead outnumber humans, a small band of heavily equipped gunslingers set out to destroy as many zombies as they can and try to save any of the remaining survivors in Zombie Apocalypse. Up to four players can try and[Xbox Live Arcade]  As the zombie infection spreads uncontrollably and the undead outnumber humans, a small band of heavily equipped gunslingers set out to destroy as many zombies as they can and try to save any of the remaining survivors in Zombie Apocalypse. Up to four players can try and stop the zombie apocalypse with an arsenal of deadly weapons, such as an assault rifle, flame thrower, or grenade launcher, and when ammo is low a chainsaw will be your last line of defense against becoming one of the undead. This action packed, arcade-style shooter will test your dual analog stick shooting skills and ability to survive 55 days of relentless zombie attacks. Multiplayer action: Spill zombie guts side-by-side with up to four players in online or local multiplayer. Devastating weapons: Burn, saw, and dismember the undead with ten devastating weapons. Fatal hazards: Butcher the walking dead using jet turbines, wood chippers, and other fatal hazards. Survival strategy: Survive over 50 stages of brutal carnage in seven brain-splattering locations. Bonus game modes: Re-live the apocalypse with seven challenging unlockable game modes. [Konami]… Expand"}, {"name": "Cloudy With a Chance of Meatballs", "details_link": "https://www.metacritic.com/game/playstation-3/cloudy-with-a-chance-of-meatballs", "publisher": "Ubisoft", "release_date": "Sep 18 2009", "developers": ["Ubisoft Shanghai"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Adventure", "Modern", "General", "General", "Modern"], "meta_score": 66, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/e22c08bccd1e2c4d3c0d9fa939a01d06-98.jpg", "descriptions": "Play as Flint, the wacky inventor who creates a machine that causes food to rain from the sky! When the machine spirals out of control, it's up to you to save the town with a variety of outrageously fun and wacky gadgets. Hurl hamburgers, sling spaghetti, and join the most hilarious foodPlay as Flint, the wacky inventor who creates a machine that causes food to rain from the sky! When the machine spirals out of control, it's up to you to save the town with a variety of outrageously fun and wacky gadgets. Hurl hamburgers, sling spaghetti, and join the most hilarious food fight ever. Explore 20 levels and environments from the movie and beyond, from Jello-Land to Ice Cream Falls. [Ubisoft]… Expand"}, {"name": "Glory of the Roman Empire", "details_link": "https://www.metacritic.com/game/pc/glory-of-the-roman-empire", "publisher": "cdv Software", "release_date": "Jul  3 2006", "developers": ["Haemimont", "Haemimont Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "City Building", "Management", "Historic", "Historic", "Government"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/584e2ae7b1893bdbd147ae6150a66e0c-98.jpg", "descriptions": "The glorious age of Rome - a time when the empire was at its peak, envied and feared by friend and foe alike. All across the provinces governors spared no expense to build cities of unparalleled splendor and magnificence and leave their mark in history. In Glory of the Roman Empire, playersThe glorious age of Rome - a time when the empire was at its peak, envied and feared by friend and foe alike. All across the provinces governors spared no expense to build cities of unparalleled splendor and magnificence and leave their mark in history. In Glory of the Roman Empire, players enter this time of wonder and use their city building skills to create cities that would humble even Rome itself. In campaign mode, players use careful planning and governing in order to become the empire's most respected governor. Or they can go online in Challenge mode to best players across the Internet and determine who can build an empire to stand the test of time. Glory of the Roman Empire is an easy to learn, yet difficult to master city building and management simulation that will challenge players in an historically authentic settings, while lush graphics immerse the player in the culture of the ancient Roman empire. [CDV Software]… Expand"}, {"name": "The Lord of the Rings: War in the North", "details_link": "https://www.metacritic.com/game/pc/the-lord-of-the-rings-war-in-the-north", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov  1 2011", "developers": ["Snowblind Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "3  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/5269fa39b584ccb2333635120ea6abe0-98.jpg", "descriptions": "In The Lord of the Rings: War in the North, players can become the heroes in the great battle of the North as part of the epic War of the Ring. Exploring unseen lands, story elements and characters from Middle-earth as well as elements familiar from past feature films, gamers will experienceIn The Lord of the Rings: War in the North, players can become the heroes in the great battle of the North as part of the epic War of the Ring. Exploring unseen lands, story elements and characters from Middle-earth as well as elements familiar from past feature films, gamers will experience extensive character customization and development, expansive co-op gameplay options and upgradeable weapons, skills and special abilities.… Expand"}, {"name": "Shadowrun", "details_link": "https://www.metacritic.com/game/xbox-360/shadowrun", "publisher": "Microsoft Game Studios", "release_date": "May 29 2007", "developers": ["FASA Studio"], "platforms": ["PC", "Xbox 360"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/041bc5a2476cb4b6b3cccb8effc021a6-98.jpg", "descriptions": "Shadowrun is a multiplayer first-person shooter based on the much beloved RPG franchise. Shadowrun propels team-based combat into a new dimension with a revolutionary blend of modern weaponry and ancient magic. Up to 16 players battle for control of this new world through Windows Vista'sShadowrun is a multiplayer first-person shooter based on the much beloved RPG franchise. Shadowrun propels team-based combat into a new dimension with a revolutionary blend of modern weaponry and ancient magic. Up to 16 players battle for control of this new world through Windows Vista's Xbox 360-to-Windows Vista online compatibility. In Shadowrun, vie for supremacy in a constantly evolving battlefield where advanced technology and ancient magic provide an unprecedented and high-velocity tactical action experience. After a 5,000 year absence magic has returned to the world of 2021, and global corporate might battles a relentless ancient order to harness this reawakened power. Be a part of the RNA global megacorp and bring order (and profit) into a world of chaos, or join the Lineage to keep magic wild and free at all costs. Choose a side and wage war for the future of magic in the new world of Shadowrun. Dive into a universe where ancient magic co-exists with deadly weaponry, and experience a revolution in multiplayer FPS gaming. Purchase advanced technology and magic each round in an extraordinary arms race to improve your abilities and open up new tactics for your team. Use your cybernetic eye to spot your enemy through walls, teleport behind your opponents in the blink of an eye, trigger a hologram as a distraction then cut them down with a burst from your rifle to clear the room before they even know you're there. [Microsoft]… Expand"}, {"name": "SpongeBob SquarePants: Battle for Bikini Bottom - Rehydrated", "details_link": "https://www.metacritic.com/game/switch/spongebob-squarepants-battle-for-bikini-bottom---rehydrated", "publisher": "THQ Nordic", "release_date": "Jun 23 2020", "developers": ["Purple Lamp Studios"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 66, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/2362adf9a3cfeb46b136fdba52c41152-98.jpg", "descriptions": "Are you ready, kids? The cult classic is back, faithfully remade in spongetastic splendor! Play as SpongeBob, Patrick and Sandy and show the evil Plankton that crime pays even less than Mr. Krabs. Want to save Bikini Bottom from lots of rampant robots with your mighty bubbles? Of course youAre you ready, kids? The cult classic is back, faithfully remade in spongetastic splendor! Play as SpongeBob, Patrick and Sandy and show the evil Plankton that crime pays even less than Mr. Krabs. Want to save Bikini Bottom from lots of rampant robots with your mighty bubbles? Of course you do! Want to underpants bungee jump? Why wouldn't you! Want to join forces in a brand new multiplayer mode? The battle is on!GAME FEATURES- Play as SpongeBob, Patrick and Sandy and use their unique sets of skills- Thwart Plankton's evil plan to rule Bikini Bottom with his army of wacky robots- Meet countless characters from the beloved seriesREMAKE FEATURES- Faithful remake of one of the best SpongeBob games ever created- High-end visuals, modern resolutions and carefully polished gameplay- Brand new horde mode multiplayer for up to two players, online and offline- Restored content that was cut from the original game like the Robo Squidward boss fight and more… Expand"}, {"name": "Driveclub VR", "details_link": "https://www.metacritic.com/game/playstation-4/driveclub-vr", "publisher": "SCEA", "release_date": "Sep 21 2016", "developers": ["Evolution Studios"], "platforms": "PlayStation 4", "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 66, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/cbd26d05ec111839e5d1c4e66fca8900-98.jpg", "descriptions": "Game modes: Online virtual reality multiplayer race modes and an action-packed single player career are joined by drifting and time trial challenges. Tracks: New and classic Driveclub tracks are brought to life through the power of PlayStation VR, including five all-new Urban locations. AGame modes: Online virtual reality multiplayer race modes and an action-packed single player career are joined by drifting and time trial challenges. Tracks: New and classic Driveclub tracks are brought to life through the power of PlayStation VR, including five all-new Urban locations. A closer look: More than 80 cars are recreated with immaculate detail for players to explore up close with Inspection Mode. Cruise control: A little time to kick back, open the throttle or just coast and explore any track, in any country at your leisure in Cruise Mode. Virtual passenger: An immersive thrill ride through exciting replays of hot laps as players watch themselves handle their greatest challenges from a unique viewpoint in Passenger Mode. [Playstation.com]\r… Expand"}, {"name": "Crash Tag Team Racing", "details_link": "https://www.metacritic.com/game/gamecube/crash-tag-team-racing", "publisher": "VU Games", "release_date": "Oct 19 2005", "developers": ["Radical Entertainment"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Car Combat"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/d3b2527690b85fb7c729ce2a20ce1a7b-98.jpg", "descriptions": "For the first time ever in a racing game, players will be able to fuse two cars together on the fly to form a super vehicle with the all-new \"clashing\" technology. In Crash Tag Team Racing, players can combine their car with an opponent's mid-race to make a super-car equipped withFor the first time ever in a racing game, players will be able to fuse two cars together on the fly to form a super vehicle with the all-new \"clashing\" technology. In Crash Tag Team Racing, players can combine their car with an opponent's mid-race to make a super-car equipped with a powerful turret gun. When clashed, players can either get behind the wheel and drive or fire an onboard weapon. Each character has his or her own uniquely deadly 360˚ rotating turret. Players can continue the action out of the car where they can explore the entire world on foot and collect upgrades for their cars and unlock bonus tracks.… Expand"}, {"name": "NASCAR Heat 2", "details_link": "https://www.metacritic.com/game/playstation-4/nascar-heat-2", "publisher": "704Games", "release_date": "Sep 12 2017", "developers": ["Monster Games Inc.", "704Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 40 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 66, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/d444d80bcff6535636ee135de3c0f86d-98.jpg", "descriptions": "Joining the Monster Energy NASCAR Cup Series, the NASCAR XFINITY Series and NASCAR Camping World Truck Series are available to race in all game modes."}, {"name": "Ty the Tasmanian Tiger 3: Night of the Quinkan", "details_link": "https://www.metacritic.com/game/xbox/ty-the-tasmanian-tiger-3-night-of-the-quinkan", "publisher": "Activision Value", "release_date": "Oct 11 2005", "developers": ["Krome Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/2a9fc627ce89569d80868641439b998a-98.jpg", "descriptions": "TY and his mates face their biggest challenge yet - an otherworldly invasion by an ancient evil known as the Quinkan. With Bush Rescue disbanded, TY begins the challenging task of reforming his team and leading the fight against the dark oppressors. In this next chapter, players will embarkTY and his mates face their biggest challenge yet - an otherworldly invasion by an ancient evil known as the Quinkan. With Bush Rescue disbanded, TY begins the challenging task of reforming his team and leading the fight against the dark oppressors. In this next chapter, players will embark on a series of engaging missions and challenges filled with new and upgradeable weapons - including his trade mark boomerang collection -- and vehicles. TY's new adventures will take him into a shadowy world full of dangerous creatures, and will see him face bigger and badder enemies.… Expand"}, {"name": "Final Fantasy XI", "details_link": "https://www.metacritic.com/game/xbox-360/final-fantasy-xi", "publisher": "Square Enix", "release_date": "Apr 18 2006", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/e95ef96a8e7bfdd20ad2b6d1be5e22a8-98.jpg", "descriptions": "The world of Vana'diel stands at the brink of war. Three powerful nations, united in their plight against the beastmen forces, look to their last hope -- brave adventurers like you! Will the beastmen gain the upper hand, and thrust the once-peaceful Vana'diel into another war? Step into theThe world of Vana'diel stands at the brink of war. Three powerful nations, united in their plight against the beastmen forces, look to their last hope -- brave adventurers like you! Will the beastmen gain the upper hand, and thrust the once-peaceful Vana'diel into another war? Step into the world of Vana'diel and journey forth on grand adventures with players from all across the globe! Final Fantasy XI is the first online game in the award-winning FINAL FANTASY series. How you play is up to you, with limitless possibilities for adventure. Set out on your own to discover the countless secrets of Vana'diel, or form a party with your friends to purge the beastman forces and bring home sensational spoils! With the release of Final Fantasy XI for Xbox 360, Square Enix expands its cross-platform strategy, making the award-winning MMORPG available to a much wider audience across the world. The powerful next-generation capabilities of Xbox 360 provides a much more dynamic and visually impressive gateway to Vana'diel. In addition, players can finally experience Final Fantasy XI in high-definition and 5.1 channel surround sound, only on Xbox 360. Final Fantasy XI is accessible through the Xbox Live online game service. [Square Enix]… Expand"}, {"name": "Scarygirl", "details_link": "https://www.metacritic.com/game/playstation-3/scarygirl", "publisher": "Square Enix", "release_date": "Jan 24 2012", "developers": ["TikGames"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 66, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/966192869f42e47db9dcd87210c7d261-98.jpg", "descriptions": "Based on Nathan Jurevicius' Scarygirl graphic novel – winner of the 2009 Aurealis Award for Best Illustrated Book/Graphic novel – Scarygirl presents a wondrous adventure into a distinctive and beautifully bizarre world.  The titular character Scarygirl is an abandoned child with a tentacleBased on Nathan Jurevicius' Scarygirl graphic novel – winner of the 2009 Aurealis Award for Best Illustrated Book/Graphic novel – Scarygirl presents a wondrous adventure into a distinctive and beautifully bizarre world.  The titular character Scarygirl is an abandoned child with a tentacle arm who dresses like a pirate, and is haunted by a strange man in her dreams. She sets out into the world to discover the meaning behind her bad dreams, but Scarygirl is hardly helpless, as she has a tentacle-powered arsenal up her sleeve.\r During her adventure, Scarygirl will be aided by her friends and guardians from the graphic novel, Blister the giant octopus and Bunniguru the mystical, kung-fu rabbit. Her friends and an ever-improving arsenal of combat moves will help her face down enemies like the adorably deadly hedgehogs of the Owl Woods, the violent Goat Clan along the Old Man Mountains, Hairclump spiders deep in the Stinky Swamp, and the most enemiest enemies of all: the clueless crossing guards around Bad Town!… Expand"}, {"name": "Pac-Man World 2", "details_link": "https://www.metacritic.com/game/xbox/pac-man-world-2", "publisher": "Namco", "release_date": "Oct 15 2002", "developers": ["Namco"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 66, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/88764e8f3a7f804b10b16306b8063835-98.jpg", "descriptions": "Pac-Man is on a brand new adventure and once again dealing with the pesky Ghost Gang.  In Pac-Man World 2, the Ghost Gang has picked the magical fruit from an ancient tree, thereby releasing wicked evils upon Pac-Land.  You must guide Pac-Man through six new lands with plenty of amusingPac-Man is on a brand new adventure and once again dealing with the pesky Ghost Gang.  In Pac-Man World 2, the Ghost Gang has picked the magical fruit from an ancient tree, thereby releasing wicked evils upon Pac-Land.  You must guide Pac-Man through six new lands with plenty of amusing surprises.  New and improved, this Pac-Man can ice skate, rollerblade, submarine dive, and solve many exciting puzzles.  With all-new moves and a zany cast of characters, your Pac-Man heroics will be pushed to its limits.… Expand"}]