[{"name": "Arena Wars", "details_link": "https://www.metacritic.com/game/pc/arena-wars", "publisher": "Tri Synergy", "release_date": "Sep 13 2004", "developers": ["Ascaron Entertainment GmbH", "Ascaron Entertainment"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Modern", "General", "Modern"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/58942c3fe251546c04d1d5bae45f2792-98.jpg", "descriptions": "Arena Wars is a completely new kind of 3D Real Time Strategy game, combining the gameplay principles and interface from RTS games with the fast pace of action-based shooters. Arena Wars is a single and multiplayer game. Multiplayer supports up to 8 players, who can fight against each otherArena Wars is a completely new kind of 3D Real Time Strategy game, combining the gameplay principles and interface from RTS games with the fast pace of action-based shooters. Arena Wars is a single and multiplayer game. Multiplayer supports up to 8 players, who can fight against each other and challenge other players from all around the world via the AW Server, whilst the single player mode is loaded with action-packed single player missions against one or more computer opponents. There are 3 different game modes: Capture the Flag, Bombing Run, and Double Domination. In AW the goal is not simply to destroy the enemy's base or units. To score points in the various scenarios you must complete objectives that range from stealing the enemy flag, carrying a bomb into your enemy's base or seize and hold Domination zones for a period of time. The winner is the player who satisfies that particular game's objectives. For example, in a Capture the Flag game with a 'capture limit' of 5, the winner is the first player to capture 5 enemy flags. [Ascaron]… Expand"}, {"name": "Kombinera", "details_link": "https://www.metacritic.com/game/switch/kombinera", "publisher": "Atari", "release_date": "Apr  7 2022", "developers": ["Graphite Lab"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "Platformer", "2D"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/8a6299ed9fcc9e6aaa7649b709437fcf-98.jpg", "descriptions": "Control multiple colored balls simultaneously in this brain-bending puzzle platformer. It's up to you to combine every ball and complete each perilous level. Can you solve them all? Can you save King Kombine from the Kave of Kaos?\r Core Features:\r\n-Progress through 300 increasingly complexControl multiple colored balls simultaneously in this brain-bending puzzle platformer. It's up to you to combine every ball and complete each perilous level. Can you solve them all? Can you save King Kombine from the Kave of Kaos?\r Core Features:\r-Progress through 300 increasingly complex puzzles.\r-Encounter new hazards and abilities.\r-Replay levels to achieve best times.\r-Grab collectibles to unlock new levels\r-Vibrant neon visual style accompanied by ambient electronic audio tracks.\r-In-depth, complex, heart-tugging emotional storyline.\r-Accessible controls.… Expand"}, {"name": "SpellForce 3: Fallen God", "details_link": "https://www.metacritic.com/game/pc/spellforce-3-fallen-god", "publisher": "THQ Nordic", "release_date": "Nov  3 2020", "developers": ["Grimlore Games"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/69b8acec5f61bab509e9d6e042d0b1ad-98.jpg", "descriptions": "Command the Trolls and lead them on an epic journey across the wild continent of Urgath. As Chieftain of the Moonkin, a tribe driven from its home by tusk hunters and disease, their survival is in your hands."}, {"name": "Super Cane Magic ZERO", "details_link": "https://www.metacritic.com/game/playstation-4/super-cane-magic-zero", "publisher": "IntraGames", "release_date": "May 30 2019", "developers": ["STUDIO EVIL"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 77, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/1977cc719d789bf31ccff27f5da41414-98.jpg", "descriptions": "Cake the Wizard is dead, and his Magic Dog is out of control. Can you save the world? Can you save the Dog? Gear up, eat rocks, throw banana-boomerangs and fight a Giant Potato. Explore a huge game world, unlock over 15 playable characters and collect hundreds of items and perks in thisCake the Wizard is dead, and his Magic Dog is out of control. Can you save the world? Can you save the Dog? Gear up, eat rocks, throw banana-boomerangs and fight a Giant Potato. Explore a huge game world, unlock over 15 playable characters and collect hundreds of items and perks in this local co-op Action RPG for 1 to 4 players.… Expand"}, {"name": "Little Red Lie", "details_link": "https://www.metacritic.com/game/playstation-4/little-red-lie", "publisher": "WZOGI", "release_date": "Jan  9 2018", "developers": ["WZOGI"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/4/1ae0bdb0f6f4055e56338cf600230abd-98.jpg", "descriptions": "Little Red Lie is a narrative-focused, interactive fiction experience that reduces the traditional nine-verb adventure game structure down to a single, context-dependent interaction: lie."}, {"name": "Naruto Shippuden: Ultimate Ninja Storm 4 - Road to Boruto Expansion", "details_link": "https://www.metacritic.com/game/xbox-one/naruto-shippuden-ultimate-ninja-storm-4---road-to-boruto-expansion", "publisher": "Bandai Namco Games", "release_date": "Feb  3 2017", "developers": ["CyberConnect2"], "platforms": ["PlayStation 4", "Xbox One"], "genres": ["Action", "Fighting", "3D"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Road to Boruto brings the combat and anime-quality graphics from Ultimate Ninja Storm 4 with an all-new adventure featuring Boruto Uzumaki. Road to Boruto also includes new characters from the hit anime series for online and offline play. Requires the full version of Naruto Shippuden:Road to Boruto brings the combat and anime-quality graphics from Ultimate Ninja Storm 4 with an all-new adventure featuring Boruto Uzumaki. Road to Boruto also includes new characters from the hit anime series for online and offline play. Requires the full version of Naruto Shippuden: Ultimate Ninja Storm 4, sold separately. [Xbox.com]… Expand"}, {"name": "Furi", "details_link": "https://www.metacritic.com/game/xbox-one/furi", "publisher": "The Game Bakers", "release_date": "Dec  2 2016", "developers": ["The Game Bakers"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Fighting", "3D"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/3e0debce188e91ea18058ab901f74d23-98.jpg", "descriptions": "Fight your way free in our frenzied all-boss fighter, and discover what’s waiting behind the last gate. Furi is all about the tension of one-on-one fights against deadly adversaries. It’s an intense, ultra-responsive game with a unique mix of fast-paced sword fighting and dual-stickFight your way free in our frenzied all-boss fighter, and discover what’s waiting behind the last gate. Furi is all about the tension of one-on-one fights against deadly adversaries. It’s an intense, ultra-responsive game with a unique mix of fast-paced sword fighting and dual-stick shooting. Each of the formidable guardians - designed by Afro Samurai creator Takashi Okazaki - has a unique and surprising combat style that requires focus and skill to defeat. The high-energy action gets a boost from an explosive soundtrack composed by electro musicians including Carpenter Brut.… Expand"}, {"name": "Corpse Party", "details_link": "https://www.metacritic.com/game/3ds/corpse-party", "publisher": "XSEED Games", "release_date": "Oct 25 2016", "developers": ["5pb"], "platforms": ["iPhone/iPad", "PC", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/dd3eda9e490dc1ed57eb83e8c69a0a3a-98.jpg", "descriptions": "Corpse Party is an adventure game that uses hand-drawn 2D sprite and tile art to tell the story of a group of Kisaragi Academy High School students who are trapped in a haunted elementary school filled with the decaying corpses and tormented souls of countless children whod mysteriouslyCorpse Party is an adventure game that uses hand-drawn 2D sprite and tile art to tell the story of a group of Kisaragi Academy High School students who are trapped in a haunted elementary school filled with the decaying corpses and tormented souls of countless children whod mysteriously vanished from the Japanese countryside years, months or sometimes only days prior. Desperately trying to escape and survive, players will experience unnatural, unnerving and decidedly uncensored horrors through the eyes  and ears -- of these frightened teenaged victims. Detailed 2D sprite animations and art stills show the bloody and unsettling fates that await those who enter, and full Japanese-language voice-acting combines with 3D audio support to create a simulated surround sound experience when playing with headphones, offering players a delightfully uncomfortable level of immersion.… Expand"}, {"name": "Element4l", "details_link": "https://www.metacritic.com/game/pc/element4l", "publisher": "i-illusions", "release_date": "May 24 2013", "developers": ["i-illusions"], "platforms": ["PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/803985b210b65145980f57f7203fd24a-98.jpg", "descriptions": "Element4l is a moody and experimental platform game, with a strong focus on flow and smooth gameplay, wrapped in an exceptional soundtrack by MindTree\r In Element4l, you control the state of your character to find your way through a dreamy underworld. Your only hindrances are nature andElement4l is a moody and experimental platform game, with a strong focus on flow and smooth gameplay, wrapped in an exceptional soundtrack by MindTree\r In Element4l, you control the state of your character to find your way through a dreamy underworld. Your only hindrances are nature and the sun. It takes a different, experimental approach to classic platform games and challenges you to rearrange your reflexes. The state-changing, physics-based gameplay invites all ages to think logically, and reveals that pressing the right button at the right time, is often more rewarding than mashing buttons. Just when you thought pressing the left button would make your character go left, Element4l crushes this doctrine.\r Just don't expect an easy platformer. The first time you play element4l, you will struggle... just like the first time you've learned how to ride a bike.… Expand"}, {"name": "Anomaly 2", "details_link": "https://www.metacritic.com/game/pc/anomaly-2", "publisher": "11 bit studios", "release_date": "May 15 2013", "developers": ["11 bit studios"], "platforms": ["iPhone/iPad", "PlayStation 4", "PC"], "genres": ["Action", "Strategy", "General", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/0b4a0fb34f894d7182935e7d657f1b72-98.jpg", "descriptions": "11 Bit's Secret Game is an unannounced title from 11 bit that is scheduled to be announced on February 28th."}, {"name": "Final Fight: Double Impact", "details_link": "https://www.metacritic.com/game/xbox-360/final-fight-double-impact", "publisher": "Capcom", "release_date": "Apr 14 2010", "developers": ["Capcom", "Proper Games Ltd"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Beat-'Em-Up", "Compilation"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/4c155e1e343cfd5515d4306bf902cd1c-98.jpg", "descriptions": "[Xbox Live Arcade]  It's a double strike of arcade perfection as Final Fight: Double Impact takes you on a hard-hitting journey through Capcom history with the ultimate versions of arcade classics Final Fight and Magic Sword. Double Impact slams into your home with seamless online and local[Xbox Live Arcade]  It's a double strike of arcade perfection as Final Fight: Double Impact takes you on a hard-hitting journey through Capcom history with the ultimate versions of arcade classics Final Fight and Magic Sword. Double Impact slams into your home with seamless online and local co-op multiplayer, new music by acclaimed remixologists, HD-filtered graphics, a host of unlockables to discover, and an integrated online leaderboard to prove your mettle! [Capcom]… Expand"}, {"name": "Samurai Warriors 5", "details_link": "https://www.metacritic.com/game/xbox-one/samurai-warriors-5", "publisher": "Koei Tecmo Games", "release_date": "Jul 27 2021", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/8133ac622704603ea324d5d15d617c10-98.jpg", "descriptions": "Experience exhilarating action set in a dramatic historical setting in Samurai warriors 5. As the latest numbered entry in the Samurai warriors franchise, the story, characters, and visuals have been re-imagined to set the stage for a thrilling new series. The story takes place after theExperience exhilarating action set in a dramatic historical setting in Samurai warriors 5. As the latest numbered entry in the Samurai warriors franchise, the story, characters, and visuals have been re-imagined to set the stage for a thrilling new series. The story takes place after the ōnin war during the Golden age of the Sengoku period, and features a story that centers on the lives of two of the most representative military commanders of this era: nobunaga oda and mitsuhide akechi. Choose from a number of new and returning characters while utilizing new abilities to take on evolving enemy forces. Experience electrifying Musou action like never before in Samurai warriors 5! Features: • announced and showcased on Nintendo direct with over 1.4mm real-time viewers. Featured on this week on Xbox. • experience an intense historical drama set during Japan's Sengoku period, told from the perspective of this era's foremost military commanders: nobunaga oda and mitsuhide akechi. • 27 playable characters - both returning heroes and brand new characters have received re-imagined designs in order to Showcase the captivating world of the Sengoku period. • Enjoy exhilarating strategic action on an evolved Battlefield. Enemy forces continue to evolve as time passes in the story, making full use of a number of different military tactics to take on the player. … Expand"}, {"name": "Ancestors Legacy", "details_link": "https://www.metacritic.com/game/pc/ancestors-legacy", "publisher": "1C Entertainment", "release_date": "May 22 2018", "developers": ["Destructive Creations"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 6 ", "genres": ["Strategy", "Real-Time", "General", "Command"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/bb16246b1f43dc2cda54ce021b853c61-98.jpg", "descriptions": "Ancestors Legacy is a squad-based real time strategy with a strong focus on tactics. Inspired by medieval European history, it brings to life four different nations and their conflicts, usually solved by war."}, {"name": "Outlast 2", "details_link": "https://www.metacritic.com/game/xbox-one/outlast-2", "publisher": "Red Barrels", "release_date": "Apr 25 2017", "developers": ["Red Barrels"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action Adventure", "Survival"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/142bdb3811a2c0ac95137ae521fbe37b-98.jpg", "descriptions": "Outlast 2 is the sequel to the acclaimed survival horror game Outlast. Set in the same universe as the first game, but with different characters and a different setting, Outlast 2 is a twisted new journey into the depths of the human mind and its dark secrets. No conflict is ever black and white."}, {"name": "The Bigs", "details_link": "https://www.metacritic.com/game/playstation-3/the-bigs", "publisher": "2K Sports", "release_date": "Jun 25 2007", "developers": ["Blue Castle Games"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Arcade", "Arcade"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/bc7b14dafa8970677d995dc9672f75ac-98.jpg", "descriptions": "This over-the-top baseball action title puts an entirely new spin on Major League Baseball as it blends outrageous visuals and intuitive gameplay mechanics to bring fans a brand new MLB video game experience. Fans redefine the baseball highlight reel by performing dramatic wall grabs,This over-the-top baseball action title puts an entirely new spin on Major League Baseball as it blends outrageous visuals and intuitive gameplay mechanics to bring fans a brand new MLB video game experience. Fans redefine the baseball highlight reel by performing dramatic wall grabs, spectacular diving plays, and epic homeruns. Unique and intuitive gameplay controls deliver a new baseball experience, while advanced power-up mechanics add exciting depth with each turn. Turbo gameplay raises the action bar, and culminates in the ultimate batter pitcher power-up duel, where either the pitcher's Big Heat will be the turning point, or the batter’s Power Blast will be the explosive end to the game. In The BIGS, every play is a big play. Each MLB player has been individualized to emphasize their extraordinary athletic attributes. The development team paid great attention to detail to portray a player's face and physical characteristics so baseball fans will easily recognize their favorite players. To deliver the authentic MLB atmosphere, stadium landmarks have been stylized to highlight the unique architecture of each MLB ballpark. Whether it's the glove at San Francisco's AT&T Park resized to mammoth proportions or the left field wall in Boston's Fenway Park made into a real \"Green Monster,\" gamers will be in awe at the grandeur of each stadium in The BIGS. [2K Sports]… Expand"}, {"name": "Observer: System Redux", "details_link": "https://www.metacritic.com/game/playstation-5/observer-system-redux", "publisher": "Aspyr", "release_date": "Nov 12 2020", "developers": ["Bloober Team"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/3ee72372544411a7c92a8b48e3a159c5-98.jpg", "descriptions": "The year is 2084. In a dark cyberpunk world shattered by plagues and wars, become a neural police detective and hack into the jagged minds of others. Make use of anything they felt, thought, or remembered to solve the case and catch the elusive killer."}, {"name": "MotorStorm: Apocalypse", "details_link": "https://www.metacritic.com/game/playstation-3/motorstorm-apocalypse", "publisher": "SCEA", "release_date": "May  3 2011", "developers": ["Evolution Studios"], "platforms": "PlayStation 3", "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/7dae5d8e2a0ee5ea3511a5904b42401c-98.jpg", "descriptions": "Motorstorm: Apocalypse is the third entry for home consoles in the Motorstorm franchise."}, {"name": "The Last Guy", "details_link": "https://www.metacritic.com/game/playstation-3/the-last-guy", "publisher": "SCEA", "release_date": "Aug 28 2008", "developers": ["SCE Japan Studio"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/09473d8826f32d0f47720e04e9edeccc-98.jpg", "descriptions": "The earth has been struck by a mysterious purple beam of light, and everyone touched by it has turned into a giant zombie. You are the chosen one and it is up to you to rescue the last survivors on earth by leading them to safety through zombie-infested streets. With a classic arcade styleThe earth has been struck by a mysterious purple beam of light, and everyone touched by it has turned into a giant zombie. You are the chosen one and it is up to you to rescue the last survivors on earth by leading them to safety through zombie-infested streets. With a classic arcade style overhead view, make your way through detailed real-world cities and use your heat vision to find people hiding in buildings. Then lead them to the Escape Zone before time runs out in this frantic game. Real Cities - Each stage is brought to life with real aerial photography of the actual city, with multiple levels of zoom to get the best view of the area to see where the survivors, and zombies, are hiding out. Zombies and Bosses - The Last Guy features 10 types of zombies and 4 types of bosses to avoid and outwit as the player races around the city rescuing survivors. Special Abilities - Utilize special powers such as dash to get away from zombies, thermography vision to see where people are hiding, and a whistle to get your long line to huddle up and get out of zombies’ paths. Power-Ups - Take advantage of five kinds of power-ups to help complete each stage, including stamina boosts, freezing time, warping back to the Escape Zone, and temporary invisibility. Extra Stages - Players can unlock Extra Stages to play with super high scores. [SCEA]… Expand"}, {"name": "Valiant Hearts: The Great War", "details_link": "https://www.metacritic.com/game/playstation-4/valiant-hearts-the-great-war", "publisher": "Ubisoft", "release_date": "Jun 24 2014", "developers": ["Ubisoft Montpellier"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Platformer", "2D", "Action", "Platformer", "2D"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/48cfa17ea1079b0173e9f3140f53d4d2-98.jpg", "descriptions": "The story of crossed destinies and a broken love in a world torn apart. All of them will try to survive the horror of the trenches following their faithful canine companion. In Valiant Hearts: The Great War, the lives of all these characters are inextricably drawn together over the course ofThe story of crossed destinies and a broken love in a world torn apart. All of them will try to survive the horror of the trenches following their faithful canine companion. In Valiant Hearts: The Great War, the lives of all these characters are inextricably drawn together over the course of the game. Friendship, love, sacrifice, and tragedy befall each one as they help each other to retain their humanity against the horrors of war. … Expand"}, {"name": "Dodgeball Academia", "details_link": "https://www.metacritic.com/game/pc/dodgeball-academia", "publisher": "Humble Games", "release_date": "Aug  5 2021", "developers": ["Pocket Trap"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Other"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/791541dd484123cfa4a3ab9275e2ae50-98.jpg", "descriptions": "In a world where dodgeball is life, you join Otto at the academy and train to become the ultimate dodgeball champion. Across eight episodes, you’ll forge friendships and create rivals, all in the name of developing the best dodgeball team. Level up Otto and develop a dynamic team across aIn a world where dodgeball is life, you join Otto at the academy and train to become the ultimate dodgeball champion. Across eight episodes, you’ll forge friendships and create rivals, all in the name of developing the best dodgeball team. Level up Otto and develop a dynamic team across a vast and customizable party progression system. All the while, explore the vast Dodgeball Academia and uncover the long hidden truths that reside within the very walls you live, learn, and dominate in.… Expand"}, {"name": "XCOM 2 Collection", "details_link": "https://www.metacritic.com/game/switch/xcom-2-collection", "publisher": "2K Games", "release_date": "May 29 2020", "developers": ["Firaxis Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 77, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/4ef523571b6d2c71733aea594e153ce3-98.jpg", "descriptions": "Ignite a global resistance and reclaim Earth from alien occupation in XCOM 2 on Nintendo Switch. The XCOM® 2 Collection includes the award-winning strategy game XCOM 2, four DLC packs (Resistance Warrior Pack, Anarchy’s Children, Alien Hunters, Shen’s Last Gift) and the War of the ChosenIgnite a global resistance and reclaim Earth from alien occupation in XCOM 2 on Nintendo Switch. The XCOM® 2 Collection includes the award-winning strategy game XCOM 2, four DLC packs (Resistance Warrior Pack, Anarchy’s Children, Alien Hunters, Shen’s Last Gift) and the War of the Chosen expansion all in one package. Activate any of the additional content (DLCs and the Expansion) or just play the base game. \r\rXCOM® 2:\r Aliens rule Earth, promising a brilliant future for mankind while secretly hiding a sinister agenda. As the leader of a guerrilla force facing impossible odds, you must ignite a global resistance to eliminate the alien threat and save the hum race from extinction. \r\rXCOM® 2: War of the Chosen:\r This expansion adds extensive new content in the fight against ADVENT including new Hero classes, powerful new enemies, as well as new missions, environments and increased depth in strategic gameplay.\r FOUR DLC PACKS: \r\rResistance Warrior Pack: Customize your squad of resistance fighters with a set of bonus outfits and head gear, as well as custom armor and face camo. \r Anarchy’s Children: This rebellion-themed content pack introduces more than 100 new exotic customizations for the entire arsenal of armors available to your XCOM soldiers. These options are purely cosmetic and do not alter the stats of a soldier.\r  Alien Hunters: Transform the soldiers of XCOM into an elite alien hunting squad with impressive new weapons and armor to face off against new alien Rulers that will pursue your squad across an entire campaign. Additional cosmetic upgrades to soldiers and the Avenger are included, as well as a new epic mission where Central Officer Bradford leads a squad with the guidance of an old friend.\r  Shen’s Last Gift: Investigate ADVENT’s “Lost Towers” facility where Chief Engineer Lily Shen accompanies your squad in search of her late father’s secretive final project. Discover a unique new soldier class complete with powerful new combat abilities, strategy mechanics, and customization options.… Expand"}, {"name": "Plants vs. Zombies: Battle for Neighborville", "details_link": "https://www.metacritic.com/game/pc/plants-vs-zombies-battle-for-neighborville", "publisher": "Electronic Arts", "release_date": "Oct 18 2019", "developers": ["PopCap"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 24 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 77, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/7b2f2553a77f5e24197bbbe08dfcb609-98.jpg", "descriptions": "Welcome to Neighborville, where all is well. Except that a crazy new coniferous conflict between brain-less and botanicals is brewing! What are you gonna do – call the crops? Soil your plants? It’s time to kick some grass in the wackiest shooter experience between plants and zombies yet:Welcome to Neighborville, where all is well. Except that a crazy new coniferous conflict between brain-less and botanicals is brewing! What are you gonna do – call the crops? Soil your plants? It’s time to kick some grass in the wackiest shooter experience between plants and zombies yet: Plants vs. Zombies: Battle for Neighborville™.… Expand"}, {"name": "11-11: Memories Retold", "details_link": "https://www.metacritic.com/game/xbox-one/11-11-memories-retold", "publisher": "Bandai Namco Games", "release_date": "Nov  9 2018", "developers": ["Digixart Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Third-Person"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/30c8e3314209a1cd2d64cd984a0ec45b-98.jpg", "descriptions": "11th November 1916, a young photographer leaves Canada to join the Western Front in Europe. The same day, a German technician is told that his son is missing in action on the front… They will discover the reality of war, crossing paths, on the front, and the rear, trying to preserve their11th November 1916, a young photographer leaves Canada to join the Western Front in Europe. The same day, a German technician is told that his son is missing in action on the front… They will discover the reality of war, crossing paths, on the front, and the rear, trying to preserve their humanity for their loved ones in the face of disastrous events… If they can come back. At 11am the 11th Day of the 11th Month of year 1918, they will face the biggest decision of their lives… This is the moving story of the end of World War One. [Bandai Namco]… Expand"}, {"name": "The Long Dark", "details_link": "https://www.metacritic.com/game/pc/the-long-dark", "publisher": "Hinterland", "release_date": "Aug  1 2017", "developers": ["Hinterland"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Action Adventure", "General", "Survival"], "meta_score": 77, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/9abc3c65a85d40c375665a8983e99ef4-98.jpg", "descriptions": "Imagine the lights go out, never to return. Bright aurora flare across the sky, and all humanity’s technological might is laid to waste, neutralized in a kind of quiet apocalypse. Everything that has shielded humanity from the disinterested power of Mother Nature is suddenly wrenched fromImagine the lights go out, never to return. Bright aurora flare across the sky, and all humanity’s technological might is laid to waste, neutralized in a kind of quiet apocalypse. Everything that has shielded humanity from the disinterested power of Mother Nature is suddenly wrenched from us, dropping us a few links down the food chain. Food and water are scarce. The roads are no longer safe. And winter approaches... Features immersive first-person exploration gameplay featuring an original art style. Take on the role of bush pilot Will Mackenzie, and navigate the savage beauty of the Northern Wilderness while you face the hazards of the new “post-digital” frontier. In addition to playing Mackenzie in Survival Story mode, experience potentially hundreds of hours of free-form Survival Sandbox gameplay. Push yourself and your skill to last as long as possible in a variety of survival scenarios. [Hinterland Games]… Expand"}, {"name": "Mini Metro", "details_link": "https://www.metacritic.com/game/pc/mini-metro", "publisher": "Dinosaur Polo Club", "release_date": "Aug 11 2014", "developers": ["Dinosaur Polo Club"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "City Building", "Management", "Modern", "Government"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/921f94a9019452d240cdf33c4e680483-98.jpg", "descriptions": "Mini Metro is a strategy simulation game about designing a subway map for a growing city. Draw lines between stations and start your trains running. Keep your lines efficient by redrawing them as new stations open. Decide where to use your limited resources. How long can you keep the city moving?"}, {"name": "Battlefield 2: Modern Combat", "details_link": "https://www.metacritic.com/game/xbox-360/battlefield-2-modern-combat", "publisher": "EA Games", "release_date": "Apr 11 2006", "developers": ["Digital Illusions"], "platforms": ["PlayStation 2", "Xbox 360"], "num_players": "Up to 24 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/5cced80792960866eb3752cdef7b0a58-98.jpg", "descriptions": "Warfare-wage all-out war with the most extensive range of vehicles and weaponry ever assembled. An all-new story-driven single-player mode drops players deep into an action-packed war obscured by government sponsored propaganda, forcing you to choose sides and decide the outcome. Engage inWarfare-wage all-out war with the most extensive range of vehicles and weaponry ever assembled. An all-new story-driven single-player mode drops players deep into an action-packed war obscured by government sponsored propaganda, forcing you to choose sides and decide the outcome. Engage in online multiplayer action for up to 24 players on more than a dozen maps. The revolutionary new HotSwap feature in single player mode gives you instant tactical control. Pull every trigger on the battlefield to lead your army to victory. Clan support, VOIP, and a deep stat-tracking system help round out one of the deepest online console shooters to date. Take control of more than 30 land, sea, and air vehicles, including tanks, helicopters, and amphibious craft, and master more than 50 state-of-the-art weapons. Put on the uniform of one of four armies, each with their own unique arsenals and soldier classes including Sniper, Special Ops, Combat Engineer, and more. Complete each unit's unique Battlefield Moment to earn Battlefield Points and unlock rewards, including upgrades and promotions. [Electronic Arts]… Expand"}, {"name": "Mortal Kombat: Shaolin Monks", "details_link": "https://www.metacritic.com/game/playstation-2/mortal-kombat-shaolin-monks", "publisher": "Midway", "release_date": "Sep 16 2005", "developers": ["Midway Studios - Los Angeles"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 77, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/8/1241bf350810ebacca5ab165c644112d-98.jpg", "descriptions": "Mortal Kombat: Shaolin Monks is an Action/Adventure title driven by both intense single and multi-player action. Similar to \"Mortal Kombat: Deception,\" background interactions (i.e., acid pits, living trees, spiked ceilings, etc.), multiple new fatalities, and action-based puzzles also playMortal Kombat: Shaolin Monks is an Action/Adventure title driven by both intense single and multi-player action. Similar to \"Mortal Kombat: Deception,\" background interactions (i.e., acid pits, living trees, spiked ceilings, etc.), multiple new fatalities, and action-based puzzles also play an important role in the player's quest for an \"outstanding\" victory. Mortal Kombat: Shaolin Monks features an impressive line-up of Mortal Kombat characters, as well, that make frequent appearances as enemies, in boss battles and during several additional in-game interactions. For the first time ever, Mortal Kombat fanatics can explore all the mythos and rumors of the Mortal Kombat universe from an entirely new perspective. Action/Adventure fans will be blown away by the intuitive kombat system, puzzle solving and epic storyline that can be experienced in either the single player mode or through co-op play. [Midway]… Expand"}, {"name": "MLB SlugFest: Loaded", "details_link": "https://www.metacritic.com/game/xbox/mlb-slugfest-loaded", "publisher": "Midway", "release_date": "Jun 23 2004", "developers": ["Point of View"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Baseball", "Arcade"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/66f2ba387aecb1377058a3361eb050de-98.jpg", "descriptions": "The MLB SlugFest series reloads its latest installment with more beanballs, hard tags, and over-the-top animations. All your favorite baseball players now have powers to run at turbo speed, make impossible catches, and survive hard collisions. This time, you can review diving catches orThe MLB SlugFest series reloads its latest installment with more beanballs, hard tags, and over-the-top animations. All your favorite baseball players now have powers to run at turbo speed, make impossible catches, and survive hard collisions. This time, you can review diving catches or home-run scoreboard smashes through a customizable instant-replay feature. And for the first time in the series, the PlayStation 2 and Xbox Live users can take their players and teams online--complete with headset support. … Expand"}, {"name": "True Crime: Streets of LA", "details_link": "https://www.metacritic.com/game/xbox/true-crime-streets-of-la", "publisher": "Activision", "release_date": "Nov  3 2003", "developers": ["Luxoflux", "Inc."], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/ad9f02a220bbfe8010490bec20dfb1b3-98.jpg", "descriptions": "As Nick Kang, your brutal reputation and lethal skills have landed you a nasty job:  heading up an undercover task force to stop the Chinese and Russian gangs from terrorizing Los Angeles.  Drive, fight, and blast your way through a massive array of unpredictable missions, using stealthAs Nick Kang, your brutal reputation and lethal skills have landed you a nasty job:  heading up an undercover task force to stop the Chinese and Russian gangs from terrorizing Los Angeles.  Drive, fight, and blast your way through a massive array of unpredictable missions, using stealth techniques, martial arts moves, and an ask-questions-later arsenal.  True Crime features a branching storyline that gives you the freedom to complete missions as you choose and face the consequences later.  The hardcore streets of L.A.  have met their match.… Expand"}, {"name": "Massive Assault", "details_link": "https://www.metacritic.com/game/pc/massive-assault", "publisher": "Matrix Games", "release_date": "Oct 28 2003", "developers": ["Wargaming.net"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/ded23d8519015b5491a20ec34a16c7bd-98.jpg", "descriptions": "Take the command of \"Free Nations Union\" forces and defeat the secret alliance of \"Phantom League\" on one of 6 distant planets. The rebels decided to seize the power on Earth by first conquering the space colonies, which provide vital energy resources to F.N.U. The war for global dominationTake the command of \"Free Nations Union\" forces and defeat the secret alliance of \"Phantom League\" on one of 6 distant planets. The rebels decided to seize the power on Earth by first conquering the space colonies, which provide vital energy resources to F.N.U. The war for global domination will unroll on continents, at sea and in the air. Lead your divisions, fleets and air squadrons against those, who dared threaten our freedom and democracy! [Wargaming.net]… Expand"}, {"name": "Fatal Frame", "details_link": "https://www.metacritic.com/game/xbox/fatal-frame", "publisher": "Tecmo", "release_date": "Nov 22 2002", "developers": ["Tecmo"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/77cb7ac1681c078a067cf2216b6539b7-98.jpg", "descriptions": "Based on a true story, Fatal Frame recounts Miku's investigation for her brother Mafuyu, who has been missing for two weeks. Her latest clue leads her to the abandoned Himuro mansion, a place that local townsfolk fear. Gifted with a supernatural sixth sense, you'll guide Miku as she exploresBased on a true story, Fatal Frame recounts Miku's investigation for her brother Mafuyu, who has been missing for two weeks. Her latest clue leads her to the abandoned Himuro mansion, a place that local townsfolk fear. Gifted with a supernatural sixth sense, you'll guide Miku as she explores the areas in the mansion where Mafuyu was last seen investigating the disappearance of three other people. Armed with only a camera, you must discover the connection between mysterious disappearances, restless spirits, and ritual sacrifices. … Expand"}, {"name": "Kelly Slater's Pro Surfer", "details_link": "https://www.metacritic.com/game/playstation-2/kelly-slaters-pro-surfer", "publisher": "Activision", "release_date": "Sep 16 2002", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Surfing"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/a19ca67f8d7c7b2c069879ba4e2c18fd-98.jpg", "descriptions": "Surf with 6-time World Champ Kelly Slater and 8 of the most legendary surfers of all time for the ultimate thrill in non-stop riding action. Features Free Surf, Career and Muli-player modes; Fantasy tricks; 30 Levels, 13 real-world breaks; Ultra-real wave & ocean conditions; and populatedSurf with 6-time World Champ Kelly Slater and 8 of the most legendary surfers of all time for the ultimate thrill in non-stop riding action. Features Free Surf, Career and Muli-player modes; Fantasy tricks; 30 Levels, 13 real-world breaks; Ultra-real wave & ocean conditions; and populated waves. [Activision]… Expand"}, {"name": "MTV Music Generator 2", "details_link": "https://www.metacritic.com/game/playstation-2/mtv-music-generator-2", "publisher": "Codemasters", "release_date": "May 19 2001", "developers": ["Jester Interactive"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Miscellaneous", "Music Maker"], "meta_score": 77, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/5cf68a3289b69d71dec9f5c6bb454264-98.jpg", "descriptions": "Oh, I get it!  THIS is what Puffy uses:  a music-making program that lets players sift through libraries of riffs, vocal loops, and vocal effects before producing an \"original\" piece of music."}, {"name": "Taiko Drum Master", "details_link": "https://www.metacritic.com/game/playstation-2/taiko-drum-master", "publisher": "Namco", "release_date": "Oct 26 2004", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/3702ebc0578b23fc6940f8f85f791fa2-98.jpg", "descriptions": "Namco brings a version of its popular Japanese drum series to the US market. Taiko No Tatsujin (\"Drum Master\") first appeared in Japanese arcades in early 2001. It was ported to the PlayStation 2 in 2002. The game is played by hitting a drum-shaped controller with two sticks to the beat ofNamco brings a version of its popular Japanese drum series to the US market. Taiko No Tatsujin (\"Drum Master\") first appeared in Japanese arcades in early 2001. It was ported to the PlayStation 2 in 2002. The game is played by hitting a drum-shaped controller with two sticks to the beat of various songs. More details to follow.… Expand"}, {"name": "Sonic Generations", "details_link": "https://www.metacritic.com/game/xbox-360/sonic-generations", "publisher": "Sega", "release_date": "Nov  1 2011", "developers": ["Sega", "Sonic Team"], "platforms": ["3DS", "PC", "PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/fd90c6549b30e77a8570d412c8d41cec-98.jpg", "descriptions": "Set across three defining eras from 20 years of Sonic the Hedgehog video game history, the instantly recognisable environments of Sonic Generations have been re-built in stunning HD and are now playable in both classic side scrolling 2D from 1991, as well as modern 3D style found in Sonic'sSet across three defining eras from 20 years of Sonic the Hedgehog video game history, the instantly recognisable environments of Sonic Generations have been re-built in stunning HD and are now playable in both classic side scrolling 2D from 1991, as well as modern 3D style found in Sonic's most recent adventures. Each incarnation of Sonic in Sonic Generations comes complete with his trademark special move, Spin Dash and Spin Attack for Classic Sonic, and Homing Attack and Sonic Boost for Modern Sonic. An innovative new interactive menu system allows for complete immersion in Sonic's universe with favourite characters and hidden treasures gradually being revealed throughout the game. … Expand"}, {"name": "Ruined King: A League of Legends Story", "details_link": "https://www.metacritic.com/game/playstation-4/ruined-king-a-league-of-legends-story", "publisher": "Riot Forge", "release_date": "Nov 16 2021", "developers": ["Airship Syndicate Entertainment"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "General"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/f49f6dc0dbf21e6ec17ef475e85ebc14-98.jpg", "descriptions": "Rise Against Ruin. Unite a party of League of Legends Champions, explore Bilgewater and set sail for the Shadow Isles to uncover the secrets of the deadly Black Mist. Developed by Airship Syndicate and featuring the art style of legendary comic book artist Joe Madureira, creators of BattleRise Against Ruin. Unite a party of League of Legends Champions, explore Bilgewater and set sail for the Shadow Isles to uncover the secrets of the deadly Black Mist. Developed by Airship Syndicate and featuring the art style of legendary comic book artist Joe Madureira, creators of Battle Chasers and Darksiders, Ruined King: A League of Legends Story is the first Riot Forge game that invites you to explore the League of Legends universe. In this immersive turn-based RPG, you will have the freedom to configure your party and control an unlikely group of League of Legends champions, explore the bustling city of Bilgewater and the mysterious Shadow Isles, and experience the Lane Initiative System. … Expand"}, {"name": "Duke Nukem 3D: 20th Anniversary World Tour", "details_link": "https://www.metacritic.com/game/playstation-4/duke-nukem-3d-20th-anniversary-world-tour", "publisher": "Gearbox Software", "release_date": "Oct 11 2016", "developers": ["Gearbox Software"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/68060a8c0840a3195bd6c41363979161-98.jpg", "descriptions": "Frag like it’s 1996 – this time with even more asses to kick! Join the world’s greatest action hero in Duke Nukem 3D: 20th Anniversary World Tour as he saves Earth once again, kicking alien ass and saving babes across the globe along the way."}, {"name": "Scott Pilgrim vs. the World: The Game", "details_link": "https://www.metacritic.com/game/playstation-3/scott-pilgrim-vs-the-world-the-game", "publisher": "Ubisoft", "release_date": "Aug 10 2010", "developers": ["Ubisoft Montreal"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "General", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/680d367bc0e6b8a57fcb871acdb64547-98.jpg", "descriptions": "This will be a video game based on Universal Pictures' upcoming action-comedy, Scott Pilgrim vs. the World."}, {"name": "King's Quest Chapter 1: A Knight to Remember", "details_link": "https://www.metacritic.com/game/playstation-4/kings-quest-chapter-1-a-knight-to-remember", "publisher": "Sierra Games", "release_date": "Jul 28 2015", "developers": ["The Odd Gentlemen"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/aee0f4444c6c0ff171235fb598943abf-98.jpg", "descriptions": "King’s Quest is a collection of 5 different chapter releases, each focusing on an untold tale in Graham’s past. In each installment, an aging King Graham reflects on his life of adventure with his granddaughter, Gwendolyn, while players are thrust back to influence first-hand the decisionsKing’s Quest is a collection of 5 different chapter releases, each focusing on an untold tale in Graham’s past. In each installment, an aging King Graham reflects on his life of adventure with his granddaughter, Gwendolyn, while players are thrust back to influence first-hand the decisions and events that shaped a kingdom. Embark on an extraordinary journey across the world of Daventry. [Sierra]… Expand"}, {"name": "Ape Escape 3", "details_link": "https://www.metacritic.com/game/playstation-2/ape-escape-3", "publisher": "SCEA", "release_date": "Jan 17 2006", "developers": ["SCE Japan Studio"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 77, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/fde9dc204c79d92b964709656a95423f-98.jpg", "descriptions": "Specter and the monkeys are back and determined to rule the world Under Specter's command, the mischievous monkeys are taking control of your television and airing programming that will cloud the mind of anyone who watches. Heroes Kei and Yumi dash through the TV studios capturing monkeysSpecter and the monkeys are back and determined to rule the world Under Specter's command, the mischievous monkeys are taking control of your television and airing programming that will cloud the mind of anyone who watches. Heroes Kei and Yumi dash through the TV studios capturing monkeys just as their outrageous shows hit the airwaves. Help us stop this primetime primate invasion! Morph into unique characters to progress through game levels and discover hidden areas. Transform into a ninja, a ghun slinging cowboy, kung fu fighter, a dragon slayer knight and more. Enjoy a hilarious storyline as the monkeys hijack the broadcast world from familiar drama and sports broadcasting to variety shows and even infomercials. Monkey AI is smarter, more varied and tougher! Monkeys can dodge player attacks and retreat as well as counterattack by disarming players and then using the captured weapons on them. Utilize innovative gadgets and weapons - including radar sweep and hoop attacks. \rHunt down those pesky monkeys with drivable vehicles, including a crafty tank, powerboat and sports car. [Sony Computer Entertainment]… Expand"}, {"name": "Gunvolt Chronicles: Luminous Avenger iX 2", "details_link": "https://www.metacritic.com/game/switch/gunvolt-chronicles-luminous-avenger-ix-2", "publisher": "Inti Creates", "release_date": "Jan 27 2022", "developers": ["Inti Creates"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/13efb4d258fac05e061fa6781803e91a-98.jpg", "descriptions": "Get ready to break into the new apeX of 2D action. Copen and Lola are back in Gunvolt Chronicles: Luminous Avenger iX 2!"}, {"name": "Shadows: Awakening", "details_link": "https://www.metacritic.com/game/pc/shadows-awakening", "publisher": "Kalypso", "release_date": "Aug 31 2018", "developers": ["Games Farm", "Games Farm s.r.o."], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General", "Western-Style"], "meta_score": 77, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/8e1748dd75781b3c7e5ed1aeb62f71f0-98.jpg", "descriptions": "Shadows: Awakening is a unique, isometric single-player RPG with real-time tactical combat. You embark on an epic adventure with challenging gameplay, a gripping storyline and enchanting graphics."}, {"name": "Batman: The Enemy Within - Episode 1: The Enigma", "details_link": "https://www.metacritic.com/game/xbox-one/batman-the-enemy-within---episode-1-the-enigma", "publisher": "Telltale Games", "release_date": "Aug  8 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 77, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/0/b2ad84c83d869dee639dd6af18fa1b16-98.jpg", "descriptions": "Both Bruce Wayne and Batman are forced into precarious new roles. The Riddler has returned to terrorize Gotham City, but his gruesome puzzles merely foreshadow an even greater crisis. With the arrival of a ruthless federal agent and the return of a still nascent Joker, Batman must navigateBoth Bruce Wayne and Batman are forced into precarious new roles. The Riddler has returned to terrorize Gotham City, but his gruesome puzzles merely foreshadow an even greater crisis. With the arrival of a ruthless federal agent and the return of a still nascent Joker, Batman must navigate uneasy alliances while Bruce Wayne undertakes a perilous series of deceptions.… Expand"}, {"name": "GRID Legends", "details_link": "https://www.metacritic.com/game/playstation-5/grid-legends", "publisher": "Electronic Arts", "release_date": "Feb 25 2022", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 22 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 77, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/1db9c06098b1c8d62ed222551637de79-98.jpg", "descriptions": "Grid Legends combines thrilling motorsport action, incredible race variety, and an immersive story that puts the player at the heart of the action. Blending brand new features with a quarter-century legacy of fantastic racing experiences, today’s official reveal trailer kicks off a newGrid Legends combines thrilling motorsport action, incredible race variety, and an immersive story that puts the player at the heart of the action. Blending brand new features with a quarter-century legacy of fantastic racing experiences, today’s official reveal trailer kicks off a new chapter for a legendary racing series.… Expand"}, {"name": "Bomb Chicken", "details_link": "https://www.metacritic.com/game/switch/bomb-chicken", "publisher": "Nitrome", "release_date": "Jul 12 2018", "developers": ["Nitrome"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/ca77791eaf14aad6dfb71329d742cca0-98.jpg", "descriptions": "After a freak accident, a seemingly ordinary chicken becomes a bomb laying free range hero. Explore the versatile mechanic of laying bombs in this explosive exploration platformer."}, {"name": "Sonic the Hedgehog (Live Arcade)", "details_link": "https://www.metacritic.com/game/xbox-360/sonic-the-hedgehog-live-arcade", "publisher": "Sega", "release_date": "Jul 11 2007", "developers": ["Backbone Entertainment"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "Switch", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/1958305dd075612383bb74d4e1090aac-98.jpg", "descriptions": "[Xbox Live Arcade]  Sonic, the fastest blue hedgehog on earth, rocket through hair-raising loop-de-loops and take dizzying dives past bubbling lava, waterfalls and more in Sonic the Hedgehog Arcade. Gather up the rings and stop Dr.Eggman's (aka Dr. Robotnik) schemes for world domination.[Xbox Live Arcade]  Sonic, the fastest blue hedgehog on earth, rocket through hair-raising loop-de-loops and take dizzying dives past bubbling lava, waterfalls and more in Sonic the Hedgehog Arcade. Gather up the rings and stop Dr.Eggman's (aka Dr. Robotnik) schemes for world domination. Enhanced version: Newly enhanced graphics bring this 1991 console classic to life as never before. Once again, you can thrill to Sonic's adventures, but this time in an updated environment.Leaderboards: Top Score leaderboards are there to keep track of your progress. All new achievements: Twelve new achievements, range from simple such as clearing the Green Hill Zone or collecting one hundred rings, to more challenging, such as trying to complete the game without losing a life. [Microsoft]… Expand"}, {"name": "Thomas Was Alone", "details_link": "https://www.metacritic.com/game/pc/thomas-was-alone", "publisher": "Mike Bithell", "release_date": "Jun 30 2012", "developers": ["Mike Bithell"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/f21bec9cf92f5de413a298629cb456d8-98.jpg", "descriptions": "Thomas won't be entirely alone, he'll be joined throughout by the awesome Mr Danny Wallace (XFM, Yes Man and Assassin's Creed) who will be narrating his adventures."}, {"name": "The Adventure Pals", "details_link": "https://www.metacritic.com/game/switch/the-adventure-pals", "publisher": "Armor Games", "release_date": "Apr  3 2018", "developers": ["Massive Monster"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/0dc5ee7aec00959c319ebba93ba383a8-98.jpg", "descriptions": "Your birthday is ruined when your dad is dad-napped by a madman. Now you, your pet rock, and Sparkles the giraffe will have to fight your way through levels filled with platforming, bizarre enemies, and big bosses in the name of friendship and hotdogs to save the world."}, {"name": "World of Final Fantasy", "details_link": "https://www.metacritic.com/game/pc/world-of-final-fantasy", "publisher": "Square Enix", "release_date": "Nov 21 2017", "developers": ["Square Enix"], "platforms": ["PlayStation 4", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/54732a39e9b67c889e52a7f5ec425601-98.jpg", "descriptions": "Embark on an adventure unlike any before to an all new WORLD OF FINAL FANTASY. With charming, stylized visuals for both the young and the young at heart, players will collect, raise, and battle iconic monsters by stacking them to form adorable yet strategic monster towers. The memorableEmbark on an adventure unlike any before to an all new WORLD OF FINAL FANTASY. With charming, stylized visuals for both the young and the young at heart, players will collect, raise, and battle iconic monsters by stacking them to form adorable yet strategic monster towers. The memorable legends of FINAL FANTASY come to life in this imaginative, colorful world as an epic story fit for the smallest of heroes unfolds.… Expand"}, {"name": "Ittle Dew 2+", "details_link": "https://www.metacritic.com/game/switch/ittle-dew-2+", "publisher": "Nintendo", "release_date": "Nov 14 2017", "developers": ["Ludosity Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "General", "Action RPG"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/532e49af9d5aa386d0f2091cbaa57d9a-98.jpg", "descriptions": "Fantasy and reality collide on an island of enchantment. Sassy adventurer Ittle and her flying fox friend Tippsie are back for their greatest adventure ever! Lost on a remote island and armed with a magical map, our heroes make new friends and bitter enemies as they search for valuable loot.Fantasy and reality collide on an island of enchantment. Sassy adventurer Ittle and her flying fox friend Tippsie are back for their greatest adventure ever! Lost on a remote island and armed with a magical map, our heroes make new friends and bitter enemies as they search for valuable loot. Help them find the eight scattered pieces of the raft that could be their ticket home!… Expand"}, {"name": "Quantum Break", "details_link": "https://www.metacritic.com/game/xbox-one/quantum-break", "publisher": "Microsoft Game Studios", "release_date": "Apr  5 2016", "developers": ["Remedy Entertainment"], "platforms": ["PC", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "General"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/4b64e1cfe3a86be6630c34daa69850c7-98.jpg", "descriptions": "Quantum Break blurs the line between television and gameplay, integrating the two into one seamless, uniquely immersive experience. Quantum Break weaves the cinematic action of intense gameplay with the tension and drama of scripted television, creating a world where each has a direct impactQuantum Break blurs the line between television and gameplay, integrating the two into one seamless, uniquely immersive experience. Quantum Break weaves the cinematic action of intense gameplay with the tension and drama of scripted television, creating a world where each has a direct impact on the other.… Expand"}, {"name": "World of Final Fantasy", "details_link": "https://www.metacritic.com/game/playstation-4/world-of-final-fantasy", "publisher": "Square Enix", "release_date": "Oct 25 2016", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/d38e9fc9f264bf51cfeb93dd2c1eb91e-98.jpg", "descriptions": "Embark on an adventure unlike any before to an all new WORLD OF FINAL FANTASY. With charming, stylized visuals for both the young and the young at heart, players will collect, raise, and battle iconic monsters by stacking them to form adorable yet strategic monster towers. The memorableEmbark on an adventure unlike any before to an all new WORLD OF FINAL FANTASY. With charming, stylized visuals for both the young and the young at heart, players will collect, raise, and battle iconic monsters by stacking them to form adorable yet strategic monster towers. The memorable legends of FINAL FANTASY come to life in this imaginative, colorful world as an epic story fit for the smallest of heroes unfolds.… Expand"}, {"name": "Dungeons & Dragons: Chronicles of Mystara", "details_link": "https://www.metacritic.com/game/xbox-360/dungeons-dragons-chronicles-of-mystara", "publisher": "Capcom", "release_date": "Jun 19 2013", "developers": ["Iron Galaxy Studios"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Beat-'Em-Up", "Compilation"], "meta_score": 77, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/6/f62021b952ae083b82a38eb4c9777e41-98.jpg", "descriptions": "As the first modern role playing game, the Dungeons & Dragons franchise from Wizards of the Coast gave birth to numerous products including two arcade titles from Capcom, Dungeons & Dragons: Tower of Doom and its sequel Dungeons & Dragons: Shadow over Mystara.  Both these titlesAs the first modern role playing game, the Dungeons & Dragons franchise from Wizards of the Coast gave birth to numerous products including two arcade titles from Capcom, Dungeons & Dragons: Tower of Doom and its sequel Dungeons & Dragons: Shadow over Mystara.  Both these titles are now being re-released with updated HD graphics and a wealth of other enhancements as a definitive double pack entitled Dungeons & Dragons: Chronicles of Mystara.… Expand"}, {"name": "Super Crush K.O.", "details_link": "https://www.metacritic.com/game/switch/super-crush-ko", "publisher": "Vertex Pop", "release_date": "Jan 16 2020", "developers": ["Vertex Pop"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/54110c72d56a76bcadb67df338cb77d3-98.jpg", "descriptions": "Super Crush KO is a fast-paced brawler set in a vibrant, near-future city. Zip up your favorite neon jacket and combo your way through swarms of deadly robots to save your kidnapped kitten and, while you’re at it, save humanity from an AI apocalypse."}, {"name": "Wik & the Fable of Souls", "details_link": "https://www.metacritic.com/game/xbox-360/wik-the-fable-of-souls", "publisher": "Reflexive Entertainment", "release_date": "Dec 14 2005", "developers": ["Reflexive Entertainment"], "platforms": ["PC", "Xbox 360"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/f843ed3cc22d85e0fb0b094d5af55afd-98.jpg", "descriptions": "[Xbox Live Arcade]  A beautiful and mysterious world of fairytale charm unfolds in Wik: The Fable of Souls as you swing by your ... tongue? Wik offers up more than 120 single-player levels and seven different modes of play. Up to four players can join in on the fun in multiplayer modes,[Xbox Live Arcade]  A beautiful and mysterious world of fairytale charm unfolds in Wik: The Fable of Souls as you swing by your ... tongue? Wik offers up more than 120 single-player levels and seven different modes of play. Up to four players can join in on the fun in multiplayer modes, where an action frenzy of firebug-dodging, acorn-spitting, and swing-chasing mayhem is sure to satisfy! Unique play mechanic, winner of 2005 IGF award for Innovation in Game Design. [Xbox.com]… Expand"}, {"name": "Blasphemous", "details_link": "https://www.metacritic.com/game/pc/blasphemous", "publisher": "Team17", "release_date": "Sep 10 2019", "developers": ["The Game Kitchen"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "", "Metroidvania"], "meta_score": 77, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/3a2ddc3d6bc8074ac1908e4c87041b0f-98.jpg", "descriptions": "Blasphemous is a punishing action-platformer that combines the fast-paced, skilled combat of a hack-n-slash game with a deep and evocative narrative core, delivered through exploration of a huge universe comprised of non-linear levels."}, {"name": "Universe at War: Earth Assault", "details_link": "https://www.metacritic.com/game/pc/universe-at-war-earth-assault", "publisher": "Sega", "release_date": "Dec 10 2007", "developers": ["Petroglyph"], "platforms": ["Xbox 360", "PC"], "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/2aeda1e4020e79324a0f6e498e922753-98.jpg", "descriptions": "Developed by Petroglyph, this combat-intensive real-time strategy game enlists players in an epic struggle to prevent total alien domination of planet Earth. Universe at War: Earth Assault is set in the near-future when multiple factions from across the galaxy have come to Earth to wage epicDeveloped by Petroglyph, this combat-intensive real-time strategy game enlists players in an epic struggle to prevent total alien domination of planet Earth. Universe at War: Earth Assault is set in the near-future when multiple factions from across the galaxy have come to Earth to wage epic warfare. Containing numerous features and customization options never-before-seen in the RTS genre, Universe at War: Earth Assault creates an exceptional strategy experience for single-player and especially multiplayer battles. The game employs a unique balance system called \"Tactical Dynamics\" that allows players to retrain and customize units in the midst of battle to better cope with enemy forces and tactical situations. Weaponry and defenses can be modified in true real-time to take advantage of constantly shifting battlefield conditions. Fully customizable tech trees allow players to control the development of technologies that they deem key to victory. Battles in Universe at War: Earth Assault are large in scope and take place in malleable and deforming environments. Deadly sci-fi weapons and alien powers will allow players to destroy cities and whole territories on a global scale. Because the world of Universe at War: Earth Assault is persistent, players can revisit previous battlegrounds to find them still smoldering in ruins. The game gives players achievements, rewards, and medals in a balanced environment to further encourage players to move forward in the game. Players from around the world battle in persistent-style online campaigns for ultimate faction supremacy across a virtual representation of the Earth. [Sega]… Expand"}, {"name": "One Piece Odyssey", "details_link": "https://www.metacritic.com/game/pc/one-piece-odyssey", "publisher": "Bandai Namco Games", "release_date": "Jan 12 2023", "developers": ["ILCA", "Inc."], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 77, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/828487e74ce05c1db972b1b896bb0304-98.jpg", "descriptions": "Join this brand-new RPG featuring new character and monster designs produced by Eiichiro Oda, the author of ONE PIECE. The game is also complemented by the beautiful music of Motoi Sakuraba, a composer well known for his various contributions to video games such as the Dark Souls and TalesJoin this brand-new RPG featuring new character and monster designs produced by Eiichiro Oda, the author of ONE PIECE. The game is also complemented by the beautiful music of Motoi Sakuraba, a composer well known for his various contributions to video games such as the Dark Souls and Tales of series.During their voyage, the Straw Hats, led by Monkey D. Luffy are swallowed by a huge storm at sea. They end up on a mysterious island full of nature amidst the storm and become separated from each other. The crew sets out on a new adventurous journey filled with wonders of a raging nature, powerful enemies, and strange encounters with island locals.Work together with Luffy and his crew to set sail once again!… Expand"}, {"name": "The Incredible Adventures of Van Helsing II", "details_link": "https://www.metacritic.com/game/pc/the-incredible-adventures-of-van-helsing-ii", "publisher": "NeocoreGames", "release_date": "Jun 13 2014", "developers": ["NeocoreGames"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/e012249222542c5307cbb4e574b0ba3b-98.jpg", "descriptions": "The incredible adventures continue, and Van Helsing, the famous monster-hunter returns to save the day again with the help of his charming, ghostly companion, Lady Katarina. The gothic metropolis of weird science is on the brink of destruction as chaos rules the streets and a new enemy plotsThe incredible adventures continue, and Van Helsing, the famous monster-hunter returns to save the day again with the help of his charming, ghostly companion, Lady Katarina. The gothic metropolis of weird science is on the brink of destruction as chaos rules the streets and a new enemy plots revenge. Itâ€™s time to enter the dark side of Borgova and the forbidden wilderness, but beware: you are not the only one behind a mask.… Expand"}, {"name": "Life is Strange: Episode 2 - Out of Time", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-episode-2---out-of-time", "publisher": "Square Enix", "release_date": "Mar 24 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action Adventure", "General"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/621535b24c7dd16299e8b444f1df7ba1-98.jpg", "descriptions": "Reunited with her friend Chloe, Max begins experimenting with her power and starts to wonder if it is related to her visions or the weird snow from the previous day. But life goes on in Blackwell Academy and a certain viral video has become a serious topic of discussion. Meanwhile, what DIDReunited with her friend Chloe, Max begins experimenting with her power and starts to wonder if it is related to her visions or the weird snow from the previous day. But life goes on in Blackwell Academy and a certain viral video has become a serious topic of discussion. Meanwhile, what DID happen to Rachel Amber? … Expand"}, {"name": "Digimon Survive", "details_link": "https://www.metacritic.com/game/switch/digimon-survive", "publisher": "Bandai Namco Games", "release_date": "Jul 29 2022", "developers": ["Bandai Namco Games", "Hyde", "WitchCraft"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Trainer", "Strategy", "Turn-Based", "Tactics"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/31dbfbc89213ae4f1a6e1c5ad22fff2b-98.jpg", "descriptions": "Digimon Survive presents a hybrid visual novel and tactical RPG set in a mysterious world filled with dangerous monsters and deadly battles that will test your ability to survive. After getting lost on a school trip, Takuma Momozuka finds himself transported to a world inhabited by ferociousDigimon Survive presents a hybrid visual novel and tactical RPG set in a mysterious world filled with dangerous monsters and deadly battles that will test your ability to survive. After getting lost on a school trip, Takuma Momozuka finds himself transported to a world inhabited by ferocious foes and new allies. Join Takuma and his friends as they fight their way back home. Craft your story in this thrilling visual novel with turn-based combat.\r Key Features:\r Rich Visual Novel Experience – Unfold a dark tale about friendship and survival that is jam-packed with exciting drama, a unique cast of characters, and potentially grim choices.\r  A Mysterious World – Explore otherworldly areas filled with hidden secrets and Digimon to recruit.\r  The Power Is Yours – Your choices affect gameplay: your bond with other NPCs, your Digimon’s evolution, and the outcome of your adventure.\r  Thrilling & Strategic Gameplay – Persuade your opponents to join your team and evolve them to fight alongside you in battles thrilling turn-based battles.… Expand"}, {"name": "SpellForce III Reforced", "details_link": "https://www.metacritic.com/game/xbox-series-x/spellforce-iii-reforced", "publisher": "THQ Nordic", "release_date": "Jun  7 2022", "developers": ["Grimlore Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 6 ", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 77, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/7461fd339b0e06b06610fd70507494a4-98.jpg", "descriptions": "SpellForce III Reforced is a unique mix of an epic RPG storyline blended with accessible real-time strategy elements, designed to offer a riveting console experience to fans and newcomers alike. It is the year 518. The rebellion of the renegade mages, known as the Mage Wars, has been quashedSpellForce III Reforced is a unique mix of an epic RPG storyline blended with accessible real-time strategy elements, designed to offer a riveting console experience to fans and newcomers alike. It is the year 518. The rebellion of the renegade mages, known as the Mage Wars, has been quashed by the Crown. However, it was a Pyrrhic victory: Whole regions have fallen into anarchy, refugees roam the lands in search of shelter, and a mysterious, deadly plague called the “Bloodburn” has arisen and is spreading rapidly. In times like these people cling to any sign of hope they can find. The Purity of Light, led by a charismatic man called Rondar Lacaine, claims that mages are the source of all misfortune – and that only the second coming of Aonir, the father of all gods, will return Eo to its former splendor. The story takes place before the acclaimed SpellForce: The Order of Dawn.… Expand"}, {"name": "The Council - Episode 3: Ripples", "details_link": "https://www.metacritic.com/game/xbox-one/the-council---episode-3-ripples", "publisher": "Focus Home Interactive", "release_date": "Jul 24 2018", "developers": ["Big Bad Wolf"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/2777379c63897f123e6de81c014a9bf6-98.jpg", "descriptions": "Episode 3: Ripples continues the story of Louis de Richet as plots are laid bare, characters reach their breaking point, and an unexpected, terrifying truth is uncovered. It will take all of Louis’ influence to prevent the situation from growing out of hand in this third episode of theEpisode 3: Ripples continues the story of Louis de Richet as plots are laid bare, characters reach their breaking point, and an unexpected, terrifying truth is uncovered. It will take all of Louis’ influence to prevent the situation from growing out of hand in this third episode of the adventure game The Council.… Expand"}, {"name": "Herald: An Interactive Period Drama", "details_link": "https://www.metacritic.com/game/pc/herald-an-interactive-period-drama", "publisher": "Wispfire", "release_date": "Feb 22 2017", "developers": ["Wispfire"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/89c30da432a2e68f8cb68725594e7792-98.jpg", "descriptions": "Herald is a choice-driven adventure set during colonial times. Board the HLV Herald and uncover its dark secrets in a tale about tyranny and servitude."}, {"name": "3D Classics: Kid Icarus", "details_link": "https://www.metacritic.com/game/3ds/3d-classics-kid-icarus", "publisher": "Nintendo", "release_date": "Mar 23 2012", "developers": ["Arika"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/6ad1ca575b65b936c16fde33fb37f496-98.jpg", "descriptions": "Enjoy classic games with a new dimension via the 3D Classics range, remastered with immersive 3D visuals! From the creators of Metroid comes Kid Icarus: an action-platformer starring angelic warrior Pit, whose quest is to rescue the goddess Palutena and save Angel Land from the evil Medusa.Enjoy classic games with a new dimension via the 3D Classics range, remastered with immersive 3D visuals! From the creators of Metroid comes Kid Icarus: an action-platformer starring angelic warrior Pit, whose quest is to rescue the goddess Palutena and save Angel Land from the evil Medusa. Armed with his trusty bow and arrow, Pit must battle from the underworld to the sky, to seek out the Three Sacred Treasures - only then will Pit have the power to take on Medusa. Look out for Pit's return in Kid Icarus: Uprising for Nintendo 3DS!… Expand"}, {"name": "Daytona USA", "details_link": "https://www.metacritic.com/game/xbox-360/daytona-usa", "publisher": "Sega", "release_date": "Oct 26 2011", "developers": ["Sega AM2"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/44bee8669be41c24014aeb1f38d682fe-98.jpg", "descriptions": "SEGA of America, Inc. and SEGA Europe Ltd. today announced the triumphant return of the cherished arcade racer, Daytona USA, coming this month to home consoles. Speeding out of the past from its 1993 debut, Daytona USA will be racing onto Xbox LIVE Arcade for the Xbox 360 video game andSEGA of America, Inc. and SEGA Europe Ltd. today announced the triumphant return of the cherished arcade racer, Daytona USA, coming this month to home consoles. Speeding out of the past from its 1993 debut, Daytona USA will be racing onto Xbox LIVE Arcade for the Xbox 360 video game and entertainment system from Microsoft, and PlayStation Network. The classic title has been tuned up and overhauled with enhanced graphics, steering wheel support and, for the first time on home consoles, online multiplayer. … Expand"}, {"name": "Teslagrad", "details_link": "https://www.metacritic.com/game/pc/teslagrad", "publisher": "Rain Games", "release_date": "Dec 13 2013", "developers": ["Rain Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/b0735a8a11c8dc08df8835b8ea67f946-98.jpg", "descriptions": "Teslagrad is a 2D puzzle-platformer, where you play as a young lad who suddenly finds himself embroiled in an ancient conflict that will shake the foundations of his entire existence, and bring a gruesome truth to light.\r The game revolves around the use of electricity and magnetism, andTeslagrad is a 2D puzzle-platformer, where you play as a young lad who suddenly finds himself embroiled in an ancient conflict that will shake the foundations of his entire existence, and bring a gruesome truth to light.\r The game revolves around the use of electricity and magnetism, and your ingenuity will be put to the test as you employ the amazing technology of the Teslamancers to traverse the abandoned Tesla Tower. The game is completely devoid of both text and dialogue, and prefers to tell the story purely through visual means.… Expand"}, {"name": "Fae Tactics", "details_link": "https://www.metacritic.com/game/pc/fae-tactics", "publisher": "Humble Bundle", "release_date": "Jul 31 2020", "developers": ["Humble Bundle", "Humble Games", "Endlessfluff Games"], "platforms": ["Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 77, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/8d4aae375996037204c82baa35b73b1f-98.jpg", "descriptions": "In Fae Tactics, follow a young magic user named Peony on her journey across a vibrant world full of mystery and danger. Summon allies, cast spells, and befriend a motley crew of characters as you dive into the growing conflicts between man and magical beings known as fae."}, {"name": "Tales of Monkey Island Chapter 2: The Siege of Spinner Cay", "details_link": "https://www.metacritic.com/game/pc/tales-of-monkey-island-chapter-2-the-siege-of-spinner-cay", "publisher": "Telltale Games", "release_date": "Aug 20 2009", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/b20499792cb98aa3deb220fe0a78b9f9-98.jpg", "descriptions": "When we left Guybrush Threepwood, he'd just escaped the mysterious winds of Flotsam Island aboard the well-meaning sailing ship The Screaming Narwhal. However, his hand is still cursed, and LeChuck--now in human form--seems, from a distance, to be courting fair Elaine's favor. To top it all,When we left Guybrush Threepwood, he'd just escaped the mysterious winds of Flotsam Island aboard the well-meaning sailing ship The Screaming Narwhal. However, his hand is still cursed, and LeChuck--now in human form--seems, from a distance, to be courting fair Elaine's favor. To top it all, he's been intercepted by a mysterious figure, yet unrevealed. I wonder what happens next. [Telltale Games]… Expand"}, {"name": "Hearts of Iron III", "details_link": "https://www.metacritic.com/game/pc/hearts-of-iron-iii", "publisher": "Paradox Interactive", "release_date": "Aug  7 2009", "developers": ["Paradox Development Studio"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/8d84188f51685253564aa15e8f7687ba-98.jpg", "descriptions": "Play as any nation from 1936 to1948 with more than 150 countries to choose from. More than 10,000 land provinces makes this game five times more detailed than Hearts of Iron 2 and the most detailed depiction of World War 2 ever made. Control the oceans with aircraft carriers, submarines andPlay as any nation from 1936 to1948 with more than 150 countries to choose from. More than 10,000 land provinces makes this game five times more detailed than Hearts of Iron 2 and the most detailed depiction of World War 2 ever made. Control the oceans with aircraft carriers, submarines and battleships. Use your air force to defend the skies, support naval and ground forces, and bomb your enemies. Customize your divisions in detail with more than 20 types of brigades.New economic system makes it possible to buy weapons overseas. Mobilization and reserves gives the option of surprise attacks. A completely new intelligence system makes it possible to get information about enemy reserves and troop movements.Assign troops to theatres on the map to fight two-front wars more successfully. Thousands of historically accurate real-world military commanders and politicians. Realistic military command AI with unprecedented levels of interaction. In-depth diplomatic and political system. [Paradox Interactive]… Expand"}, {"name": "#IDARB", "details_link": "https://www.metacritic.com/game/xbox-one/idarb", "publisher": "Other Ocean Interactive", "release_date": "Jan 30 2015", "developers": ["Other Ocean Interactive"], "platforms": "Xbox One", "genres": ["Action", "Miscellaneous", "General", "Party / Minigame"], "meta_score": 77, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/31b242b1dd6542eb1965999f0e9b781b-98.jpg", "descriptions": "#IDARB started as a picture of red box. Then more happened. It's a constantly-evolving, crowd-sourced, minimalist game mechanic sketchbook."}, {"name": "Azure Striker Gunvolt", "details_link": "https://www.metacritic.com/game/3ds/azure-striker-gunvolt", "publisher": "Inti Creates", "release_date": "Aug 29 2014", "developers": ["Inti Creates"], "platforms": ["PC", "Xbox One", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/c05a96e6d6a198c547b745d2b0d2941b-98.jpg", "descriptions": "When lightning strikes, a new legend will be born. Azure Striker GUNVOLT is a 2D side-scrolling action game. The heroe's agility and control over lightning create a fresh approach to the genre that gives the player a unique feeling of speed and power."}, {"name": "FIFA Soccer 06", "details_link": "https://www.metacritic.com/game/psp/fifa-soccer-06", "publisher": "EA Sports", "release_date": "Oct 11 2005", "developers": ["EA Sports"], "platforms": ["PC", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/498725f4f1b007ff0a9cfad24570eb90-98.jpg", "descriptions": "FIFA Soccer 06 brings the total football experience to your fingertips. It delivers a combination of attacking gameplay, complete customization, pure authenticity and the deepest manager mode ever. Intuitive gameplay enables you to command every move of your player with pinpoint accuracy.FIFA Soccer 06 brings the total football experience to your fingertips. It delivers a combination of attacking gameplay, complete customization, pure authenticity and the deepest manager mode ever. Intuitive gameplay enables you to command every move of your player with pinpoint accuracy. Passing, shooting and tackling is now more responsive than ever and enables you to trap, shield and dribble like a world-class football player. Experience 90 minutes of heart pumping football, feel the Team Chemistry of your side and the sense of momentum shift as you battle for supremacy on the pitch. As the Midfield General you'll control the overarching strategy of the game, dictating the pace and performance of your players as you execute strategic decisions on the fly using the tactical play button configurations. [EA Sports]… Expand"}, {"name": "Darksiders II: Deathinitive Edition", "details_link": "https://www.metacritic.com/game/switch/darksiders-ii-deathinitive-edition", "publisher": "THQ Nordic", "release_date": "Sep 26 2019", "developers": ["Gunfire Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/c0a98314e9d0d186f3aeded50bddafa9-98.jpg", "descriptions": "What starts with War, ends in Death. \r\rAwakened by the End of Days, Death, the most feared of the legendary Four Horsemen, embarks upon a quest to restore mankind, and redeem his brother's name. Along the way, the Horseman discovers that there are far worse things than an earthlyWhat starts with War, ends in Death. \r\rAwakened by the End of Days, Death, the most feared of the legendary Four Horsemen, embarks upon a quest to restore mankind, and redeem his brother's name. Along the way, the Horseman discovers that there are far worse things than an earthly Apocalypse, and that an ancient grudge may threaten all of Creation ... \r\rDeathinitive Edition Features: \r\r- Darksiders II with all DLC included and integrated into the game which offers a total playtime of more than 30 hours \r- Improved Graphic Render Engine for higher visual quality especially in terms of lighting and shadows \r- Improved and reworked level, character and environment graphics \r- Running in native 1080p resolution \r- Reworked and tuned game balancing and loot distribution… Expand"}, {"name": "Space Junkies", "details_link": "https://www.metacritic.com/game/pc/space-junkies", "publisher": "Ubisoft", "release_date": "Mar 21 2019", "developers": ["Ubisoft Montpellier"], "platforms": ["PlayStation 4", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Arcade"], "meta_score": 77, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/7/fccc5182461cb0fbe71bdb780eec1b11-98.jpg", "descriptions": "A visceral, jeckpack-fueled VR Arcade Shooter through which you fly through deadly Orbital Arenas in Hostile Space, facing off in extreme battles. [Ubisoft]"}, {"name": "Echoes Of Aetheria", "details_link": "https://www.metacritic.com/game/pc/echoes-of-aetheria", "publisher": "Degica", "release_date": "Jan 15 2016", "developers": ["Dancing Dragon games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/408748a203379b10dc9a99244af9423d-98.jpg", "descriptions": "Two nations finally achieve peace, marked by a momentous royal wedding. But just as they seal it with a kiss, a group of soldiers sabotage the wedding and kidnap the bride! Follow the story of Lucian, Ingrid, and Soha, as they uncover the secrets of the conspiracy and expose the true villains."}, {"name": "Life is Strange: Episode 1 - Chrysalis", "details_link": "https://www.metacritic.com/game/xbox-one/life-is-strange-episode-1---chrysalis", "publisher": "Square Enix", "release_date": "Jan 30 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "General"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/0c061204f3934f5169cf604d7121cfdc-98.jpg", "descriptions": "Chrysalis is an introduction to the world of Life is Strange. You’ll see Max and Chloe reunite and you’ll make important choices that will influence their destiny. You will observe some of the short-term consequences of those choices but know that there are also mid and long-termChrysalis is an introduction to the world of Life is Strange. You’ll see Max and Chloe reunite and you’ll make important choices that will influence their destiny. You will observe some of the short-term consequences of those choices but know that there are also mid and long-term repercussions that will pan out over the course of the later episodes, in a butterfly effect manner. [DONTNOD]… Expand"}, {"name": "Pacer", "details_link": "https://www.metacritic.com/game/playstation-4/pacer", "publisher": "R8 Games", "release_date": "Oct 22 2020", "developers": ["R8 Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Driving", "Racing", "Arcade", "Futuristic"], "meta_score": 77, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/c7bd318ae403076525a08c52671db02f-98.jpg", "descriptions": "Unique Storm Mode for single player and multiplayer: Life or death in a contracting field of play - the first ever Battle Royale arcade racer .\rSpectator Mode: Follow any pilot with Chase, Nose, Orbit or Environment cameras while displaying all race stats.\rHighly customizable: Craft,Unique Storm Mode for single player and multiplayer: Life or death in a contracting field of play - the first ever Battle Royale arcade racer .\rSpectator Mode: Follow any pilot with Chase, Nose, Orbit or Environment cameras while displaying all race stats.\rHighly customizable: Craft, weapons and cosmetics.\rReplay Mode: For capturing and sharing amazing action clips and stills.\rOnline Ranked Mode: Find out how your piloting skills rate against the best in the world.\rOnline Tournament/Spectator Mode: For easy streaming and encouraging fun events at all levels.\rCampaign: Unlock team skins, as well as more challenging tracks and speed classes.\rDesigners Republic partnership: Graphic designs that influenced a generation in games and music.\rOST and SFX: Created by Tim Wright aka CoLD SToRAGE.\rIn-game VOIP, making in-game chat both easy and fun.\rHosted servers: To level the online playing field and minimize the possibility of cheating.… Expand"}, {"name": "Nexus: The Jupiter Incident", "details_link": "https://www.metacritic.com/game/pc/nexus-the-jupiter-incident", "publisher": "HD Interactive", "release_date": "Feb 24 2005", "developers": ["Mithis/HD Interactive"], "platforms": "PC", "num_players": "12  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 77, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/8/c8ecf7cfb04d7f3b7237c9e341f0336a-98.jpg", "descriptions": "Immerse yourself in Nexus - The Jupiter Incident, a real-time mission-based tactical space game (\"what we call a TFS: a Tactical Fleet Simulator\") featuring spectacular real time battles and breathtaking motion picture quality. Focus on tactics and action as you control up to a dozenImmerse yourself in Nexus - The Jupiter Incident, a real-time mission-based tactical space game (\"what we call a TFS: a Tactical Fleet Simulator\") featuring spectacular real time battles and breathtaking motion picture quality. Focus on tactics and action as you control up to a dozen battleships encountering aliens, unknown solar systems and astrophysical phenomena in your struggle to save Earth.At the dawn of the 22nd century the conquest of space and the colonization of the solar system is being monopolized by several huge and ambitious megacorporations. Although extremely delicate and vulnerable, a balance is maintained by these companies. It has now been 60 years since the terrible catastrophe that befell Noah's Ark, the first colony ship of mankind. At the very edge of the solar system the companies make a discovery which will shift the technological advantage and upset the balance. And so a new conflict is born: \"The Jupiter Incident\". You are Marcus Cromwell, a young but already famous captain. With your legendary spaceship Stiletto you find yourself in the middle of the conflict. [HD Interactive]… Expand"}, {"name": "Naruto Shippuden: Ultimate Ninja Storm 3", "details_link": "https://www.metacritic.com/game/playstation-3/naruto-shippuden-ultimate-ninja-storm-3", "publisher": "Namco Bandai Games", "release_date": "Mar  5 2013", "developers": ["CyberConnect2"], "platforms": ["Switch", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/cdff4a02c42f51a9c8c78e78970dee8c-98.jpg", "descriptions": "Ultimate Ninja STORM 3 promises to unleash a tornado of ninja action and adventure that the franchise is known for, with over eighty playable characters, advanced online modes and enhanced fighting mechanics that allow anyone to become a ninja master."}, {"name": "Supreme Commander 2", "details_link": "https://www.metacritic.com/game/pc/supreme-commander-2", "publisher": "Square Enix", "release_date": "Mar  1 2010", "developers": ["Gas Powered Games"], "platforms": ["Xbox 360", "PC"], "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General", "Command"], "meta_score": 77, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/46061122221b0547406bc1aef032c6ed-98.jpg", "descriptions": "Experience brutal battles on a massive scale! In Supreme Commander 2, players wage war by creating enormous customizable armies and experimental war machines that can change the balance of power at any given moment. Take the role of one of the three enigmatic commanders, each representing aExperience brutal battles on a massive scale! In Supreme Commander 2, players wage war by creating enormous customizable armies and experimental war machines that can change the balance of power at any given moment. Take the role of one of the three enigmatic commanders, each representing a unique faction with a rich story that brings a new level of emotional connection to the RTS genre, or fight the battle online. Where do your loyalties lie? [Square Enix]… Expand"}, {"name": "Back 4 Blood", "details_link": "https://www.metacritic.com/game/pc/back-4-blood", "publisher": "Warner Bros. Games", "release_date": "Oct  7 2021", "developers": ["Turtle Rock Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Survival", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 77, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/0/20e089997af4f105d782e372270a2f63-98.jpg", "descriptions": "From the creators and development team behind the critically acclaimed, co-op phenomenon Left 4 Dead. Back 4 Blood is designed from the ground-up as an original, premium title and marries the best of what made the co-op zombie shooter so successful with new features and state-of-the-art technology."}, {"name": "Orwell", "details_link": "https://www.metacritic.com/game/pc/orwell", "publisher": "Surprise Attack", "release_date": "Oct 27 2016", "developers": ["Osmotic Studios"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/2fe3e2be78073141e828502594e9245c-98.jpg", "descriptions": "Big Brother has arrived - and it’s you. Investigate the lives of citizens to find those responsible for a series of terror attacks. Information from the internet, personal communications and private files are all accessible to you. But, be warned, the information you supply will have consequences."}, {"name": "Super Little Acorns 3D Turbo", "details_link": "https://www.metacritic.com/game/3ds/super-little-acorns-3d-turbo", "publisher": "Pixel Toys", "release_date": "Apr 18 2013", "developers": ["Pixel Toys"], "platforms": "3DS", "num_players": "1 Player", "genres": ["Action", "General", "General"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/41d928d7619a143f980db25901a327a2-98.jpg", "descriptions": "Time for some squirreling action! Prepare for some super squirreling action! Now with 50% new exclusive level content, ninja completion bonuses, super high speed turbo mode and a whole bunch of zany new squirrel outfits! Run, jump, swing and smash Mr Nibbles through 90 frantic levels ofTime for some squirreling action! Prepare for some super squirreling action! Now with 50% new exclusive level content, ninja completion bonuses, super high speed turbo mode and a whole bunch of zany new squirrel outfits! Run, jump, swing and smash Mr Nibbles through 90 frantic levels of pixel perfect platforming. Mr Nibbles goes nuts for acorns and he’s on a mission to reclaim his stash from the pesky critters who stole them so he can feed his growing family. Delivering some of the best platform gameplay yet and featuring wonderful crisp graphics, Super Little Acorns 3D Turbo is a must have for platform game fans. Grapple and swing Mr Nibbles through 30 exclusive Challenge stages to test your squirreling skills. Adventure through 60 main game stages spread across four seasons with epic boss levels and completion goals, enough to keep you playing until winter! Collect power-ups to supercharge Mr. Nibbles through his adventure, including Tough Nut to smash through enemies and walls!… Expand"}, {"name": "Turok 3: Shadow of Oblivion", "details_link": "https://www.metacritic.com/game/nintendo-64/turok-3-shadow-of-oblivion", "publisher": "Acclaim", "release_date": "Aug 30 2000", "developers": ["Acclaim Studios Austin"], "platforms": "Nintendo 64", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/65dfeb47daef133d8b29adb5fdeb9bba-98.jpg", "descriptions": "Older than time itself, a savage cosmic entity called Oblivion exists only to devour everything in its path. Two new Turok warriors, Danielle and Joseph Fireseed must face this evil. The heritage of Turok and all humankind depends on them. Join the legacy. Over 24 upgradable weapons toOlder than time itself, a savage cosmic entity called Oblivion exists only to devour everything in its path. Two new Turok warriors, Danielle and Joseph Fireseed must face this evil. The heritage of Turok and all humankind depends on them. Join the legacy. Over 24 upgradable weapons to battle 40 new and original enemies! Intense multiplayer action - over 8 modes and 48 maps!… Expand"}, {"name": "World of Tanks: Xbox 360 Edition", "details_link": "https://www.metacritic.com/game/xbox-360/world-of-tanks-xbox-360-edition", "publisher": "Microsoft Game Studios", "release_date": "Feb 12 2014", "developers": ["Wargaming.net"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox 360"], "num_players": "Up to 30 ", "genres": ["Shooter", "Historic", "Action", "Simulation", "Shooter", "Vehicle", "Third-Person", "Combat", "Tactical", "Historic"], "meta_score": 77, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/964c91e7c4f10d89e9a880f9121672d1-98.jpg", "descriptions": "The world is your battlefield. While every World of Tanks player dreams of becoming an ace tanker that single-handedly saves the day, it's only through teamwork that you and your allies will prevail. Up to 30 tanks at a time, split into two teams, will be vying for supremacy on over 10The world is your battlefield. While every World of Tanks player dreams of becoming an ace tanker that single-handedly saves the day, it's only through teamwork that you and your allies will prevail. Up to 30 tanks at a time, split into two teams, will be vying for supremacy on over 10 highly-detailed maps. Hold up your end of the bargain and your allies will work with you to coordinate an unstoppable assault against your enemies.… Expand"}, {"name": "Surge Deluxe", "details_link": "https://www.metacritic.com/game/playstation-vita/surge-deluxe", "publisher": "FuturLab", "release_date": "Feb  4 2014", "developers": ["FuturLab"], "platforms": "PlayStation Vita", "genres": ["Miscellaneous", "Puzzle", "Action"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/a07da326c175a3c6d0e2a6698a1df1d5-98.jpg", "descriptions": "Surge Deluxe is the block-matching puzzle game that promises to electrify your fingertips with lightning fast gameplay, unique mechanics & strategic depth."}, {"name": "Golf Club: Wasteland", "details_link": "https://www.metacritic.com/game/switch/golf-club-wasteland", "publisher": "Untold Tales", "release_date": "Sep  3 2021", "developers": ["Demagog Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Puzzle", "Action", "General"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/a1fa044704670a0eba34a3e3f93e46c7-98.jpg", "descriptions": "Human life is wiped out. Earth is now a golf course for the ultra-rich. The rich fled to Mars but venture back to a desolate Earth for a round of golf. Each hole in the wasteland offers its own little story and possible puzzle to sink the perfect shot. Play through destroyed brutalistHuman life is wiped out. Earth is now a golf course for the ultra-rich. The rich fled to Mars but venture back to a desolate Earth for a round of golf. Each hole in the wasteland offers its own little story and possible puzzle to sink the perfect shot. Play through destroyed brutalist monuments, crumbling shopping malls, and abandoned museums as neon signs and poignant graffiti take swings at current events, Silicon Valley culture and humanity. Piece together the full story of how humanity fell through three distinct sources. Details from the lone golfer’s story, who's come back to Earth for one last game. The Radio Nostalgia From Mars broadcast that gives a glimpse into the lives of those who escaped. And the narration of a “secret spectator” watching from a distance...Be accompanied by a purposefully composed soundtrack as well as personal stories broadcasted on Radio Nostalgia From Mars. The station caters to citizens of Mars, nostalgic for Earth as they listen to music from the 2020s, and dial in to share their memories of the planet. A smooth-voiced radio DJ keeps the show flowing with updates and announcements hinting at a not-so-glamorous life on Mars. Three distinct modes mean every golfer can find something for their tastes. Casual players can focus just on the story and a relaxing scenic round of golf in Story Mode. Those looking for an extra challenge can beat each hole under par using skill and puzzle solving through Challenge Mode. While the total pros can try Iron Mode, where there’s almost zero room for error. Easy-to grasp controls and a minimalist UI underpin the whole game so anyone can easily pick up and play at their own pace. … Expand"}, {"name": "Yakuza 3 Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/yakuza-3-remastered", "publisher": "Sega", "release_date": "Feb 11 2020", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/31b755eab824f6bfc568ba45f81a489d-98.jpg", "descriptions": "As part of The Yakuza Remastered Collection, enjoy Yakuza 3 with restored content in 1080p and 60fps. In a quest to abandon their bloody past, Kazuma Kiryu and adoptive daughter Haruka Sawamura leave for Okinawa to run the Morning Glory Orphanage. But trouble shadows Kiryu and the MorningAs part of The Yakuza Remastered Collection, enjoy Yakuza 3 with restored content in 1080p and 60fps. In a quest to abandon their bloody past, Kazuma Kiryu and adoptive daughter Haruka Sawamura leave for Okinawa to run the Morning Glory Orphanage. But trouble shadows Kiryu and the Morning Glory Orphanage is soon entangled in a deadly power struggle.… Expand"}, {"name": "The Turing Test", "details_link": "https://www.metacritic.com/game/switch/the-turing-test", "publisher": "Square Enix", "release_date": "Feb  7 2020", "developers": ["Bulkhead Interactive"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 77, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/6dfcd14b38bc684cce516c15ea3faae6-98.jpg", "descriptions": "The Turing Test is a first person puzzler from the developers of ‘Pneuma: Breath of Life’ that explores the phenomena of consciousness and challenges the meaning of human intuition. Take control of Ava Turing, an engineer for the International Space Agency (ISA), and progress through aThe Turing Test is a first person puzzler from the developers of ‘Pneuma: Breath of Life’ that explores the phenomena of consciousness and challenges the meaning of human intuition. Take control of Ava Turing, an engineer for the International Space Agency (ISA), and progress through a narrated story of introspection and morality whilst uncovering the hidden mysteries of Europa. Delve into The Turing Test’s human interaction puzzles and arm yourself with logical and methodical thinking. Take on tests designed in such a way that only a human could solve them. In an evolving story based on mankind’s inherent need to explore, protect and survive; players search deeper into Europa’s ice crusted core and transcend the line between man and machine. Investigate the truth behind the ISA research base on Jupiter’s moon Europa. Solve puzzles using your Energy Manipulation Tool (EMT) to transfer power out from one object and into another. Power up and take control of artificially intelligent machines, manipulate giant structures and solve complex tasks; all woven into a multi-layered story based on the human struggle for control. The Turing Test can only be experienced through the interactive medium of video games. The Turing Test sparks your synapses into action in this electrifying new first person puzzler, as players learn the true cost of retaining human morality.… Expand"}, {"name": "Lumo", "details_link": "https://www.metacritic.com/game/switch/lumo", "publisher": "Rising Star Games", "release_date": "Nov 14 2017", "developers": ["Rising Star Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/6d7416e0a7a5ad3f7dd72fcf386ff4c9-98.jpg", "descriptions": "Witness the rebirth of a genre in Lumo  a classic isometric adventure with a modern twist for gamers young and old alike! \r\rAs a contemporary take on the long-lost isometric platform genre, Lumo can be enjoyed by anyone looking for an absorbing, challenging and rewarding adventure. But forWitness the rebirth of a genre in Lumo  a classic isometric adventure with a modern twist for gamers young and old alike! \r\rAs a contemporary take on the long-lost isometric platform genre, Lumo can be enjoyed by anyone looking for an absorbing, challenging and rewarding adventure. But for those who lived through the golden age of videogames  the 80s and early 90s  or know about the games and culture from that time, layer upon layer of nods, winks and touches to those times help build upon an experience thats as heart-warming as it is exciting!… Expand"}, {"name": "Shank 2", "details_link": "https://www.metacritic.com/game/playstation-3/shank-2", "publisher": "Electronic Arts", "release_date": "Feb  7 2012", "developers": ["Klei Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 77, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/a5266d20c71190af144a487ed942f0c0-98.jpg", "descriptions": "Shank 2 returns with a story of redemption as Shank, a former mob hitman with a dark and vengeful past, is thrust back into action when the lives of those close to him are endangered. Expanding on the original game's intuitive combat and control system, Shank 2 continues Klei's tradition ofShank 2 returns with a story of redemption as Shank, a former mob hitman with a dark and vengeful past, is thrust back into action when the lives of those close to him are endangered. Expanding on the original game's intuitive combat and control system, Shank 2 continues Klei's tradition of making fluid brawling controls and stunningly beautiful visuals that leapfrogs the competition in the 2D side-scrolling genre. The game also introduces an intense new, arcade-style survival co-op mode that has gamers working together to take down their foes, relying on the environment and weapon pick-ups for survival.… Expand"}, {"name": "Penny Arcade Adventures: Episode One", "details_link": "https://www.metacritic.com/game/pc/penny-arcade-adventures-episode-one", "publisher": "Hothead Games", "release_date": "May 21 2008", "developers": ["Hothead Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/8d06612bef0403bdb8f7f046fc8837a8-98.jpg", "descriptions": "Based on the popular comic strip Penny Arcade, On the Rain-Slick Precipice of Darkness is an episodic RPG/Adventure where you join with Gabe and Tycho of the Startling Developments Detective Agency to solve strange mysteries lurking in New Arcadia. Set in the 1920s, the game places theBased on the popular comic strip Penny Arcade, On the Rain-Slick Precipice of Darkness is an episodic RPG/Adventure where you join with Gabe and Tycho of the Startling Developments Detective Agency to solve strange mysteries lurking in New Arcadia. Set in the 1920s, the game places the familiar Penny Arcade protagonists in an alternate pulp horror setting reminiscent of the works of H. P. Lovecraft. [Hothead Games]… Expand"}, {"name": "Stuntman", "details_link": "https://www.metacritic.com/game/game-boy-advance/stuntman", "publisher": "Atari", "release_date": "Jun 24 2003", "developers": ["Atari"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Driving", "Mission-based"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/66f48fe02d4c2fd27890bf2dc7fb7572-98.jpg", "descriptions": "In the world of stunt driving, all it takes is one slip to end your Hollywood dreams. As a stunt driver, you can't afford to fail when performing dangerous stunts. In six famous movie locations, you'll smash up vehicles ranging from TukTuks and snowmobiles to Jeeps and high-performanceIn the world of stunt driving, all it takes is one slip to end your Hollywood dreams. As a stunt driver, you can't afford to fail when performing dangerous stunts. In six famous movie locations, you'll smash up vehicles ranging from TukTuks and snowmobiles to Jeeps and high-performance sports cars. Begin a career in the stuntman industry or practice your skills in the stunt arena. After another hard day of risky work, replay the action as a polished movie trailer. … Expand"}, {"name": "NFL Blitz 20-02", "details_link": "https://www.metacritic.com/game/xbox/nfl-blitz-20-02", "publisher": "Midway", "release_date": "Mar 18 2002", "developers": ["Point of View"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/b620b622501e076d3cbc8d0681ea6569-98.jpg", "descriptions": "NFL Blitz 2002 is extreme-style football the way it was meant to be played. Lightning fast gameplay and action play selection screens make for non-stop action. Over-the-top animations mean you'll see bigger hits and wilder plays then you have ever dreamed of. Real teams, real players, real attitude!"}, {"name": "Kirby 64: The Crystal Shards", "details_link": "https://www.metacritic.com/game/nintendo-64/kirby-64-the-crystal-shards", "publisher": "Nintendo", "release_date": "Jun 26 2000", "developers": ["HAL Labs"], "platforms": "Nintendo 64", "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Dart past enemies, soar the skies and swim the depths of the ocean as Kirby takes on Dark Matter in an all-new adventure. Inhale, exhale and swallow your enemies, then copy and combine their abilities and use them as your own! Team up with familiar friends and foes - like Waddle Dee and KingDart past enemies, soar the skies and swim the depths of the ocean as Kirby takes on Dark Matter in an all-new adventure. Inhale, exhale and swallow your enemies, then copy and combine their abilities and use them as your own! Team up with familiar friends and foes - like Waddle Dee and King Dedede - as you travel through dreamy worlds in search of the lost Crystal Shards.… Expand"}, {"name": "The Suffering", "details_link": "https://www.metacritic.com/game/xbox/the-suffering", "publisher": "Midway", "release_date": "Mar  9 2004", "developers": ["Surreal Software"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/dba668401f68e0ad783a8555b2f91cdf-98.jpg", "descriptions": "The Suffering captures the disturbing and terrifying nature of the horror genre in a compelling third-person action/adventure game set in the mature and gritty world of a maximum-security prison.  You'll control of the prisoner Torque, a man sentenced to die for a murder he may or may notThe Suffering captures the disturbing and terrifying nature of the horror genre in a compelling third-person action/adventure game set in the mature and gritty world of a maximum-security prison.  You'll control of the prisoner Torque, a man sentenced to die for a murder he may or may not have actually committed.  Enter a nightmarish world where creatures jump out of shadows, fall out of trees, and erupt out of the ground.  Battle ghoulish apparitions, hardened criminals and guards, and the demons from your own forgotten past.  Will you solve the mystery of Torque's past and survive or fall victim to The Suffering?… Expand"}, {"name": "OMNO", "details_link": "https://www.metacritic.com/game/xbox-one/omno", "publisher": "Future Friends Games", "release_date": "Jul 29 2021", "developers": ["StudioInkyfox"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/94d281c68addae18c9c038ade9d8690c-98.jpg", "descriptions": "A single-player journey of discovery through an ancient world of wonders, created by solo developer Jonas Manke."}, {"name": "Still There", "details_link": "https://www.metacritic.com/game/pc/still-there", "publisher": "Iceberg Interactive", "release_date": "Nov 20 2019", "developers": ["GhostShark Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/ed1a461d834abe5d1a802e236962f83c-98.jpg", "descriptions": "Every day is the same on the faraway Bento space-lighthouse - until a mysterious radio message breaks through. Evade the past, welcome oblivion, make the perfect Italian coffee. Still There is a psychological adventure game about grief, technical puzzles, wacky AIs and dark humour. How farEvery day is the same on the faraway Bento space-lighthouse - until a mysterious radio message breaks through. Evade the past, welcome oblivion, make the perfect Italian coffee. Still There is a psychological adventure game about grief, technical puzzles, wacky AIs and dark humour. How far is far enough?\r… Expand"}, {"name": "NEO Scavenger", "details_link": "https://www.metacritic.com/game/pc/neo-scavenger", "publisher": "Blue Bottle Games", "release_date": "Dec 15 2014", "developers": ["Blue Bottle Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Sci-Fi", "Strategy", "Turn-Based", "General"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/b8c971e59c903b8db824a55454e1372c-98.jpg", "descriptions": "NEO Scavenger takes place in a near-future, post apocalyptic Earth, where human warfare and supernatural activity have fragmented mankind into struggling pockets of civilization. Harsh wilderness and blasted ruins cover most of the planet, dotted by fragile settlements that can beNEO Scavenger takes place in a near-future, post apocalyptic Earth, where human warfare and supernatural activity have fragmented mankind into struggling pockets of civilization. Harsh wilderness and blasted ruins cover most of the planet, dotted by fragile settlements that can be extinguished in an instant. A few cities survived the apocalypse, evolving into massive, ultra-urban fortresses. Other areas have become so devastated that even to this day, the only inhabitants are the ghosts of the past.… Expand"}]