[{"name": "Encodya", "details_link": "https://www.metacritic.com/game/pc/encodya", "publisher": "Assemble Entertainment", "release_date": "Jan 26 2021", "developers": ["Chaosmonger Studio"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Point-and-Click", "Third-Person"], "meta_score": 67, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/f4b53dd95b5ba4699cca8e9585a2e77e-98.jpg", "descriptions": "Neo Berlin 2062. Tina – a nine-year-old orphan – lives with SAM-53 – her big clumsy robot guardian –in a rooftop makeshift shelter in Neo-Berlin, a dark megalopolis controlled by corporations."}, {"name": "We Ski", "details_link": "https://www.metacritic.com/game/wii/we-ski", "publisher": "Namco Bandai Games", "release_date": "May 13 2008", "developers": ["Bandai Namco Games"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Individual", "Skiing", "Skiing", "Ski / Snowboard"], "meta_score": 67, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/aaa01c8b6ffb09301c2990273b4c8277-98.jpg", "descriptions": "(Also known as \"Family Ski\")  Step onto your Wii Balance Board or grab your Wii Remote and Nunchuk and hit the fresh powder with We Ski. Up to four skiers can experience the sweetest mountain runs in the comfort of their homes as We Ski’s highly responsive and intuitive controls take them(Also known as \"Family Ski\")  Step onto your Wii Balance Board or grab your Wii Remote and Nunchuk and hit the fresh powder with We Ski. Up to four skiers can experience the sweetest mountain runs in the comfort of their homes as We Ski’s highly responsive and intuitive controls take them down the slopes like never before. In We Ski, up to four skiers can test their skills on more than a dozen runs from the bunny slopes to the most challenging Black Diamonds. Not only can players carve through the trails using the motion-based controls but they can also mix in the Wii Balance Board for a whole new level of realism. Players can ski using their own Mii or create a new character with a host of customizable options including changeable face and body types. Boosting the customization feature, additional skis, poles, goggles, and costumes can be unlocked. We Ski features an entire mountain to explore, complete with a ski school, freestyle skiing, moguls and slaloms, photography, and a variety of other events. Players can even try their hand at night skiing while enjoying the spectrum of fireworks that color the sky. With We Ski no more long drives to the snow will be necessary to enjoy a day of shredding the mountains. [Namco Bandai Games]… Expand"}, {"name": "Raiders of the Broken Planet", "details_link": "https://www.metacritic.com/game/xbox-one/raiders-of-the-broken-planet", "publisher": "Mercury Steam", "release_date": "Sep 22 2017", "developers": ["Mercury Steam"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 5 ", "genres": ["Strategy", "Real-Time", "MOBA"], "meta_score": 67, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/36571e2f5d98f6e739ad1ccb1b2326b1-98.jpg", "descriptions": "This new game is a multiplayer 4 vs 1 asymmetrical third person shooter that features a distinctive blend of shooting, brawling and thinking man’s strategy. We think this game is a mouth-watering proposition to gamers looking for an immersive, cinematic story coupled with intense and epicThis new game is a multiplayer 4 vs 1 asymmetrical third person shooter that features a distinctive blend of shooting, brawling and thinking man’s strategy. We think this game is a mouth-watering proposition to gamers looking for an immersive, cinematic story coupled with intense and epic online action.… Expand"}, {"name": "Fallout 3 - Operation: Anchorage", "details_link": "https://www.metacritic.com/game/xbox-360/fallout-3---operation-anchorage", "publisher": "Bethesda Softworks", "release_date": "Jan 27 2009", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 67, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/7171f5e01d9ba65ffb05a99a2aaa2998-98.jpg", "descriptions": "[Xbox Live Downloadable Content]  Enter the simulation pod and embark on one of the greatest military campaigns of the Fallout universe – the liberation of Anchorage, Alaska from its Chinese Communist invaders. Experience harrowing winter combat using Fallout 3’s patented V.A.T.S. targeting[Xbox Live Downloadable Content]  Enter the simulation pod and embark on one of the greatest military campaigns of the Fallout universe – the liberation of Anchorage, Alaska from its Chinese Communist invaders. Experience harrowing winter combat using Fallout 3’s patented V.A.T.S. targeting system, and employ powerful new equipment like the Gauss Rifle, Chinese Stealth Armor, Winterized T-51b Power Armor, and more. Enlist today, soldier! [Microsoft]… Expand"}, {"name": "Human: Fall Flat", "details_link": "https://www.metacritic.com/game/playstation-4/human-fall-flat", "publisher": "No Brakes Games", "release_date": "May  9 2017", "developers": ["No Brakes Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "General"], "meta_score": 67, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/aab04d46556f588dcb28de0004280903-98.jpg", "descriptions": "Human:Fall Flat is a quirky, open-ended physics-based puzzle and exploration game set in floating dreamscapes. Your goal is to escape these surreal dreams by solving puzzles with nothing but your wits and physics."}, {"name": "Beatmania", "details_link": "https://www.metacritic.com/game/playstation-2/beatmania", "publisher": "Konami", "release_date": "Mar 28 2006", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 67, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/6fc6c813c77ff8e6c24715e51562229b-98.jpg", "descriptions": "Straight from the arcades, beatmania is an interactive DJ simulation that puts you at the center of the music. Utilizing a specially designed DJ controller featuring a turntable, players must create and perform the music by hitting the notes that appear on screen and scratching the turntableStraight from the arcades, beatmania is an interactive DJ simulation that puts you at the center of the music. Utilizing a specially designed DJ controller featuring a turntable, players must create and perform the music by hitting the notes that appear on screen and scratching the turntable at the right timing. Beatmania lets you spin the tracks, feel the vibe, drop the beats and create the energy of a club all at your fingertips. Spin the music to over 50 club tracks. Show off your mixing skills with exciting two player modes. Interactive music experience that lets you mix music in real-time. [Konami]… Expand"}, {"name": "One Piece Grand Battle", "details_link": "https://www.metacritic.com/game/gamecube/one-piece-grand-battle", "publisher": "Bandai", "release_date": "Sep  7 2005", "developers": ["Ganbarion"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/b074c1bdfcc1198abd14ca2783b6c1e2-98.jpg", "descriptions": "You can try to grab the greatest treasure of them all, the \"one piece,\" in One Piece: Grand Battle. This pirate action game is based on the TV series One Piece, and it lets you play as Monkey D. Luffy and more than 16 other playable characters. There are six game modes for you toYou can try to grab the greatest treasure of them all, the \"one piece,\" in One Piece: Grand Battle. This pirate action game is based on the TV series One Piece, and it lets you play as Monkey D. Luffy and more than 16 other playable characters. There are six game modes for you to play with either one or two players. You can unlock new characters, costumes, and minigames and collect powerful items as you progress through the game and explore the interactive environments from the TV show.… Expand"}, {"name": "Wonder Boy: Asha in Monster World", "details_link": "https://www.metacritic.com/game/playstation-4/wonder-boy-asha-in-monster-world", "publisher": "ININ Games", "release_date": "May 28 2021", "developers": ["Artdink"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 67, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/0bc1d419a4c5c52f84d0e52264bd16d9-98.jpg", "descriptions": "An icon in adventure gaming history is back!Wonder Boy: Asha in Monster World becomes a real Wonder Boy adventure that stays true to its roots as the latest part of the legendary and successful series, that dates back to 1986. \n\nAsha is tasked to free the four spirits being confined byAn icon in adventure gaming history is back!Wonder Boy: Asha in Monster World becomes a real Wonder Boy adventure that stays true to its roots as the latest part of the legendary and successful series, that dates back to 1986. Asha is tasked to free the four spirits being confined by evil forces whose origin she discovers throughout her journey. Luckily, she does not have to face this adventure alone, as early on she finds her new companion, a special blue Pepelogoo.The players can experience the adventures of the dynamic duo like never before thanks to cell-shaded 3D graphics and 2D gameplay as well as enhanced visuals and refined play content. Especially in the event scenes the performance is deepened and the world view is reproduced vividly and colorfully. Plus, for the first time in the series, it comes with a character voice by the popular and talented Japanese voice actress Ai Fairouz.… Expand"}, {"name": "The Simpsons Arcade Game", "details_link": "https://www.metacritic.com/game/xbox-360/the-simpsons-arcade-game", "publisher": "Konami", "release_date": "Feb  3 2012", "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/bd83d2dce3b85978b1267992245dab5b-98.jpg", "descriptions": "In The Simpsons Arcade Game, play as your favorite Simpsons character as you attempt to chase down Smithers and Mr. Burns on an epic quest to save Maggie. Featuring 4-player online and offline cooperative play as well as 8 classic Springfield locations, players can participate in several In The Simpsons Arcade Game, play as your favorite Simpsons character as you attempt to chase down Smithers and Mr. Burns on an epic quest to save Maggie. Featuring 4-player online and offline cooperative play as well as 8 classic Springfield locations, players can participate in several different game modes. Quarters Mode recreates the feeling of the original coin-op classic for a more challenging experience. Survival Mode tests players' skills with only one life at their disposal. Finally, Free Play Mode provides players with unlimited Continues for a more casual run. Also included is the Japanese version of The Simpsons Arcade Game, which features new weapons, higher scoring and a slightly different ending. This version of the game has never been released outside of Japan and is a different take on the beloved classic. As an added bonus, fans can view classic flyers and posters specifically made for the game back in 1991. [Konami]… Expand"}, {"name": "Warhammer 40,000: Shootas, Blood & Teef", "details_link": "https://www.metacritic.com/game/switch/warhammer-40000-shootas-blood-teef", "publisher": "Rogueside", "release_date": "Oct 20 2022", "developers": ["Rogueside"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/837178079a63789d32f822eadb190d4f-98.jpg", "descriptions": "The Orks, a savage race commonly known as the 'Green Tide', sweep across the stars with unrivalled violence in frenzied crusades known as a Waaagh! They are savage, brutal and crude, outnumbering all other races that lay in their path of destruction.Become the spearhead of an Ork invasionThe Orks, a savage race commonly known as the 'Green Tide', sweep across the stars with unrivalled violence in frenzied crusades known as a Waaagh! They are savage, brutal and crude, outnumbering all other races that lay in their path of destruction.Become the spearhead of an Ork invasion as you bash, smash and shoot your way through the hive city of Luteus Prime on a mission to retrieve your hair squig and claim vengeance on your warlord! And just maybe become the warboss of a WAAAGH! along the way? Survival of the strongest has never been so violently fun!Never enough Dakka! Destroy your foes using a great arsenal of weapons and rain destruction down upon them. No one can stand in your way! Massive explosions and flying body parts ain't never been this fun!WAAAGH! Feel the emotion and violence build up until it bursts out as a storm of bullets! Violence begets violence as the massive destruction you cause builds up into a full blown unstoppable WAAAGH! Because Orks are made for two things: fightingand winning! Orks together strong! Grab your friends and take on the forces of the Astra Militarum, the Genestealer Cults and the Space Marines together. Or you know, bash their head in instead and determine who is the fiercest Ork in the clan!… Expand"}, {"name": "Destroy All Humans! 2 - Reprobed", "details_link": "https://www.metacritic.com/game/playstation-5/destroy-all-humans!-2---reprobed", "publisher": "THQ Nordic", "release_date": "Aug 30 2022", "developers": ["Black Forest Games"], "platforms": ["PC", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 67, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/3d00a2722d1c2ae547c69b15e9db1e7f-98.jpg", "descriptions": "Crypto is back with a license to probe. The alien invader returns, groovier than ever and now with genitals! Experience the swinging ‘60s in all its chemical-induced glory and take revenge on the KGB for blowing up your mothership. As you uncover the schemes of your enemies, you’ll have toCrypto is back with a license to probe. The alien invader returns, groovier than ever and now with genitals! Experience the swinging ‘60s in all its chemical-induced glory and take revenge on the KGB for blowing up your mothership. As you uncover the schemes of your enemies, you’ll have to form alliances with members of the very species you came to enslave. … Expand"}, {"name": "Sword Art Online: Hollow Fragment", "details_link": "https://www.metacritic.com/game/playstation-vita/sword-art-online-hollow-fragment", "publisher": "Bandai Namco Games", "release_date": "Aug 19 2014", "developers": ["Bandai Namco Games", "Aquria"], "platforms": "PlayStation Vita", "num_players": "Up to 4 ", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/f61229a779eb3f59d07e3804f38754b9-98.jpg", "descriptions": "Sword Art Online: Hollow Fragment is a Role Playing Game based on the novel, manga and anime, Sword Art Online, and reflects the charming characters and breathtaking environments from the virtual reality world called Aincrad. In a simulated Massively Multiplayer Online Role Playing GameSword Art Online: Hollow Fragment is a Role Playing Game based on the novel, manga and anime, Sword Art Online, and reflects the charming characters and breathtaking environments from the virtual reality world called Aincrad. In a simulated Massively Multiplayer Online Role Playing Game setting, players find that they are captured within the game and must explore and defeat enemies until they reach the highest floors of Aincrad to beat the game and free themselves from the fantasy world. … Expand"}, {"name": "Star Fox: Assault", "details_link": "https://www.metacritic.com/game/gamecube/star-fox-assault", "publisher": "Nintendo", "release_date": "Feb 14 2005", "developers": ["Namco"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 67, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/5c009d7ba448b5841744e7338065d313-98.jpg", "descriptions": "Team Star Fox is back for more intense combat as they engage a new threat by air and by land. A few years after disaster was barely averted on Dinosaur Planet, Lylat Central Command gets wind of a new threat spreading throughout the solar system. The Star Fox team--composed of classic teamTeam Star Fox is back for more intense combat as they engage a new threat by air and by land. A few years after disaster was barely averted on Dinosaur Planet, Lylat Central Command gets wind of a new threat spreading throughout the solar system. The Star Fox team--composed of classic team members Fox McCloud, Slippy Toad, Peppy Hare, and Falco Lombardi, along with some new faces--is sent in to engage this new enemy. Now, as part of the Star Fox team, you can participate in solo or co-op missions or plug in with up to three other players.… Expand"}, {"name": "Shoot Many Robots", "details_link": "https://www.metacritic.com/game/xbox-360/shoot-many-robots", "publisher": "Ubisoft", "release_date": "Mar 14 2012", "developers": ["Demiurge Studios"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "General", "General"], "meta_score": 67, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/4d0f051b6b1c1c4862740e0e296102a0-98.jpg", "descriptions": "Shoot Many Robots delivers an onslaught of innovative cross-genre action that has multiple players working together to fight through an intense and chaotic robot uprising."}, {"name": "CSI: Crime Scene Investigation: 3 Dimensions of Murder", "details_link": "https://www.metacritic.com/game/pc/csi-crime-scene-investigation-3-dimensions-of-murder", "publisher": "Ubisoft", "release_date": "Mar 14 2006", "developers": ["Telltale Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Modern", "Modern"], "meta_score": 67, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/393ee91ce410f52aeef562855cbec6f7-98.jpg", "descriptions": "Players work alongside Gil Grissom, Catherine Willows and the rest of the original Las Vegas cast to help solve intense cases and investigate crimes using cutting-edge techniques and real-world forensic equipment. CSI: 3 Dimensions of Murder improves upon the successfulcore design conceptsPlayers work alongside Gil Grissom, Catherine Willows and the rest of the original Las Vegas cast to help solve intense cases and investigate crimes using cutting-edge techniques and real-world forensic equipment. CSI: 3 Dimensions of Murder improves upon the successfulcore design concepts of previous CSI games, featuring an all-new,real-time 3D engine, enriched character interactions and animations, and longer, more immersive stories. [Ubisoft]… Expand"}, {"name": "Lost Planet: Extreme Condition", "details_link": "https://www.metacritic.com/game/playstation-3/lost-planet-extreme-condition", "publisher": "Capcom", "release_date": "Feb 26 2008", "developers": ["Capcom"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 67, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/c673bf46139873845ed1d90ed9a3c40e-98.jpg", "descriptions": "Driven to the brink of extinction in ice-covered wastelands, humankind fights to survive, from the deadly elements to the hostile alien creatures known as the Akrid. With only fragments of his memory intact, Wayne Holden must struggle to recover his past and the answers to E.D.N. III'sDriven to the brink of extinction in ice-covered wastelands, humankind fights to survive, from the deadly elements to the hostile alien creatures known as the Akrid. With only fragments of his memory intact, Wayne Holden must struggle to recover his past and the answers to E.D.N. III's secrets. While the search for the truth could lead to valuable allies and a means to save humanity, what he finds instead could be worse than he ever imagined! PSN Enabled: 16 diverse multiplayer maps right out of the box. 16 Player multiplayer cooperative and versus battles. On-Foot and In-Vehicle Modes: Command heavily armed bipedal vehicles or switch to more stealthy exploration on-foot. Vast and Vivid Environments: Snowstorms, arctic winds, towering buildings and mountains of ice create cinematic stunning visuals and breathtaking landscapes. Next-Gen Realism: Immerse yourself in the brutal chilling world of Lost Planet as you labor through waist-deep snow, hear the crunch of ice with each step, and fly backward from explosive force during battle. Alien Encounters: Face off with an array of Akrid, from massive rolling behemoths and long-legged ground-dwellers to fast-flying swarms overhead. [Capcom]… Expand"}, {"name": "JYDGE", "details_link": "https://www.metacritic.com/game/switch/jydge", "publisher": "10tons", "release_date": "Oct 19 2017", "developers": ["10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 67, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/90a5acc484064dc83b62f327bc1a8725-98.jpg", "descriptions": "Build your JYDGE. Enter Edenbyrg. Get out alive.\r JYDGE is a lawful but awful roguehate top-down shooter where you get to build your own cybernetic JYDGE and eradicate crime in the never-sleeping megacity of Edenbyrg. Create your own play-style by augmenting your JYDGE, modifying yourBuild your JYDGE. Enter Edenbyrg. Get out alive.\r JYDGE is a lawful but awful roguehate top-down shooter where you get to build your own cybernetic JYDGE and eradicate crime in the never-sleeping megacity of Edenbyrg. Create your own play-style by augmenting your JYDGE, modifying your Gavel rifle, and choosing companion drones to suit the tasks at hand.\r Will you be stealthy and lurk in shadows? Or will you assault the evildoers head on? Maybe you'll brutally rocket them to bits from a distance? Or perhaps bring your own squad of reckless companions to solve the scenarios?\r You be the JYDGE!… Expand"}, {"name": "Silent Hill 4: The Room", "details_link": "https://www.metacritic.com/game/pc/silent-hill-4-the-room", "publisher": "Konami", "release_date": "Sep  7 2004", "developers": ["Konami"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 67, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/0ab4d5d8ad93823d5f7e46252b70b501-98.jpg", "descriptions": "Taking the series in a new direction, apprehension and fear immediately run high when the new main character, Henry Townshend, finds himself trapped in his own cursed apartment. Only by exploring mysterious portals leading to disturbing alternate worlds will Henry begin to uncover clues asTaking the series in a new direction, apprehension and fear immediately run high when the new main character, Henry Townshend, finds himself trapped in his own cursed apartment. Only by exploring mysterious portals leading to disturbing alternate worlds will Henry begin to uncover clues as to why he is trapped. However, in true Silent Hill fashion, mysterious new characters, horrendous creatures, and the undead will use any means necessary to impede his progress. A tense atmosphere and grotesque enemies will get the player's heart thumping as Silent Hill 4 delivers a gameplay experience that fans and newcomers will never forget. Using state of the art technology, the development team has effectively created bone-chilling effects to add to the game's creepy atmosphere. Players will be able to see changes in environments over time, as the alternate world seeps into reality. In addition, Silent Hill 4 shifts between the first and third-person perspective, which is a first for the series. Beautifully detailed environments, a haunting soundtrack and the game's trademark psychological horror complete Silent Hill 4's overall fear factor as players travel between the room and their worst nightmare. [Konami]… Expand"}, {"name": "UFO: Aftermath", "details_link": "https://www.metacritic.com/game/pc/ufo-aftermath", "publisher": "Cenega Publishing", "release_date": "Oct 15 2003", "developers": ["Altar Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "Sci-Fi", "Sci-Fi"], "meta_score": 67, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/0ce55334d112fce70ee0de6754d3fbd3-98.jpg", "descriptions": "UFO: Aftermath is a 3D isometric, tactical strategy game a rich and compelling sci fi story. Combining global strategy with small squad tactical combat, the challenge offered is to fight against an alien invasion. Featuring run time generated tactical missions with innovative simultaneousUFO: Aftermath is a 3D isometric, tactical strategy game a rich and compelling sci fi story. Combining global strategy with small squad tactical combat, the challenge offered is to fight against an alien invasion. Featuring run time generated tactical missions with innovative simultaneous combat action; the genre is also enhanced with strong RPG elements, offering a quite unique mix of strategic ideas. [Cenega]… Expand"}, {"name": "K-1 World Grand Prix", "details_link": "https://www.metacritic.com/game/playstation-2/k-1-world-grand-prix", "publisher": "Konami", "release_date": "Jul  9 2003", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 67, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/381facdac576a616226868ba6c617026-98.jpg", "descriptions": "The new breed of sport fighting games has entered the ring. K-1 World Grand Prix combines the tactical barrage of boxing with the powerful ferocity of no-holds-barred fighting to deliver the ultimate sport fighting experience. With greater depth, more strategy and the fiercest knockoutsThe new breed of sport fighting games has entered the ring. K-1 World Grand Prix combines the tactical barrage of boxing with the powerful ferocity of no-holds-barred fighting to deliver the ultimate sport fighting experience. With greater depth, more strategy and the fiercest knockouts around, K-1 World Grand Prix puts all other sport fighting games on the canvas!Over 20 real K-1 fighters, each with signature moves & combos. Body-region-specific damage allows for tactical weakening the opponent. Endless offensive and defensive moves to employ. 7 game modes including Grand Prix, Trial, Revival & Head-to-head. [Konami]… Expand"}, {"name": "Incoming Forces", "details_link": "https://www.metacritic.com/game/pc/incoming-forces", "publisher": "Hip Games", "release_date": "Sep 25 2002", "developers": ["Rage Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 67, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/6781c33e6f6621aaf6af35e9a66fef8b-98.jpg", "descriptions": "Incoming Forces is the sequel to the multi-million unit selling, award winning and critically acclaimed Incoming. Set 20 years after the original, Earth has now discovered the secret of sustainable long distance space travel and their forces are gathered and seeking to destroy all hostileIncoming Forces is the sequel to the multi-million unit selling, award winning and critically acclaimed Incoming. Set 20 years after the original, Earth has now discovered the secret of sustainable long distance space travel and their forces are gathered and seeking to destroy all hostile planets, in particular four alien worlds in a small distant galaxy. Your task is to defend these planets at all costs. [Rage Software]… Expand"}, {"name": "Guilty Gear X Advance Edition", "details_link": "https://www.metacritic.com/game/game-boy-advance/guilty-gear-x-advance-edition", "publisher": "Sammy Studios", "release_date": "Aug 29 2002", "developers": ["Arc System Works"], "platforms": "Game Boy Advance", "genres": ["Action", "Fighting", "2D"], "meta_score": 67, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/1bad65152489551470e8183e79313849-98.jpg", "descriptions": "In the 22nd Century, mankind is battling with futuristic biological weapons named Gears. Now you must stop these dangerous beasts in their tracks. At stake is a huge reward... and the fate of mankind. Take on 6 gameplay modes, including Arcade, VS, 3-on-3, Tag and Survival. \rFight as 14In the 22nd Century, mankind is battling with futuristic biological weapons named Gears. Now you must stop these dangerous beasts in their tracks. At stake is a huge reward... and the fate of mankind. Take on 6 gameplay modes, including Arcade, VS, 3-on-3, Tag and Survival. \rFight as 14 characters and pull off cool moves, including combo attacks. \rCompete in 2-player action via the Game Boy Advance Game Link Cable.… Expand"}, {"name": "Army Men: RTS", "details_link": "https://www.metacritic.com/game/pc/army-men-rts", "publisher": "3DO", "release_date": "Mar 24 2002", "developers": ["Pandemic Studios"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy", "Command"], "meta_score": 67, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/2e21384ff43956f8bdc5283d504633db-98.jpg", "descriptions": "A deep and strategic war game without the intimidation factor of other Real-Time Strategies. Army Men: RTS features an intuitive interface and easy-to-learn controls. This is not another plastic soldier game; the game forces players to think about how to strategically build and manageA deep and strategic war game without the intimidation factor of other Real-Time Strategies. Army Men: RTS features an intuitive interface and easy-to-learn controls. This is not another plastic soldier game; the game forces players to think about how to strategically build and manage troops, vehicles and buildings while involved in a full out war! [3DO]… Expand"}, {"name": "Blood Omen 2", "details_link": "https://www.metacritic.com/game/playstation-2/blood-omen-2", "publisher": "Eidos Interactive", "release_date": "Mar 21 2002", "developers": ["Crystal Dynamics"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 67, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/32d3bd604eabb5cc91280f8133ad0a2a-98.jpg", "descriptions": "The latest installment in the Legacy of Kain Series is a 3rd person 3D action/combat game in which the player assumes the role of the vampire Kain. A compelling story drives the player through huge lushly detailed 3D environments and challenges his game play skills in combat, puzzle solving,The latest installment in the Legacy of Kain Series is a 3rd person 3D action/combat game in which the player assumes the role of the vampire Kain. A compelling story drives the player through huge lushly detailed 3D environments and challenges his game play skills in combat, puzzle solving, stealth and exploration. With each success, the player achieves new dark powers that will grant Kain the ability to access treacherous new areas to explore and the power to face stronger, more aggressive enemies. As the player develops a stronger, more skilled vampire, he is rewarded with dozens of in-game cinematic sequences that unfold the continuing epic of Nosgoth, and Kain's attempts to ultimately rule over it. [Eidos Interactive]… Expand"}, {"name": "MotoGP", "details_link": "https://www.metacritic.com/game/game-boy-advance/motogp", "publisher": "THQ", "release_date": "Mar  8 2002", "developers": ["Visual Impact"], "platforms": ["PlayStation 2", "Game Boy Advance"], "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/27d60e7fe08c9db468a498798089c1e1-98.jpg", "descriptions": "MotoGP puts you behind the handlebars of some of the fastest machines on two wheels. Take control of any of the bikes and riders from the world of Grand Prix Motorcycle racing, and race across 10 real-world tracks in a variety of game modes. In Grand Prix and Training modes, you can developMotoGP puts you behind the handlebars of some of the fastest machines on two wheels. Take control of any of the bikes and riders from the world of Grand Prix Motorcycle racing, and race across 10 real-world tracks in a variety of game modes. In Grand Prix and Training modes, you can develop your own rider's attributes and then race to unlock tracks, riders, cheats, and bikes. Show off your speed and style in single-player tournaments or multiplayer races.… Expand"}, {"name": "Iron Aces", "details_link": "https://www.metacritic.com/game/dreamcast/iron-aces", "publisher": "Xicat Interactive", "release_date": "Feb  6 2001", "developers": ["Marionette"], "platforms": "Dreamcast", "genres": ["Simulation", "Flight", "WWII"], "meta_score": 67, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/0dc8109c7090579ba838d1e8dae9ad31-98.jpg", "descriptions": "It's a dark night. The cool, calming ocean air floats across your body, rejuvenating your animal spirit, flowing through your nerves like iced lightning. You breathe deeply, and climb into the cockpit of your P-51 Mustang. As you strap down your helmet and goggles you utter a silent prayer;It's a dark night. The cool, calming ocean air floats across your body, rejuvenating your animal spirit, flowing through your nerves like iced lightning. You breathe deeply, and climb into the cockpit of your P-51 Mustang. As you strap down your helmet and goggles you utter a silent prayer; you know that this time you launch off the carrier could be your last. So gear up, soldier. You're one of the best now...one of the Iron Aces.… Expand"}, {"name": "Shattered Union", "details_link": "https://www.metacritic.com/game/pc/shattered-union", "publisher": "2K Games", "release_date": "Oct 17 2005", "developers": ["PopTop Software"], "platforms": "PC", "num_players": "2  Online", "genres": ["Strategy", "Turn-Based", "Historic", "General", "Historic"], "meta_score": 67, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/bea9dd48401cde8d94d678b5503158ac-98.jpg", "descriptions": "Set atop the smoldering ruins of a fictional United States torn apart by civil war, Shattered Union is an action-packed turn-based strategy game for the Xbox and PC. Gamers play through a single player campaign to reunite the country by force or online in one-on-one matches.  [2K Games]"}, {"name": "MediEvil", "details_link": "https://www.metacritic.com/game/playstation-4/medievil", "publisher": "Sony Interactive Entertainment", "release_date": "Oct 25 2019", "developers": ["Other Ocean Interactive", "Sony Interactive Entertainment"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 67, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/c6f09d07ee37f457faf8d4424cbf1dd2-98.jpg", "descriptions": "Re-live the original adventure on PlayStation 4. The beloved fan-favorite has been completely remade from the grave up, blending classic gameplay with stunning visuals, all in  4K. Step into the bones of Sir Daniel Fortesque, a slightly-inept (and long dead) knight accidentally resurrectedRe-live the original adventure on PlayStation 4. The beloved fan-favorite has been completely remade from the grave up, blending classic gameplay with stunning visuals, all in  4K. Step into the bones of Sir Daniel Fortesque, a slightly-inept (and long dead) knight accidentally resurrected by his greatest enemy, the evil sorcerer Zarok. With a second chance to foil his greatest foe, Dan will once again set out to save the kingdom of Gallowmere and earn his place as a true hero.… Expand"}, {"name": "Nancy Drew: The White Wolf of Icicle Creek", "details_link": "https://www.metacritic.com/game/wii/nancy-drew-the-white-wolf-of-icicle-creek", "publisher": "Sega", "release_date": "Dec  2 2008", "developers": ["Her Interactive"], "platforms": ["PC", "Wii"], "num_players": "1 Player", "genres": ["Adventure", "First-Person", "General", "Point-and-Click", "Modern"], "meta_score": 67, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/d8343d5e2bf8a49538095187fa3f7456-98.jpg", "descriptions": "Nancy Drew: The White Wolf of Icicle Creek finds Nancy far from home in the middle of the Canadian Rockies to investigate several suspicious accidents occurring at Chantal's spooky Icicle Creek Lodge. To make matters worse, an eerie wolf's howl in the distance is haunting the guests atNancy Drew: The White Wolf of Icicle Creek finds Nancy far from home in the middle of the Canadian Rockies to investigate several suspicious accidents occurring at Chantal's spooky Icicle Creek Lodge. To make matters worse, an eerie wolf's howl in the distance is haunting the guests at night, causing Nancy to wonder if the accidents and the mysterious wolf are connected. Assuming the role of Nancy Drew, players embark on a mystery adventure that tax their deductive reasoning skills as they tackle intricate puzzles and master a variety of gesture-based mini-games with the Wii Remote. Additionally, Nancy Drew: The White Wolf of Icicle Creek lets players choose either a Junior or Senior Detective level, making it a perfect game for players of all skill levels. [Her Interactive]… Expand"}, {"name": "Pony Friends", "details_link": "https://www.metacritic.com/game/ds/pony-friends", "publisher": "Eidos Interactive", "release_date": "May 30 2007", "developers": ["Tantalus"], "platforms": "DS", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 67, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/78ea4e7cd715acc84ee727603d36a173-98.jpg", "descriptions": "Pony Friends is a virtual pet game for the Nintendo DS where players get to emulate every cool aspect of owning their own pet pony.  From grooming and accessorizing your pony with colorful custom gear to going on exciting trail rides where you encounter new wildlife friends, the world ofPony Friends is a virtual pet game for the Nintendo DS where players get to emulate every cool aspect of owning their own pet pony.  From grooming and accessorizing your pony with colorful custom gear to going on exciting trail rides where you encounter new wildlife friends, the world of Pony Friends offers a cool new interactive environment where kids learn how to care for their dream pony. [Eidos Interactive]… Expand"}, {"name": "Little Orpheus", "details_link": "https://www.metacritic.com/game/pc/little-orpheus", "publisher": "Secret Mode", "release_date": "Sep 13 2022", "developers": ["The Chinese Room"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 67, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/cb86d4117a913a28b5fbeb7cebe1bf3c-98.jpg", "descriptions": "The year is 1962 and NASA are trying to put a man on the moon. In a remote corner of Siberia, a Soviet cosmonaut is heading in the other direction. Comrade Ivan Ivanovich is dropped into an extinct volcano in his exploration capsule, Little Orpheus, to explore the center of the earth. HeThe year is 1962 and NASA are trying to put a man on the moon. In a remote corner of Siberia, a Soviet cosmonaut is heading in the other direction. Comrade Ivan Ivanovich is dropped into an extinct volcano in his exploration capsule, Little Orpheus, to explore the center of the earth. He promptly vanishes.Join our bold yet hapless hero as he explores lost civilizations, undersea kingdoms, prehistoric jungles and lands beyond imagination. Gasp as he battles the subhuman tribe of the Menkv and escapes the clutches of dreadful monsters! Cheer as he triumphs over impossible odds and brings socialism to the subterranean worlds!Little Orpheus is a technicolor side-scrolling adventure game inspired by classic movies like Flash Gordon, Sinbad and The Land that Time Forgot. Delivered in eight bite-size, commute-friendly episodes, Little Orpheus is simple enough for casual players but rich enough for seasoned adventure fans.… Expand"}, {"name": "The Escapists: Complete Edition", "details_link": "https://www.metacritic.com/game/switch/the-escapists-complete-edition", "publisher": "Team17", "release_date": "Sep 25 2018", "developers": ["Mouldy Toof Studios"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 67, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/834119876859f8eb15474b70e020f854-98.jpg", "descriptions": "The Escapists: Complete Edition brings you the whole original Escapists experience including all DLC packs as well as Fhurst Peak which is exclusive to Nintendo Switch. The Escapists is an award winning prison break simulation that provides players the opportunity of experiencing aThe Escapists: Complete Edition brings you the whole original Escapists experience including all DLC packs as well as Fhurst Peak which is exclusive to Nintendo Switch. The Escapists is an award winning prison break simulation that provides players the opportunity of experiencing a light-hearted insight into everyday prison life. Master the routine, plan your strategy then execute your Escape. … Expand"}, {"name": "Monster Monpiece", "details_link": "https://www.metacritic.com/game/playstation-vita/monster-monpiece", "publisher": "Idea Factory", "release_date": "May 27 2014", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation Vita"], "num_players": "2 ", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/b7e97842814be53211cc55508331a281-98.jpg", "descriptions": "Based on an authentic card battle of deep strategies, this title depicts an adventure story of charming characters."}, {"name": "Tony Hawk's Pro Skater HD", "details_link": "https://www.metacritic.com/game/playstation-3/tony-hawks-pro-skater-hd", "publisher": "Activision", "release_date": "Aug 28 2012", "developers": ["Robomodo"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Sports", "Alternative", "Individual", "Skating", "Skating", "Skate / Skateboard"], "meta_score": 67, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/78259326a591d2ecab0c821b6b8bcc14-98.jpg", "descriptions": "Tony Hawk's Pro Skater HD returns to controllers and focuses on the satisfaction of linking sick tricks for maximum points."}, {"name": "Zombie Apocalypse: Never Die Alone", "details_link": "https://www.metacritic.com/game/playstation-3/zombie-apocalypse-never-die-alone", "publisher": "Konami", "release_date": "Oct 25 2011", "developers": ["Konami"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "General", "Shooter", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 67, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/1/11bbbef2f2e2ed71f60bdd65fac10624-98.jpg", "descriptions": "Backbone Entertainment has created a stunning against-all-odds blaster, where four new heroes must attempt to survive a zombie uprising. The quartet is stranded on a remote island which is under siege from an army of the dead. Using whatever weapons come to hand, the player must scour theBackbone Entertainment has created a stunning against-all-odds blaster, where four new heroes must attempt to survive a zombie uprising. The quartet is stranded on a remote island which is under siege from an army of the dead. Using whatever weapons come to hand, the player must scour the island looking for survivors and eliminating the flesh-eaters in order to create safe zones.\r The action is viewed from an elevated position, with the player central to the action. As the undead attack from all directions, the player uses both control sticks to turn and shoot in all directions, with extra items discarded by fortunate survivors instantly added to an inventory. Zombie Apocalypse: Never Die Alone also introduces a new squad-based mechanism, which allows players to work together. A new class-based system allows users to switch weapons between each other, and also distribute powers and energy to those that need it.… Expand"}, {"name": "NCAA March Madness 08", "details_link": "https://www.metacritic.com/game/playstation-3/ncaa-march-madness-08", "publisher": "Electronic Arts", "release_date": "Dec 11 2007", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 67, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/1/14df31bb973eb35c0b1aa59ead70b791-98.jpg", "descriptions": "NCAA March Madness 08 has created a strategic new gameplay experience called Dynamic Post Play that enables you to take complete control over running your offense through the post, and defending your opponent in the paint. Experience the intensity of a strategic match-up on each possession,NCAA March Madness 08 has created a strategic new gameplay experience called Dynamic Post Play that enables you to take complete control over running your offense through the post, and defending your opponent in the paint. Experience the intensity of a strategic match-up on each possession, outwit your opponent by creating a favorable mismatch, and then make a move that scores the bucket to lift your team and your fans to victory. For the first time, you have complete control over dozens of new offensive post moves, including finesse ones like an up-and-under, drop step, hook spin, jump hook, and pump fake, and the ability to combine moves together. Animations can be interrupted at any time to transition into a new move, enabling you to read and respond to the defense, just like real life. Take command of the post on defense with strategic positioning to dominate down low -- guard your opponent man-to-man, front him to deny the entry pass or read the offense and go for the steal. NCAA March Madness 08 finally makes dream match-ups a reality, enabling you to replay classic games in college basketball history. Featuring more than 70 classic teams, take the court as the 1972 UCLA Bruins against any of the great North Carolina Tar Heels teams of the 1980s, the Duke Blue Devils of the 1990s or the two-time defending national champion University of Florida Gators. In addition, the ultimate teams for dozens of Division I programs have been created enabling you to go head-to-head to determine the best team in the history of college basketball. [Electronic Arts]… Expand"}, {"name": "Nin2-Jump", "details_link": "https://www.metacritic.com/game/xbox-360/nin2-jump", "publisher": "Cave", "release_date": "Apr 27 2011", "developers": ["Cave"], "platforms": "Xbox 360", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 67, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/3a6eea339a0b12e567013f1cde2ca255-98.jpg", "descriptions": "Nin2-Jump is an adventure game where the player must become a great ninja master in order to rescue Princess Sakura."}, {"name": "Fatal Frame: Maiden of Black Water", "details_link": "https://www.metacritic.com/game/wii-u/fatal-frame-maiden-of-black-water", "publisher": "Nintendo", "release_date": "Oct 22 2015", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Horror", "Action Adventure", "Survival"], "meta_score": 67, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/72dde44f78f9c267d1986d773b7cd166-98.jpg", "descriptions": "Fatal Frame/Project Zero: Maiden of Black Water consists of 3 interconnected stories that converge to uncover the truth behind a recent group of tragic deaths in a forest marred by a history of suicides. As one of 3 people with the power of the Camera Obscura and the ability to see theFatal Frame/Project Zero: Maiden of Black Water consists of 3 interconnected stories that converge to uncover the truth behind a recent group of tragic deaths in a forest marred by a history of suicides. As one of 3 people with the power of the Camera Obscura and the ability to see the shadows of those spirited away, you will explore the ruins of an eerie inn, a shrine filled with life-size dolls, and a lake full of dead priestesses. Each shadowy location is connected by a stream of water flowing throughout the mountain, and this once holy water is tied to the darkest mystery of all—the history of death and darkness on Mt. Hikami.… Expand"}, {"name": "LEGRAND LEGACY: Tale of the Fatebounds", "details_link": "https://www.metacritic.com/game/pc/legrand-legacy-tale-of-the-fatebounds", "publisher": "SEMISOFT", "release_date": "Jan 24 2018", "developers": ["SEMISOFT"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 67, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/3bd92620ed3dfa34e304ddd692d8964e-98.jpg", "descriptions": "A tactical turn-based RPG that takes you on a journey through Legrand, a chaotic world that's torn apart by civil war and threatened by an otherworldly invasion. You play as Finn, the reluctant leader of a band of unlikely heroes, who soon discovers that the true peril to their universe liesA tactical turn-based RPG that takes you on a journey through Legrand, a chaotic world that's torn apart by civil war and threatened by an otherworldly invasion. You play as Finn, the reluctant leader of a band of unlikely heroes, who soon discovers that the true peril to their universe lies within themselves.… Expand"}, {"name": "King's Quest Chapter 2: Rubble Without a Cause", "details_link": "https://www.metacritic.com/game/pc/kings-quest-chapter-2-rubble-without-a-cause", "publisher": "Sierra Games", "release_date": "Dec 15 2015", "developers": ["The Odd Gentlemen"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Adventure", "General"], "meta_score": 67, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/fafb5eb01b07df61e8743c9dd761e8c2-98.jpg", "descriptions": "Kings Quest - Chapter 1: A Knight to Remember is required to play this content and is sold separately.\r Kings Quest - Rubble Without A Cause is the second of five chapters in the new, critically acclaimed reimagining of the classic Kings Quest game series. In this latest adventure, KingKings Quest - Chapter 1: A Knight to Remember is required to play this content and is sold separately.\r Kings Quest - Rubble Without A Cause is the second of five chapters in the new, critically acclaimed reimagining of the classic Kings Quest game series. In this latest adventure, King Graham takes players back to his first test as ruler of Daventry. When a mischievous horde of goblins takes his kingdom hostage, a newly crowned and woefully unprepared Graham must rise up to free his people and prove himself the leader he was destined to become.\r Will Graham and his friends unearth a way to escape their rock-brained captors? Will he take for granite everything he learned as an adventurer? Does he have the stones to reclaim his mantle & lead his kingdom to safety? Will the hat make it out ok?… Expand"}, {"name": "The Fancy Pants Adventures", "details_link": "https://www.metacritic.com/game/xbox-360/the-fancy-pants-adventures", "publisher": "Electronic Arts", "release_date": "Apr 20 2011", "developers": ["Over the Top Games", "EA 2D"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Shooter", "Scrolling", "Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 67, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/2f85581a1dbc749c3dea2be399e9d095-98.jpg", "descriptions": "The Fancy Pants Adventures casts players in the role of the game’s hero – a hand-drawn stick figure named Fancy Pants Man who embarks on a mission to rescue his kidnapped sister, Cutie Pants. Sporting his trademark orange pants, Fancy Pants Man begins his journey in Squiggleville, racingThe Fancy Pants Adventures casts players in the role of the game’s hero – a hand-drawn stick figure named Fancy Pants Man who embarks on a mission to rescue his kidnapped sister, Cutie Pants. Sporting his trademark orange pants, Fancy Pants Man begins his journey in Squiggleville, racing through more than 20 unique open levels filled with challenges and bonus rooms where he must defeat comical enemies and overcome clever obstacles. Along the way, gamers can unlock over 140 unique customizations including 40 weapons to help Fancy Pants Man in his quest to defeat the Pirates. … Expand"}, {"name": "The Legend of Legacy", "details_link": "https://www.metacritic.com/game/3ds/the-legend-of-legacy", "publisher": "Atlus", "release_date": "Oct 13 2015", "developers": ["Cattle Call", "FuRyu"], "platforms": "3DS", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 67, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/848cee30868f6a535175777ae2d1cc47-98.jpg", "descriptions": "Seven adventurers are about to embark on the quest of a lifetime as they explore the island of Avalon and unravel the mysteries of its dark past."}, {"name": "Super Bomberman R", "details_link": "https://www.metacritic.com/game/playstation-4/super-bomberman-r", "publisher": "Konami", "release_date": "Jun 12 2018", "developers": ["Konami", "M2"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Puzzle", "Action", "Arcade"], "meta_score": 67, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/46b2bcd0a96a8d5d85cb26fd63d2268a-98.jpg", "descriptions": "New characters from the popular game series Ratchet & Clank make an appearance. Hailing from the Solana Galaxy, Ratchet Bomber is here with his trusty pal Clank strapped to his back. It’s time to save a whole new galaxy as the duo team up to bring their own brand of destruction to SuperNew characters from the popular game series Ratchet & Clank make an appearance. Hailing from the Solana Galaxy, Ratchet Bomber is here with his trusty pal Clank strapped to his back. It’s time to save a whole new galaxy as the duo team up to bring their own brand of destruction to Super Bomberman R.… Expand"}, {"name": "Lichtspeer", "details_link": "https://www.metacritic.com/game/playstation-4/lichtspeer", "publisher": "Crunching Koalas", "release_date": "Sep 27 2016", "developers": ["Lichthund"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 67, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/1cd4697b2a0908411ea22f0f7e0c39e7-98.jpg", "descriptions": "Lichtspeer is an action arcade lightspear-throwing simulator based in an ancient Germanic future. In a land filled with Wurst Zombies and Hipster Ice Giants, survival is an art. Grab your lightspear, become a Germonaut, and traverse lands straight out of Germanic myths. Survive with styleLichtspeer is an action arcade lightspear-throwing simulator based in an ancient Germanic future. In a land filled with Wurst Zombies and Hipster Ice Giants, survival is an art. Grab your lightspear, become a Germonaut, and traverse lands straight out of Germanic myths. Survive with style and expand your powers to fight for the glory and amusement of the almighty Gods. [Playstation.com]… Expand"}, {"name": "Citizens of Earth", "details_link": "https://www.metacritic.com/game/wii-u/citizens-of-earth", "publisher": "Atlus", "release_date": "Jan 20 2015", "developers": ["Eden Industries"], "platforms": ["3DS", "PC", "PlayStation 4", "PlayStation Vita", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "General", "Japanese-Style"], "meta_score": 67, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/15574e0d0b60be556ea916c9d696bdda-98.jpg", "descriptions": "In Citizens of Earth, you head home after a too-long election, hoping for a respite. On the contrary, you are accosted with a myriad of oddities. You immediately (following your cup 'o joe) embark on a mission to travel the land, battle mutants, gain allies, overthrow a puppet government,In Citizens of Earth, you head home after a too-long election, hoping for a respite. On the contrary, you are accosted with a myriad of oddities. You immediately (following your cup 'o joe) embark on a mission to travel the land, battle mutants, gain allies, overthrow a puppet government, snorkel for buried treasure, and, with the luxury of time, grab a well-deserved refill on your coffee.… Expand"}, {"name": "Metal Slug XX", "details_link": "https://www.metacritic.com/game/psp/metal-slug-xx", "publisher": "Atlus", "release_date": "Feb 23 2010", "developers": ["SNK Playmore"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "PSP"], "genres": ["Action", "General", "General", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 67, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/ae94fe54d39bb70ad8ba17f02363e9f7-98.jpg", "descriptions": "Choose between six zany METAL SLUG characters and shoot through seven action-packed levels with varying obstacles, numerous enemies, and diverging paths. Confident players can put their skills to the test by playing more than 70 mission-based trials in \"Combat School.\" With its unmistakableChoose between six zany METAL SLUG characters and shoot through seven action-packed levels with varying obstacles, numerous enemies, and diverging paths. Confident players can put their skills to the test by playing more than 70 mission-based trials in \"Combat School.\" With its unmistakable style and personality, nostalgic gameplay, more than 70 missions, and the ability to play with a friend, METAL SLUG XX is the definitive portable METAL SLUG arcade experience. [Atlus USA]… Expand"}, {"name": "Tom Clancy's Splinter Cell Classic Trilogy HD", "details_link": "https://www.metacritic.com/game/playstation-3/tom-clancys-splinter-cell-classic-trilogy-hd", "publisher": "Ubisoft", "release_date": "Sep 27 2011", "developers": ["Ubisoft"], "platforms": "PlayStation 3", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 67, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/bbcb63ec9a413e72118831ddc3ef9ffc-98.jpg", "descriptions": "This compilation includes Splinter Cell, Splinter Cell Pandora, and Splinter Cell Chaos Theory."}, {"name": "Brut@l", "details_link": "https://www.metacritic.com/game/playstation-4/brutl", "publisher": "Stormcloud Games Limited", "release_date": "Aug  9 2016", "developers": ["Stormcloud Games Limited"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 67, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/57735cf9f36318cef67e6855ead8b08e-98.jpg", "descriptions": "Brut@l is a modern re-imagining of the classic ASCII dungeon crawler with roguelike elements. With Perma death as a key feature players choose their hero: Ranger, Mage, Warrior or Amazon then descend into a procedurally generated world constructed entirely from ASCII. With weapon crafting,Brut@l is a modern re-imagining of the classic ASCII dungeon crawler with roguelike elements. With Perma death as a key feature players choose their hero: Ranger, Mage, Warrior or Amazon then descend into a procedurally generated world constructed entirely from ASCII. With weapon crafting, potion brewing and an onslaught of enemies to face, can you survive this Brut@l dungeon crawler? [Playstation.com]\r… Expand"}, {"name": "Edge Of Eternity", "details_link": "https://www.metacritic.com/game/pc/edge-of-eternity", "publisher": "Midgar Studio", "release_date": "Jun  8 2021", "developers": ["Midgar Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "General", "Japanese-Style"], "meta_score": 67, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/f6d7e242dfba99c8b77263f1a3073423-98.jpg", "descriptions": "Wage epic turn-based battles as you follow Daryon and Selene on their quest to find a cure to the all-consuming Corrosion in this grand tale of hope and sacrifice."}, {"name": "Oil Rush", "details_link": "https://www.metacritic.com/game/pc/oil-rush", "publisher": "Unigine Corp, Russia", "release_date": "Sep 23 2011", "developers": ["Unigine Corp", "Russia"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Modern", "General", "Modern"], "meta_score": 67, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/47d4406880941884e14d2eb87e6ab8de-98.jpg", "descriptions": "OilRush is a real-time strategy game based on group control. It offers mechanics of a classical RTS combined with a Tower Wars genre: control the upgrade of production platforms as well as their defence forces, and send battle groups of naval and air units to capture enemy platforms and oil rigs."}, {"name": "Song of Horror", "details_link": "https://www.metacritic.com/game/playstation-4/song-of-horror", "publisher": "Raiser Games", "release_date": "May 28 2021", "developers": ["Protocol Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 67, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/cc98cf76a3ec2382106128be6ded0fd8-98.jpg", "descriptions": "Beware the shadows and the darkness which seem silent. Beware the closed doors, the whispering mirrors. Beware the Song of Horror that nests in the cracks of your mind.\r The famed writer Sebastian P. Husher has gone missing, along with his entire family. Worried, his editor sent anBeware the shadows and the darkness which seem silent. Beware the closed doors, the whispering mirrors. Beware the Song of Horror that nests in the cracks of your mind.\r The famed writer Sebastian P. Husher has gone missing, along with his entire family. Worried, his editor sent an assistant to his house in order to look for him but he never came back... These disappearances spark a set of events that will soon reveal something dreadful: a nameless, dark entity known only as The Presence seems to be responsible and it's still somewhere, out there, lurking in the shadows, waiting for you... You may die, but the horror continues others will pick the investigation up from where you left it until you all find out the origin of The Presence and put an end to this nightmare. \r\rA PARANORMAL ADVENTURE OF UNPREDICTABLE TERROR\rSong of Horror offers a truly dynamic terror experience: its antagonist, the supernatural entity known only as The Presence, is controlled by an advanced AI (Artificial Intelligence) that adapts to your actions and decisions. Experience unbearable fear as this otherworldly being responds to your way of playing and hunts you down in unexpected ways, offering a unique experience to every player and gameplay where tension builds up naturally instead of coming from scripted sequences.\r As a player, you will live this story through the eyes of a varied set of characters related to the story in their own way. Every character is different, and brings their unique point of view to the investigation, allowing them to approach clues and items differently. Their actions and decisions will shape the world: some of them will know more or less of certain aspects of the story; some will be more effective against supernatural manifestations, but all of them can die if the Presence gets to them and death is permanent. If they die, you will have to pick the story up with another one, and continue the investigation so their deaths are not in vain.\r SPOOKY CHARACTERISTICS:\r * Investigate a paranormal mystery in a thrilling story of psychological horror\r* Beware The Presence, an otherworldly entity with its own AI that reacts to your actions and decisions in a non-scripted, unpredictable horror experience\r* Choose between a group of unique characters: each one brings its own point of view and has a different relation to the story and other characters\r* You may die, but the horror continues: death is permanent when a character dies, it's gone...but the next one will follow the investigation from where the deceased left it. The world will be shaped by their previous actions.\r* Explore haunted, sinister locations to gather clues and items that will help you solve challenging puzzles while enduring the agonizing tension of the game's atmosphere… Expand"}, {"name": "DOOM 3: VR Edition", "details_link": "https://www.metacritic.com/game/playstation-4/doom-3-vr-edition", "publisher": "Bethesda Softworks", "release_date": "Mar 29 2021", "developers": ["id Software", "Archiact Interactive Ltd."], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Light Gun", "Arcade"], "meta_score": 67, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/929a0ca27b4aaa7952a97b8bdb714037-98.jpg", "descriptions": "The game arrives March 29 for PlayStation 4 and is backwards compatible on PlayStation 5. Take your Aim controller in hand, put on your PS VR headset, and step into the armored boots of The Doom Marine. Fight for your life as one of the few survivors left in a UAC facility overrun by The game arrives March 29 for PlayStation 4 and is backwards compatible on PlayStation 5. Take your Aim controller in hand, put on your PS VR headset, and step into the armored boots of The Doom Marine. Fight for your life as one of the few survivors left in a UAC facility overrun by demons. Doom 3: VR Edition features Doom 3 and its expansions, Resurrection of Evil and The Lost Mission, retooled for PS VR technology. Uncover the secrets of the UAC’s unholy experiments, encounter uncanny monstrosities in claustrophobic environments, and wield an arsenal of iconic (and even otherworldly) weaponry with new textures, shaders and sound effects as you survive against the forces of Hell across over 15 hours of heart-stopping action. [Bethesda Softworks]… Expand"}, {"name": "Namco Museum Archives Vol. 2", "details_link": "https://www.metacritic.com/game/switch/namco-museum-archives-vol-2", "publisher": "Bandai Namco Games", "release_date": "Jun 18 2020", "developers": ["B.B.Studio"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/9e35a04eaedb35273fe8a547c81ea867-98.jpg", "descriptions": "Take a trip down memory lane and relive the magical times of the 8-Bit era with a collection of Namco’s hits and long-lost treasures in Namco Museum Archives Volume 2.\r ■Includes 11 titles!\r\nIn addition to 10 classic Namco titles, some of which were never localized and released in theTake a trip down memory lane and relive the magical times of the 8-Bit era with a collection of Namco’s hits and long-lost treasures in Namco Museum Archives Volume 2.\r ■Includes 11 titles!\rIn addition to 10 classic Namco titles, some of which were never localized and released in the west, an 8-Bit consolized version of \"Gaplus\" is included as a bonus!\r(Titles included: Galaga, Battle City, Pac-Land, Dig Dug II, Super Xevious, Mappy-Land, Legacy of the Wizard, Rolling Thunder, Dragon Buster II, Mendel Palace, and Gaplus)\r ■Equipped with convenient modern functions!\rConvenient features such as the \"save function\" that allows you to interrupt the game at any time and the \"replay function\" that allows you to start over at the last minute.… Expand"}, {"name": "Golazo!", "details_link": "https://www.metacritic.com/game/switch/golazo!", "publisher": "Klabater", "release_date": "Sep 12 2019", "developers": ["Purple Tree", "Purple Tree Studio"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Team", "Soccer", "Arcade"], "meta_score": 67, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/7/579896e5ef7eb91ef24851a7ea01bbc0-98.jpg", "descriptions": "Football is all about fun and teamwork. It doesn't matter if you're on the field or play it on console sitting with your friends on the couch. Golazo boldly recalls the glory days of the arcade soccer games, bringing back memories of cult classics we all know. With its vintage,Football is all about fun and teamwork. It doesn't matter if you're on the field or play it on console sitting with your friends on the couch. Golazo boldly recalls the glory days of the arcade soccer games, bringing back memories of cult classics we all know. With its vintage, not-too-serious, artistic and creative modern approach to classic gameplay, Golazo is certainly a perfect game for people who are weary of football managers or complicated hard-core simulators. You just grab your pad, sit on the couch and play!… Expand"}, {"name": "Atari Flashback Classics", "details_link": "https://www.metacritic.com/game/switch/atari-flashback-classics", "publisher": "Atari SA", "release_date": "Dec 13 2018", "developers": ["Code Mystics Inc.", "AtGames"], "platforms": ["PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/a9e0b996f54ec0331828d1ad72b18178-98.jpg", "descriptions": "More games - more fun! Contains 150 video games. Including Atari 2600, Atari 5200 & arcade classics! Featuring Gravitar, Crystal Castles, Major Havoc, Circus Atari & more!"}, {"name": "Yo-kai Watch Blasters: Red Cat Corps", "details_link": "https://www.metacritic.com/game/3ds/yo-kai-watch-blasters-red-cat-corps", "publisher": "Nintendo", "release_date": "Sep  7 2018", "developers": ["Level 5"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 67, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/6ab476f1fa9dbc3d324692e8d60a9198-98.jpg", "descriptions": "Take down enemy Yo-kai and Big Bosses using skills and Soultimate Moves with up to 3 other friends. As you tackle missions, befriend new Yo-kai to amplify your team's awesomeness. Train with Sgt. Burly to become the strongest Blasters team there is! As you complete missions, gather Oni OrbsTake down enemy Yo-kai and Big Bosses using skills and Soultimate Moves with up to 3 other friends. As you tackle missions, befriend new Yo-kai to amplify your team's awesomeness. Train with Sgt. Burly to become the strongest Blasters team there is! As you complete missions, gather Oni Orbs and items to level up or forge equipment to power up your team. Some missions, bosses, and Yo-kai are exclusive to each version. Trade Yo-kai between versions to collect them all! You can befriend all friend Yo-kai from all versions of the YO-KAI WATCH 2 game, boss Yo-kai, plus the all-new Usapyon, Blizzie, and more. Link save data with a version of YO-KAI WATCH 2 to befriend special Yo-kai. Uncover new sides to the story as well as new Yo-kai, bosses, and missions with a post-launch software update.… Expand"}, {"name": "Gravel", "details_link": "https://www.metacritic.com/game/xbox-one/gravel", "publisher": "Milestone S.r.l", "release_date": "Feb 27 2018", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/22448562f3d422ff9a7dd92e2f9d1167-98.jpg", "descriptions": "Destroy obstacles, take shortcuts, and forget any rules until the end to win."}, {"name": "Danganronpa Another Episode: Ultra Despair Girls", "details_link": "https://www.metacritic.com/game/playstation-4/danganronpa-another-episode-ultra-despair-girls", "publisher": "NIS America", "release_date": "Jun 27 2017", "developers": ["Spike Chunsoft"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 67, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/18b171c49988836128eaa9dba47b833e-98.jpg", "descriptions": "From the Danganronpa series, Danganronpa Another Episode: Ultra Despair Girls bridges the first two critically acclaimed mystery adventure games.\r Komaru Naegi, little sister to Makoto Naegi, has been imprisoned inside a mysterious apartment for over a year. One day, she is rescued byFrom the Danganronpa series, Danganronpa Another Episode: Ultra Despair Girls bridges the first two critically acclaimed mystery adventure games.\r Komaru Naegi, little sister to Makoto Naegi, has been imprisoned inside a mysterious apartment for over a year. One day, she is rescued by Byakuya Togami of Future Foundation, but the rescue is derailed by a sudden attack of hundreds of Monokumas. Komaru soon discovers that the city has been taken over by a group of children calling themselves the Warriors of Hope. Their leader, Monaca, declares that the city will be the site of a Children's Paradise, and to accomplish this, all the adults will be exterminated. Komaru teams up with Toko Fukawa to try to survive the rampaging Monokumas, escape the crafty Monokuma Kids, and uncover the secrets of the city.\r Third Person Shooter Action Sequences: Use Future Foundation's Hacking Gun to have a fighting chance against the hordes of Monokumas as you traverse Towa City.\r Tons of Different Types of Ammo: Tackle challenges with multiple kinds of Truth Bullets, such as Paralyze and Link. Upgrade your firepower with special Bling Bullet modifiers.\r Riddles and Puzzles: The Monokuma Kids will challenge more than just your trigger finger; you'll need your smarts to survive as well. There's a lot to discover in the city, with a number of familiar faces and mysteries to unravel!… Expand"}, {"name": "Vikings: Wolves of Midgard", "details_link": "https://www.metacritic.com/game/playstation-4/vikings-wolves-of-midgard", "publisher": "Kalypso", "release_date": "Mar 28 2017", "developers": ["Games Farm"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 67, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/12029b48bbdd54468bd9e0d77f27971f-98.jpg", "descriptions": "Fear the wolves. They are cold, they are hungry - and they will stop at nothing to survive\r Ragnarok. Legend has it that when the coldest winter descends, the Jotan will return to take their vengeance against the Gods of Asgard. The world is on the road to perdition and the fate of MidgardFear the wolves. They are cold, they are hungry - and they will stop at nothing to survive\r Ragnarok. Legend has it that when the coldest winter descends, the Jotan will return to take their vengeance against the Gods of Asgard. The world is on the road to perdition and the fate of Midgard hangs in the balance. But when the Fire and Frost Giants begin to merge their armies, they encounter the clan of the Ulfung  the Wolves of Midgard. Bloody, but unbowed following the destruction of their village, this notorious band of ostracized Viking warriors are determined to seize their destiny and save the world. As clan chief, you must save Midgard from complete annihilation, and spearhead the charge to vanquish the fiendish creatures of the Fimbulwinter.\r * Fantasy Meets Norse Mythology\rTravel the realms of earthly Midgard, freezing Niflheim and boiling Balheim, either as a fierce Viking warrior or merciless shieldmaiden.\r *The Deadly Fimbulwinter\rWithstand the deathly colds and protect yourself from exposure to natures wrath in order to survive.\r * Tribute To The Gods\rCollect blood from fallen enemies and sacrifice it at the altar to gain gifts from the Gods to enhance your powers.\r * Berserker Rage\rLet your anger take hold by activating Rage Mode to overwhelm your enemies in bloodthirsty combat.\r * The Art Of Combat\rPerfect your skills with each weapon to unlock their true potential, including swords, bows and spell-powered canes.\r * The Power Of The Gods\rMake the abilities of the Gods your own by equipping power-infused amulets, like the Talismans of Thor or Loki. Put your new skills to the test by competing in the Trials of the Gods to earn further rewards.\r * Teamwork\rTeam up with a friend and journey to the Shores of Midgard together in an epic two player online co-op mode. Choose between four difficulty levels to suit your skills and talents. Do you dare attempt the unrelenting hardcore mode?… Expand"}, {"name": "FORCED SHOWDOWN", "details_link": "https://www.metacritic.com/game/pc/forced-showdown", "publisher": "BetaDwarf", "release_date": "Mar 29 2016", "developers": ["BetaDwarf"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/9ae596996de16d42af05048b84b4d2d9-98.jpg", "descriptions": "Action and deckbuilding combine in a Galactic Game Show - but questions gets replaced with deadly Gladiator Battles. You are the contestant - will you die or become a crowd favorite?"}, {"name": "Senran Kagura Shinovi Versus", "details_link": "https://www.metacritic.com/game/playstation-vita/senran-kagura-shinovi-versus", "publisher": "XSEED Games", "release_date": "Oct 14 2014", "developers": ["Tamsoft", "Marvelous AQL"], "platforms": ["PC", "PlayStation Vita"], "num_players": "Up to 4 ", "genres": ["Action", "General"], "meta_score": 67, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/26579a2e9077c2ce3e66ee392268b404-98.jpg", "descriptions": "SENRAN KAGURA SHINOVI VERSUS immediately follows the events of SENRAN KAGURA Burst, revisiting the fierce rivalry between the girls of Hanz? National Academy and their sworn enemies from Hebijo Clandestine Girls’ Academy, the latter of which have now gone underground and formed a mercenarySENRAN KAGURA SHINOVI VERSUS immediately follows the events of SENRAN KAGURA Burst, revisiting the fierce rivalry between the girls of Hanz? National Academy and their sworn enemies from Hebijo Clandestine Girls’ Academy, the latter of which have now gone underground and formed a mercenary strike team known as the Homura Crimson Squad. In addition to their old adversaries, the Hanz? girls must also face a whole new set of foes: the students of Gessen Girls’ Academy, who seek to punish them for their imperfections as shinobi warriors. Meanwhile, a new class is in session at Hebijo, and these students mean business: they oppose all three of the competing factions and will stop at nothing to be the last shinobi squad standing – even if it means leaving broken bodies and shattered dreams in their wake.… Expand"}, {"name": "Rayman Raving Rabbids 2", "details_link": "https://www.metacritic.com/game/wii/rayman-raving-rabbids-2", "publisher": "Ubisoft", "release_date": "Nov 15 2007", "developers": ["Ubisoft Montpellier"], "platforms": ["PC", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 67, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/c1780ff17c766e4aa2f27ede7c883636-98.jpg", "descriptions": "After invading the world of Rayman, the insane Rabbids have a new objective: THE INVASION OF PLANET EARTH! Setting their home base at a shopping mall, the Rabbids try to study human behavior and mimic everything humans do in funny, illogical ways. As part of their training, the Rabbids mustAfter invading the world of Rayman, the insane Rabbids have a new objective: THE INVASION OF PLANET EARTH! Setting their home base at a shopping mall, the Rabbids try to study human behavior and mimic everything humans do in funny, illogical ways. As part of their training, the Rabbids must carry out several missions around the globe to prepare themselves for world domination. Rayman will attempt to infiltrate the Rabbids, disguised as one of them, in a mission to foil their crazy plans and save Earth. Game features include: 60 brand-new games that spoof popular culture and are even wackier than those featured in the first Rayman Raving Rabbids. Unique use of the Wii Remote – Discover new, innovative ways to play, with eight types of gameplay, including shaking, precision, dexterity and balance. Travel around the world - Take Rayman on a world tour to defend Earth from the Rabbids invasion. Travel to five different regions such as the USA, Europe and Asia, where players will challenge the Rabbids in the local environments. Customize Rayman and the Rabbids - Use more than 110 items (skins, hats, accessories and clothes) to dress Rayman and create your own Rabbids. Unleash your creativity with over 540K customization combinations. Multiplayer experience – Play co-op or battle up to three friends in all the games unlocked in the single-player campaign. [Ubisoft]… Expand"}, {"name": "Ice Age 2: The Meltdown", "details_link": "https://www.metacritic.com/game/gamecube/ice-age-2-the-meltdown", "publisher": "Vivendi Games", "release_date": "Mar 14 2006", "developers": ["Vivendi Games"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 67, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/f068e177897e5632131bc8ad8513c58e-98.jpg", "descriptions": "Their world is melting, and your Ice Age 2 The Meltdown pals need help escaping the biggest flash flood in prehistory. Swim, splash, and scurry through all the action and adventure from the new Ice Age 2 The Meltdown movie and unearth fun, laughter and surprises along the way. Play as Scrat,Their world is melting, and your Ice Age 2 The Meltdown pals need help escaping the biggest flash flood in prehistory. Swim, splash, and scurry through all the action and adventure from the new Ice Age 2 The Meltdown movie and unearth fun, laughter and surprises along the way. Play as Scrat, along with your favorite heroes from the film. Dive into a huge variety of exciting mini-games, like Sid's Slippery Sloth Slide Challenge. Journey through the amazing worlds of the Ice Age 2 The Meltdown movie... and new ones too.… Expand"}, {"name": "Fullmetal Alchemist 2: Curse of the Crimson Elixir", "details_link": "https://www.metacritic.com/game/playstation-2/fullmetal-alchemist-2-curse-of-the-crimson-elixir", "publisher": "Square Enix", "release_date": "Jul 12 2005", "developers": ["Racjin"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 67, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/7f836fd7088b18906f5e3ba04f3575c8-98.jpg", "descriptions": "(Also known as \"Fullmetal Alchemist 2: Akaki Elixir no Akuma\") The story begins in Lior, a desert city that Edward and Alphonse visit in the first episode of the animated series. As the brothers are unveiling the secrets of a cult called Leto, they are attacked by shadowy creatures from the(Also known as \"Fullmetal Alchemist 2: Akaki Elixir no Akuma\") The story begins in Lior, a desert city that Edward and Alphonse visit in the first episode of the animated series. As the brothers are unveiling the secrets of a cult called Leto, they are attacked by shadowy creatures from the unknown. Meanwhile, a frightening phenomenon is sweeping the country; people in many regions are vanishing without a trace. In Resembool, Edward and Alphonse meet an enigmatic alchemist. It seems that he has some connection with both the disappearances and the strange creatures encountered earlier. When Colonel Mustang sends the brothers to investigate a village plagued by these monsters, they meet Arlen, an archaeologist who is studying the ancient civilization of Lebis. Edward and Alphonse soon find themselves headed for the ruins of Siam-Sid, the capital city of Lebis, to discover the truth behind the monstrous creatures and the puzzling disappearances.… Expand"}, {"name": "Tomb Raider: Legend", "details_link": "https://www.metacritic.com/game/psp/tomb-raider-legend", "publisher": "Eidos Interactive", "release_date": "Jun 21 2006", "developers": ["Buzz Monkey"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PSP"], "num_players": "1-2 ", "genres": ["Action Adventure", "Modern", "Modern", "Linear"], "meta_score": 67, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/0ea4b4b953d58f1870717516324b07a6-98.jpg", "descriptions": "Tomb Raider: Legend revives the athletic, intelligent and entertaining adventurer who won the hearts and minds of gamers worldwide. Lara comes alive with intricately animated expressions, moves and abilities. An arsenal of modern equipment, such as a magnetic grappling device, binoculars,Tomb Raider: Legend revives the athletic, intelligent and entertaining adventurer who won the hearts and minds of gamers worldwide. Lara comes alive with intricately animated expressions, moves and abilities. An arsenal of modern equipment, such as a magnetic grappling device, binoculars, frag grenades, personal lighting device and communications equipment, allows gamers to experience tomb raiding as never before. Eidos and Crystal Dynamics shaped Lara's look and movements to be an inherent extension of her skills, motivation and personality. Lara's character model features natural structure, realistic textures, detailed facial features, reactive eyes and fluid motion, all of which make her part of a living environment. New character animations and controls allow her to move through stunning environments with grace and precision, while an understanding of the game's original appeal reinvigorates the fundamental explore-and-solve adventure experience. [Eidos Interactive]… Expand"}, {"name": "Sea of Thieves", "details_link": "https://www.metacritic.com/game/pc/sea-of-thieves", "publisher": "Microsoft Game Studios", "release_date": "Mar 20 2018", "developers": ["Rare Ltd."], "platforms": ["Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 24 ", "genres": ["Role-Playing", "Action Adventure", "Massively Multiplayer", "Open-World"], "meta_score": 67, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/e7c904af1ce29b50be1ad577e85aea01-98.jpg", "descriptions": "Be The Pirate You Want To Be - With musket loaded and grog in hand, the freedom of the pirate life awaits. What will your legend be? An epic multiplayer adventure. Crew up and set sail on memorable voyages. Make and break your pirates' code on the Sea of Thieves. A treacherous shared world.Be The Pirate You Want To Be - With musket loaded and grog in hand, the freedom of the pirate life awaits. What will your legend be? An epic multiplayer adventure. Crew up and set sail on memorable voyages. Make and break your pirates' code on the Sea of Thieves. A treacherous shared world. Plot your course and set sail for hidden riches. Navigate the perils of a fantastical world and the danger of rival crews.… Expand"}, {"name": "Lollipop Chainsaw", "details_link": "https://www.metacritic.com/game/playstation-3/lollipop-chainsaw", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 12 2012", "developers": ["Grasshopper Manufacture"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Beat-'Em-Up", "3D"], "meta_score": 67, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/fb458d75b90703cefca0a985e5ff3e7d-98.jpg", "descriptions": "Lollipop Chainsaw is the un-deadly story of sweet, killer zombie-slayer Juliet Starling and her mission to uncover the root of a zombie outbreak. Juliet must balance the drama of high school while carrying out her zombie-hunting lineage. Players hone their cheerleading acrobatics andLollipop Chainsaw is the un-deadly story of sweet, killer zombie-slayer Juliet Starling and her mission to uncover the root of a zombie outbreak. Juliet must balance the drama of high school while carrying out her zombie-hunting lineage. Players hone their cheerleading acrobatics and chainsaw skills to string together lethal combo moves, taking out scores of the undead. The game was developed by GRASSHOPPER MANUFACTURE, led by game develop Goichi Suda (aka SUDA 51) and featuring the music of the Akira Yamaoka. In addition, Hollywood director and writer James Gunn (Super, Slither, Dawn of the Dead, Tromeo and Juliet) has brought his cult humor and edgy storytelling to Lollipop Chainsaw’s script.… Expand"}, {"name": "Mario & Sonic at the Olympic Games", "details_link": "https://www.metacritic.com/game/wii/mario-sonic-at-the-olympic-games", "publisher": "Sega", "release_date": "Nov  6 2007", "developers": ["Sega", "Nintendo", "Sega Sports R&D"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 67, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/959ad614f1793c9235948d93a81b0e21-98.jpg", "descriptions": "In Mario & Sonic at the Olympic Games, players compete in events that take place in environments based on the official venues of the Beijing 2008 Olympic Games. Using a supporting cast of characters from the worlds of both Mario and Sonic, gamers compete as or against a range of lovableIn Mario & Sonic at the Olympic Games, players compete in events that take place in environments based on the official venues of the Beijing 2008 Olympic Games. Using a supporting cast of characters from the worlds of both Mario and Sonic, gamers compete as or against a range of lovable personalities including Mario, Sonic, Luigi, Knuckles, Yoshi, Tails and more. Innovative usage of the Wii and DS control systems to maneuver a favorite character allows players to race the likes of Mario and Sonic down the 100m track, engage in exhilarating rallies in table tennis and churn water in a swimming heat, all while competing for the much sought after gold medal. [Sega]… Expand"}, {"name": "Crystar", "details_link": "https://www.metacritic.com/game/playstation-4/crystar", "publisher": "Spike Chunsoft", "release_date": "Aug 27 2019", "developers": ["FuRyu", "Gemdrops"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 67, "users_score": 9.6, "image": "https://static.metacritic.com/images/products/games/8/e628991d91cbe6f604c5c86342fdeedd-98.jpg", "descriptions": "For when I weep, then I am strong. Battle through Purgatory as Rei to help save her sister in this Action RPG. Switch freely between four playable characters, and uncover each one of their pasts to see the sorrows they have endured."}, {"name": "InnerSpace", "details_link": "https://www.metacritic.com/game/playstation-4/innerspace", "publisher": "PolyKnight Games", "release_date": "Jan 16 2018", "developers": ["PolyKnight Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Civilian"], "meta_score": 67, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/8/c4c24d27edbab412e34bc63419f5ea53-98.jpg", "descriptions": "In the final days of the Inverse, you must help the Archaeologist recover the last remaining memories before they are lost forever. Fly through ancient skies and abandoned oceans to discover the lost history of this fading realm, where entire civilizations have died, yet their gods stillIn the final days of the Inverse, you must help the Archaeologist recover the last remaining memories before they are lost forever. Fly through ancient skies and abandoned oceans to discover the lost history of this fading realm, where entire civilizations have died, yet their gods still wander. In InnerSpace, gravity pulls outward instead of in. InnerSpace began as a project among college friends and evolved into a successful Kickstarter campaign in 2014. After years of development, PolyKnight is proud to welcome you to the Inverse.… Expand"}, {"name": "Neon Chrome", "details_link": "https://www.metacritic.com/game/switch/neon-chrome", "publisher": "10tons", "release_date": "Oct 12 2017", "developers": ["10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "PlayStation Vita", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 67, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/1439ea504a0c897d12ff87b698a59672-98.jpg", "descriptions": "Neon Chrome is a ruthless top-down cyberpunk shooter with rogue-like elements. The game takes place inside an arcology  a massive sci-fi mega structure.\r Blast your way through walls with guns and cybernetic abilities and try alternate approaches with different roles like the Assassin,Neon Chrome is a ruthless top-down cyberpunk shooter with rogue-like elements. The game takes place inside an arcology  a massive sci-fi mega structure.\r Blast your way through walls with guns and cybernetic abilities and try alternate approaches with different roles like the Assassin, Corporate Soldier or the Cyber Psycho. Upgrade your character stats, discover new cybernetic enhancements and build up strength to finally face the Overseer. Every death is a new beginning  the path to defeating the Overseer is never the same.… Expand"}, {"name": "The Incredibles: Rise of the Underminer", "details_link": "https://www.metacritic.com/game/gamecube/the-incredibles-rise-of-the-underminer", "publisher": "THQ", "release_date": "Nov  1 2005", "developers": ["Heavy Iron Studios"], "platforms": "GameCube", "genres": ["Action", "Platformer", "3D"], "meta_score": 67, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/a6b4194780543db34c73a1176f0798ce-98.jpg", "descriptions": "When the evil Underminer rises to the surface with a sinister plan to rule the world, it's up to Mr. Incredible and his super cool pal Frozone to save the day. While Mrs. Incredible, Violet, Dash, and Jack-Jack take care of things topside, Mr. Incredible and Frozone race underground to put aWhen the evil Underminer rises to the surface with a sinister plan to rule the world, it's up to Mr. Incredible and his super cool pal Frozone to save the day. While Mrs. Incredible, Violet, Dash, and Jack-Jack take care of things topside, Mr. Incredible and Frozone race underground to put a stop to the Underminer's dastardly plans and bury the diabolitical baddie once and for all! All-new action/adventure game. Play as Mr. Incredible or Frozone at anytime. Cooperative game-play with the ability to switch characters at any point in the game. Update your character's moves and abilities as you progress through the game.… Expand"}, {"name": "Re:Turn - One Way Trip", "details_link": "https://www.metacritic.com/game/pc/return---one-way-trip", "publisher": "Green Man Gaming Publishing", "release_date": "Oct 14 2020", "developers": ["Red Ego Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 67, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/1529bb02e30de09201fb16d62922a980-98.jpg", "descriptions": "Re:Turn - One Way Trip is a 2D side-scrolling puzzle-adventure horror game. Trapped in a ghostly train, Saki must search the past and present to find and save her friends. More importantly, Saki must use her wits if she is to survive against an unspeakable evil hellbent on avenging Re:Turn - One Way Trip is a 2D side-scrolling puzzle-adventure horror game. Trapped in a ghostly train, Saki must search the past and present to find and save her friends. More importantly, Saki must use her wits if she is to survive against an unspeakable evil hellbent on avenging unrequited love. … Expand"}, {"name": "The King's Bird", "details_link": "https://www.metacritic.com/game/switch/the-kings-bird", "publisher": "Graffiti Games", "release_date": "Feb 12 2019", "developers": ["Serenity Forge"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 67, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/7/16c5efd7ddc790ec99f52a969b5c0652-98.jpg", "descriptions": "The King's Bird is a momentum-based precision-platformer that seamlessly combines parkour with aerial movement."}, {"name": "Phantom Breaker: Battle Grounds", "details_link": "https://www.metacritic.com/game/playstation-vita/phantom-breaker-battle-grounds", "publisher": "Mages.", "release_date": "Aug 12 2014", "developers": ["Division2"], "platforms": ["PC", "Xbox 360", "PlayStation Vita"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 67, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/d583ec30cfafbd6d5702fe0ec2174942-98.jpg", "descriptions": "Phantom Breaker: Battle Grounds is a 2D beat 'em up from Mages/5pb, the makers of Steins;Gate, Bullet Soul, and other great games. Choose a fighter and battle against the bizarre minions of the evil wizard Phantom. Enjoy classic beat 'em up gameplay with a fighting game twist. Dash throughPhantom Breaker: Battle Grounds is a 2D beat 'em up from Mages/5pb, the makers of Steins;Gate, Bullet Soul, and other great games. Choose a fighter and battle against the bizarre minions of the evil wizard Phantom. Enjoy classic beat 'em up gameplay with a fighting game twist. Dash through colorful Tokyo locales, strengthen your characters, team up with your friends, fight dragons and killer robots!\r Story Mode - Enjoy a lighthearted story as you battle Phantom's minions across 8 stages inspired by famous Tokyo districts.\r Arcade Mode - Challenge yourself to get the biggest combo, the highest score, or the fastest completion time.\r Multiplayer - Easy to learn mechanics make playing with your friends a snap. Team up with your friends for the local co-op or online campaign, or go to the battlegrounds arena and fight a pitched PVP battle! Up to 4 players supported.\r Customizable, Persistent Characters - 4 starting characters and 6 unlockable ones. Each character has a fully customizable stat and skill tree, and levels persist between all modes. Choose a favorite character and build them how you like! Every character has unique special attacks.\r Retro Charm - Vibrant sprite graphics and a catchy chiptune-inspired soundtrack for the discerning retro gamer!… Expand"}, {"name": "Dragon Age: Origins - Leliana's Song", "details_link": "https://www.metacritic.com/game/playstation-3/dragon-age-origins---lelianas-song", "publisher": "Electronic Arts", "release_date": "Jul  6 2010", "developers": ["BioWare"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 67, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/75a5d1527a3c0ce58e1bcae1d9c33a49-98.jpg", "descriptions": "A standalone adventure in which you play as Leliana during the mission--and betrayal--that changed her forever. It is years before the Blight, and Leliana is a young bard whose curiosities run more to passion than to the Chant of Light. Her mentor, Marjolaine, is determined to inflict theA standalone adventure in which you play as Leliana during the mission--and betrayal--that changed her forever. It is years before the Blight, and Leliana is a young bard whose curiosities run more to passion than to the Chant of Light. Her mentor, Marjolaine, is determined to inflict the Orlesian game of intrigue on Ferelden. It is a time of adventure and excitement. And it cannot last.… Expand"}, {"name": "Shark Tale", "details_link": "https://www.metacritic.com/game/xbox/shark-tale", "publisher": "Activision", "release_date": "Sep 27 2004", "developers": ["Edge of Reality"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/1cb856a3617473704f9b0e96b7d2e197-98.jpg", "descriptions": "In the murky depths of the ocean, the fate of Reef City lies in the fins of one little fish--at least that's what he wants you to think. Dive into the underwater metropolis of Shark Tale and play as Oscar, a fast-talking fish whose little fib gets him into big trouble. Based on DreamWorks'In the murky depths of the ocean, the fate of Reef City lies in the fins of one little fish--at least that's what he wants you to think. Dive into the underwater metropolis of Shark Tale and play as Oscar, a fast-talking fish whose little fib gets him into big trouble. Based on DreamWorks' animated film, Shark Tale features 25 missions that will have you exploring Reef City, racing through the coral, fighting Fish Fu and great white sharks, and dancing to the sounds of hip-hop tracks.… Expand"}, {"name": "The Lord of the Rings: War of the Ring", "details_link": "https://www.metacritic.com/game/pc/the-lord-of-the-rings-war-of-the-ring", "publisher": "Sierra Entertainment", "release_date": "Nov  4 2003", "developers": ["Liquid Entertainment"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 67, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/522527643be1c4f0c901741cf62996ac-98.jpg", "descriptions": "Play the Greatest Story Ever Written . . . The quest to destroy the One Ring continues in the first Real-Time Strategy game based on The Lord of the Rings saga. Massive battles erupt as the forces of light and darkness battle for control of Middle-earth. Play as the forces of good andPlay the Greatest Story Ever Written . . . The quest to destroy the One Ring continues in the first Real-Time Strategy game based on The Lord of the Rings saga. Massive battles erupt as the forces of light and darkness battle for control of Middle-earth. Play as the forces of good and valiantly fight for the One Ring's destruction or play as the forces of evil to claim control over Middle-earth forever. [Sierra]… Expand"}, {"name": "Wallace & Gromit in Project Zoo", "details_link": "https://www.metacritic.com/game/playstation-2/wallace-gromit-in-project-zoo", "publisher": "Bam Entertainment", "release_date": "Oct  7 2003", "developers": ["Frontier Developments"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 67, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/1/74594af4ab28708bf8ba000ee2c33d54-98.jpg", "descriptions": "Wallace & Gromit is an arcade platform adventure where the player has to liberate the zoo from the evil clutches of the maniacal Feathers. Feathers wants to make diamonds. Lots of diamonds. And he'll stop at nothing to achieve his dream. The diabolical penguin has incarcerated all the babyWallace & Gromit is an arcade platform adventure where the player has to liberate the zoo from the evil clutches of the maniacal Feathers. Feathers wants to make diamonds. Lots of diamonds. And he'll stop at nothing to achieve his dream. The diabolical penguin has incarcerated all the baby animals in order to persuade their parents to do his bidding and manufacture gems from the coal being mined using the incredible diamond-o-matic. Wallace & Gromit have smelled the fishy presence of Feathers and developed an elaborate plan to infiltrate his domain. And so the indomitable duo has to construct the integral part of their scheme, the Trojan Penguin. When the giant wooden bird is placed at the zoo gates Feathers' narcissistic personality embraces the 30-foot tribute and makes it the zoo centerpiece. Unbeknownst to Feathers, Wallace & Gromit reside in the Trojan Penguin complete with resplendent standard lamp and armchair. At night the pair can start their amazing adventure. [BAM! Entertainment]… Expand"}, {"name": "Naval Ops: Warship Gunner", "details_link": "https://www.metacritic.com/game/playstation-2/naval-ops-warship-gunner", "publisher": "Koei", "release_date": "Jun 25 2003", "developers": ["Micro Cabin"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Ship"], "meta_score": 67, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/ee12acc25e13ea422edd8bd3dae14b92-98.jpg", "descriptions": "The gameplay in Naval Ops: Warship Gunner involves two unique phases: design and battle. At the start of the design phase, players are given a mission briefing. Based on the mission?s objectives, players can construct or retrofit their ship with weapons, a propulsion system, aircraft, andThe gameplay in Naval Ops: Warship Gunner involves two unique phases: design and battle. At the start of the design phase, players are given a mission briefing. Based on the mission?s objectives, players can construct or retrofit their ship with weapons, a propulsion system, aircraft, and defensive hardware. At this stage, players can also invest in new technology, develop new weapons, or purchase parts. Players can also bypass the process of ship design, and proceed directly into battle using ships based on actual naval craft. The battle phase puts the player?s real-time combat skills to the test. Players engage surface vessels and aircraft, destroy communications garrisons, and avoid high-G anti-ship missiles. Combat missions can take place around the clock making nighttime attacks a strategic option.  Dense fog and heavy storms are just some of the other conditions that players must contend with. For help, players can rely on fully integrated combat systems providing complete situational awareness, and access to all weapons systems. [KOEI]… Expand"}, {"name": "Star Wars Bounty Hunter", "details_link": "https://www.metacritic.com/game/gamecube/star-wars-bounty-hunter", "publisher": "LucasArts", "release_date": "Dec  7 2002", "developers": ["LucasArts"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 67, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/e7410ac49f819a003959957c1c6b2589-98.jpg", "descriptions": "The hunt begins.  You are Jango Fett, the galaxy's most dangerous bounty hunter, hired to hunt down the elusive leader of a mysterious cult--dead or alive.  Through 18 action-packed levels across six diverse worlds, face off against galactic scum, fearsome beasts, and brutal competition thatThe hunt begins.  You are Jango Fett, the galaxy's most dangerous bounty hunter, hired to hunt down the elusive leader of a mysterious cult--dead or alive.  Through 18 action-packed levels across six diverse worlds, face off against galactic scum, fearsome beasts, and brutal competition that stand between you and your prey: a deranged dark Jedi.  This hunt will lead you to the darkest corners of the Star Wars universe where no one else has dared to go, but you are the fearless, ruthless, and relentless Jango Fett.  For the galaxy's most wanted, there is no place to hide.… Expand"}, {"name": "Dungeon Hunter: Alliance", "details_link": "https://www.metacritic.com/game/playstation-3/dungeon-hunter-alliance", "publisher": "Gameloft", "release_date": "Apr 12 2011", "developers": ["Gameloft"], "platforms": ["PlayStation Vita", "PlayStation 3"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/c722650f24f89c57da3348a73395fd6a-98.jpg", "descriptions": "The world of Gothicus is in the suffocating grip of a queen bent on hellish destruction. In Dungeon Hunter: Alliance on PlayStation 3, your destiny and this tormented land depend on your ability to forge a fighting unit strong enough to withstand anything the forces of the netherworld canThe world of Gothicus is in the suffocating grip of a queen bent on hellish destruction. In Dungeon Hunter: Alliance on PlayStation 3, your destiny and this tormented land depend on your ability to forge a fighting unit strong enough to withstand anything the forces of the netherworld can throw at it.\r Picture postcard charm gives the villages and settlements of Gothicus an air of unruffled tranquillity. Traders and craftsmen bustle between thatched houses, stopping to pass the time of day and hawk their goods. All is bright and, seemingly, idyllic.\r Spend a little longer here and the atmosphere takes on a more sinister edge. In the bowels beneath Gothicus, malevolent hordes roam in immense packs, waiting to engulf anyone foolish enough to venture there. Goblin kings, enslaved trolls and zombie marauders are just an acrid taste of the tidal wave of evil threatening to rip through this peaceful land.\r Armed with PlayStation Move motion controllers or wireless controllers, you and up to three friends are all that separate Gothicus and darkness.… Expand"}, {"name": "Teenage Zombies: Invasion of the Alien Brain Thingys", "details_link": "https://www.metacritic.com/game/ds/teenage-zombies-invasion-of-the-alien-brain-thingys", "publisher": "Ignition Entertainment", "release_date": "Apr 15 2008", "developers": ["InLight Entertainment"], "platforms": "DS", "genres": ["Adventure", "General", "General"], "meta_score": 67, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/d4a236000370909a79d4884c419860d1-98.jpg", "descriptions": "The Earth is under attack by a horde of Alien Brain... uh...Thingys! Humans, succumbing to ray-guns, mind-control, and shiny flying saucers, have failed to defend their planet and let it fall easily into the clutches of the Big Brain and his army of Brain Thingys. The only hope left forThe Earth is under attack by a horde of Alien Brain... uh...Thingys! Humans, succumbing to ray-guns, mind-control, and shiny flying saucers, have failed to defend their planet and let it fall easily into the clutches of the Big Brain and his army of Brain Thingys. The only hope left for mankind is three Teenage Zombies that have arisen from a graveyard disturbed in the invasion. The undead trio ignores their normal human victims in favor of the pulsing pink brains they see EVERYWHERE - all the while being lured to the ultimate lunch: THE BIG BRAIN! The Big Brain soon realizes he's overlooked this \"Super Race\" as they inexplicably resist mind control, are unaffected by ray-gun wounds, and devour his Brain Thingy Armies like sweets! He refocuses his efforts and resources to battle the Earth's greatest champions: The Teenage Zombies! Teenage Zombies uses a whimsical style that focuses on, and parodies the Zombie genre, as well as 1950s style Science Fiction. This is presented in a comic book look featuring comic book panels, dialogue boxes and story telling. Gameplay involves side-scrolling adventures opening up to stylus mini-games, double-screen boss battles, and brain busting puzzle challenges. [Ignition]… Expand"}, {"name": "Sonic Colors: Ultimate", "details_link": "https://www.metacritic.com/game/switch/sonic-colors-ultimate", "publisher": "Sega", "release_date": "Sep  7 2021", "developers": ["Sega", "Blind Squirrel Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "genres": ["Action", "Platformer", "2D", "3D"], "meta_score": 67, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/2/5a524ed91634da8281dc77ac0bb54d3d-98.jpg", "descriptions": "The evil Dr. Eggman has built an interstellar amusement park – but he’s powering it with a captured alien race called “Wisps.” Use Sonic’s speed to free the Wisps and gain their amazing powers as you explore six colorful unique worlds."}, {"name": "Disjunction", "details_link": "https://www.metacritic.com/game/pc/disjunction", "publisher": "Sold Out", "release_date": "Jan 28 2021", "developers": ["Ape Tribe Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/5a71ecddb35d1e8525882d1e1c2e41cb-98.jpg", "descriptions": "Disjunction is a cyberpunk stealth-action RPG set in the dystopian underworld of a 2048 New York. Experience a reactive, intertwining story of three playable characters, working to uncover unfortunate truths that will change the fate of their city forever."}, {"name": "Fret Nice", "details_link": "https://www.metacritic.com/game/playstation-3/fret-nice", "publisher": "Tecmo", "release_date": "Feb  4 2010", "developers": ["Tecmo", "Pieces Interactive"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 67, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/a82db742edb26a8bfc334c355b80c72e-98.jpg", "descriptions": "[Playstation Network]  Rock on and harmonize the unity between music and 2D platformer! As you control your character through the artful stages, you play the game as if it was a jammin’ rock song. Blast your enemies with riff combos and create your own soundtracks with each “strum” of a[Playstation Network]  Rock on and harmonize the unity between music and 2D platformer! As you control your character through the artful stages, you play the game as if it was a jammin’ rock song. Blast your enemies with riff combos and create your own soundtracks with each “strum” of a chord. You will have an ever-changing experience each time a stage is repeated. [Pieces Interactive]… Expand"}, {"name": "Just Cause", "details_link": "https://www.metacritic.com/game/playstation-2/just-cause", "publisher": "Eidos Interactive", "release_date": "Sep 27 2006", "developers": ["Avalanche Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/a884e595472d4c830e618621cd37d4b5-98.jpg", "descriptions": "Assume the role of the flamboyant Rico Rodriguez – an undercover CIA operative specializing in regime change - as he tries to overthrow the corrupt government of San Esperito. This rogue South American island is suspected of stockpiling WMDs and it’s your job to negate the threat to worldAssume the role of the flamboyant Rico Rodriguez – an undercover CIA operative specializing in regime change - as he tries to overthrow the corrupt government of San Esperito. This rogue South American island is suspected of stockpiling WMDs and it’s your job to negate the threat to world peace. It could be to your advantage that this tropical paradise is about to implode as various factions vie for power – it just needs a gentle nudge in the right direction. Just Cause offers the freedom to tackle your assignment however you want: play the island’s factions off against one another; incite a rebellion among the masses; or build alliances with rebel forces and drug cartels. The game world consists of 1,225 sq. miles of mountains, jungles, beaches, cities and villages which can be explored by land, sea and air. And you will have at your disposal a varied and exciting array of vehicles, planes and watercraft. [Eidos Interactive]… Expand"}, {"name": "Nelke & the Legendary Alchemists: Ateliers of the New World", "details_link": "https://www.metacritic.com/game/playstation-4/nelke-the-legendary-alchemists-ateliers-of-the-new-world", "publisher": "Koei Tecmo Games", "release_date": "Mar 26 2019", "developers": ["Gust"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 67, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/de570b2cac2f5dfd4b0474cf06ce4c7c-98.jpg", "descriptions": "As players work hard to build Westwald up from a quaint village to a flourishing city, they will require the aid of the many alchemists that settle in the town. Features famous alchemists from previous entries across the Atelier series, including those from the Salburg, Arland, Dusk, andAs players work hard to build Westwald up from a quaint village to a flourishing city, they will require the aid of the many alchemists that settle in the town. Features famous alchemists from previous entries across the Atelier series, including those from the Salburg, Arland, Dusk, and Mysterious trilogies. Celebrates the series' 20th anniversary; allowing players to experience the beloved series' characters with an exciting new town-building focus.\r… Expand"}, {"name": "Tesla Force", "details_link": "https://www.metacritic.com/game/playstation-5/tesla-force", "publisher": "10tons", "release_date": "Nov 24 2020", "developers": ["10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/ea8964a3fcc1a09dfe928a5fe651c44e-98.jpg", "descriptions": "With science as your superpower, team up with Tesla, Curie, Lovecraft, and Shelley to save the world from an invasion of cosmic horrors. Tesla Force is an intense, procedurally generated, rogue-lite top-down shooter packed with non-stop mayhem and over-the-top power tripping. When the cosmicWith science as your superpower, team up with Tesla, Curie, Lovecraft, and Shelley to save the world from an invasion of cosmic horrors. Tesla Force is an intense, procedurally generated, rogue-lite top-down shooter packed with non-stop mayhem and over-the-top power tripping. When the cosmic horrors awake, it's time to call up the Tesla Force to defend mankind against an assault from the outer reaches of reality!… Expand"}, {"name": "Katana Kami: A Way of the Samurai Story", "details_link": "https://www.metacritic.com/game/playstation-4/katana-kami-a-way-of-the-samurai-story", "publisher": "Spike Chunsoft", "release_date": "Feb 20 2020", "developers": ["Acquire"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "2 ", "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Linear"], "meta_score": 67, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/b4f3d6368a948604bf9da80ff852d711-98.jpg", "descriptions": "The Way of the Samurai is forged in battle! Play as a ronin during Japan’s Meiji Restoration. The swordsmith Dojima falls into debt and his beautiful daughter is taken as collateral. Help repay the debt by crafting swords by day and exploring the mysterious, twisting dungeons of theThe Way of the Samurai is forged in battle! Play as a ronin during Japan’s Meiji Restoration. The swordsmith Dojima falls into debt and his beautiful daughter is taken as collateral. Help repay the debt by crafting swords by day and exploring the mysterious, twisting dungeons of the Ipponmatsu Cave for valuable materials at night.… Expand"}, {"name": "How to Survive 2", "details_link": "https://www.metacritic.com/game/playstation-4/how-to-survive-2", "publisher": "505 Games", "release_date": "Feb  6 2017", "developers": ["505 Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Survival"], "meta_score": 67, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/cc43080f3d68ca121c282fd29c07f913-98.jpg", "descriptions": "The zombie infection has turned into a worldwide pandemic. You find yourself in Louisiana and your survival chance starts by building a safe camp and becoming a skilled survivalist. Find water, food, and shelter — and talk to the unconventional locals to make your way around. [Playstation.com]"}, {"name": "White Night", "details_link": "https://www.metacritic.com/game/playstation-4/white-night", "publisher": "Activision", "release_date": "Mar  3 2015", "developers": ["OSome Studio"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Survival"], "meta_score": 67, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/e41f273aa14297a9ee6010847794560f-98.jpg", "descriptions": "Explore the macabre past of an aging mansion in the 1930's and solve puzzles of light and shadows in this fully black & white survival horror. Players are trapped in this nightmare where darkness is a persistent threat."}, {"name": "Monster Truck Championship", "details_link": "https://www.metacritic.com/game/playstation-4/monster-truck-championship", "publisher": "Bigben Interactive", "release_date": "Oct 20 2020", "developers": ["Teyon"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Simulation", "Vehicle", "Civilian"], "meta_score": 67, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/9/3931440158bc2006cb0919e385499626-98.jpg", "descriptions": "From Las Vegas to Orlando, go head-to-head against experienced drivers in drag races and freestyle competitions. But, before you can pull off donuts, wheelies, and bicycles, you must first tune your truck to perfection. These machines are spectacular and impressive, yet highly technical toFrom Las Vegas to Orlando, go head-to-head against experienced drivers in drag races and freestyle competitions. But, before you can pull off donuts, wheelies, and bicycles, you must first tune your truck to perfection. These machines are spectacular and impressive, yet highly technical to drive. The game faithfully reproduces all the unique demands of mastering these powerful trucks, including independent front and rear-wheel management, mass transfer anticipation in bends, and predicting bounces after jumps. … Expand"}, {"name": "Sniper Elite V2", "details_link": "https://www.metacritic.com/game/xbox-360/sniper-elite-v2", "publisher": "505 Games", "release_date": "May  2 2012", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "General", "Shooter", "Shooter", "Third-Person", "Tactical", "Historic", "Historic"], "meta_score": 67, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/71ac79d78ddd659d880f646f040722b4-98.jpg", "descriptions": "Berlin 1945... V2 Rockets with deadly nerve gas are ready to launch. An army of German and Russian soldiers are in your path. Make every bullet count or the world goes down with you. X-RAY KILL CAM - see organs tear and burst, bones and teeth shatter, as your bullet penetrates your enemy.Berlin 1945... V2 Rockets with deadly nerve gas are ready to launch. An army of German and Russian soldiers are in your path. Make every bullet count or the world goes down with you. X-RAY KILL CAM - see organs tear and burst, bones and teeth shatter, as your bullet penetrates your enemy. ADVANCED SNIPER SIMULATION: Allow for gravity, wind, distance, breathing and more. SNIPER'S CHOICE: leave yourself exposed with an easy shot, or opt for a more difficult but stealthier approach. CO-OP MULTIPLAYER: battle through 4 war-torn online modes.… Expand"}, {"name": "We Happy Few", "details_link": "https://www.metacritic.com/game/playstation-4/we-happy-few", "publisher": "Gearbox Publishing", "release_date": "Aug 10 2018", "developers": ["Compulsion Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 67, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/1/b78fdefa17560e13c67d4dc6a3cd6df2-98.jpg", "descriptions": "We Happy Few is the tale of a plucky bunch of moderately terrible people trying to escape from a lifetime of cheerful denial in the city of Wellington Wells. Set in a drug-fuelled, retrofuturistic city in an alternative 1960s England, youll have to blend in with its other inhabitants, whoWe Happy Few is the tale of a plucky bunch of moderately terrible people trying to escape from a lifetime of cheerful denial in the city of Wellington Wells. Set in a drug-fuelled, retrofuturistic city in an alternative 1960s England, youll have to blend in with its other inhabitants, who dont take kindly to people who dont abide by their not-so-normal rules.\r ***1960s Dystopian England***\rSet in a retrofuturistic 1960s, you will find a city ravaged by war and rebuilt by delusionally happy people. Everything appears to be happy in Wellington Wells, including the roads, the people, and its omnipresent television personality, Uncle Jack! However, its a beautiful world on the brink of collapse. You will discover the history of this world, and how it came to be just so beguilingly happy.\r ***Suspicion and Joy***\rWe Happy Few is about surviving in and escaping from a procedurally generated world, where you must learn to hide in plain sight. If you act out of turn, or youre not on Joy (the local happy pills), the locals will become suspicious and will rapidly turn your frown upside down! Forcefully. You will need to practice conformity, stealth and combat if you want to survive long enough to escape.\r ***A Mature Story***\rWe Happy Fews characters are not typical video game heroes. They are flawed and not particularly heroic, warped by the trauma their world has been through. Each character has their own storyline that reacts to the events of the world around them, and their place within it. Our stories are definitely not appropriate for children, but are laced with dark humour, hope, and even a spot of redemption.\r ***Features***\rIn We Happy Few, you will experience:\r- A procedurally generated world, meaning that everyones experience will be unique,\r- A range of difficulties for new and experienced players alike, \r- Permadeath, if you want to satisfy all your masochistic needs,\r- Three modes: sandbox, story and Wellie mode,\r- A unique soundtrack, and\r- A fully voiced, cinematic, first person story.\r And you can play it in your own style:\r- Fill your basic needs (hunger, thirst, and sleep) to survive,\r- Learn how to interact with the other members of your society, and choose stealth, conformity or combat,\r- Encounter dozens of in-game unique events,\r- Conform to the specific local habits by learning to behave accordingly, and taking your Joy,\r- Collect recipes, scavenge items and craft dozens of weapons, tools and devices,\rfight with your bare hands or the crazy weapons you create,\rwatch out for traps, or learn how to use them to your advantage.… Expand"}, {"name": "The Spectrum Retreat", "details_link": "https://www.metacritic.com/game/playstation-4/the-spectrum-retreat", "publisher": "Ripstone", "release_date": "Jul 10 2018", "developers": ["Dan Smith Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 67, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/1/55df7756764bfdd6749aedba27ae9e11-98.jpg", "descriptions": "Check-in to The Spectrum Retreat for a stay you won’t forget. Manipulate your way to the truth in this narrative-driven puzzler."}, {"name": "Disney Castle of Illusion starring Mickey Mouse", "details_link": "https://www.metacritic.com/game/xbox-360/disney-castle-of-illusion-starring-mickey-mouse", "publisher": "Sega", "release_date": "Sep  4 2013", "developers": ["Sega"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/144da3b8d28c3f4b331a4d2cf8acafec-98.jpg", "descriptions": "Mickey Mouse returns to star in Castle of Illusion, a reimagining of the Sega Genesis classic. With all-new HD graphics and gameplay, Castle of Illusion brings Mickey and his world to life in this magical Disney adventure. When the evil witch Mizrabel kidnaps Minnie, it’s up to Mickey toMickey Mouse returns to star in Castle of Illusion, a reimagining of the Sega Genesis classic. With all-new HD graphics and gameplay, Castle of Illusion brings Mickey and his world to life in this magical Disney adventure. When the evil witch Mizrabel kidnaps Minnie, it’s up to Mickey to face the dangers of the Castle of Illusion to rescue Minnie. Build your courage and traverse enchanted forests, challenge on hordes of rebellious toys and navigate mazes of living books. Play as Mickey and save Minnie from Mizrabel’s evil clutches.… Expand"}, {"name": "World Championship Poker 2: Featuring Howard Lederer", "details_link": "https://www.metacritic.com/game/playstation-2/world-championship-poker-2-featuring-howard-lederer", "publisher": "Crave", "release_date": "Nov  8 2005", "developers": ["Point of View"], "platforms": ["PC", "PlayStation 2"], "num_players": "8  Online", "genres": ["Miscellaneous", "Parlor", "Gambling"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/84c20b3954e26ea5afdd0e3d3f118740-98.jpg", "descriptions": "WCP 2 features Howard Lederer, Greg Raymer, Clonie Gowen, Amir Vahidi, Paul Darden, Robert Williamson III, Matt Savage, and Annie Duke.  World Championship Poker 2 features a much more detailed one player game, where you now have to work your way up the ranks, starting in your mom'sWCP 2 features Howard Lederer, Greg Raymer, Clonie Gowen, Amir Vahidi, Paul Darden, Robert Williamson III, Matt Savage, and Annie Duke.  World Championship Poker 2 features a much more detailed one player game, where you now have to work your way up the ranks, starting in your mom's basement. Once you start winning and accumulating money, you can spend your winnings on increasingly better pads, and furnishings. Hit a losing streak, and you may have to hock your stuff to stay in the game. 14 types of poker are featured, including Texas Hold'em, Five Card Draw, Seven Card Stud and Pineapple. [Crave]… Expand"}, {"name": "Rise of the Triad", "details_link": "https://www.metacritic.com/game/pc/rise-of-the-triad", "publisher": "Apogee Games", "release_date": "Jul 31 2013", "developers": ["Interceptor"], "platforms": "PC", "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 67, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/efb5103dc84724f56e3bb7c34e4d9a5c-98.jpg", "descriptions": "The 1994 shooter returns with a full Unreal Engine 3 remake featuring a classic arsenal and online modes."}, {"name": "Hextech Mayhem: A League of Legends Story", "details_link": "https://www.metacritic.com/game/switch/hextech-mayhem-a-league-of-legends-story", "publisher": "Riot Games", "release_date": "Nov 16 2021", "developers": ["Choice Provisions"], "platforms": ["PC", "Switch"], "genres": ["Action", "Platformer", "2D"], "meta_score": 67, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/0a0471fdbd6ff556412684753ceabd37-98.jpg", "descriptions": "Bomb to the beat, groove to the mayhem. In this fast-paced rhythm runner, every action has an explosive reaction and no amount of mayhem is too much. Take on the role of yordle and Hexplosives expert Ziggs as you rampage through the neighborhoods of Piltover. Bomb, bounce, and bop to theBomb to the beat, groove to the mayhem. In this fast-paced rhythm runner, every action has an explosive reaction and no amount of mayhem is too much. Take on the role of yordle and Hexplosives expert Ziggs as you rampage through the neighborhoods of Piltover. Bomb, bounce, and bop to the beat of the music to avoid obstacles, disarm enemies, and light fuses to achieve maximum chaos. Cause musical mayhem while outrunning no-fun-allowed Heimerdinger in your quest to build the greatest bomb the world has ever seen!\r Use the Freestyle Mayhem System to create spontaneous blasts and grab bonus points… all while dodging the fun police and showing them what they’re really missing.\r Leave no fuse unlit in Hextech Mayhem: A League of Legends Story.\r… Expand"}]