[{"name": "Meg's Monster", "details_link": "https://www.metacritic.com/game/switch/megs-monster", "publisher": "Odencat Inc.", "release_date": "Mar  2 2023", "developers": ["Odencat Inc."], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 79, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/5f8aff6cefb136cb21f6ab086d132658-98.jpg", "descriptions": "Welcome to the Underworld - a land of monsters and mutants who eat humans for breakfast.One such monster - a hulking ogre by the name of Roy - has no interest in eating humans. But one day, he and his best friend Golan stumble upon a lost little girl named Meg, and discover something trulyWelcome to the Underworld - a land of monsters and mutants who eat humans for breakfast.One such monster - a hulking ogre by the name of Roy - has no interest in eating humans. But one day, he and his best friend Golan stumble upon a lost little girl named Meg, and discover something truly terrifying: the moment she starts wailing in fear, a blood-red hue washes over the sky, and the earth itself begins to tremble and quake.That's right: this small girl's tears hold the power to bring forth the apocalypse - and the only way to stop it is for them to help find her mother so she can make it safely back home.Meg's Monster is a short, story-driven JRPG with a big twist. Players control Roy, who begins the game with 99,999 HP and is virtually untouchable - but the real concern is keeping Meg safe, because if she starts crying, it's game over for everyone. Players will have to master the unique mechanics and mini-games baked into each battle, all while protecting Meg and using her favorite toys to keep her pacified.… Expand"}, {"name": "Life is Strange: True Colors - Wavelengths", "details_link": "https://www.metacritic.com/game/playstation-5/life-is-strange-true-colors---wavelengths", "publisher": "Square Enix", "release_date": "Sep 30 2021", "developers": ["Deck Nine Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Action Adventure", "General"], "meta_score": 79, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/f82539ffd4825d53d5281dce38c930a5-98.jpg", "descriptions": "Play as Steph Gingrich in the year before Alex came to Haven Springs, in an exclusive standalone story set in the iconic Rocky Mountain Record Traders store and KRCT radio station. Spin records, host a radio show, and face your future."}, {"name": "Mad Rat Dead", "details_link": "https://www.metacritic.com/game/switch/mad-rat-dead", "publisher": "NIS America", "release_date": "Oct 30 2020", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 79, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/ac8d14491f8391bf018aea3d4a6c6e67-98.jpg", "descriptions": "Funky tunes: advance by matching your inputs to the rhythm of addictive music tracks. Or Practice your inputs as you get acquainted with stages in the sound test.\rMastering the music: unlock music to Mix and match with Replay able stages for different difficulties. Hit the rewind button forFunky tunes: advance by matching your inputs to the rhythm of addictive music tracks. Or Practice your inputs as you get acquainted with stages in the sound test.\rMastering the music: unlock music to Mix and match with Replay able stages for different difficulties. Hit the rewind button for Infinite attempts and jump, Dash, and smash your way to the highest score. Audiovisual art: Cartoon visuals Mix with a Punk Aesthetic for a unique art style that changes depending on the number of combos performed.\r… Expand"}, {"name": "Bleed 2", "details_link": "https://www.metacritic.com/game/switch/bleed-2", "publisher": "Digerati Distribution", "release_date": "Mar  8 2018", "developers": ["BootdiskRevolution"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 79, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/20edacc37da22c05017d19467eeeb5a2-98.jpg", "descriptions": "Bleed 2 is a relentless arcade action game featuring air-dodging, bullet-reflecting, and tons of bosses."}, {"name": "ECHO", "details_link": "https://www.metacritic.com/game/playstation-4/echo", "publisher": "Ultra Ultra", "release_date": "Oct 10 2017", "developers": ["Ultra Ultra"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 79, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/a384f63643cd4e6cd6918d348ae3d966-98.jpg", "descriptions": "After a century in stasis the girl En arrives at her destination: a palace out of legend, a marvel of the old civilization eons gone, still awaiting its first human occupants. Out here, using forgotten technologies, she hopes to bring back a life that shouldn’t have been lost."}, {"name": "Hitman - Episode 2: Sapienza", "details_link": "https://www.metacritic.com/game/xbox-one/hitman---episode-2-sapienza", "publisher": "Square Enix", "release_date": "Apr 26 2016", "developers": ["Io Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "General"], "meta_score": 79, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/6e06aa4d47c3c065fdfc25273afa318d-98.jpg", "descriptions": "The 2nd installment of HITMAN finds Agent 47 traveling to the beautiful, sun-drenched coastal town of Sapienza, Italy. This episode adds a new story mission, new challenges, new weapons and gear, the Italian suit and of course new targets, opportunities and disguises."}, {"name": "SMITE", "details_link": "https://www.metacritic.com/game/playstation-4/smite", "publisher": "Hi-Rez Studios", "release_date": "Mar 24 2016", "developers": ["Hi-Rez Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Strategy", "Real-Time", "MOBA"], "meta_score": 79, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/f8b7f42037b9c2301091f59054dfdc9c-98.jpg", "descriptions": "Players choose from a selection of mythical gods, join session-based arena combat, and use custom powers and team tactics against other player-controlled gods and non-player controlled minions."}, {"name": "Wolfenstein: The New Order", "details_link": "https://www.metacritic.com/game/xbox-one/wolfenstein-the-new-order", "publisher": "Bethesda Softworks", "release_date": "May 20 2014", "developers": ["MachineGames"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["General", "Shooter", "Historic", "Action", "Shooter", "First-Person", "Historic", "Arcade"], "meta_score": 79, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/e6b668e25bda2f0059dd521821f2285c-98.jpg", "descriptions": "1946: Europe. World War II rages on across Europe. Where the Allies once pressed advantage, the Nazi forces have turned the tide in dramatic fashion behind the technologically advanced war machine of General Wilhelm Strasse, aka Deathshead. When a final Allied assault on Deathshead's1946: Europe. World War II rages on across Europe. Where the Allies once pressed advantage, the Nazi forces have turned the tide in dramatic fashion behind the technologically advanced war machine of General Wilhelm Strasse, aka Deathshead. When a final Allied assault on Deathshead's compound fails, the Allies’ greatest hope falls with it. 1960: Europe. The war is over. And the Nazis are triumphant victors. Using unrelenting force and brutal intimidation, the Nazis have brought even the most powerful nations to their knees. The Nazi regime now rules the globe with an iron fist. You are Captain B.J. Blazkowicz, the American War Hero. After delving into this world of darkness, you must launch an impossible counter-offensive against the monstrous Nazi regime. Only you dare stand up against an unstoppable army of Nazi robots and hulking Super Soldiers. Only you can stop Deathshead. Only you can rewrite history.… Expand"}, {"name": "RAGE", "details_link": "https://www.metacritic.com/game/pc/rage", "publisher": "Bethesda Softworks", "release_date": "Oct  3 2011", "developers": ["id Software"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 79, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/6/b297359cebbf06194d328add4d3245fe-98.jpg", "descriptions": "An action game set in a post-apocalyptic landscape jam-packed with driving and shooting, created by John Carmack and the rest of the Doom crew."}, {"name": "Call of Duty: Black Ops - Escalation", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-black-ops---escalation", "publisher": "Activision", "release_date": "May  3 2011", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Tactical", "Historic", "Arcade"], "meta_score": 79, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/0a5107b3435525c0e5d84ecb69af0e1e-98.jpg", "descriptions": "5 all-new maps; featuring 4 Multiplayer maps and an epic Zombies experience with all-new playable characters. In Multiplayer, battle it out in Hotel, on the roof of a Cuban luxury hotel and casino against the vivid backdrop of old Havana;"}, {"name": "The Misadventures of P.B. Winterbottom", "details_link": "https://www.metacritic.com/game/pc/the-misadventures-of-pb-winterbottom", "publisher": "2K Games", "release_date": "Apr 20 2010", "developers": ["The Odd Gentlemen"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/5fd8276b19c1cc3bc8f31548ea0a7a0b-98.jpg", "descriptions": "(Downloadable Game)  Create your own paradox... for the love of pie. Enter a macabre and comical silent world filled with mischief, time travel and delicious pie in The Misadventures of P. B. Winterbottom. Record yourself and harness your time-bending abilities to cooperate, compete against,(Downloadable Game)  Create your own paradox... for the love of pie. Enter a macabre and comical silent world filled with mischief, time travel and delicious pie in The Misadventures of P. B. Winterbottom. Record yourself and harness your time-bending abilities to cooperate, compete against, and disrupt your past, present, and future selves. Winterbottom's debut misadventures present a whimsical spin on the notions of time, space, and play. Join Winterbottom as he travels through over 75 \"movie\" levels, causing mischief and mayhem in pursuit of the mysterious and elusive Chronoberry Pie on his spectacular journey through space-time. [2K Play]… Expand"}, {"name": "UEFA EURO 2008", "details_link": "https://www.metacritic.com/game/playstation-3/uefa-euro-2008", "publisher": "Electronic Arts", "release_date": "May 19 2008", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 14 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 79, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/db3e2e90aa77f672e937ed6e7bfb028d-98.jpg", "descriptions": "UEFA EURO 2008 captures the look and feel of the journey from qualification to the finals with rain and mud dynamics that impact playing conditions, real-time player ratings that change based on player performance, and a penalty kick mode that re-creates the elation and agony of a penaltyUEFA EURO 2008 captures the look and feel of the journey from qualification to the finals with rain and mud dynamics that impact playing conditions, real-time player ratings that change based on player performance, and a penalty kick mode that re-creates the elation and agony of a penalty shoot-out as if you were on the pitch. Experience the thrill of scoring the goal that sends your country through to the next round and then choose how to celebrate it with all-new interactive user-controlled celebrations. Captain your country, play alongside your heroes, and inspire them to championship glory in the official videogame of UEFA EURO 2008. A new game mode called Captain Your Country enables gamers to customize them on the pitch and wear the shirt of their national team. Work through eight status levels to earn the captaincy of your team and then lead your country into battle for championship glory against your rivals. Go online in Battle of the Nations to earn status points for yourself and your country in a competition for global supremacy. Go for the biggest upsets to earn the most points and then watch you and your country move up the leader boards. Face the challenge and pressure of competing in the championship rounds in the EURO Online Knockout Draw to test your skills against the world's best. [Electronic Arts]… Expand"}, {"name": "Heavenly Sword", "details_link": "https://www.metacritic.com/game/playstation-3/heavenly-sword", "publisher": "SCEA", "release_date": "Sep 12 2007", "developers": ["Ninja Theory"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 79, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/5c82ed9d00616890244d4758779eccd4-98.jpg", "descriptions": "A dramatic tale of revenge sees Nariko, a fiery red-haired heroine embark on a quest for vengeance against an invading King and his army. The story builds around the ancient Heavenly Sword which once belonged to a powerful deity. It can never be wielded by a mortal without it draining theirA dramatic tale of revenge sees Nariko, a fiery red-haired heroine embark on a quest for vengeance against an invading King and his army. The story builds around the ancient Heavenly Sword which once belonged to a powerful deity. It can never be wielded by a mortal without it draining their life-force, killing them within hours. When the invading King (played by Andy Serkis) destroys the warrior clan that guards the Heavenly Sword, the clan leader's daughter, Nariko, takes up the sword in a desperate fight for survival. Nariko must now pay the ultimate price as she embarks on one last mission of vengeance against the King and his army before her life is finally drawn to a close... The Heavenly Sword itself can Transform into Three Distinct Stances – Players can switch between on the fly allowing players to create their own fighting styles. The Combat Engine can Scale Up – From sophisticated one-on-one encounters to one-on-many, where enemies employ intelligent squad-based dynamics, right up to combat against battalions pushing real-time gameplay and AI to unprecedented new levels. Physics-based Combat – Players can sweep debris against opponents, kick tables to halt an oncoming surge of fighters, smash the enemy into the scenery or throw bodies into other enemies using aftertouch controls. [SCEE]… Expand"}, {"name": "Dragon Age II", "details_link": "https://www.metacritic.com/game/xbox-360/dragon-age-ii", "publisher": "Electronic Arts", "release_date": "Mar  8 2011", "developers": ["BioWare"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "Action RPG"], "meta_score": 79, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/8/acb446189e2cc697d8409feb3c459f09-98.jpg", "descriptions": "EA announced that a new installment in the Dragon Age series will arrive in the first quarter of 2011."}, {"name": "NCAA Football 13", "details_link": "https://www.metacritic.com/game/playstation-3/ncaa-football-13", "publisher": "EA Sports", "release_date": "Jul 10 2012", "developers": ["EA Tiburon"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 79, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/0/4b9a481fb9d74ad64d7f21619af9c87f-98.jpg", "descriptions": "Take your school to victory with a former Heisman Trophy winner on your team with NCAA Football 13. With one of ten former Heismans on your roster, see if you have the confidence and poise to utilize his legendary skill set to capture the Heisman Trophy—this time for your school. ExperienceTake your school to victory with a former Heisman Trophy winner on your team with NCAA Football 13. With one of ten former Heismans on your roster, see if you have the confidence and poise to utilize his legendary skill set to capture the Heisman Trophy—this time for your school. Experience the game like never before with an all-new passing game in which players track and fight for the ball, and feel the excitement of gameday as ESPN Studio Updates bring the game to life in a dynamic football environment. Throw down the gauntlet and lead your team to glory with NCAA Football 13.… Expand"}, {"name": "Tales of Vesperia", "details_link": "https://www.metacritic.com/game/xbox-360/tales-of-vesperia", "publisher": "Namco Bandai Games America", "release_date": "Aug 26 2008", "developers": ["Bandai Namco Games"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 79, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/2911e26d2c1671bccd7ae2df0d09223a-98.jpg", "descriptions": "The debut of the Tales series on the Xbox 360, Tales of Vesperia launches the series to new heights of interactive narrative and engrossing gameplay with anime-style graphics, a captivating storyline and characters as well as an upgraded battle system. Set in a world reliant on a mysteriousThe debut of the Tales series on the Xbox 360, Tales of Vesperia launches the series to new heights of interactive narrative and engrossing gameplay with anime-style graphics, a captivating storyline and characters as well as an upgraded battle system. Set in a world reliant on a mysterious ancient technology known as \"blastia,\" the game follows former knight Yuri as he delves into a shadowy plot to use these magical devices to control civilization, or destroy it. A bold new interpretation of the elements that made the Tales series a hit with gamers around the world, Tales of Vesperia promises a standard-setting RPG experience on the Xbox 360. Using an all-new graphics engine and character designs by the renowned Kosuke Fujishima (Ah! My Goddess, Sakura Taisen), the game delivers high-quality HD character models and environments that are indistinguishable from traditional cel-based anime. The game also makes significant additions to the series' trademark real-time combat system, allowing players to do battle in massive battlefields and learn new special attacks that are tied to individual weapons. New finishing blows allow players to take down enemies in a single hit with correctly timed button combinations, while mission-based battles increase the variety of each encounter as players gain unique items by fulfilling various battle objectives. Players can also use materials collected by successfully executing finishing moves to craft rare and unique equipment for their characters. [Namco Bandai Games]… Expand"}, {"name": "Fat Princess", "details_link": "https://www.metacritic.com/game/playstation-3/fat-princess", "publisher": "SCEA", "release_date": "Jul 30 2009", "developers": ["Titan Studios"], "platforms": "PlayStation 3", "num_players": "Up to 32 ", "genres": ["Action", "Strategy", "General", "Real-Time", "General"], "meta_score": 79, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/01db35f011d60900d70e9a6092706ae8-98.jpg", "descriptions": "[Playstation Network]  Rescue your beloved princess through teamwork in this comic medieval battle royale. There's a catch, though - the other team has been feeding her magical cake, making her harder to escort back to your castle. Choose from five distinct character classes and switch at[Playstation Network]  Rescue your beloved princess through teamwork in this comic medieval battle royale. There's a catch, though - the other team has been feeding her magical cake, making her harder to escort back to your castle. Choose from five distinct character classes and switch at any time to best help your team. Charge head first into battle, heal teammates as they break through enemy lines, and upgrade your team and the castle defenses as you work with your team to save your princess. Online Multiplayer - Face off in online matches with up to 32 players and in-game voice chat. Unique and Varied Maps - Enjoy eight comical and challenging maps, plus two special arena-style single-player levels. Five Character Classes - Change between Worker, Warrior, Ranger, Mage and Priest simply by picking up a new hat. Unique Game Modes - After the seven-chapter single-player campaign, enjoy custom games of Rescue the Princess, Snatch 'n Grab, Team Deathmatch and Invasion. Customizable Avatars - Create your own personal avatar before you charge into battle, and unlock new customization options during gameplay. [SCEA]… Expand"}, {"name": "Tiger Woods PGA Tour 08", "details_link": "https://www.metacritic.com/game/playstation-3/tiger-woods-pga-tour-08", "publisher": "EA Sports", "release_date": "Aug 28 2007", "developers": ["EA Salt Lake"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 79, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/bcbac023a953f46c6674cf3495264355-98.jpg", "descriptions": "Photo Game Face is a new feature of Tiger Woods PGA Tour 08 for Playstation 3 and Xbox 360 that lets you use photos of your face to create an ultra-realistic likeness of yourself in the game. Your photo-based face can be used with any custom golfer profile you make. Customize your Photo GamePhoto Game Face is a new feature of Tiger Woods PGA Tour 08 for Playstation 3 and Xbox 360 that lets you use photos of your face to create an ultra-realistic likeness of yourself in the game. Your photo-based face can be used with any custom golfer profile you make. Customize your Photo Game Face just like any standard character using the tools in \"My Appearance\". For the first time ever, find out who truly is the world’s greatest golfer. In Tiger Woods PGA Tour 08, all of your golf game is recorded: from the first tee box in Play Now mode, to your final putt in a FedExCup tournament. Post your most amazing--and unthinkable--performances on EA SPORTS GamerNet, a revolutionary interactive gaming hub that hosts user-created content online. Set the bar high by sharing your top moments, or take on challenges set by others. Whether you’re uploading an unbeatable round or the craziest shot you’ve ever sunk, take on the golfing world with GamerNet and Tiger Woods PGA Tour 08. A Shot of ConfidenceAll-new Shot Confidence tracks your performance on every hole, round, and golf course. Based on key factors, including club selection, hole, lie, and more, dig into past performances with the Confidence Meter to identify strengths and weaknesses before every shot. The Most Golf Courses EverExperience the all-new FedExCup championship format by playing a dream round of golf at Westchester Country Club, TPC Boston, Cog Hill, and East Lake. Take On PGA And LPGA Tour ProsChallenge the greatest PGA Tour pros, including Tiger Woods, John Daly, and Vijay Singh, plus LPGA Tour pros such as Annika Sorenstam, Natalie Gulbis, Christie Kerr, and Morgan Pressel. [Electronic Arts]… Expand"}, {"name": "Uru: Ages Beyond Myst", "details_link": "https://www.metacritic.com/game/pc/uru-ages-beyond-myst", "publisher": "Ubisoft", "release_date": "Nov 11 2003", "developers": ["Cyan Worlds"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Fantasy", "Fantasy"], "meta_score": 79, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/9e037e4c3d4aab4eeaea4daa9d7689de-98.jpg", "descriptions": "From Cyan Worlds, the makers of Myst® and Riven?, Uru?: Ages Beyond Myst is the next chapter of the Myst franchise and the most immersive and ambitious Myst experience ever created. The single-player game will be bigger, better, and more innovative than any of the previous Myst adventures.From Cyan Worlds, the makers of Myst® and Riven?, Uru?: Ages Beyond Myst is the next chapter of the Myst franchise and the most immersive and ambitious Myst experience ever created. The single-player game will be bigger, better, and more innovative than any of the previous Myst adventures. Players can move at their own pace, spending hours discovering visually stunning, real-time 3D worlds, solving a large variety of mind-challenging puzzles, and following an epic storyline. Players can continue to discover new areas of D'ni by connecting to Uru Live, the online service of Uru. There, players will be part of an ever-expanding world that brings more areas to explore and more mysteries to solve. [Ubi Soft]… Expand"}, {"name": "Resident Evil 3", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-3", "publisher": "Capcom", "release_date": "Apr  3 2020", "developers": ["Capcom", "M-Two"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 5 ", "genres": ["Action Adventure", "Survival"], "meta_score": 79, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/72764928de50fee04f05ac490153dc0e-98.jpg", "descriptions": "Fight your way to freedom from the brink of despair. A series of strange disappearances have been occurring in the American Midwest within a place called Racoon City. A specialist squad of the police force known as S.T.A.R.S. has been investigating the case, and have determined that theFight your way to freedom from the brink of despair. A series of strange disappearances have been occurring in the American Midwest within a place called Racoon City. A specialist squad of the police force known as S.T.A.R.S. has been investigating the case, and have determined that the pharmaceutical company Umbrella and their biological weapon, the T-Virus, are behind the incidents though they've lost several members in the process. Jill Valentine and the other surviving S.T.A.R.S. members try to make this truth known, but find that the police department itself is under Umbrella's sway and their reports are rejected out of hand.\r However, soon reports of a grisly \"cannibal virus\" begin to surface, and vicious dogs begin roaming the streets. With the viral plague spreading through the town and to her very doorstep, Jill is determined to survive.\rHowever, unbeknownst to Jill, an extremely powerful pursuer has already been dispatched to eliminate her.… Expand"}, {"name": "Pillars of Eternity: The White March - Part 2", "details_link": "https://www.metacritic.com/game/pc/pillars-of-eternity-the-white-march---part-2", "publisher": "Paradox Interactive", "release_date": "Feb 16 2016", "developers": ["Obsidian Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 79, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/7a039cfd388df7dc314466e80629fe26-98.jpg", "descriptions": "The White March – Part 2 not only adds new content to the Pillars of Eternity universe, but also allows players to experience the conclusion of the stories told in The White March – Part 1, bringing the first epic chapter of Pillars of Eternity to a close. Players will find a variety of newThe White March – Part 2 not only adds new content to the Pillars of Eternity universe, but also allows players to experience the conclusion of the stories told in The White March – Part 1, bringing the first epic chapter of Pillars of Eternity to a close. Players will find a variety of new challenges waiting for them in the snowy borderlands of the Eastern Reach, along with new quests, new abilities and a raised level cap, and a new companion: Meneha, the Barbarian. [Obsidian]… Expand"}, {"name": "Greed Corp", "details_link": "https://www.metacritic.com/game/xbox-360/greed-corp", "publisher": "W!Games", "release_date": "Feb 24 2010", "developers": ["W!Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Strategy", "Turn-Based", "Modern", "General", "Modern"], "meta_score": 79, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/01e84bfa402b40a84a8494664d99df5b-98.jpg", "descriptions": "[Xbox Live Arcade]   Why share when you can have it all? Greed Corp is an online multiplayer strategy game in which you battle for dominance over a world once rich in resources. In order to prevail, exhaust all the remaining resources to build an army, and then use the depleted collapsing[Xbox Live Arcade]   Why share when you can have it all? Greed Corp is an online multiplayer strategy game in which you battle for dominance over a world once rich in resources. In order to prevail, exhaust all the remaining resources to build an army, and then use the depleted collapsing terrain to your advantage. An extensive campaign mode and multiple unlockables prepare you to take the battle online. Will you defend your territory or sacrifice it to keep it out of enemy hands? Manage the finite available resources to build your army and use the unique collapsing terrain mechanic to your advantage, all while the mist grows closer. [Valcon Games]… Expand"}, {"name": "Eldest Souls", "details_link": "https://www.metacritic.com/game/playstation-5/eldest-souls", "publisher": "United Label", "release_date": "Jul 29 2021", "developers": ["Fallen Flag Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Role-Playing", "Action RPG"], "meta_score": 79, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/21673a496129feb767ed0b62a5085810-98.jpg", "descriptions": "Eldest Souls is a challenging, pixel-art boss-rush game. The Old Gods have long been imprisoned. Humanity has prospered. Great Kingdoms have arisen from the now forsaken temples of worship. But no longer… In their final act of vengeance, the Old Gods have unleashed a great Desolation uponEldest Souls is a challenging, pixel-art boss-rush game. The Old Gods have long been imprisoned. Humanity has prospered. Great Kingdoms have arisen from the now forsaken temples of worship. But no longer… In their final act of vengeance, the Old Gods have unleashed a great Desolation upon the world. Farmlands have turned to deserts, rivers to dust. The Great Crusade sent to slay the imprisoned Gods once and for all, has all but perished, and the human Kingdoms are in disarray. A lone Crusader approaches the Citadel, ancient prison of the Gods. His objective is simple: slay them all.… Expand"}, {"name": "Nioh 2: Darkness in the Capital", "details_link": "https://www.metacritic.com/game/playstation-4/nioh-2-darkness-in-the-capital", "publisher": "Koei Tecmo Games", "release_date": "Oct 15 2020", "developers": ["Team Ninja"], "platforms": "PlayStation 4", "num_players": "Up to 3 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 79, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/1/dc1f4f7ff451ad50289b4507c9f23880-98.jpg", "descriptions": "Darkness in the Capital features new storylines, overwhelmingly powerful new bosses, tricky new Yokai, new Guardian Spirits, skills, Ninjutsu, Onmyo Magic and Soul Cores. And to top it all off, this new chapter will present electrifying new armor sets and a weapon that fans of hand-to-handDarkness in the Capital features new storylines, overwhelmingly powerful new bosses, tricky new Yokai, new Guardian Spirits, skills, Ninjutsu, Onmyo Magic and Soul Cores. And to top it all off, this new chapter will present electrifying new armor sets and a weapon that fans of hand-to-hand combat will surely relish. [Team Ninja]… Expand"}, {"name": "WWE SmackDown vs. Raw 2009", "details_link": "https://www.metacritic.com/game/wii/wwe-smackdown-vs-raw-2009", "publisher": "THQ", "release_date": "Nov  9 2008", "developers": ["Yuke's"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "Up to 4 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 79, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/89f835530debde1dc7be45fa859de94d-98.jpg", "descriptions": "WWE SmackDown vs. Raw 2009 for Wii builds upon its inaugural offering by significantly expanding its match type options, giving players more ways to enjoy the platform's unique pick-up-and-play experience. The game also takes full combat sports entertainment to the next level by givingWWE SmackDown vs. Raw 2009 for Wii builds upon its inaugural offering by significantly expanding its match type options, giving players more ways to enjoy the platform's unique pick-up-and-play experience. The game also takes full combat sports entertainment to the next level by giving players more Superstar control with interactive entrances and victory scenes. WWE SmackDown vs. Raw 2009 for Wii also includes a wide variety of new weapons, the debut of online gameplay and much more. [THQ]… Expand"}, {"name": "Little Inferno", "details_link": "https://www.metacritic.com/game/wii-u/little-inferno", "publisher": "Tomorrow Corporation", "release_date": "Nov 18 2012", "developers": ["Tomorrow Corporation"], "platforms": ["iPhone/iPad", "PC", "Switch", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Action"], "meta_score": 79, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/40bd7244409ac7c4907cd1a3991e3824-98.jpg", "descriptions": "Little Inferno is an adventure that takes place almost entirely in front of a fireplace that's about looking up up up out of the chimney, and the cold world just on the other side of the wall."}, {"name": "Guild Wars: Eye of the North", "details_link": "https://www.metacritic.com/game/pc/guild-wars-eye-of-the-north", "publisher": "NCSOFT", "release_date": "Aug 28 2007", "developers": ["ArenaNet"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Miscellaneous", "General", "General", "Compilation", "Massively Multiplayer"], "meta_score": 79, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/9b7cdb6d265f0c351861f0d398ddcbe4-98.jpg", "descriptions": "Guild Wars players can embark on a journey that will take their existing characters into the treacherous reaches north of the Shiverpeak Mountains. There, they must stand side-by-side with both friends and enemies from the past, recruit new allies and heroes, and delve deep into perilousGuild Wars players can embark on a journey that will take their existing characters into the treacherous reaches north of the Shiverpeak Mountains. There, they must stand side-by-side with both friends and enemies from the past, recruit new allies and heroes, and delve deep into perilous dungeons to face an ancient evil. The fate of the world hangs in the balance. One thing is certain; at the end of this battle, nothing will remain the same. In Guild Wars: Eye of the North, players encounter two new races: the enigmatic Asura, masters of magic who were driven from the depths by a great danger, and the fiercely independent Norn, who are more interested in contests of personal prowess than the troubles of the world around them. And as the Deldrimor Dwarves fight a desperate battle against a new evil welling up out of the earth, players once again come face-to-face with humanity's most-hated enemy—the Charr. Guild Wars: Eye of the North introduces another exciting feature to the Guild Wars legacy—multi-level dungeons. As the story of this expansion unfolds, players delve into eighteen vast dungeons to face untold enemies, search for clues about the menace facing the world, and uncover new weapons they can use in the final confrontation. These immersive, multi-level dungeons take characters deep beneath the earth and expose them to challenges the likes of which have never been seen in any Guild Wars game to date. [NCsoft]… Expand"}, {"name": "Outlast 2", "details_link": "https://www.metacritic.com/game/switch/outlast-2", "publisher": "Red Barrels", "release_date": "Mar 27 2018", "developers": ["Red Barrels"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 79, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/8e338b1225947d1733cad5e0b6d703cf-98.jpg", "descriptions": "Outlast 2 is the sequel to the acclaimed survival horror game Outlast. Set in the same universe as the first game, but with different characters and a different setting, Outlast 2 is a twisted new journey into the depths of the human mind and its dark secrets.\r No conflict is ever blackOutlast 2 is the sequel to the acclaimed survival horror game Outlast. Set in the same universe as the first game, but with different characters and a different setting, Outlast 2 is a twisted new journey into the depths of the human mind and its dark secrets.\r No conflict is ever black and white. But once the dust has settled, the victors get to decide who was right and who was wrong. Who is good and who is evil. Human nature pushes us to extremes of violence and depravity, which we then justify by divine inspiration and a promise of paradise to come. Horror rises from desperation and blind faith. OUTLAST 2 will test your faith, pushing players to a place where going mad is the only sane thing to do.… Expand"}, {"name": "Summon Night: Swordcraft Story 2", "details_link": "https://www.metacritic.com/game/game-boy-advance/summon-night-swordcraft-story-2", "publisher": "Atlus Co.", "release_date": "Oct 17 2006", "developers": ["Flight-Plan"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 79, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/7a53034d0a51a394cab113303ee8f728-98.jpg", "descriptions": "Banpresto's sequel to the series continues to take place in the world of Linbalm, a fantasy-themed world."}, {"name": "Driveclub Bikes", "details_link": "https://www.metacritic.com/game/playstation-4/driveclub-bikes", "publisher": "SCEE", "release_date": "Oct 27 2015", "developers": ["Evolution Studios"], "platforms": "PlayStation 4", "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 79, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/53b2912a8d4b7b2a7445956594e3fa7c-98.jpg", "descriptions": "Create events from scratch to ride day or night, and play with the fully customizable weather conditions to make every event unique. Race the worlds best superbikes from Yamaha, Ducati, Kawasaki, Honda, Bimota, BMW and more. 78 tracks in locations from Canada, Chile, Japan, Norway, ScotlandCreate events from scratch to ride day or night, and play with the fully customizable weather conditions to make every event unique. Race the worlds best superbikes from Yamaha, Ducati, Kawasaki, Honda, Bimota, BMW and more. 78 tracks in locations from Canada, Chile, Japan, Norway, Scotland & India. Form a Club with your mates and race online in challenges & multiplayer matches to earn big rewards. Go it alone in the offline Tour campaign with 42 events including Races, Time Trials, Skill challenges & Championship events. Send challenges to your friends & rivals to compete for glory. Customize your bikes & racing leathers. Choose from simulation or arcade camera views: first person rider, handlebar, dash, front wheel, near chase & far chase… Expand"}, {"name": "Cult of the Lamb", "details_link": "https://www.metacritic.com/game/switch/cult-of-the-lamb", "publisher": "Devolver Digital", "release_date": "Aug 11 2022", "developers": ["Massive Monster"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 79, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/2/d3fda70944c94bfc0b582e5055b208a6-98.jpg", "descriptions": "Start your own cult in a land of false prophets, venturing out into diverse and mysterious regions to build a loyal community of woodland worshippers and spread your Word to become the one true cult. BUILD YOUR FLOCK. Collect and use resources to build new structures, perform dark rituals toStart your own cult in a land of false prophets, venturing out into diverse and mysterious regions to build a loyal community of woodland worshippers and spread your Word to become the one true cult. BUILD YOUR FLOCK. Collect and use resources to build new structures, perform dark rituals to appease the gods, and give sermons to reinforce the faith of your flock. DESTROY THE NON-BELIEVERS. Explore a sprawling, randomly generated world, fight off hordes of enemies and defeat rival cult leaders in order to absorb their power and assert your cult's dominance. SPREAD YOUR WORD. Train your flock and embark on a quest to explore and discover the secrets of five mysterious regions. Cleanse the non-believers, spread enlightenment and perform mystical rituals on the journey to become the mighty lamb god.… Expand"}, {"name": "Anomaly: Warzone Earth", "details_link": "https://www.metacritic.com/game/xbox-360/anomaly-warzone-earth", "publisher": "11 bit studios", "release_date": "Apr  6 2012", "developers": ["11 bit studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Strategy", "Real-Time", "General", "Sci-Fi", "General"], "meta_score": 79, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/06bcf5fd8200bc5465a80213445d8f1a-98.jpg", "descriptions": "Blending fast-paced, explosive action with tactical battlefield command, Anomaly puts players in charge of a military convoy tasked with fighting back against the mysterious alien war machines that have begun to spring up in many of the world's largest cities. Players take part in battlesBlending fast-paced, explosive action with tactical battlefield command, Anomaly puts players in charge of a military convoy tasked with fighting back against the mysterious alien war machines that have begun to spring up in many of the world's largest cities. Players take part in battles personally to support and assist a hand-picked armor squad, utilizing their top-down tactical view to plot each and every turn of the convoy. As they progress through the story campaign and challenge modes, players will unlock upgrades and new units to build their ultimate destruction squad.… Expand"}, {"name": "DOOM", "details_link": "https://www.metacritic.com/game/switch/doom", "publisher": "Bethesda Softworks", "release_date": "Nov 10 2017", "developers": ["id Software", "Panic Button"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 79, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/82ffbcc8b6d8697ad50bee86e00ff6ca-98.jpg", "descriptions": "Developed by id Software, DOOM returns as a challenging modern-day shooter experience. Relentless demons, impossibly destructive guns, and fast, fluid movement provide the foundation for intense, first-person combat – whether you’re obliterating demon hordes through the depths of Hell in theDeveloped by id Software, DOOM returns as a challenging modern-day shooter experience. Relentless demons, impossibly destructive guns, and fast, fluid movement provide the foundation for intense, first-person combat – whether you’re obliterating demon hordes through the depths of Hell in the single-player campaign, or competing against your friends in numerous multiplayer modes. There is no taking cover or stopping to regenerate health as you beat back Hell’s raging demon hordes. Combine your arsenal of futuristic and iconic guns, upgrades, movement and an advanced melee system to knock-down, slash, stomp, crush, and blow apart demons in creative and violent ways. [Nintendo]… Expand"}, {"name": "DIRT 5", "details_link": "https://www.metacritic.com/game/playstation-4/dirt-5", "publisher": "Codemasters", "release_date": "Nov  3 2020", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 79, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/3/a45866de2c534765e460738b6344ee82-98.jpg", "descriptions": "Take a trip around the world to and race on over 70+ unique routes across 10 different global locations in stunning environments complete with dynamic weather and time of day. Get behind the wheel of an eclectic and exciting roster of cars. World-renowned voice talents troy baker and nolanTake a trip around the world to and race on over 70+ unique routes across 10 different global locations in stunning environments complete with dynamic weather and time of day. Get behind the wheel of an eclectic and exciting roster of cars. World-renowned voice talents troy baker and nolan north head up the cast of dirt 5's story-driven Career mode. Local split-screen of up to four players on offline modes, including Career, makes dirt 5 the perfect couch multiplayer racing game as you battle for position with your friends. Capture your biggest jumps and best moves with a detailed photo mode, and show your creative flair with dirt's deepest ever livery editor for all cars.\r… Expand"}, {"name": "Temtem", "details_link": "https://www.metacritic.com/game/pc/temtem", "publisher": "Crema Games", "release_date": "Sep  6 2022", "developers": ["Crema Games"], "platforms": ["PlayStation 5", "Switch", "Xbox Series X", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Trainer"], "meta_score": 79, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/753c8d71ff9ffdf864b2230172c6de11-98.jpg", "descriptions": "Every kid dreams about becoming a Temtem tamer; exploring the six islands of the Airborne Archipelago, discovering new species, and making good friends along the way. Now it's your turn to embark on an epic adventure and make those dreams come true.Catch new Temtem on Omninesia's floatingEvery kid dreams about becoming a Temtem tamer; exploring the six islands of the Airborne Archipelago, discovering new species, and making good friends along the way. Now it's your turn to embark on an epic adventure and make those dreams come true.Catch new Temtem on Omninesia's floating islands, battle other tamers on the sandy beaches of Deniz or trade with your friends in Tucma's ash-covered fields. Defeat the ever-annoying Clan Belsoto and end its plot to rule over the Archipelago, beat all eight Dojo Leaders, and become the ultimate Temtem tamer!… Expand"}, {"name": "Semblance", "details_link": "https://www.metacritic.com/game/pc/semblance", "publisher": "Good Shepherd Entertainment", "release_date": "Jul 24 2018", "developers": ["Nyamakop"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 79, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/190a6302609145d26c2dfc869826bb1f-98.jpg", "descriptions": "Semblance is an innovative platformer with deformable terrain, set in a beautiful minimalist world. It’s a game that asks, what if you could deform and reshape the world itself? Semblance takes the idea of a ‘platform’ in a platformer and turns it on its head."}, {"name": "Batman: The Enemy Within - The Telltale Series", "details_link": "https://www.metacritic.com/game/pc/batman-the-enemy-within---the-telltale-series", "publisher": "Telltale Games", "release_date": "Aug  8 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/2f07eba6adccbdf5d8e9891629e6dab1-98.jpg", "descriptions": "In this latest chapter from the award-winning studio behind Batman - The Telltale Series, both Bruce Wayne and Batman will be forced into precarious new roles. The Riddler has returned to terrorize Gotham City, but his gruesome puzzles merely foreshadow an even greater crisis."}, {"name": "Dead Space: Extraction", "details_link": "https://www.metacritic.com/game/playstation-3/dead-space-extraction", "publisher": "Electronic Arts", "release_date": "Jan 25 2011", "developers": ["Visceral Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Horror", "Horror", "Shooter", "Light Gun"], "meta_score": 79, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/978b85b94afb13e4b1fd740738b51877-98.jpg", "descriptions": "Dead Space Extraction is a prequel that reveals the events leading up to Isaac Clarke's mission on the USG Ishimura in the original Dead Space game released in 2008. Dead Space Extraction will marry the innovative motion controls of the Wii Remote with a frenetic first-person perspective toDead Space Extraction is a prequel that reveals the events leading up to Isaac Clarke's mission on the USG Ishimura in the original Dead Space game released in 2008. Dead Space Extraction will marry the innovative motion controls of the Wii Remote with a frenetic first-person perspective to create a new action-packed horror experience.… Expand"}, {"name": "Project: Snowblind", "details_link": "https://www.metacritic.com/game/xbox/project-snowblind", "publisher": "Eidos Interactive", "release_date": "Feb 23 2005", "developers": ["Crystal Dynamics"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 79, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/246dc8f58cf965afcfe50eb0f224274b-98.jpg", "descriptions": "In Project: Snowblind, you can experience war through the eyes of the first of a new breed of supersoldiers. As Lt. Nathan Frost, your mission is to stop a renegade regime from eradicating the civilized world. You must use your newly implanted enhancements, tools, weapons, and vehicles inIn Project: Snowblind, you can experience war through the eyes of the first of a new breed of supersoldiers. As Lt. Nathan Frost, your mission is to stop a renegade regime from eradicating the civilized world. You must use your newly implanted enhancements, tools, weapons, and vehicles in your fight on the front lines. Discover your character's superhuman powers in the single-player missions, and then showcase your talents in the online multiplayer modes. The Xbox version of the game also features exclusive gameplay modes.… Expand"}, {"name": "LEGO Harry Potter: Years 1-4", "details_link": "https://www.metacritic.com/game/wii/lego-harry-potter-years-1-4", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 29 2010", "developers": ["Traveller's Tales"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 79, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/e3f2862f585c111af02fdb4e8e8a8d11-98.jpg", "descriptions": "Build the adventure from Privet Drive to the Triwizard Tournament and experience the fun of the first four Harry Potter stories – Lego style. Explore Hogwarts School of Witchcraft and Wizardry, learn spells, brew potions and relive the adventures with tongue-in-cheek humor and creativeBuild the adventure from Privet Drive to the Triwizard Tournament and experience the fun of the first four Harry Potter stories – Lego style. Explore Hogwarts School of Witchcraft and Wizardry, learn spells, brew potions and relive the adventures with tongue-in-cheek humor and creative customization that is unique to LEGO videogames.… Expand"}, {"name": "LEGO Harry Potter: Years 1-4", "details_link": "https://www.metacritic.com/game/playstation-3/lego-harry-potter-years-1-4", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 29 2010", "developers": ["Traveller's Tales"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 79, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/a9cd275ad90e2bed4c020b28e3d2b2eb-98.jpg", "descriptions": "Build the adventure from Privet Drive to the Triwizard Tournament and experience the fun of the first four Harry Potter stories – Lego style. Explore Hogwarts School of Witchcraft and Wizardry, learn spells, brew potions and relive the adventures with tongue-in-cheek humor and creativeBuild the adventure from Privet Drive to the Triwizard Tournament and experience the fun of the first four Harry Potter stories – Lego style. Explore Hogwarts School of Witchcraft and Wizardry, learn spells, brew potions and relive the adventures with tongue-in-cheek humor and creative customization that is unique to LEGO videogames.… Expand"}, {"name": "Trackmania Turbo", "details_link": "https://www.metacritic.com/game/pc/trackmania-turbo", "publisher": "Ubisoft", "release_date": "Mar 24 2016", "developers": ["Nadeo"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 79, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/929e3560f68030a5a5e6cd25a357fd7f-98.jpg", "descriptions": "Trackmania offers and arcade racing universe in which everything is about reaching the perfect racing time. Test your skills in over two hundred tracks, challenge your friends at home (offline splitscreen) or online."}, {"name": "Tales From The Borderlands: Episode 4 - Escape Plan Bravo", "details_link": "https://www.metacritic.com/game/pc/tales-from-the-borderlands-episode-4---escape-plan-bravo", "publisher": "Telltale Games", "release_date": "Aug 18 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 79, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/6843d47b9233330ec60c5d56cd4a4f95-98.jpg", "descriptions": "Captured by Vallory and her thugs, Rhys and Fiona are forced to keep searching for the Vault beacon - at gunpoint. The beacon is on the Hyperion moon base - Helios - while our heroes are on Pandora... so there's the annoying cold void of death known as 'space' to overcome. Even with the helpCaptured by Vallory and her thugs, Rhys and Fiona are forced to keep searching for the Vault beacon - at gunpoint. The beacon is on the Hyperion moon base - Helios - while our heroes are on Pandora... so there's the annoying cold void of death known as 'space' to overcome. Even with the help of a familiar face, and with a worryingly helpful Handsome Jack hitching a ride in Rhys’ head, getting on board the ominous ‘H’ is going to take every drop of guile, and quite possibly all the spunk you’ve got. Sacrifices will be made – can you make the tough choices needed to succeed?… Expand"}, {"name": "Nobody Saves the World", "details_link": "https://www.metacritic.com/game/pc/nobody-saves-the-world", "publisher": "DrinkBox Studios", "release_date": "Jan 18 2022", "developers": ["DrinkBox Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 79, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/93c38bf0250b2d3d7427851e2b2a0515-98.jpg", "descriptions": "From the developers of Guacamelee! 1 + 2 comes Nobody Saves the World, a new twist on Action RPGs, in which you play many different character Forms, each with their own unique gameplay mechanics."}, {"name": "Wo Long: Fallen Dynasty", "details_link": "https://www.metacritic.com/game/xbox-series-x/wo-long-fallen-dynasty", "publisher": "Koei Tecmo Games", "release_date": "Mar  3 2023", "developers": ["Team Ninja"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 5 ", "genres": ["Action Adventure", "Linear", "Role-Playing", "Action RPG"], "meta_score": 79, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/8afdcf9740282acb67f476f56d8556c8-98.jpg", "descriptions": "Wo Long: Fallen Dynasty follows the dramatic, action-packed story of a nameless militia soldier fighting for survival in a dark fantasy version of the Later Han Dynasty where demons plague the Three Kingdoms. Players fight off deadly creatures and enemy soldiers using swordplay based on theWo Long: Fallen Dynasty follows the dramatic, action-packed story of a nameless militia soldier fighting for survival in a dark fantasy version of the Later Han Dynasty where demons plague the Three Kingdoms. Players fight off deadly creatures and enemy soldiers using swordplay based on the Chinese martial arts, attempting to overcome the odds by awakening the true power from within.… Expand"}, {"name": "Forza Horizon 5: Rally Adventure", "details_link": "https://www.metacritic.com/game/xbox-series-x/forza-horizon-5-rally-adventure", "publisher": "Xbox Game Studios", "release_date": "Mar 29 2023", "developers": ["Playground Games"], "platforms": ["PC", "Xbox Series X"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 79, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/2bc23243231570f641b55893f181a867-98.jpg", "descriptions": "Drive purpose-built rally monsters and conquer the rugged Sierra Nueva. Join three rally teams and attack Horizon's most thrilling routes ever in Horizon Rally and Horizon Races.Feel the intensity of massive dust trails and deformable sand roads in 10 new cars and experience the burstingDrive purpose-built rally monsters and conquer the rugged Sierra Nueva. Join three rally teams and attack Horizon's most thrilling routes ever in Horizon Rally and Horizon Races.Feel the intensity of massive dust trails and deformable sand roads in 10 new cars and experience the bursting flames of anti-lag. Explore dramatic craters, an abandoned quarry and an entirely smashable palm forest.… Expand"}, {"name": "Final Fantasy III Pixel Remaster", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-iii-pixel-remaster", "publisher": "Square Enix", "release_date": "Jul 28 2021", "developers": ["Square Enix", "TOSE"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 79, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/7/9d84c7c71c505799c9ac1d1770ef3286-98.jpg", "descriptions": "When darkness falls and the land is robbed of light, four young heroes are chosen by the crystals to head off an exciting journey across a vast and hostile land.This critically-acclaimed entry in the series innovated with a flexible job system, which lets characters change their roles inWhen darkness falls and the land is robbed of light, four young heroes are chosen by the crystals to head off an exciting journey across a vast and hostile land.This critically-acclaimed entry in the series innovated with a flexible job system, which lets characters change their roles in combat at any time. Many of the most famous elements of FINAL FANTASY started here too - for example, it was the first to introduce summons, including series mainstays Bahamut and Shiva!… Expand"}, {"name": "NBA 2K21", "details_link": "https://www.metacritic.com/game/playstation-5/nba-2k21", "publisher": "2K Games", "release_date": "Nov 12 2020", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Arcade"], "meta_score": 79, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/5/75f02a1549ebf75c428ce10502b89e45-98.jpg", "descriptions": "With extensive improvements upon its best-in-class graphics and gameplay, competitive and community online features, and deep, varied game modes, NBA 2K21 offers one-of-a-kind immersion into all facets of NBA basketball and culture - where Everything is Game."}, {"name": "Pit People", "details_link": "https://www.metacritic.com/game/xbox-one/pit-people", "publisher": "The Behemoth", "release_date": "Mar  2 2018", "developers": ["The Behemoth"], "platforms": ["PC", "Xbox One"], "genres": ["Action", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/26b18512186517f40187270b21cf63c6-98.jpg", "descriptions": "Game 4 is the code name for an upcoming grand and mysterious adventure game from The Behemoth."}, {"name": "Nioh: Defiant Honor", "details_link": "https://www.metacritic.com/game/playstation-4/nioh-defiant-honor", "publisher": "Sony Interactive Entertainment", "release_date": "Jul 25 2017", "developers": ["Team Ninja"], "platforms": "PlayStation 4", "genres": ["Role-Playing", "Action RPG"], "meta_score": 79, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/0b5be5730b811ef3b3a581891e522d85-98.jpg", "descriptions": "Defiant Honor takes us to Osaka Castle, the largest and most impregnable castle of Sengoku era. This add-on features the legendary warrior Sanada Yukimura, serving Tokugawa Ieyasu’s archenemy Toyotomi clan, who values honor above all else. As tensions brew between the Tokugawa and ToyotomiDefiant Honor takes us to Osaka Castle, the largest and most impregnable castle of Sengoku era. This add-on features the legendary warrior Sanada Yukimura, serving Tokugawa Ieyasu’s archenemy Toyotomi clan, who values honor above all else. As tensions brew between the Tokugawa and Toyotomi clans, Sanada Yukimura prepares his men for imminent conflict against the Tokugawa’s forces by building a stronghold called the Sanada Maru on the outskirts of the Osaka Castle. With the castle fortified, Tokugawa’s forces were faced with a difficult and bloody challenge. In the midst of this chaos, our hero William, accompanied by Date Masamune who fights alongside Tokugawa, heads towards Sanada Maru in pursuit of Maria. It is a bitter winter in Osaka and the stage is ripe for a fierce battle for the ages. Bundle up and get ready for a brutal winter showdown. [Team Ninja]… Expand"}, {"name": "Enslaved: Odyssey to the West - Pigsy's Perfect 10", "details_link": "https://www.metacritic.com/game/playstation-3/enslaved-odyssey-to-the-west---pigsys-perfect-10", "publisher": "Namco Bandai Games", "release_date": "Nov 23 2010", "developers": ["Ninja Theory"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 79, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/9e9d3fedb57e0b6df382e9182aa864be-98.jpg", "descriptions": "Pigsy, the comical porcine character known for his one-line zingers and questionable hygiene, finally gets his time in the spotlight. The Titan Graveyard is a lonely place and Pigsy really needs some companionship beyond the mechs that roam the area. He dreams of the perfect woman andPigsy, the comical porcine character known for his one-line zingers and questionable hygiene, finally gets his time in the spotlight. The Titan Graveyard is a lonely place and Pigsy really needs some companionship beyond the mechs that roam the area. He dreams of the perfect woman and embarks on a mission to build one from scratch using scrap parts he finds around the junkyard. In contrast to the main game which features strong, capable Monkey as the playable character, Pigsy is much more of a lover than a fighter. Pigsy's gameplay will have a completely different gameplay dynamic, with a focus on stealth and sharp-shooting. He has plenty of tricks up his sleeves including a far-reaching hookshot, trusty sniper rifle, various grenades and devices, Trouble Vision eye piece and the aid of his trusty mechanical sidekick Truffles.… Expand"}, {"name": "Mini Ninjas", "details_link": "https://www.metacritic.com/game/wii/mini-ninjas", "publisher": "Eidos Interactive", "release_date": "Sep  8 2009", "developers": ["Io Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "General", "Fantasy"], "meta_score": 79, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/73840587565dd0c17fad113ba86208de-98.jpg", "descriptions": "Prepare yourself for a Ninja adventure like you have never seen before! Join Hiro, the smallest hero on the biggest adventure, as he embarks on an epic and electrifying quest to restore harmony to a world on the brink of chaos. Use your skills and mighty Ninja training to battle a magicalPrepare yourself for a Ninja adventure like you have never seen before! Join Hiro, the smallest hero on the biggest adventure, as he embarks on an epic and electrifying quest to restore harmony to a world on the brink of chaos. Use your skills and mighty Ninja training to battle a magical army of evil Samurai. Harness the power of your Kuji magic and utilise the special skills of your Mini Ninja friends as you travel through a perilous world to reach the final confrontation with the Evil Samurai Warlord in his Fortress of Doom.… Expand"}, {"name": "Carcassonne", "details_link": "https://www.metacritic.com/game/xbox-360/carcassonne", "publisher": "Sierra Online", "release_date": "Jun 27 2007", "developers": ["Sierra Online"], "platforms": ["PC", "Xbox 360"], "num_players": "5  Online", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 79, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/c2e0c69b00b243297a1d475450e42c26-98.jpg", "descriptions": "[Xbox Live Arcade]  Based on the award-winning board game and designed for two to five players, Carcassonne is set in a medieval landscape made up of 72 tiles. Players start from a single tile and then draw from a pool of remaining tiles to create a growing landscape and gain points for[Xbox Live Arcade]  Based on the award-winning board game and designed for two to five players, Carcassonne is set in a medieval landscape made up of 72 tiles. Players start from a single tile and then draw from a pool of remaining tiles to create a growing landscape and gain points for ultimate victory. Carcassonne features multiplayer modes both offline and online allowing players to compete against up to five players on Xbox LIVE and four players on a single Xbox 360. Players amass valuable points by strategically placing tiles and claiming land, completing towns, roads and farms.  Gamers can master strategy in the medieval world by owning the largest towns, longest roads and biggest farms, not to mention a monastery or two. Or they can score points and properties the old fashioned way--by poaching from others!… Expand"}, {"name": "Harvest Moon: A Wonderful Life", "details_link": "https://www.metacritic.com/game/gamecube/harvest-moon-a-wonderful-life", "publisher": "Natsume", "release_date": "Mar 16 2004", "developers": ["Marvelous"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 79, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/a654d55d6e2eab75a5e53826e7a2d302-98.jpg", "descriptions": "Harvest Moon: A Wonderful Life will span a lifetime on the farm and follow the drama that goes with it. Not only must you build and successfully run a farm, but you must also build a successful life with family and friends! This new Harvest Moon experience will take the best qualities of theHarvest Moon: A Wonderful Life will span a lifetime on the farm and follow the drama that goes with it. Not only must you build and successfully run a farm, but you must also build a successful life with family and friends! This new Harvest Moon experience will take the best qualities of the series and add more...more animals, more vegetables and more drama! What sort of life will you live?… Expand"}, {"name": "Sphinx and the Cursed Mummy", "details_link": "https://www.metacritic.com/game/xbox/sphinx-and-the-cursed-mummy", "publisher": "THQ", "release_date": "Nov 10 2003", "developers": ["Eurocom Entertainment Software"], "platforms": ["PC", "PlayStation 2", "Switch", "Xbox 360", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 79, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/3b92e31c9ed974f8f4b32928c813213c-98.jpg", "descriptions": "Ancient Egyptian mythology comes to life in the Sphinx and the Cursed Mummy. You play the role of Sphinx, a headstrong demigod who travels the world via portals to foil the evil plans of Set. Equipped with a magical sword and a blowpipe, you'll need all your wits, agility, and special powersAncient Egyptian mythology comes to life in the Sphinx and the Cursed Mummy. You play the role of Sphinx, a headstrong demigod who travels the world via portals to foil the evil plans of Set. Equipped with a magical sword and a blowpipe, you'll need all your wits, agility, and special powers to overcome powerful enemies. When being inconspicuous is the only solution, control Sphinx's reluctant hero friend, The Mummy. By finding the stolen magical crowns of Egypt, Sphinx can stop Set and save the world.… Expand"}, {"name": "EverQuest: Lost Dungeons of Norrath", "details_link": "https://www.metacritic.com/game/pc/everquest-lost-dungeons-of-norrath", "publisher": "Sony Online Entertainment", "release_date": "Sep  8 2003", "developers": ["Sony Online Entertainment"], "platforms": "PC", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 79, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/b48b602c83d10be3be6bdf7d8d3dcdbc-98.jpg", "descriptions": "The Lost Dungeons expansion features 48 new dungeons that span the old world of Norrath, focusing on several long lost locations, including the Rujarkian Hills and Deepest Guk. Encounter never before seen monsters that prowl the halls of these dungeons, waiting to challenge any explorerThe Lost Dungeons expansion features 48 new dungeons that span the old world of Norrath, focusing on several long lost locations, including the Rujarkian Hills and Deepest Guk. Encounter never before seen monsters that prowl the halls of these dungeons, waiting to challenge any explorer brave enough to venture in. [Sony Online Entertainment]… Expand"}, {"name": "Battlefield 1942: Secret Weapons of WWII", "details_link": "https://www.metacritic.com/game/pc/battlefield-1942-secret-weapons-of-wwii", "publisher": "EA Games", "release_date": "Sep  4 2003", "developers": ["Digital Illusions"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/8e397306b60087f86b906f93dea05b1b-98.jpg", "descriptions": "In Secret Weapons of WWII, players will engage in war with a choice of up to 46 vehicles to control. In addition to the 30 vehicles introduced in the original game such as fighter planes, tanks, and aircraft carriers, players can operate 16 new vehicles including the Horton HO 229 \"FlyingIn Secret Weapons of WWII, players will engage in war with a choice of up to 46 vehicles to control. In addition to the 30 vehicles introduced in the original game such as fighter planes, tanks, and aircraft carriers, players can operate 16 new vehicles including the Horton HO 229 \"Flying Wing\" that is equipped with 30 mm machine guns and missiles. Other vehicles consist of a US Sherman tank with a T-34 Calliope rocket launcher, U.S. T95/T28 Super Heavy Tank, the Sturmtiger (naval gun mounted on Tiger tank), U.S. Goblin jetfighter, C-47 cargo plane that will serve as a mobile spawn point, the American Armstrong Whitworth AW-52 advanced fighter, the German Wasserfall guided anti-air missile and the German Natter rocket plane. Also, for the first time, Secret Weapons of WWII will give players the chance to fly and fight at the same time with a top secret German prototype Rocket Pack. There will be seven new weapons including one-shot kill knives, the Bren light machine gun, Remington Auto 5 shotgun and the Mauser K98 grenade rifle. The game introduces British Commando and German Elite troops while enriching gameplay by adding a new \"objective based\" gameplay mode. [Electronic Arts]… Expand"}, {"name": "Robot Alchemic Drive", "details_link": "https://www.metacritic.com/game/playstation-2/robot-alchemic-drive", "publisher": "Enix Corporation", "release_date": "Nov  4 2002", "developers": ["Sandlot"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 79, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/282f23160812755cd9f976bc0b3201e4-98.jpg", "descriptions": "Prepare to bond with 75 tons of high-tensile robot. Direct every movement of your machine and slug your way to victory over colossal opponents in brutal hand-to-hand combat (plus missiles, lasers, shooting fists, boomerangs, and much more). Freeway overpass in the way? Take it down.Prepare to bond with 75 tons of high-tensile robot. Direct every movement of your machine and slug your way to victory over colossal opponents in brutal hand-to-hand combat (plus missiles, lasers, shooting fists, boomerangs, and much more). Freeway overpass in the way? Take it down. Buildings crowding you? Knock 'em over. Much more than a simple action game, Robot Alchemic Drive accurately simulates the operation of a remote-controlled metal titan in crowded, active urban environments. Use your giant robot as a tool to defeat enemies, complete missions, and much more. [Enix]… Expand"}, {"name": "NHL 2003", "details_link": "https://www.metacritic.com/game/playstation-2/nhl-2003", "publisher": "Electronic Arts", "release_date": "Sep 30 2002", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 79, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/fecf86ce513f5fa04cdd28b7d1816364-98.jpg", "descriptions": "Dynamic Deke Control: User-activated dekes give you full control of the puck. Game Breaker: Build enough momentum and the action slows in key moments -- feel your heart pounding while you go for goal. New Graphics and Animation Engine: NHL action comes to life with all-new animations andDynamic Deke Control: User-activated dekes give you full control of the puck. Game Breaker: Build enough momentum and the action slows in key moments -- feel your heart pounding while you go for goal. New Graphics and Animation Engine: NHL action comes to life with all-new animations and stunning graphics. New Puck Physics and Goalie AI: The players and puck respond more accurately to your actions. More Cool Features: 4 game modes, Create-A-Player, real on-ice sounds, and dynamic camera work bring the NHL to your fingertips. [EA Sports]… Expand"}, {"name": "The Sims: Unleashed", "details_link": "https://www.metacritic.com/game/pc/the-sims-unleashed", "publisher": "EA Games", "release_date": "Sep 23 2002", "developers": ["Maxis"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 79, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/d6a86c5c7771280dc33a42f7875bacec-98.jpg", "descriptions": "As fans of The Sims know, there has always been something missing from their virtual neighborhoods... pets. In The Sims Unleashed, players can now add furry friends to their Sims' families. An all new expanded neighborhood featuring parks, pet stores, cafes and markets will give the Sims andAs fans of The Sims know, there has always been something missing from their virtual neighborhoods... pets. In The Sims Unleashed, players can now add furry friends to their Sims' families. An all new expanded neighborhood featuring parks, pet stores, cafes and markets will give the Sims and their new pets a variety of places to sniff, explore and meet their new neighbors. [Electronic Arts]… Expand"}, {"name": "NHL Hitz 20-02", "details_link": "https://www.metacritic.com/game/gamecube/nhl-hitz-20-02", "publisher": "Midway", "release_date": "Nov 17 2001", "developers": ["Midway"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Arcade"], "meta_score": 79, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/1e91110c672619dd52dbda5d94ef5141-98.jpg", "descriptions": "As the only hockey game available, NHL Hitz 2002 deserves a strong look from GameCube-owning pucks fans."}, {"name": "Worms World Party", "details_link": "https://www.metacritic.com/game/dreamcast/worms-world-party", "publisher": "Titus Software", "release_date": "Jun  3 2001", "developers": ["Team17"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Dreamcast"], "genres": ["Strategy", "General"], "meta_score": 79, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/e9f54828a52dacef227b99ab9b47c697-98.jpg", "descriptions": "You are invited to the ultimate gaming experience. And if you can't make it, we'll bring the party to you! Those loveable worms are back again, annihilating each other with zany weapons on wacky landscapes. Worms World Party is the pinnable of evolution for strategy gaming enthusiasts. WithYou are invited to the ultimate gaming experience. And if you can't make it, we'll bring the party to you! Those loveable worms are back again, annihilating each other with zany weapons on wacky landscapes. Worms World Party is the pinnable of evolution for strategy gaming enthusiasts. With \"Worms\" already having a reputation for being a party animal, there is just no reason not to come.… Expand"}, {"name": "Resident Evil 3: Nemesis", "details_link": "https://www.metacritic.com/game/dreamcast/resident-evil-3-nemesis", "publisher": "Capcom", "release_date": "Nov 17 2000", "developers": ["Capcom"], "platforms": ["PC", "Dreamcast"], "genres": ["Action Adventure", "Horror"], "meta_score": 79, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/5/772c19b50fc55b0927435b75d2b301a3-98.jpg", "descriptions": "A month and a half have passed since the mansion lab incident and now the secrets come back to haunt you in Resident Evil 3: Nemesis.  Join Jill Valentine in her attempt to escape a nightmarish city in ruins.  Around every corner lurk hordes of flesh-eating zombies, hideous mutants, and aA month and a half have passed since the mansion lab incident and now the secrets come back to haunt you in Resident Evil 3: Nemesis.  Join Jill Valentine in her attempt to escape a nightmarish city in ruins.  Around every corner lurk hordes of flesh-eating zombies, hideous mutants, and a relentless new nemesis.  You'll soon rely on cunning and brute force to stay alive.  The Resident Evil series has taken a horrifying turn, unveiling new layers in the Umbrella Corporation's devious activities.… Expand"}, {"name": "RayStorm", "details_link": "https://www.metacritic.com/game/playstation/raystorm", "publisher": "Working Designs", "release_date": "Dec 31 1996", "developers": ["Taito Corporation"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 79, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/2ea2d02687e02790805fe90cfb9d6e6b-98.jpg", "descriptions": "Grab your oxygen mask and jump into the future of interplanetary defense. The year is 2219AD, and Earth's Star Federation has unleashed the R-GRAY advanced tactical combat fighter to save the planet from certain destruction at the hands of the bloodthirsty Secilia Federation. DespiteGrab your oxygen mask and jump into the future of interplanetary defense. The year is 2219AD, and Earth's Star Federation has unleashed the R-GRAY advanced tactical combat fighter to save the planet from certain destruction at the hands of the bloodthirsty Secilia Federation. Despite impossible odds, you must now command a specially outfitted R-Gray fighter to defend Earth from certain destruction. Each fighter is equipped with lock-on lasters, pulse lasers, and a single devastating assault laser array that can destroy all sighted targets as once. Even with this technology at your disposal, the battle will not be easy. Earth's forces are depleted, and the merciless hordes of Secilia will settle for nothing less than complete annihilation of Earth. Fortunately, Star command has created two R-GRAY prototypes, so if you need extra firepower, a skilled friend can fly at your side. Whether you fly solo or with a friend, the intense sound, action, and arcade-perfect Hyper-3D visuals will blow you away!… Expand"}, {"name": "The King of Fighters XIV", "details_link": "https://www.metacritic.com/game/playstation-4/the-king-of-fighters-xiv", "publisher": "Atlus Co.", "release_date": "Aug 23 2016", "developers": ["SNK Playmore", "SNK Corporation"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 79, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/e8edb0cf6a3454b1423a19939e196c0e-98.jpg", "descriptions": "King of Fighters returns with a roster of 50 characters. Besides the returning fan favorites, numerous new combatants join the roster. Nakoruru, one of the heroines from the Samurai Shodown series, joins the fight along with her fellow hawk companion Mamahaha. Shun’ei is a new character whoKing of Fighters returns with a roster of 50 characters. Besides the returning fan favorites, numerous new combatants join the roster. Nakoruru, one of the heroines from the Samurai Shodown series, joins the fight along with her fellow hawk companion Mamahaha. Shun’ei is a new character who plays an important role in the game’s story.\rPlus, numerous emblematic and original characters prepare to duke it out in the KOF tournament.… Expand"}, {"name": "Madden NFL 20", "details_link": "https://www.metacritic.com/game/xbox-one/madden-nfl-20", "publisher": "Electronic Arts", "release_date": "Jul 30 2019", "developers": ["Electronic Arts", "EA Tiburon"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Action", "Sports", "General", "Team", "Football", "Sim"], "meta_score": 79, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/5/2301399a630b1543689617a7ed3977f7-98.jpg", "descriptions": "Take the journey of an NFL superstar. Create a college quarterback and dominate the College Football Playoff, then impress the scouts at the NFL Combine. Find out where your story begins at the NFL Draft, and then fight to prove you belong in the league. Last long enough and you just mightTake the journey of an NFL superstar. Create a college quarterback and dominate the College Football Playoff, then impress the scouts at the NFL Combine. Find out where your story begins at the NFL Draft, and then fight to prove you belong in the league. Last long enough and you just might leave a legacy and even play in a few Pro Bowls. This new and customizable career campaign is all about you, with personalized playable scenarios, events, and dynamic challenges. The choices you make early on will affect how your career pans out.… Expand"}, {"name": "Tales of Berseria", "details_link": "https://www.metacritic.com/game/playstation-4/tales-of-berseria", "publisher": "Bandai Namco Games", "release_date": "Jan 24 2017", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Japanese-Style", "Role-Playing", "Action RPG"], "meta_score": 79, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/bf036353f8b38ff39292ba9cf7f680a9-98.jpg", "descriptions": "Players set out on a journey of self-discovery as they assume the role of Velvet, a young woman whose once kind demeanor has been replaced and overcome with a festering anger and hatred after a traumatic experience three years prior to the events within TALES OF BERSERIA. Velvet will join aPlayers set out on a journey of self-discovery as they assume the role of Velvet, a young woman whose once kind demeanor has been replaced and overcome with a festering anger and hatred after a traumatic experience three years prior to the events within TALES OF BERSERIA. Velvet will join a crew of pirates as they sail across the sea and visit the many islands that make up the sacred kingdom of Midgand in an all-new adventure developed by the celebrated team behind the TALES OF series.… Expand"}, {"name": "Star Wars: Squadrons", "details_link": "https://www.metacritic.com/game/playstation-4/star-wars-squadrons", "publisher": "Electronic Arts", "release_date": "Oct  2 2020", "developers": ["Motive Studios"], "platforms": ["PC", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Simulation", "Space", "Combat"], "meta_score": 79, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/7a729ece315903dfed5cce28f95e641e-98.jpg", "descriptions": "Master the art of starfighter combat in the authentic piloting experience Star Wars: Squadrons. Buckle up and feel the adrenaline of first-person multiplayer space dogfights alongside your squadron. Pilots who enlist will step into the cockpits of starfighters from both the New Republic andMaster the art of starfighter combat in the authentic piloting experience Star Wars: Squadrons. Buckle up and feel the adrenaline of first-person multiplayer space dogfights alongside your squadron. Pilots who enlist will step into the cockpits of starfighters from both the New Republic and Imperial fleets and fight in strategic 5 vs. 5 space battles. Modify your starfighter and adjust the composition of your squadron to suit varying playstyles and crush the opposition. Pilots will triumph as a team and complete tactical objectives across known and never-before-seen battlefields, including the gas giant of Yavin Prime and the shattered moon of Galitan.\r Take control of starfighters such as the X-wing and TIE fighter. Customize loadouts and cosmetics, divert power between weapons, shields, and engines, while immersing yourself in the cockpit. In addition, players will have the option to play the entirety of the game in virtual reality on PSVR and PC!\r Learn what it means to be a pilot in a thrilling Star Wars single-player story set after the events of Return of the Jedi. Seen from alternating perspectives between two factions, iconic and emerging leaders on both sides are battling for the galaxy. The New Republic fights for freedom. The Empire demands order. We need you to join the galaxy's finest.… Expand"}, {"name": "Life is Strange 2: Episode 2 - Rules", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-2-episode-2---rules", "publisher": "DONTNOD Entertainment", "release_date": "Jan 24 2019", "developers": ["DONTNOD Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 79, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/3/352c2a073f7b651368bc00c9c687ef72-98.jpg", "descriptions": "The two brothers continue their journey into the winter months & struggle against the cold. As Daniel gradually falls ill, Sean decides they must make their way to their distant grandparent’s house to recover. During their stay, they encounter next-door neighbor Chris, a young boy whoThe two brothers continue their journey into the winter months & struggle against the cold. As Daniel gradually falls ill, Sean decides they must make their way to their distant grandparent’s house to recover. During their stay, they encounter next-door neighbor Chris, a young boy who believes he is a superhero by the name of Captain Spirit.… Expand"}, {"name": "Shiren the Wanderer: The Tower of Fortune and the Dice of Fate", "details_link": "https://www.metacritic.com/game/playstation-vita/shiren-the-wanderer-the-tower-of-fortune-and-the-dice-of-fate", "publisher": "Aksys Games", "release_date": "Jul 26 2016", "developers": ["Spike Chunsoft"], "platforms": ["PC", "Switch", "PlayStation Vita"], "num_players": "2 ", "genres": ["Role-Playing", "Roguelike"], "meta_score": 79, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/7fa5670a38c2870374449482816bf926-98.jpg", "descriptions": "Legend has it that Reeva, god of Destiny, holds sway over the past, present, and future. Said to dwell in the mysterious Tower of Fortune, Reeva decides the fates of all mankind with a trio of magic dice. Lead Shiren The Wanderer and his sidekick Koppa in their quest to conquer the Tower ofLegend has it that Reeva, god of Destiny, holds sway over the past, present, and future. Said to dwell in the mysterious Tower of Fortune, Reeva decides the fates of all mankind with a trio of magic dice. Lead Shiren The Wanderer and his sidekick Koppa in their quest to conquer the Tower of Fortune. [Playstation.com]… Expand"}, {"name": "Halfbrick Echoes", "details_link": "https://www.metacritic.com/game/psp/halfbrick-echoes", "publisher": "Halfbrick Studios", "release_date": "Nov 19 2009", "developers": ["Halfbrick Studios"], "platforms": "PSP", "genres": ["Puzzle", "Action", "General", "General"], "meta_score": 79, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/86bf1f0b9d2f36316241ced5da42f38f-98.jpg", "descriptions": "[PSP Minis]  Echoes is an arcade puzzle game in which players collect crystals within many surreal, artistic worlds. The player controls Charlie, and must collect crystals and avoid Echoes, the translucent and deadly ghost versions of yourself which spawn each time a crystal is collected.[PSP Minis]  Echoes is an arcade puzzle game in which players collect crystals within many surreal, artistic worlds. The player controls Charlie, and must collect crystals and avoid Echoes, the translucent and deadly ghost versions of yourself which spawn each time a crystal is collected. Fight back with four powerups across 22 arcade levels and four individual game modes. [Halfbrick]… Expand"}, {"name": "Race the Sun", "details_link": "https://www.metacritic.com/game/pc/race-the-sun", "publisher": "Flippfly", "release_date": "Aug 19 2013", "developers": ["Flippfly"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Racing", "General", "General", "Arcade", "Futuristic"], "meta_score": 79, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/3ef470d74811287dd980d6b7c8e37180-98.jpg", "descriptions": "Race the Sun is an intense action game that could be described as a mash-up of Star Fox and Temple Run with a community focus."}, {"name": "MotorStorm: Arctic Edge", "details_link": "https://www.metacritic.com/game/psp/motorstorm-arctic-edge", "publisher": "SCEA", "release_date": "Sep 29 2009", "developers": ["Bigbig Studios"], "platforms": "PSP", "num_players": "Up to 6 ", "genres": ["Driving", "Racing", "Simulation", "Arcade", "Rally / Offroad", "Other", "Rally / Offroad", "Automobile"], "meta_score": 79, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/d0ad22acd8740eebe1742b9b48d67fa5-98.jpg", "descriptions": "MotorStorm's next mission is battling the frozen wasteland of Alaska's Arctic Edge. MotorStorm Arctic Edge delivers brutal off-road racing in the beautiful yet lethal and unpredictable setting of Alaska. With temperatures plummeting, sudden avalanches, broken ice bridges, and three differentMotorStorm's next mission is battling the frozen wasteland of Alaska's Arctic Edge. MotorStorm Arctic Edge delivers brutal off-road racing in the beautiful yet lethal and unpredictable setting of Alaska. With temperatures plummeting, sudden avalanches, broken ice bridges, and three different racing altitudes, Arcitc Edge is the most inhospitable environment in the franchise's history. In addition to the six vehicle classes from the original MotorStorm, two new vehicles (the Snowcat and Snow Machine) have been introduced to combat the ice, the cold and the snow. One has the power and size to blast through packed snow, while the other has the grip and pace to combat most of what the sub-zero conditions can throw at it. MotorStorm Arctic Edge is fit for single player action, online multiplayer or playing with friends; two to eight players can compete against each other wirelessly via Ad Hoc Mode on PSP. Alternatively, you can also compete via online multiplayer using Infrastructure Mode on PSP to make it to the summit of the online global leaderboards.… Expand"}, {"name": "I Am Dead", "details_link": "https://www.metacritic.com/game/switch/i-am-dead", "publisher": "Annapurna Interactive", "release_date": "Oct  8 2020", "developers": ["Hollow Ponds and Richard Hogg"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 79, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/bf5a900a852f925505f0576274fb3c7f-98.jpg", "descriptions": "I Am Dead is a charming puzzle adventure game from the creators of Hohokum and Wilmot’s Warehouse about exploring the afterlife. Morris Lupton is the recently-deceased museum curator of the tiny island of Shelmerston who is reunited with the ghost of his dog Sparky, only to discover that aI Am Dead is a charming puzzle adventure game from the creators of Hohokum and Wilmot’s Warehouse about exploring the afterlife. Morris Lupton is the recently-deceased museum curator of the tiny island of Shelmerston who is reunited with the ghost of his dog Sparky, only to discover that a disaster is about to destroy his beloved island.\r Together, they must uncover Shelmerston’s ancient mysteries, prevent the island’s volcano from erupting, and save the place they call home.\r Morris and Sparky must unearth a number of Shelmerston's lost and scattered ghosts. To find them, the duo must visit the places they spent time in, dive inside the memories of the people who knew them best, and learn the stories of their lives. \r\rTo help with their mission, Morris uses his newfound power that allows him to peer inside objects and people to reveal their contents and memories, like a supernatural X-Ray!\r Along the way you will discover many stories about the history and folklore of Shelmerston, and its cast of curious inhabitants and visitors: tourist finches, the fishfolk, morlos, and the Legend of Aggi - the one who originally silenced the volcano...\r… Expand"}, {"name": "GRID", "details_link": "https://www.metacritic.com/game/xbox-one/grid", "publisher": "Codemasters", "release_date": "Oct 11 2019", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "num_players": "Online Multiplayer", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 79, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/be9891f2ebbe6b90391cb8bc84d69ff9-98.jpg", "descriptions": "Capturing intense moment-to-moment racing action, GRID returns with an all-new experience where every race is the chance to choose your own path, create your own story and define your legacy in the motorsport world.From the creators of the hugely successful DiRT and F1 series, CodemastersCapturing intense moment-to-moment racing action, GRID returns with an all-new experience where every race is the chance to choose your own path, create your own story and define your legacy in the motorsport world.From the creators of the hugely successful DiRT and F1 series, Codemasters invites you to take your place in the GRID World Series and compete in intense wheel-to-wheel racing with the most iconic and desirable race cars -- current and classic, from GT through Touring and Muscle to Stock and Super Modifieds -- and in some of the world's most famous city streets, ovals and circuits.GRID captures every moment of the race, from the adrenaline rush of lights-out to the elation at the chequered flag -- and in-between, it's all action too. Incidents come one right after the other -- tight overtakes, bumper-to bumper scrapes and competitive collisions -- all heightened by rivalries, team-mates and a nemesis driver who will all either try to help or hinder your progress as you achieve your goal of becoming the GRID World Series champion.… Expand"}, {"name": "Hitman - Episode 3: Marrakesh", "details_link": "https://www.metacritic.com/game/pc/hitman---episode-3-marrakesh", "publisher": "Square Enix", "release_date": "May 31 2016", "developers": ["Io Interactive"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action Adventure", "General"], "meta_score": 79, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/11853a727c0b693c5794012585759aa6-98.jpg", "descriptions": "Hitman Episode 3: Marrakesh presents players with a range of new in-game Challenges and Opportunities that keep them busy along with an entirely new setting for Escalation Contracts and Elusive Targets."}, {"name": "The Sims 3: Pets", "details_link": "https://www.metacritic.com/game/pc/the-sims-3-pets", "publisher": "Electronic Arts", "release_date": "Oct 18 2011", "developers": ["The Sims Studio"], "platforms": "PC", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 79, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/f232e8abbb43434f9b485ea497a99263-98.jpg", "descriptions": "Players take creativity by the reins and play out the stories they want to tell whether it’s the single guy in the dog park picking up women or the criminal overlord and her evil cat. Across all platforms, The Sims 3 Pets players will be able to create, customize and control over a hundredPlayers take creativity by the reins and play out the stories they want to tell whether it’s the single guy in the dog park picking up women or the criminal overlord and her evil cat. Across all platforms, The Sims 3 Pets players will be able to create, customize and control over a hundred different kinds of cats and dogs like the Australian Shepherd and the Maine Coon, and can breed and share them with friends providing endless possibilities to create new and exciting breeds. Each platform brings a new world for players to explore from the Xbox 360 and PlayStation 3 versions where players will unlock achievements by solving mysteries around town, the Nintendo 3DS with new lots to unlock to the PC/Mac version where they’ll be able to take their pets on play dates or meet other Sims at the dog park, cat jungles and even a horse ranch. With The Sims 3 Pets, players will be able to create, control and play with life with their pets.… Expand"}, {"name": "Pac-Man 256", "details_link": "https://www.metacritic.com/game/playstation-4/pac-man-256", "publisher": "Bandai Namco Games", "release_date": "Jun 21 2016", "developers": ["HIPSTER WHALE"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Arcade"], "meta_score": 79, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/dac967dc41d8254c13363017a530daff-98.jpg", "descriptions": "Control Pac-Man as you devour pellets and ghosts in an endless maze, and you must continue moving forward as a wave of glitches follow and destroy you if they get too close. The game ends when you die, so getting as many points as possible is key."}, {"name": "MTX Mototrax", "details_link": "https://www.metacritic.com/game/xbox/mtx-mototrax", "publisher": "Activision", "release_date": "Mar  2 2004", "developers": ["Left Field Productions"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 79, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Push your bike to the limit.  MTX: Mototrax challenges race against seven other riders, perform outrageous gravity-defying stunts, and develop a career as an motocross athlete.  Play as or against any of the 12 top riders, earning money from contest wins and sponsorships to spend onPush your bike to the limit.  MTX: Mototrax challenges race against seven other riders, perform outrageous gravity-defying stunts, and develop a career as an motocross athlete.  Play as or against any of the 12 top riders, earning money from contest wins and sponsorships to spend on customizing your attributes, upgrading your equipment, or buying access to new environments.  If you think you're the best, prove it in the online multiplayer mode, which includes over 25 tracks.  Accept the MTX: Mototrax challenge to become the ultimate motocross racer.… Expand"}, {"name": "Trials Rising", "details_link": "https://www.metacritic.com/game/playstation-4/trials-rising", "publisher": "Ubisoft", "release_date": "Feb 26 2019", "developers": ["RedLynx"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 79, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/1a8a99a3be18133619ce38ce5f400fa2-98.jpg", "descriptions": "Explore challenging tracks around the world, from Yellowstone Park to the peaks of Mt. Everest and everywhere in between. New Tandem Bike mode allows two riders to control one bike. Hone your racing skills and level up from local backyard competitions to stadium races. Make a statement withExplore challenging tracks around the world, from Yellowstone Park to the peaks of Mt. Everest and everywhere in between. New Tandem Bike mode allows two riders to control one bike. Hone your racing skills and level up from local backyard competitions to stadium races. Make a statement with customizable outfits and bike skins. … Expand"}, {"name": "Prototype (2009)", "details_link": "https://www.metacritic.com/game/pc/prototype-2009", "publisher": "Activision", "release_date": "Jun 10 2009", "developers": ["Radical Entertainment"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "Open-World"], "meta_score": 79, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/958ad7dcff1fb68a10af53e99071fab3-98.jpg", "descriptions": "You are Alex Mercer, the Prototype: a shapeshifter with amazing powers of combat, destruction, and deception. Consume targets for their form and memories to assume a perfect disguise, or instantly transform your body into an array of deadly biological weapons, cutting your way to the heartYou are Alex Mercer, the Prototype: a shapeshifter with amazing powers of combat, destruction, and deception. Consume targets for their form and memories to assume a perfect disguise, or instantly transform your body into an array of deadly biological weapons, cutting your way to the heart of the conspiracy forty years in the making. Stalk the streets of New York City, searching for the life you lead before. Take the form of anyone in your path, using an arsenal of identities to confound, exploit or annihilate your enemies. Mankind is your mask. Wage a secret war against factions with complex agendas of their own, out to capture or kill you. They are your greatest threat and the key to the secrets of your past. Confront them, find those responsible and make them pay. Shapeshifting: Attack with brutal and devastating powers; instantly triggering hundreds of power combinations (Attack, Defensive and Sensory). Disguise: Assume the perfect disguise by transforming into any character and assuming the victim's powers, skills and abilities. New York City is your hunting ground! Jam-packed, vibrant, fully interactive city filled with thousands of people and enemies out to destroy you. Delve to the bottom of a conspiracy that has haunted the American government for decades. Who is responsible for your condition? Only you can find out!… Expand"}, {"name": "Alienation", "details_link": "https://www.metacritic.com/game/playstation-4/alienation", "publisher": "SCEA", "release_date": "Apr 26 2016", "developers": ["Housemarque"], "platforms": "PlayStation 4", "num_players": "Up to 4 ", "genres": ["Sci-Fi", "Action", "Shooter", "Third-Person", "Shoot-'Em-Up", "Arcade", "Top-Down"], "meta_score": 79, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/c079904e8c234931caf2e46c03a6b977-98.jpg", "descriptions": "Unleash a devastating array of conventional, hybrid and Alien weaponry and eliminate the Alien masses with extreme firepower in massively destructible environments where collateral damage can literally bring the house down."}, {"name": "F.I.S.T.: Forged In Shadow Torch", "details_link": "https://www.metacritic.com/game/switch/fist-forged-in-shadow-torch", "publisher": "bilibili", "release_date": "Jul 12 2022", "developers": ["TIGAMES"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Metroidvania"], "meta_score": 79, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/3f31860ce210d93fe0562faf9e173e44-98.jpg", "descriptions": "Six years ago, the Machine Legion invaded and colonized the Torch City, which was originally inhabited by animals. Rayton, the former soldier in the resistance war, has been living in seclusion since then. After his friend is forcibly arrested, Rayton reclaims his mechanical fist and stepsSix years ago, the Machine Legion invaded and colonized the Torch City, which was originally inhabited by animals. Rayton, the former soldier in the resistance war, has been living in seclusion since then. After his friend is forcibly arrested, Rayton reclaims his mechanical fist and steps to his journey fighting back. And he never expects that he has been involved in a bigger scheme between the mafia, the rebellion, and the legion.Exploring the Metroidvania game world with a dozen of areas with distinguishing vision themes and level designs. Earning the rewards by conquering the challenges of combats, puzzles and platformers in countless chambers, tunnels and shortcuts.Interconnected and automatically loading game map makes the detailed Torch City more convincing and beautiful.… Expand"}, {"name": "Super Robot Wars 30", "details_link": "https://www.metacritic.com/game/pc/super-robot-wars-30", "publisher": "Bandai Namco Games", "release_date": "Oct 27 2021", "developers": ["Banpresto", "B.B.Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 79, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/20d6c4210d91164405ce74af55c3a0df-98.jpg", "descriptions": "The battle fire of steel ignites after 30 years\"Super Robot Wars 30, a title commemorating the 30th anniversary of the series, is coming to Nintendo Switch/PlayStation®4/STEAM®.\n\nSuper Robot Wars is a simulation RPG where robots of various animations come together to fight against a commonThe battle fire of steel ignites after 30 years\"Super Robot Wars 30, a title commemorating the 30th anniversary of the series, is coming to Nintendo Switch/PlayStation®4/STEAM®.Super Robot Wars is a simulation RPG where robots of various animations come together to fight against a common enemy.In this original story, robots from various animations such as \" \"Mazinger Z: Infinity,\" \"Super Electromagnetic Robot Combattler V,\" \"Mobile Suit Zeta Gundam,\" and \"Code Geass: Lelouch of the Re;surrection\" transcend the boundaries of their works and assemble in one place.… Expand"}, {"name": "The Last Show of Mr. Chardish", "details_link": "https://www.metacritic.com/game/pc/the-last-show-of-mr-chardish", "publisher": "Punk Notion", "release_date": "Nov  5 2020", "developers": ["Punk Notion"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 79, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/00e160d7968b93e5b27ea94c4ba59432-98.jpg", "descriptions": "Decades have passed and the Actress, Ella, returns to the abandoned theatre to uncover a preserved collection of extraordinary performances. Explore a variety of magical, hand-painted worlds as you collect the lost pieces of the past."}, {"name": "Fury Unleashed", "details_link": "https://www.metacritic.com/game/pc/fury-unleashed", "publisher": "Awesome Games Studio", "release_date": "May  8 2020", "developers": ["Awesome Games Studio"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 79, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/22af646dbecc389b821769461f7d0293-98.jpg", "descriptions": "Fury Unleashed is a combo-driven roguelite action platformer - each kill you score increases your combo. Hit certain thresholds and your damage resistance and healing powers will kick in! It's a game you can even beat in one, ultimate combo. Are you up for the task?"}, {"name": "River City Girls", "details_link": "https://www.metacritic.com/game/switch/river-city-girls", "publisher": "Arc System Works", "release_date": "Sep  5 2019", "developers": ["WayForward"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 79, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/807b9f0d8dc2b402a000dab46fe72b1a-98.jpg", "descriptions": "Kick butt, take names, and pound punks in this all-new installment of the classic co-op beat-'em-up series!River City Girls stars Kyoko and Misako, two street-tough high-schoolers who must fight their way through the six regions of River City to rescue their kidnapped boyfriends, seriesKick butt, take names, and pound punks in this all-new installment of the classic co-op beat-'em-up series!River City Girls stars Kyoko and Misako, two street-tough high-schoolers who must fight their way through the six regions of River City to rescue their kidnapped boyfriends, series mainstays Kunio and Riki. Along the way, they'll utilize an arsenal of combos, counters, throws, and special attacks; battle an assortment of enemies; accept numerous side quests; level up with experience points; interact with NPCs (including guest stars from past River City games); and shop for a variety of items, food, and gear to boost stats and unlock new abilities. The girls can even wield weapons and recruit defeated foes to join them in combat!The one- or local two-player bare-knuckle brawling is complemented by spectacular 16-bit-style graphics and an epic synth-pop soundtrack (featuring NateWantsToBattle, Chipzel, Christina Vee, and Megan McDuffee!), while the story roars to life via glorious anime cutscenes and manga-style intermissions.Key Features:-Furious beat-'em-up action for one or two players!-Stunning pixel-art graphics plus anime and manga cutscenes!-Fantastic soundtrack featuring NateWantsToBattle, Chipzel, Christina Vee, and Megan McDuffee!-Six large city regions to fight through, complete with shops and side quests!-Loads of weapons, items, and abilities to power-up your heroines!-Guest appearances by classic River City characters!… Expand"}, {"name": "Deru - The Art of Cooperation", "details_link": "https://www.metacritic.com/game/switch/deru---the-art-of-cooperation", "publisher": "Ink Kit", "release_date": "Nov  7 2018", "developers": ["Ink Kit"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 79, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/99473db6074b9769a32b58840414cfb0-98.jpg", "descriptions": "Deru is a cooperative puzzle game that mixes eye catching abstract art with mind bending puzzles to a unique gaming experience. In this couch co-op experience two players team up to overcome the boundaries of shadow and light and succeed through teamwork, timing and tactics. Block streamsDeru is a cooperative puzzle game that mixes eye catching abstract art with mind bending puzzles to a unique gaming experience. In this couch co-op experience two players team up to overcome the boundaries of shadow and light and succeed through teamwork, timing and tactics. Block streams for your partner, juggle your mass to make each other huge for traversing big streams. To succeed you have to communicate and plan together, fuse your brains and bring your co-op gaming skills on the next level. Deru is more than your usual puzzle game, you need to have dexterity, precision and use strategic planning to reach the exit of each level. … Expand"}, {"name": "Steredenn: Binary Stars", "details_link": "https://www.metacritic.com/game/switch/steredenn-binary-stars", "publisher": "Plug In Digital", "release_date": "Mar  8 2018", "developers": ["Plug In Digital"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 79, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/1707b28b5bc3d110e8d7579913dae1d1-98.jpg", "descriptions": "Steredenn: Binary Stars is the expanded version of Steredenn. Enjoy infinite replayability and unforgiving gameplay through intense boss fights, (almost) randomly generated environments, twisted space events and a massive arsenal of weapons."}, {"name": "Zwei: The Ilvard Insurrection", "details_link": "https://www.metacritic.com/game/pc/zwei-the-ilvard-insurrection", "publisher": "XSEED Games", "release_date": "Oct 31 2017", "developers": ["Falcom"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 79, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/be46f4ad3849f52d49253d07804327ab-98.jpg", "descriptions": "In a world where magic and technology exist side by side, vampire princess Alwen must reclaim her ancestral castle and her magic alongside her unlikely ally, treasure hunter Ragna Valentine. They may make for an odd pair, but when they combine their talents, the sky’s the limit!"}, {"name": "Torment: Tides of Numenera", "details_link": "https://www.metacritic.com/game/xbox-one/torment-tides-of-numenera", "publisher": "Techland", "release_date": "Feb 28 2017", "developers": ["InXile Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "Western-Style"], "meta_score": 79, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/e226266a4544aba2a32324fc31eca1b0-98.jpg", "descriptions": "Torment: Tides of Numenera is a single-player role-playing game which continues the thematic legacy of the critically acclaimed Planescape: Torment by having to face complex and nuanced morality decisions, carefully contemplating deep and reactive choices with consequences that echoTorment: Tides of Numenera is a single-player role-playing game which continues the thematic legacy of the critically acclaimed Planescape: Torment by having to face complex and nuanced morality decisions, carefully contemplating deep and reactive choices with consequences that echo throughout the game all the while immersed into a new and strange vision taken from by renowned designer and writer Monte Cook's new tabletop role-playing game, Numenera. In Torment: Tides of Numenera, players must decide for themselves the answer to the eternal question, what does one life matter? Numenera's Ninth World is a fantastic vision of a world in which massive civilizations continue to rise and fall with only cities, monuments, and artifacts left behind to serve as reminders of their past existence. These reminders have become part of the accumulated detritus of eons and now this assortment of ancient power, called the numenera, is there for the taking. One of these humans has discovered a way to harness the numenera to grow strong, to cheat death, to skip across the face of centuries in a succession of bodies. But he discovers an unexpected side effect: You.… Expand"}, {"name": "Hand of Fate", "details_link": "https://www.metacritic.com/game/playstation-4/hand-of-fate", "publisher": "Defiant Development", "release_date": "Feb 17 2015", "developers": ["Defiant Development"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Miscellaneous", "General", "Board / Card Game"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/21ca9dc5d827983e7f24eed3b6dcc2ce-98.jpg", "descriptions": "In Hand of Fate, players collect equipment, items, artifacts and enemies as in-game collectible cards in a card based RPG; then play their deck, bringing to video game life a beautiful 3D world in which gamers make difficult decisions.  Sometimes their choices have unexpected consequencesIn Hand of Fate, players collect equipment, items, artifacts and enemies as in-game collectible cards in a card based RPG; then play their deck, bringing to video game life a beautiful 3D world in which gamers make difficult decisions.  Sometimes their choices have unexpected consequences and players must crush their foes utilizing a third person action-adventure combat system. The more bosses a player defeats, the more cards they obtain.… Expand"}, {"name": "Outland", "details_link": "https://www.metacritic.com/game/pc/outland", "publisher": "Housemarque", "release_date": "Sep 29 2014", "developers": ["Housemarque", "Knockout Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Platformer", "2D"], "meta_score": 79, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/6bc33a24ab798ca03d3ee6237534980f-98.jpg", "descriptions": "Outland puts players in the middle of a world of balance and chaos where their efforts allow them to bridge the ancient divide, or doom the world to destruction. Each player's adventure will take them between light and darkness and force them to adapt to an ever-changing world. This lightOutland puts players in the middle of a world of balance and chaos where their efforts allow them to bridge the ancient divide, or doom the world to destruction. Each player's adventure will take them between light and darkness and force them to adapt to an ever-changing world. This light versus dark core gameplay is inspired by the arcade classic Ikaruga.… Expand"}, {"name": "Stick it to the Man!", "details_link": "https://www.metacritic.com/game/pc/stick-it-to-the-man!", "publisher": "Ripstone", "release_date": "Dec 13 2013", "developers": ["Zoink!"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 79, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/07c58848082617f8e21edc148f93b95b-98.jpg", "descriptions": "Meet Ray, he lives in a world where everything is made out of paper and stickers. One day he has an accident and wakes up with a giant pink spaghetti arm sticking out of his brain. This gives him awesome powers and he can suddenly change the world around him by folding it, tearing it,Meet Ray, he lives in a world where everything is made out of paper and stickers. One day he has an accident and wakes up with a giant pink spaghetti arm sticking out of his brain. This gives him awesome powers and he can suddenly change the world around him by folding it, tearing it, pulling stickers off and sticking them elsewhere! And if that weren't enough, Ray can also read peoples minds! Digging into the brains of his fellow citizens, Ray can hear their thoughts and use that to his advantage. Unfortunately, Ray doesn't have much time to get to grips with his new abilities. He is framed by 'The Man' with a crime he didn't commit, and is on the run. Can you help to get Ray out of this sticky situation?… Expand"}, {"name": "Street Fighter X Tekken", "details_link": "https://www.metacritic.com/game/pc/street-fighter-x-tekken", "publisher": "Capcom", "release_date": "May 11 2012", "developers": ["Capcom", "QLOC"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita", "Xbox 360", "PC"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "2D", "3D"], "meta_score": 79, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/3669cee6fbd921c71ab80221341b07d4-98.jpg", "descriptions": "\"Street Fighter\" is best known for its well-polished 2D game play, and \"Street Fighter IV\" is an exemplary addition to the series. And now, based on the \"Street Fighter IV\" engine, the \"TEKKEN\" characters will be stepping into the ring to fight.\"Street Fighter\" is best known for its well-polished 2D game play, and \"Street Fighter IV\" is an exemplary addition to the series. And now, based on the \"Street Fighter IV\" engine, the \"TEKKEN\" characters will be stepping into the ring to fight. Featuring two on two \"Tag Team Fighting\", and together with Battle and Training Modes, this title will push the series beyond its limits. … Expand"}, {"name": "Assault Heroes", "details_link": "https://www.metacritic.com/game/xbox-360/assault-heroes", "publisher": "Sierra Online", "release_date": "Dec 13 2006", "developers": ["Wanako Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 79, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/248a69f3a1ec9383de0a3fa8cb1edc87-98.jpg", "descriptions": "[Xbox Live Arcade]  As the only surviving members of an elite Special Forces unit, it is up to you to find the secret underground lab. Go the mission alone or fight side-by-side with a friend in the two-player cooperative mode. Navigate your heavily armed 4x4, speed boat or travel on foot[Xbox Live Arcade]  As the only surviving members of an elite Special Forces unit, it is up to you to find the secret underground lab. Go the mission alone or fight side-by-side with a friend in the two-player cooperative mode. Navigate your heavily armed 4x4, speed boat or travel on foot and blast your way through enemy-infested territory. Prepare to be assaulted by waves of formidable enemies with unrelenting attacks. Play online or offline two-player (same screen) cooperative mode with enhanced weapons to encourage teamwork. Operate an armed 4x4, speed boat or simply fight on foot to for a quick change of pace. Equip yourself with damaging Mini-Guns, Flak Cannons, Flamethrower, Grenades and Nukes to destroy everything in your path. Activate cooperative attacks with increased firepower and range (specific to co-op) to add new dimension to weapon capabilities. Features destructible terrain and advanced physics engine for the most engaging arcade experience. Most Intense Arcade Experience - Challenging and graphically compelling levels and bonus sublevels for fast-paced, and addictive play. [Sierra Online]… Expand"}, {"name": "Guilty Gear X", "details_link": "https://www.metacritic.com/game/playstation-2/guilty-gear-x", "publisher": "Sammy Studios", "release_date": "Sep 30 2001", "developers": ["Arc System Works"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/9e95e45db62ac31cc89b57bf4a7f0b4e-98.jpg", "descriptions": "A beautiful high-resolution 2D fighter featuring 14 wildly different combatants and an odd variety of weapons that redefine the term \"unconventional.\""}, {"name": "Perfect Dark", "details_link": "https://www.metacritic.com/game/xbox-360/perfect-dark", "publisher": "Microsoft Game Studios", "release_date": "Mar 17 2010", "developers": ["4J Studios"], "platforms": "Xbox 360", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 79, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/0c3c526f7270e3f2cfd71c6173214465-98.jpg", "descriptions": "[Xbox Live Arcade]  Agent Joanna Dark hit the ground running in Perfect Dark, an epic tale of galactic conspiracies in 2023 America. Now this classic shooter comes to Xbox LIVE Arcade, rendered in greater definition and detail and sporting a silkier framerate than ever before. Fire up your[Xbox Live Arcade]  Agent Joanna Dark hit the ground running in Perfect Dark, an epic tale of galactic conspiracies in 2023 America. Now this classic shooter comes to Xbox LIVE Arcade, rendered in greater definition and detail and sporting a silkier framerate than ever before. Fire up your Farsight and prepare for assignment—the Dark returns this winter. CLassic action: Play the original full game beautifully restored and back in full HD, 1080p at 60 frames per second! All the original game features are included plus new Xbox LIVE ones. [Xbox.com]… Expand"}, {"name": "Frozen Cortex", "details_link": "https://www.metacritic.com/game/pc/frozen-cortex", "publisher": "Mode 7 Games", "release_date": "Feb 19 2015", "developers": ["Mode 7 Games"], "platforms": "PC", "genres": ["General", "Sports", "Team", "Futuristic"], "meta_score": 79, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/59bdf207ddaddd44905a675f1e896f22-98.jpg", "descriptions": "A simultaneous-turn-based tactical game from the creators of Frozen Synapse. Defeat your opponent’s plans on a randomly-generated playfield in this brutal futuresport."}, {"name": "Burnout Paradise Remastered", "details_link": "https://www.metacritic.com/game/xbox-one/burnout-paradise-remastered", "publisher": "Electronic Arts", "release_date": "Mar 16 2018", "developers": ["Criterion Games", "STELLAR ENTERTAINMENT SOFTWARE LTD"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 79, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/05656c3cb2972b78b56c9b800981ad90-98.jpg", "descriptions": "Welcome back to Paradise City! Make action your middle name as you rule the streets in Burnout Paradise Remastered. Tear up the town from hectic downtown avenues to wild mountain roads. Relive the high-octane stunts and wanton destruction of one of the greatest arcade-driving games ever!Welcome back to Paradise City! Make action your middle name as you rule the streets in Burnout Paradise Remastered. Tear up the town from hectic downtown avenues to wild mountain roads. Relive the high-octane stunts and wanton destruction of one of the greatest arcade-driving games ever!Burnout Paradise Remastered provides the ultimate driving playground for you and your friends to play online. This remaster includes all DLC from the Year of Paradise, including the Big Surf Island update, meticulously recreated and ready to wreck in 4K on the PlayStation 4 Pro and Xbox One X.… Expand"}]