[{"name": "Rune Factory 4", "details_link": "https://www.metacritic.com/game/3ds/rune-factory-4", "publisher": "XSEED Games", "release_date": "Oct  1 2013", "developers": ["Neverland"], "platforms": ["Switch", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Breeding/Constructing", "General", "Action RPG", "Breeding/Constructing"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/160c6447a36beb915b26cd604c818a8f-98.jpg", "descriptions": "Rune Factory 4 marks the return of the popular Harvest Moon spinoff that combines farming with dungeon adventuring. For the first time in the series, the player can select to play as a male or female hero, and potential suitors of either gender are also available in order to pursue love,Rune Factory 4 marks the return of the popular Harvest Moon spinoff that combines farming with dungeon adventuring. For the first time in the series, the player can select to play as a male or female hero, and potential suitors of either gender are also available in order to pursue love, marriage, and possibly a child. As the newly-appointed prince or princess, you can fulfill your royal duties of protecting the town from invaders, or take a more rural approach to governing by raising your own fruits and vegetables and helping townsfolk. Should some dungeon adventuring be on the days itinerary, you can select from the castles vast armament of swords, spears, and staffs along with magic for battle against dangerous foes, or even bring along a companion or friendly monster to aid you during your travels.… Expand"}, {"name": "Thomas Was Alone", "details_link": "https://www.metacritic.com/game/playstation-vita/thomas-was-alone", "publisher": "Curve Studios", "release_date": "Apr 23 2013", "developers": ["Mike Bithell"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox One", "PlayStation Vita"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 78, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/0352bb6e9a9a97f8f1142b9c11783505-98.jpg", "descriptions": "Thomas won't be entirely alone, he'll be joined throughout by the awesome Mr Danny Wallace (XFM, Yes Man and Assassin's Creed) who will be narrating his adventures."}, {"name": "Little Nightmares", "details_link": "https://www.metacritic.com/game/playstation-4/little-nightmares", "publisher": "Bandai Namco Games", "release_date": "Apr 28 2017", "developers": ["Tarsier Studios"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General", "Linear"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/39fc8f8116743ab341d5ff8099293daf-98.jpg", "descriptions": "Immerse yourself in Little Nightmares, a dark whimsical tale that will confront you with your childhood fears. Help Six escape The Maw – a vast, mysterious vessel inhabited by corrupted souls looking for their next meal."}, {"name": "PlanetSide 2", "details_link": "https://www.metacritic.com/game/playstation-4/planetside-2", "publisher": "Daybreak Games", "release_date": "Jun 23 2015", "developers": ["Sony Online Entertainment", "Daybreak Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 64 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Tactical", "Arcade"], "meta_score": 78, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/cd1298428eff2c0cd181e52beb2b9783-98.jpg", "descriptions": "Across the continents of Auxraxis, thousands of players will come together in enormous battles to win control of critical territories and key resources for their empire. With an extensive skill tree and free-form class-based system, players will be able to customize their soldier, weapons,Across the continents of Auxraxis, thousands of players will come together in enormous battles to win control of critical territories and key resources for their empire. With an extensive skill tree and free-form class-based system, players will be able to customize their soldier, weapons, and vehicles to match their play-style, as well as the needs of their squad, outfit or empire. Battles can last for days or weeks, so players will need to build alliances and specialized combat outfits to take on long-term strategic and tactical initiatives. With air, ground and seaborne combat, the battles will be larger and more intense than ever.… Expand"}, {"name": "NHL 2K7", "details_link": "https://www.metacritic.com/game/xbox/nhl-2k7", "publisher": "2K Sports", "release_date": "Sep 12 2006", "developers": ["Kush Games"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Xbox"], "num_players": "8  Online", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/7b73db4293ba62c2ade05f7acb60eaed-98.jpg", "descriptions": "Hundreds of new skating animations have been captured for NHL 2K7. Not only will skating look much more natural, players will also experience the true momentum of skating whenever players dig into the ice to accelerate or carve the ice to make sudden stops. In addition to the numerous newHundreds of new skating animations have been captured for NHL 2K7. Not only will skating look much more natural, players will also experience the true momentum of skating whenever players dig into the ice to accelerate or carve the ice to make sudden stops. In addition to the numerous new skating animations, several new checking, passing, and shooting animations have been added, making all the action in NHL 2K7 flow with amazing detail. New gameplay enhancements have been added to Pro Control, giving users offensive and defensive tools to utilize on the ice. While on offense, players now have the ability to execute drop passes, allowing users to setup new screen plays and create new scoring opportunities to catch the goalie off-guard. Pressure Control brings a tactical element to defensive hockey as players now can instruct teammates to defend opposing players while on the ice. Varying degrees of pressure can be selected - whether it's telling your teammate to shadow a selected opponent or deliver a big check - allowing players new defensive options on the fly. Pro Control in NHL 2K7 delivers the offensive and defensive options hockey fans have been asking for, truly delivering the next generation of hockey.… Expand"}, {"name": "Klonoa Phantasy Reverie Series", "details_link": "https://www.metacritic.com/game/switch/klonoa-phantasy-reverie-series", "publisher": "Bandai Namco Games", "release_date": "Jul  8 2022", "developers": ["Bandai Namco Games", "MONKEYCRAFT Co. Ltd."], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/8acfa67e9b07d4782e0e7dd15fa2a83d-98.jpg", "descriptions": "Klonoa Phantasy Reverie Series brings back \"Klonoa: Door to Phantomile\" and \"Klonoa 2: Lunatea's Veil\" remastered in one collection to fans new and old. Get ready to set off on an adventure to save the world. Released initially in 1997 by Namco, Klonoa is a side-scrolling platformerKlonoa Phantasy Reverie Series brings back \"Klonoa: Door to Phantomile\" and \"Klonoa 2: Lunatea's Veil\" remastered in one collection to fans new and old. Get ready to set off on an adventure to save the world. Released initially in 1997 by Namco, Klonoa is a side-scrolling platformer featuring a colorful character roster and vibrant game world, it's up to you as Klonoa to embark on a journey to save Phantomile. For the franchise's momentous twenty-fifth birthday, Klonoa: Door to Phantomile and Klonoa 2: Lunatea's Veil are receiving the remaster treatment in a two-in-one set—titled KLONOA Phantasy Reverie Series slated to hit the Nintendo Switch™, PlayStation®5, PlayStation®4, Xbox Series X|S, Xbox One, and Steam. The graphics have received an elegant revamp while Klonoa's beloved world and classic gameplay have been faithfully preserved. The remaster also features an adjustable difficulty level, allowing franchise newcomers to delve right into the action, and long-time fans to get reacquainted with ease.… Expand"}, {"name": "Metal Slug 3", "details_link": "https://www.metacritic.com/game/xbox-360/metal-slug-3", "publisher": "SNK Playmore", "release_date": "Jan  2 2008", "developers": ["SNK Playmore"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/1157dbcebc809efe010da6ead6764fed-98.jpg", "descriptions": "Marco, Tarma, Eri, and Fio, the four veterans of the elite Sparrows Unit now come to Xbox Live in METAL SLUG 3! The popular action shooting series is in all of its original arcade glory, with gorgeous graphics and all the run-and-gun action you can handle. There is no time for indecision.Marco, Tarma, Eri, and Fio, the four veterans of the elite Sparrows Unit now come to Xbox Live in METAL SLUG 3! The popular action shooting series is in all of its original arcade glory, with gorgeous graphics and all the run-and-gun action you can handle. There is no time for indecision. General Morden is on the warpath and you must prevent him from creating the New World Order. Stop the Rebel Army! Multiple routes: Different routes through the stages allow for extended replayability. Different metal slugs: Various slugs are available for help in battle. Handle all the different slugs to learn their capabilities and complete the mission. Individual enemies: Different enemies appear depending on which route the player takes, and each enemy has its own unique characteristics. Classic arcade graphics: The classic graphics are faithfully reproduced for your gaming enjoyment. [SNK Playmore]… Expand"}, {"name": "GRID 2", "details_link": "https://www.metacritic.com/game/xbox-360/grid-2", "publisher": "Codemasters", "release_date": "May 28 2013", "developers": ["Codemasters"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 78, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/331dd9946a2c6917b83f4cac0ef15845-98.jpg", "descriptions": "Prove yourself against advanced AI in aggressive races. Catapult your way to the top of a new world of motorsport. A separate online campaign features full RaceNet integration. Race a handpicked selection of iconic cars that represent what some consider to be the best in automotiveProve yourself against advanced AI in aggressive races. Catapult your way to the top of a new world of motorsport. A separate online campaign features full RaceNet integration. Race a handpicked selection of iconic cars that represent what some consider to be the best in automotive engineering from the last 40 years. Take on challenging licensed tracks, city streets and lethal mountain roads. Prove yourself by entering and winning events across three continents.… Expand"}, {"name": "Tropico 6", "details_link": "https://www.metacritic.com/game/xbox-one/tropico-6", "publisher": "Kalypso", "release_date": "Sep 27 2019", "developers": ["Limbic Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Strategy", "Management", "Government"], "meta_score": 78, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/30a6ef03bed3fc8a3ebfadadd7b43b70-98.jpg", "descriptions": "El Presidente is back! Prove yourself once again as a feared dictator or peace-loving statesman on the island state of Tropico and shape the fate of your very own banana republic through four distinctive eras."}, {"name": "Atelier Shallie Plus: Alchemists of the Dusk Sea", "details_link": "https://www.metacritic.com/game/playstation-vita/atelier-shallie-plus-alchemists-of-the-dusk-sea", "publisher": "Koei Tecmo Games", "release_date": "Jan 17 2017", "developers": ["Gust"], "platforms": ["PlayStation 3", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/0e441634dc863f066b3f307b3a434a5c-98.jpg", "descriptions": "Choose to play as either the reserved, mission-focused Shallistera or as ambitious, energetic Shallotte. While their personalities and appearance are drastically different, both girls share the nickname \"Shallie.\" Shallistera is the daughter of a tribal leader who embarks on aChoose to play as either the reserved, mission-focused Shallistera or as ambitious, energetic Shallotte. While their personalities and appearance are drastically different, both girls share the nickname \"Shallie.\" Shallistera is the daughter of a tribal leader who embarks on a voyage to find a solution to the crisis affecting her homeland. Shallotte, on the other hand, has been struggling to bring success to the alchemy workshop since the passing of her father. Uncover each of their journeys using the dual main character system, which has been improved with multiple separate stories and endings for Shallistera and Shallotte.… Expand"}, {"name": "Medal of Honor: Airborne", "details_link": "https://www.metacritic.com/game/pc/medal-of-honor-airborne", "publisher": "Electronic Arts", "release_date": "Sep  4 2007", "developers": ["Electronic Arts"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "12  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 78, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/8503112aadac9e9248afae1f03c2375f-98.jpg", "descriptions": "Step into the boots of Boyd Travers, Private First Class of the 82nd Airborne Division and engage in battles throughout Europe. From rocky beginnings in Sicily to war-winning triumphs in Germany, each mission begins behind enemy lines, with an intense and fully interactive airdrop. YourStep into the boots of Boyd Travers, Private First Class of the 82nd Airborne Division and engage in battles throughout Europe. From rocky beginnings in Sicily to war-winning triumphs in Germany, each mission begins behind enemy lines, with an intense and fully interactive airdrop. Your ability to determine your own starting point dramatically changes the way each mission plays out. View the entire operation from the air, and then control your parachute to choose your landing spot. On the ground, gather your senses and assess the terrain. A wide variety of authentic, customizable weapons are at your disposal, each with distinct characteristics. Choose your path in this free roaming FPS environment. Medal of Honor Airborne also features exceptionally photo-realistic characters, adding to the intensity of the cinematic, story-driven game. [Electronic Arts]… Expand"}, {"name": "Rebelstar: Tactical Command", "details_link": "https://www.metacritic.com/game/game-boy-advance/rebelstar-tactical-command", "publisher": "Namco", "release_date": "Sep  6 2005", "developers": ["Codo Games"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Strategy", "Turn-Based", "Sci-Fi"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/10f9244fd7edfbef2e645996cac50f67-98.jpg", "descriptions": "You can play as the leader of a revolt in the turn-based strategy game Rebelstar: Tactical Command. The Arelian Empire seized control of Earth 70 years ago and has since become an oppressive regime, controlling the world with fear and marauding shock troops. You can fight back by equipping aYou can play as the leader of a revolt in the turn-based strategy game Rebelstar: Tactical Command. The Arelian Empire seized control of Earth 70 years ago and has since become an oppressive regime, controlling the world with fear and marauding shock troops. You can fight back by equipping a team of rebels and controlling them in battle. Rebelstar: Tactical Command includes campaign, skirmish, multiplayer hotseat, and multiplayer link mode.… Expand"}, {"name": "A Kingdom for Keflings", "details_link": "https://www.metacritic.com/game/xbox-360/a-kingdom-for-keflings", "publisher": "NinjaBee", "release_date": "Nov 19 2008", "developers": ["NinjaBee"], "platforms": ["PC", "Xbox 360"], "num_players": "4  Online", "genres": ["Strategy", "Breeding/Constructing", "General", "Breeding/Constructing"], "meta_score": 78, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/fb57f973b923c4d0a7a5aaef6394ee88-98.jpg", "descriptions": "[Xbox Live Arcade]  Place your customized Xbox LIVE Avatar in the medieval world of A Kingdom for Keflings, a new city-building game from NinjaBee. Play as your Avatar or choose from other friendly giants as you teach the local Keflings how to collect and convert resources to customize your[Xbox Live Arcade]  Place your customized Xbox LIVE Avatar in the medieval world of A Kingdom for Keflings, a new city-building game from NinjaBee. Play as your Avatar or choose from other friendly giants as you teach the local Keflings how to collect and convert resources to customize your kingdom. Educate and train your Keflings to become workers, scholars, even Mayor of the city! Build your kingdom alone or cooperatively with up to three of your friends online. The more you build, the more buildings you unlock and the more Keflings you attract, so start building today! City-building fun: In an original approach to a well-loved genre, A Kingdom for Keflings features a large avatar interacting with the Keflings, resources, and buildings of a small village. Resources and Keflings can be converted from one type to another. Buildings can be built and upgraded with a combination of specific resources and specific Kefling types. Buildings in turn make new resources and Kefling types available, unlock new building types, attract more Keflings, and achieve other game goals. It's the first game of its kind on Xbox LIVE Arcade to support full in-game playable avatars. Move your avatar around, pick up the Keflings and pop them into buildings. Customization: Make your city your own by customizing the look and color of buildings, and decorating the village with additional elements such as trees and walkways. The time of the season: Stylized animated graphics change with the seasons, and a dynamic music soundtrack (which adapts to the season and the state of the village) gives the game an unusually strong sense of life and activity. Co-op play: Build cities online cooperatively with your friends. [Microsoft]… Expand"}, {"name": "Red Faction", "details_link": "https://www.metacritic.com/game/pc/red-faction", "publisher": "THQ", "release_date": "Sep 17 2001", "developers": ["Volition Inc."], "platforms": ["PlayStation 2", "PlayStation 4", "PC"], "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/c58e57e2fd9a861377c39b77d801c438-98.jpg", "descriptions": "This first-person shooter features Geo-Mod? technology, the ability to completely alter and destroy the environment in real-time. Wage war through 20 diverse levels with 15 weapons of mass destruction. Hijack 5 fully armed land, sea and air vehicles.  [THQ]"}, {"name": "Rain on Your Parade", "details_link": "https://www.metacritic.com/game/switch/rain-on-your-parade", "publisher": "Unbound Creations", "release_date": "Apr 15 2021", "developers": ["Unbound Creations"], "platforms": ["PC", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/1d18fa31715d7cf555fe328e90f71037-98.jpg", "descriptions": "Rain on Your Parade is a slapstick comedy game where you play as a mischievous cloud determined to ruin everybody’s day. Play across a wide range of levels while unlocking new abilities and mechanics that get progressively more ridiculous. Travel across the world, inventing new ways ofRain on Your Parade is a slapstick comedy game where you play as a mischievous cloud determined to ruin everybody’s day. Play across a wide range of levels while unlocking new abilities and mechanics that get progressively more ridiculous. Travel across the world, inventing new ways of causing chaos and mayhem. Turn the perfectly dry and sunny wedding day into a wet one, unleash thunder and lightning upon the cities, bring pandemonium to supermarket shoppers, destroy farmer’s crops, sneak around military bases and rain down meteors on dinosaurs! Yes, not even the dinosaurs are safe! As you progress in the game you will unlock new and more comical methods of causing bedlam. Use thunder and lightning to scare people out of hiding and set things alight, tornadoes to suck up everything that gets in its path, rain explosive material that you can blow up and even entire meteors and much more.… Expand"}, {"name": "The Sojourn", "details_link": "https://www.metacritic.com/game/pc/the-sojourn", "publisher": "Iceberg Interactive", "release_date": "Sep 20 2019", "developers": ["Shifting Tides"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 78, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/836494d82618ae0a60f84407accdf3e5-98.jpg", "descriptions": "Traverse a thought-provoking puzzle game and its immersive color-drenched world of light and shadow. The Sojourn takes place in a mysterious land, where lights guide you forward and the world reveals itself to be full of challenges. Overcome these intricate and ever more demanding obstaclesTraverse a thought-provoking puzzle game and its immersive color-drenched world of light and shadow. The Sojourn takes place in a mysterious land, where lights guide you forward and the world reveals itself to be full of challenges. Overcome these intricate and ever more demanding obstacles to uncover the nature of reality.… Expand"}, {"name": "Disney's Extreme Skate Adventure", "details_link": "https://www.metacritic.com/game/playstation-2/disneys-extreme-skate-adventure", "publisher": "Activision", "release_date": "Sep  3 2003", "developers": ["Toys for Bob"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/b708896e4115b760f298e9e342556eff-98.jpg", "descriptions": "Disney's Extreme Skate Adventure marks the first time Buzz Lightyear and Woody from Walt Disney Pictures' presentation of Pixar Animation Studios' \"Toy Story 2,\" Young Tarzan and Terk from Disney's \"Tarzan\" and Simba and Rafiki from \"The Lion King\" have been showcased in the same video game.Disney's Extreme Skate Adventure marks the first time Buzz Lightyear and Woody from Walt Disney Pictures' presentation of Pixar Animation Studios' \"Toy Story 2,\" Young Tarzan and Terk from Disney's \"Tarzan\" and Simba and Rafiki from \"The Lion King\" have been showcased in the same video game.  Players skate as their favorite characters, performing moves such as ollies, rail grinds, spins and other expert balance moves.  The characters from the films can skate through each of their respective worlds, such as Simba and Rafiki in Pride Rock, Young Tarzan and Terk in the \"Jungle Treehouse\" and Disney/Pixar's Buzz Lightyear and Woody in Pizza Planet, and interact with the other characters that live in those worlds.  The game also provides an abundance of fun and offers players unique skateboards that resemble items found in their respective worlds including bamboo rafts, frying pans and other themed items.  Beyond the skateboard challenge there are puzzles to solve, secret areas to explore and collectibles to find on each level of the game. [Activision]… Expand"}, {"name": "Stronghold: Crusader", "details_link": "https://www.metacritic.com/game/pc/stronghold-crusader", "publisher": "Gathering", "release_date": "Sep 25 2002", "developers": ["FireFly Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 78, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/2/2ac388d166cdffabfbec916bfb4f08e7-98.jpg", "descriptions": "Journey to distant lands renowned for brave warriors and fearsome weaponry. This highly anticipated successor to the best-selling Stronghold combines the finest aspects from a City Builder and a Real-Time Strategy game. Lead a determined group of crusaders, forged by centuries of barbaricJourney to distant lands renowned for brave warriors and fearsome weaponry. This highly anticipated successor to the best-selling Stronghold combines the finest aspects from a City Builder and a Real-Time Strategy game. Lead a determined group of crusaders, forged by centuries of barbaric conflicts, or wage war against a powerful foreign invader amidst the haze of the desert heat. Within impenetrable walls beats the heart of a thriving society full of Fletchers, Brewers, and Armourers, while outside stalk enemy Assassins, mighty War Engines, and the constant threat of fire! As European nobles or Arabian warriors, conquer this unforgiving wasteland, defend desert fortresses, and lay siege to fearless enemies during the legendary Crusades of the 11th and 12th centuries! [God Games]… Expand"}, {"name": "Dragon Warrior VII", "details_link": "https://www.metacritic.com/game/playstation/dragon-warrior-vii", "publisher": "Enix Corporation", "release_date": "Oct 31 2001", "developers": ["Heart Beat"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/628275b359d9b7831c13becd4aabbfd1-98.jpg", "descriptions": "You plan to become a humble fisherman of peaceful Estard Island, the only land in a world of ocean. But when you discover the artifacts from an ancient land, you tear the fabric of time and unveil the world that once was. Transported to past lands, you must solve their mysteries and breakYou plan to become a humble fisherman of peaceful Estard Island, the only land in a world of ocean. But when you discover the artifacts from an ancient land, you tear the fabric of time and unveil the world that once was. Transported to past lands, you must solve their mysteries and break the spell of annihilation. Prepare for your destiny!… Expand"}, {"name": "NHL Hitz 20-02", "details_link": "https://www.metacritic.com/game/playstation-2/nhl-hitz-20-02", "publisher": "Midway", "release_date": "Sep 24 2001", "developers": ["Black Box"], "platforms": "PlayStation 2", "num_players": "1-6 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Arcade"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/ed4370e39c060f69f7865a2187bb82bb-98.jpg", "descriptions": "Extreme, arcade-style 3-on-3 hockey action featuring \"on fire\" pucks, players, and teams, \"big\" player models, fantasy stadiums, along with exhibition, championship, and franchise modes."}, {"name": "Konami Krazy Racers", "details_link": "https://www.metacritic.com/game/game-boy-advance/konami-krazy-racers", "publisher": "Konami", "release_date": "Jun 10 2001", "developers": ["KCEK"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/16f84c1e61abe0a57677cfcbc6b63774-98.jpg", "descriptions": "Race your favorite Konami characters through 16 action packed, fun-filled courses on your way to the checkered flag! 16 challenging courses showcase the power of hame Boy Advance graphics, including Cyber Field, Ice Paradise, Pop 'n Beach, Skybridge, and many more! 8 Classic KonamiRace your favorite Konami characters through 16 action packed, fun-filled courses on your way to the checkered flag! 16 challenging courses showcase the power of hame Boy Advance graphics, including Cyber Field, Ice Paradise, Pop 'n Beach, Skybridge, and many more! 8 Classic Konami characters to choose from, including Ninja from Metal Gear Solid, Dracula of Castlevania fame, and Goemon the Mystical Ninja.… Expand"}, {"name": "Summoner", "details_link": "https://www.metacritic.com/game/pc/summoner", "publisher": "THQ", "release_date": "Mar 21 2001", "developers": ["Volition Inc."], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/901fa019388f3b4d55b7a425c8fce7e7-98.jpg", "descriptions": "Volition's first RPG, a truly 3-D RPG played from a third-person perspective which was praised as a launch title on the PS2, features Joseph, a young summoner who learns to use and control his powers while attempting to overthrow the evil tyranny that has beset his world."}, {"name": "Armored Core 2", "details_link": "https://www.metacritic.com/game/playstation-2/armored-core-2", "publisher": "Agetec Inc.", "release_date": "Oct 24 2000", "developers": ["From Software"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/5321591d792cd7618a0f24e30fc8e978-98.jpg", "descriptions": "The sequel to Armored Core takes the action to Mars where the Ravens battle for their corporations. In Armored Core 2, you'll enter new battle arenas and challenge more than 45 menacing Armored Core units. Customize your AC unit's 200 parts, including interior equipment and extension packs,The sequel to Armored Core takes the action to Mars where the Ravens battle for their corporations. In Armored Core 2, you'll enter new battle arenas and challenge more than 45 menacing Armored Core units. Customize your AC unit's 200 parts, including interior equipment and extension packs, and use over-boost propulsion to generate lightning speed. One or two players can go head-to-head in split-screen battles using more than 200 customizable parts that feature interior equipment and extension packs. … Expand"}, {"name": "Madden NFL 2001", "details_link": "https://www.metacritic.com/game/pc/madden-nfl-2001", "publisher": "EA Sports", "release_date": "Aug 24 2000", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 78, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/76a87445b27098443c82ae772e4dad3a-98.jpg", "descriptions": "Get ready for a dose of bone-crunching football action on the PlayStation 2 with Madden NFL 2001. Madden NFL 2001 features an all-new and exclusive NFL Coaches Club license, which means you'll see coaches on the sidelines and hear them yelling encouragement, comments and criticisms. MaddenGet ready for a dose of bone-crunching football action on the PlayStation 2 with Madden NFL 2001. Madden NFL 2001 features an all-new and exclusive NFL Coaches Club license, which means you'll see coaches on the sidelines and hear them yelling encouragement, comments and criticisms. Madden 2001 also features individualized details, easy-to-use interface, dynamically enhanced audio and play-by-play recorded with John Madden and his broadcast partner, Pat Summerall, and more!… Expand"}, {"name": "ATV Offroad Fury 3", "details_link": "https://www.metacritic.com/game/playstation-2/atv-offroad-fury-3", "publisher": "SCEA", "release_date": "Nov  2 2004", "developers": ["Climax Group"], "platforms": "PlayStation 2", "num_players": "6  Online", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/02bd4ab7b3010303c62d09f7b36b2af1-98.jpg", "descriptions": "ATV Offroad Fury 3 provides intense, free-roaming offroad racing gameplay, packed with additional courses, larger environments, extra modes, mini-games, more ATVs, online gameplay via the Network Adaptor and future support for the internal Hard Disk Drive. Through both on- and offlineATV Offroad Fury 3 provides intense, free-roaming offroad racing gameplay, packed with additional courses, larger environments, extra modes, mini-games, more ATVs, online gameplay via the Network Adaptor and future support for the internal Hard Disk Drive. Through both on- and offline gameplay, players tear it up anywhere and blaze their own trail, choosing from more than 24 highly detailed ATVs ? including six competing ATVs in all singleplayer and multiplayer modes that offer varied gameplay. With visually stunning backgrounds featuring water and mud effects and fully interactive objects and instances such as ramps, tires, cones and trees, ATV Offroad Fury 3 includes new short track, one-day events and Olympic championships. Playable from both first- and third-person perspectives, ATV Offroad Fury 3 features two main modes of play containing race, freestyle, career, mini-games and multiplayer games. Other modes will include a training course and waypoint editor. In ATV Offroad Fury 3, players will have the ability to race in more than 30 unique environments with six distinct terrain types including snow, dirt, mud, ice, water and grass, as well as compete in eight exciting mini-games including king of the hill, treasure hunt, tag, hockey, soccer, basketball and pre-load ? to play in all multi-player modes. Supporting up to six players online with voice-chat capabilities via the USB Headset, ATV Offroad Fury 3, includes a new comprehensive online scoreboard system that records event data for players and clans within all race types. [SCEA]… Expand"}, {"name": "Bugsnax", "details_link": "https://www.metacritic.com/game/switch/bugsnax", "publisher": "Young Horses, Inc", "release_date": "Apr 28 2022", "developers": ["Young Horses", "Inc"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Open-World", "First-Person"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/020c8d5eff15affee01dc5f475fe3794-98.jpg", "descriptions": "Explore whimsical Snaktooth Island in search of answers and a snack, maybe. \r\rIn this first-person adventure, you play as a journalist who receives a mysterious film from the disgraced explorer, Elizabert Megafig. She's invited you to Snaktooth Island to witness her latest and greatestExplore whimsical Snaktooth Island in search of answers and a snack, maybe. \r\rIn this first-person adventure, you play as a journalist who receives a mysterious film from the disgraced explorer, Elizabert Megafig. She's invited you to Snaktooth Island to witness her latest and greatest discovery: Bugsnax! Lured by the promise of a great story, you travel to the island to interview Elizabert and her group of misfit grumpuses. In the pursuit of your big scoop, you get caught up in hunting Bugsnax, feeding grumpuses, and solving the mysteries of the island\r * What are these half-bug half-snack creatures, really?\r* How do they affect the bodies of those who eat them?\r* And most importantly, why do they taste SO GOOD!? \r\rWe are what we eat\rBugsnax takes you on a whimsical adventure to Snaktooth Island, home of the legendary half-bug half-snack creatures, Bugsnax. Invited by intrepid explorer Elizabert Megafig, you arrive to discover your host nowhere to be found, her camp in shambles, and her followers scattered across the island alone... and hungry!\r It's up to you to solve the mysteries of Snaktooth Island: What happened to Lizbert? What are Bugsnax and where do they come from? But most of all, why do they taste SO GOOD? \r\rKey features: \r\r* Discover, hunt, and capture all 100 different species of Bugsnax using a variety of contraptions and bait! \r* Explore the diverse biomes of Snaktooth Island to track down and reunite the inhabitants of Snaxburg. \r* Stuff your new friends with Bugsnax to customize them with countless new looks. \r* Follow every lead to learn more about Lizbert's band of misfits and the mysteries of Snaktooth Island.… Expand"}, {"name": "Death Squared", "details_link": "https://www.metacritic.com/game/switch/death-squared", "publisher": "SMG Studio", "release_date": "Jul 13 2017", "developers": ["SMG Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["General", "Puzzle", "Action"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/c1980c1a055db7e2b91226515402eb0e-98.jpg", "descriptions": "Death Squared is a cooperative puzzle game for 1, 2, or 4 players, best enjoyed with loved ones who don't mind a little arguing for the greater good. Prove your teamwork skills in Death Squared as you solve puzzles together or die trying! Each player needs to guide a robot to a color-codedDeath Squared is a cooperative puzzle game for 1, 2, or 4 players, best enjoyed with loved ones who don't mind a little arguing for the greater good. Prove your teamwork skills in Death Squared as you solve puzzles together or die trying! Each player needs to guide a robot to a color-coded goal, but the path is beset with deadly traps and hazards. Teams of players will need close observation and communication to keep each other alive and discover a solution together. Complete the main campaign with 1 or 2 players, then take a group into 4-player Party Mode for the ultimate teamwork trial! For those that can't get enough, head to the 'Vault' to find extra experiments recommended only for the brave. [Nintendo.com]… Expand"}, {"name": "Wargame: Red Dragon", "details_link": "https://www.metacritic.com/game/pc/wargame-red-dragon", "publisher": "Focus Home Interactive", "release_date": "Apr 17 2014", "developers": ["Eugen Systems"], "platforms": "PC", "num_players": "Up to 20 ", "genres": ["Strategy", "Real-Time", "Historic", "Tactics"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/62209e6d3f8ec2bba1f9b686b3a952f3-98.jpg", "descriptions": "The Wargame series returns to duty, larger, richer and more spectacular than ever before. In Wargame Red Dragon, you are engaged in a large-scale conflict where Western forces clash against the Communist bloc."}, {"name": "Life is Strange: True Colors", "details_link": "https://www.metacritic.com/game/switch/life-is-strange-true-colors", "publisher": "Square Enix", "release_date": "Dec  7 2021", "developers": ["Deck Nine Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/8c916bf2c4a4ca06b160625340413be8-98.jpg", "descriptions": "A bold new era of the award-winning Life is Strange begins, with an all-new playable lead character and a thrilling mystery to solve!Alex Chen has long suppressed her 'curse': the supernatural ability to experience, absorb and manipulate the strong emotions of others, which she sees asA bold new era of the award-winning Life is Strange begins, with an all-new playable lead character and a thrilling mystery to solve!Alex Chen has long suppressed her 'curse': the supernatural ability to experience, absorb and manipulate the strong emotions of others, which she sees as blazing, colored auras.When her brother dies in a so-called accident, Alex must embrace her volatile power to find the truth and uncover the dark secrets buried by a small town.… Expand"}, {"name": "Inazuma Eleven", "details_link": "https://www.metacritic.com/game/3ds/inazuma-eleven", "publisher": "Level 5", "release_date": "Feb 13 2014", "developers": ["Level 5"], "platforms": "3DS", "genres": ["Sports", "Traditional", "Team", "Soccer", "Arcade"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/20d74096d2922bf1c8e870dd5d5febed-98.jpg", "descriptions": "Take the world of soccer by storm! Genres collide in this soccer RPG!\r The original world-renowned soccer RPG INAZUMA ELEVEN is now available for digital download!\r\n\r\nNobody loves soccer like Mark Evans. As captain of the Raimon Junior High soccer club, he dreams of taking his team to theTake the world of soccer by storm! Genres collide in this soccer RPG!\r The original world-renowned soccer RPG INAZUMA ELEVEN is now available for digital download!\r Nobody loves soccer like Mark Evans. As captain of the Raimon Junior High soccer club, he dreams of taking his team to the top and winning the legendary Soccer Frontier championship. Unfortunately for him, nobody else in the club shares his passion... until theyre thrown into a match against the elite Royal Academy for the club's survival. It seems the only way Raimon will stand a chance is if Mark can convince new transfer student and ace striker Axel Blaze to come out of his mysterious early retirement...\r Train your team, find items, and level up; then take to the field for some tactical soccer action. The more soccer battles you win, the more special moves youll learn, and the stronger your team will be!\r Take on fierce opponents in eleven-on-eleven soccer matches!\r Field over 1000 potential recruits to craft your custom team and challenge your friends via local wireless play!\r The first few episodes of the INAZUMA ELEVEN anime are now available on the Nintendo eShop for FREE… Expand"}, {"name": "WWE SmackDown vs. Raw 2007", "details_link": "https://www.metacritic.com/game/psp/wwe-smackdown-vs-raw-2007", "publisher": "THQ", "release_date": "Dec  6 2006", "developers": ["Yuke's"], "platforms": ["PlayStation 2", "Xbox 360", "PSP"], "num_players": "1-4 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/9b9ef8a7801816acfacd35ee011ae250-98.jpg", "descriptions": "A brand new Analog Control System makes fighting more realistic than ever with intuitive movement and new elements of control. An enhanced Season Mode provides multiple branching storylines and unprecedented levels of player choice. In and out of the ring, dozens of user-controlledA brand new Analog Control System makes fighting more realistic than ever with intuitive movement and new elements of control. An enhanced Season Mode provides multiple branching storylines and unprecedented levels of player choice. In and out of the ring, dozens of user-controlled environmental hotspots let players take advantage of anything at their disposal to inflict damage on opponents in new and unique ways. Additionally, new high impact combination moves let players take the power of WWE Superstars into their own hands. Experience the intensity of WWE fans in a brand new, fully loaded interactive fighting area. Players can take advantage of multiple weapons, environmental damage and grabbing signs and weapons from the crowd. WWE SmackDown vs. RAW 2007 offers multiple enhancements, including incredible high definition graphics, updated rosters for both RAW and SmackDown, an expanded General Manager Mode, online multiplayer game play with voice chat support and more. [THQ]… Expand"}, {"name": "MySims Agents", "details_link": "https://www.metacritic.com/game/wii/mysims-agents", "publisher": "Electronic Arts", "release_date": "Sep 29 2009", "developers": ["Electronic Arts"], "platforms": "Wii", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/bd64ab3b8ac2874625e49f0e307699ad-98.jpg", "descriptions": "In MySims Agents players take on the role of a special agent hired to foil the sinister plans of Morcubus, lord of the criminal underworld. By recruiting different MySims, each with their own special characteristics, players can build up their very own crime-busting dream team. From trackingIn MySims Agents players take on the role of a special agent hired to foil the sinister plans of Morcubus, lord of the criminal underworld. By recruiting different MySims, each with their own special characteristics, players can build up their very own crime-busting dream team. From tracking footprints and using forensics to picking locks, hacking into computers, following leads and collecting clues, players must rely on their wits, skills and trusty gadgets to piece together the clues to solve the mystery.  Jump aboard the jet to reach an ancient temple, a spooky mansion or an icy mountaintop chalet in search of clues that lead players closer to the sinister Morcubus. Return from the adventure with cool treasures that players can use to construct and customize their headquarters and make it their own. [Electronic Arts]… Expand"}, {"name": "Shin Megami Tensei: Devil Survivor Overclocked", "details_link": "https://www.metacritic.com/game/3ds/shin-megami-tensei-devil-survivor-overclocked", "publisher": "Atlus", "release_date": "Aug 23 2011", "developers": ["Atlus"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "General", "Tactics"], "meta_score": 78, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/811666d0923d43c6b6f32af869830ab0-98.jpg", "descriptions": "Expanded and enhanced, Devil Survivor Overclocked for Nintendo 3DS builds upon the game's original release with the addition of voice acting for the entirety of the game's lengthy, unconventional narrative.  Moreover, that very story, already boasting multiple endings based on criticalExpanded and enhanced, Devil Survivor Overclocked for Nintendo 3DS builds upon the game's original release with the addition of voice acting for the entirety of the game's lengthy, unconventional narrative.  Moreover, that very story, already boasting multiple endings based on critical decisions by the player, now concludes with a special eighth chapter, a rousing epilogue for Shin Megami Tensei fans.  The game's beautifully remastered hand drawn artwork and character portraits benefit from the new system's higher resolution screens, offering players a crisper, higher fidelity experience.… Expand"}, {"name": "NBA 2K20", "details_link": "https://www.metacritic.com/game/playstation-4/nba-2k20", "publisher": "2K Games", "release_date": "Sep  6 2019", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Sim"], "meta_score": 78, "users_score": 1.4, "image": "https://static.metacritic.com/images/products/games/1/88d59e6788a3aa46f3561b3423b9a502-98.jpg", "descriptions": "From the blacktop to the hardwood and throughout the Neighborhood, NBA 2K20 and its next level features are the closest thing to actually playing in the league. Welcome to the Next. Put your career on the line to stand up for what you believe in. Executive produced by LeBron James &From the blacktop to the hardwood and throughout the Neighborhood, NBA 2K20 and its next level features are the closest thing to actually playing in the league. Welcome to the Next. Put your career on the line to stand up for what you believe in. Executive produced by LeBron James & SpringHill Entertainment, this year’s MyCAREER experience features topical storylines, true-to-life basketball characters, and a star-studded cast. [Take 2 Interactive]… Expand"}, {"name": "Dandy Dungeon: Legend of Brave Yamada", "details_link": "https://www.metacritic.com/game/switch/dandy-dungeon-legend-of-brave-yamada", "publisher": "Onion Games", "release_date": "Jun 27 2019", "developers": ["DMM GAMES", "Onion Games"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/a35bad5ce3ed3d766ee08ee0628f7bb9-98.jpg", "descriptions": "Yamada-kun (Age 36) is a programmer at a major game publisher. He hates his job. Alone in his apartment, deep into the night, he toils to create a game of his own: it's an RPG, and he is the hero, Brave Yamada! One day, he falls for his new neighbor Maria-chan. To nurture these feelings,Yamada-kun (Age 36) is a programmer at a major game publisher. He hates his job. Alone in his apartment, deep into the night, he toils to create a game of his own: it's an RPG, and he is the hero, Brave Yamada! One day, he falls for his new neighbor Maria-chan. To nurture these feelings, adds Princess Maria into his game! Will they find love? … Expand"}, {"name": "Forager", "details_link": "https://www.metacritic.com/game/pc/forager", "publisher": "Humble Bundle", "release_date": "Apr 18 2019", "developers": ["HopFrog"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/3a65498849d0315f35bbf4bf9e741ab7-98.jpg", "descriptions": "The highly popular and quirky idle game that you want to actively keep playing. Explore, craft, gather & manage resources, find secrets and build your base out of nothing. Buy land to explore and expand!"}, {"name": "Bridge Constructor Portal", "details_link": "https://www.metacritic.com/game/xbox-one/bridge-constructor-portal", "publisher": "Headup Games", "release_date": "Feb 28 2018", "developers": ["ClockStone Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Puzzle", "Action", "Virtual", "Career"], "meta_score": 78, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/89eec828e4b3ab2b1904fa030429b7ec-98.jpg", "descriptions": "Enter the Aperture Science Enrichment Center and experience Bridge Constructor Portal – the unique merging of the classic Portal and Bridge Constructor games. As a new employee in the Aperture Science test lab, it's your job to build bridges, ramps, slides, and other constructions in 60 testEnter the Aperture Science Enrichment Center and experience Bridge Constructor Portal – the unique merging of the classic Portal and Bridge Constructor games. As a new employee in the Aperture Science test lab, it's your job to build bridges, ramps, slides, and other constructions in 60 test chambers and get the Bendies safely across the finish line in their vehicles. Make use of the many Portal gadgets, like portals, propulsion gel, repulsion gel, aerial faith plates, cubes, and more to bypass the sentry turrets, acid pools and laser barriers, solve switch puzzles, and make it through the test chambers unscathed. Let Ellen McLain, the original voice of GLaDOS, guide you through the tutorial, and learn all the tips and tricks that make a true Aperture Science employee. The bridge is a lie!… Expand"}, {"name": "This War of Mine: The Little Ones", "details_link": "https://www.metacritic.com/game/playstation-4/this-war-of-mine-the-little-ones", "publisher": "Deep Silver", "release_date": "Jan 29 2016", "developers": ["11 bit studios"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Miscellaneous", "Action Adventure", "Real-Time", "Survival", "Board / Card Game", "General"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/0dbde329531a429c151fdfc3ee1b8d80-98.jpg", "descriptions": "This War of Mine: The Little Ones explores the hardships of wartime survival as seen from an entirely new perspective; that of a child.\r Based on This War of Mine, The Little Ones puts you in charge of a group of adults and children stuck in the middle of hell, trying to survive in aThis War of Mine: The Little Ones explores the hardships of wartime survival as seen from an entirely new perspective; that of a child.\r Based on This War of Mine, The Little Ones puts you in charge of a group of adults and children stuck in the middle of hell, trying to survive in a besieged city; struggling with lack of food, medicine and constant danger. The question is: how far will you go to make it through another day?\r This War of Mine: The Little Ones focuses not only on the reality of enduring war, but also the fact that even in times of conflict, kids are still kids - they laugh, cry, play with toys and see the world differently. In addition to thinking about survival, you'll have to bring back the kid in yourself to understand how to protect the little ones. Their faith, and their futures, are in your hands.\r The pace of This War of Mine is imposed by the day and night cycle. During the day snipers outside stop you from leaving your refuge, so you need to focus on maintaining your hideout: crafting, trading and taking care of young and adult civilians. At night, take one of your people on a mission to scavenge through a city for items that will help you stay alive.… Expand"}, {"name": "Need for Speed: Carbon", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-carbon", "publisher": "EA Games", "release_date": "Oct 31 2006", "developers": ["Black Box", "EA Black Box"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Driving", "Racing", "Simulation", "Arcade", "GT / Street", "GT / Street", "Automobile"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/bd97721fc2cc2efc59087686e66bf87b-98.jpg", "descriptions": "What starts in the city is settled in the canyons as Need for Speed Carbon immerses you into the world's most dangerous and adrenaline-filled form of street racing. You and your crew must race in an all-out war for the city, risking everything to take over your rivals' neighborhoods oneWhat starts in the city is settled in the canyons as Need for Speed Carbon immerses you into the world's most dangerous and adrenaline-filled form of street racing. You and your crew must race in an all-out war for the city, risking everything to take over your rivals' neighborhoods one block at a time. As the police turn up the heat, the battle ultimately shifts to Carbon Canyon, where territories and reputations can be lost on every perilous curve. Need for Speed Carbon delivers the next generation of customization giving you the power to design and tweak your crew's cars in every way using the ground-breaking new Autosculpt technology. Represent your car class, your crew, and your turf in Need for Speed Carbon, the next revolution in racing games. [Electronic Arts]… Expand"}, {"name": "Top Gear Rally", "details_link": "https://www.metacritic.com/game/game-boy-advance/top-gear-rally", "publisher": "Nintendo", "release_date": "Oct 28 2003", "developers": ["Tantalus"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/86f4c687659613e14bfc6cc8584a4e49-98.jpg", "descriptions": "Hop in the driver's seat of a freewheeling rally car in Top Gear Rally. You can hone your driving skills in Practice, Quick Race, and Time Attack modes before shifting into Championship mode. If you're among the fastest cars to cross the finish line, you'll earn points that can unlock moreHop in the driver's seat of a freewheeling rally car in Top Gear Rally. You can hone your driving skills in Practice, Quick Race, and Time Attack modes before shifting into Championship mode. If you're among the fastest cars to cross the finish line, you'll earn points that can unlock more challenging courses. As you race to the top of the amateur, professional, and Top Gear World leagues, you'll unlock faster cars, bonus car colors, and car upgrades. … Expand"}, {"name": "Etherlords II", "details_link": "https://www.metacritic.com/game/pc/etherlords-ii", "publisher": "Strategy First", "release_date": "Sep 30 2003", "developers": ["Nival Interactive"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/6f6df06ab63078c76f78ae51322efd9b-98.jpg", "descriptions": "Delve into a fantasy world beyond your wildest dreams in Etherlords II: Second Age, a turn-based strategy adventure where four races vie for control of the world in dynamic one-on-one fights. Combat is based on the premise of a fantasy card game, in which you must select cards from your deckDelve into a fantasy world beyond your wildest dreams in Etherlords II: Second Age, a turn-based strategy adventure where four races vie for control of the world in dynamic one-on-one fights. Combat is based on the premise of a fantasy card game, in which you must select cards from your deck and each time a card is used, a new round is introduced and new spells become available to you. [Strategy First]… Expand"}, {"name": "Ace Combat: Assault Horizon", "details_link": "https://www.metacritic.com/game/xbox-360/ace-combat-assault-horizon", "publisher": "Namco Bandai Games", "release_date": "Oct 11 2011", "developers": ["Project Aces"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 78, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/4d5ccd83cf6fad9784f39e0fb074df77-98.jpg", "descriptions": "Climb back into the cockpit with another installment of the Ace Combat series."}, {"name": "Good Job!", "details_link": "https://www.metacritic.com/game/switch/good-job!", "publisher": "Nintendo", "release_date": "Mar 26 2020", "developers": ["Nintendo", "Paladin Studios"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "General"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/02cc7b328a59845a2c13497e796f7ed9-98.jpg", "descriptions": "As the clumsy child of a CEO, you must climb the corporate ladder one office-themed puzzle at a time! Complete puzzles in multiple ways as you experiment with the interactive environments—a projector can be wheeled gently through an electric door…or catapulted through the wall. So toil (orAs the clumsy child of a CEO, you must climb the corporate ladder one office-themed puzzle at a time! Complete puzzles in multiple ways as you experiment with the interactive environments—a projector can be wheeled gently through an electric door…or catapulted through the wall. So toil (or tumble) your way to the top and make your father proud.… Expand"}, {"name": "Samurai Gunn", "details_link": "https://www.metacritic.com/game/pc/samurai-gunn", "publisher": "Maxistentialism", "release_date": "Dec 10 2013", "developers": ["Beau Blyth"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Action", "General"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/e09ad9efd4e86e34c4caad676434f304-98.jpg", "descriptions": "Samurai Gunn is a 2-4 Player local multiplayer game. Each player is armed with a sword and gun, with only 3 bullets to a life. Both swords and bullets can be deflected with clever control and timing. Levels range from thick bamboo forests that can be hacked through, to vertically-loopingSamurai Gunn is a 2-4 Player local multiplayer game. Each player is armed with a sword and gun, with only 3 bullets to a life. Both swords and bullets can be deflected with clever control and timing. Levels range from thick bamboo forests that can be hacked through, to vertically-looping cliffs and caverns which bear walls that can be sharpened to deadly points.… Expand"}, {"name": "The Walking Dead: 400 Days", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-400-days", "publisher": "Telltale Games", "release_date": "Jul  3 2013", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita", "Xbox 360", "PC"], "genres": ["Action", "Miscellaneous", "Adventure", "General", "Compilation", "Point-and-Click"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/2a7a0c00d8b91f2716f7582437d935c8-98.jpg", "descriptions": "Join five new characters as they struggle to survive in The Walking Dead: 400 Days"}, {"name": "Lost Words: Beyond the Page", "details_link": "https://www.metacritic.com/game/switch/lost-words-beyond-the-page", "publisher": "Maximum Games", "release_date": "Apr  6 2021", "developers": ["Sketchbook Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "2D"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/25193592eee14a8576caefbdc39c99c3-98.jpg", "descriptions": "An atmospheric narrative adventure written by Rhianna Pratchett. Set between the pages of a diary and a fantasy story where you run on words and use them to interact with the world around you."}, {"name": "Life is Strange 2", "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-2", "publisher": "Square Enix", "release_date": "Sep 26 2018", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/7dfafc936e429e8dbdd2fcc8df54ee14-98.jpg", "descriptions": "The long awaited sequel to the award winning Life is Strange returns with a new 5-part narrative adventure from DONTNOD Entertainment."}, {"name": "Blue Reflection: Second Light", "details_link": "https://www.metacritic.com/game/switch/blue-reflection-second-light", "publisher": "Koei Tecmo Games", "release_date": "Nov  9 2021", "developers": ["Gust"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/2973b6f73ba963c39e89d40af3d80517-98.jpg", "descriptions": "Blue Reflection: Second Light follows the adventures of three students – Ao Hoshizaki, Kokoro Utsubo, and Yuki Kinjou – who find themselves transported to a mysterious floating academy, searching for clues to find their way back home, with only their names as memories. One day, a pathBlue Reflection: Second Light follows the adventures of three students – Ao Hoshizaki, Kokoro Utsubo, and Yuki Kinjou – who find themselves transported to a mysterious floating academy, searching for clues to find their way back home, with only their names as memories. One day, a path leading to a new land appears, but when the three protagonists set off to unravel the mystery, they’re met by a series of deadly monsters. By battling the fiendish creatures, they unlock unknown powers that only seem to deepen the cryptic nature of their surroundings. Throughout the adventure, the three friends cooperate and struggle to make their everyday-life as rich and as fun as possible. While spending every day trapped in this unknown world, the characters’ true feelings and personalities will be revealed, and as their bonds grow deeper, they will acquire new strengths and abilities. … Expand"}, {"name": "Trials Rising", "details_link": "https://www.metacritic.com/game/switch/trials-rising", "publisher": "Ubisoft", "release_date": "Feb 26 2019", "developers": ["RedLynx"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/a35f57890245025d42495b2e0fedd791-98.jpg", "descriptions": "Explore over-the-top action and physics-bending motorcycle racing in the latest edition of the Trials franchise. All-new features, more competitions, and more tracks mean more to play!."}, {"name": "WWE SmackDown vs. Raw 2009", "details_link": "https://www.metacritic.com/game/playstation-2/wwe-smackdown-vs-raw-2009", "publisher": "THQ", "release_date": "Nov  9 2008", "developers": ["Yuke's"], "platforms": ["PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "1-6 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/a5398cde27884d0a06ee9b8f7e8bdd28-98.jpg", "descriptions": "WWE SmackDown vs. Raw 2009 upholds the franchise’s commitment to delivering the definitive videogame simulation of live WWE programming. The Xbox 360, PLAYSTATION 3 system, PlayStation 2 system and PSP system versions of the game unleash a brand new tag team experience, allowing players toWWE SmackDown vs. Raw 2009 upholds the franchise’s commitment to delivering the definitive videogame simulation of live WWE programming. The Xbox 360, PLAYSTATION 3 system, PlayStation 2 system and PSP system versions of the game unleash a brand new tag team experience, allowing players to build momentum and attributes, eliminate opponents with high impact double teams and finishers, as well as get the “hot tag” for the win. The franchise's renowned creation system offers a brand new Create-A-Finisher option, while a new Road to WrestleMania Mode paves the way to WWE’s biggest event of the year and lets players experience co-op storylines for the first time. WWE SmackDown vs. Raw 2009 also extends the virtual WWE gameplay experience with robust online capabilities, including the highly anticipated debut of downloadable content. [THQ]… Expand"}, {"name": "El Shaddai: Ascension of the Metatron", "details_link": "https://www.metacritic.com/game/playstation-3/el-shaddai-ascension-of-the-metatron", "publisher": "Ignition Entertainment", "release_date": "Aug 16 2011", "developers": ["Ignition Entertainment"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Action Adventure", "General", "Fantasy", "General", "Fantasy"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/7fd552d0667a1a223ac3a2d163f767fb-98.jpg", "descriptions": "Developed by a hugely-talented, Tokyo-based team headed by the legendary Sawaki Takeyasu (Devil May Cry) and Masato Kimura (Okami, Viewtiful Joe) El Shaddai: Ascension of the Metatron, draws players into a rich storyline inspired by events in the Old Testament's apocryphal 'Book of Enoch.'Developed by a hugely-talented, Tokyo-based team headed by the legendary Sawaki Takeyasu (Devil May Cry) and Masato Kimura (Okami, Viewtiful Joe) El Shaddai: Ascension of the Metatron, draws players into a rich storyline inspired by events in the Old Testament's apocryphal 'Book of Enoch.'  In the game, players take on the role of Enoch and must harness his natural combat skills to master a range of powerful and Heavenly weapons under the guidance of the watchful Archangels.  Only then will he be able to deliver the souls of the Fallen Angels and spare the world from a great flood ordered by Heaven. … Expand"}, {"name": "Ghostbusters: The Video Game", "details_link": "https://www.metacritic.com/game/playstation-3/ghostbusters-the-video-game", "publisher": "Atari", "release_date": "Jun 16 2009", "developers": ["Terminal Reality"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "General", "General"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/772a8aef9f3be265f791f6d87cb8fcb1-98.jpg", "descriptions": "The Ghostbusters are back in an all new story penned by the original creators. With Manhattan newly overrun by ghosts and other supernatural creatures, it's up to you to take on the role of a new recruit joining the original film cast of the famous Ghostbusters team. Equipped with a varietyThe Ghostbusters are back in an all new story penned by the original creators. With Manhattan newly overrun by ghosts and other supernatural creatures, it's up to you to take on the role of a new recruit joining the original film cast of the famous Ghostbusters team. Equipped with a variety of unique weapons and gadgets, you will hunt, fight and capture a wide range of uncanny phantasms and demons in an all new funny and frightening battle to save New York City from its latest paranormal plague. To deliver a special gaming experience to the tremendous Ghostbusters’ fan base around the world, the game features the original film cast from the classic Ghostbusters films, Bill Murray, Dan Aykroyd, Harold Ramis, and Ernie Hudson, back again for the first time in more than 20 years. Supporting the ghost busting crew are the talents of Annie Potts, Brian Doyle Murray and William Atherton. [Sierra Entertainment]… Expand"}, {"name": "New Super Mario Bros. 2", "details_link": "https://www.metacritic.com/game/3ds/new-super-mario-bros-2", "publisher": "Nintendo", "release_date": "Aug 19 2012", "developers": ["Nintendo"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 78, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/9fb39d0a2e0aa95c5b51dee832a91a90-98.jpg", "descriptions": "New Super Mario Bros. 2 is a traditional side-scrolling adventure game featuring Mario, Luigi and loads of other favorite characters from the popular Mario series. The game was created specifically as a pick-up-and-play experience that can be instantly enjoyed by players of all skill levelsNew Super Mario Bros. 2 is a traditional side-scrolling adventure game featuring Mario, Luigi and loads of other favorite characters from the popular Mario series. The game was created specifically as a pick-up-and-play experience that can be instantly enjoyed by players of all skill levels on the Nintendo 3DS system… Expand"}, {"name": "DeathSpank: Thongs of Virtue", "details_link": "https://www.metacritic.com/game/pc/deathspank-thongs-of-virtue", "publisher": "Electronic Arts", "release_date": "Nov 30 2010", "developers": ["Hothead Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/ee788715e79258f28a211f738544cfb8-98.jpg", "descriptions": "DeathSpank: Thongs of Virtue picks up right where the original left off."}, {"name": "Richard Garriott's Tabula Rasa", "details_link": "https://www.metacritic.com/game/pc/richard-garriotts-tabula-rasa", "publisher": "NCSOFT", "release_date": "Oct 30 2007", "developers": ["NCSOFT"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/38a8022ba4174eef53112a2286db927c-98.jpg", "descriptions": "Richard Garriott’s Tabula Rasa is a massively multiplayer online role-playing game that takes the player into lush forest planets, volcanic moons, and exotic alien civilizations. Face off against powerful alien soldiers, armored mechanoids, and vicious creatures! Use a wide range of weaponsRichard Garriott’s Tabula Rasa is a massively multiplayer online role-playing game that takes the player into lush forest planets, volcanic moons, and exotic alien civilizations. Face off against powerful alien soldiers, armored mechanoids, and vicious creatures! Use a wide range of weapons and unique alien powers to help the Allied Free Sentients (AFS) in their desperate fight against extinction. Tabula Rasa combines a vast, persistent game world and ongoing storyline with fast-paced action, resulting in a new approach to the design of multiplayer online games. Richard Garriott’s Signature Creative Vision – Features a rich storyline with culminating experiences, immersive tactile environments and a persistent plot. Take Role-playing to the Battlefield – Fast-paced action involving skill, stealth, and strategy combines with character growth and development (RPG) on a massive multiplayer scale. Unleash the Power of Logos – Alien technology allows you to harness the very fabric of the cosmos for healing, attacks, and more. Ethical Parables – Encounter ethical decisions while attempting to complete goals or missions that affect the people and environments around them. Battlefield Control Points – Entrenched positions on a given battlefield can change hands over the course of a battle and affect spawn points of both enemy and friendly characters. Character Cloning System – Innovative class system allows you to explore different character classes without leveling up a new character. Crafting & Economy – Participate in crafting and selling items. Player-vs-Player – Challenge other players in voluntary PvP mode. Integrated Voice Chat – Allows hands-free communication on the battlefield. [NCSoft]… Expand"}, {"name": "Oxenfree", "details_link": "https://www.metacritic.com/game/xbox-one/oxenfree", "publisher": "Night School Studio", "release_date": "Jan 15 2016", "developers": ["Night School Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action Adventure", "Adventure", "General"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/9c0f8e95fe89c156b709fe1285c5deab-98.jpg", "descriptions": "Oxenfree is a supernatural thriller about a gaggle of friends who inadvertently open a ghostly rift. You assume the role of Alex, and you’ve just brought your new stepbrother Jonas to an overnight island party gone horribly wrong."}, {"name": "NFL Street 2", "details_link": "https://www.metacritic.com/game/xbox/nfl-street-2", "publisher": "EA Sports Big", "release_date": "Dec 22 2004", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/91aeeab418253c5664442a6fdfa1ca10-98.jpg", "descriptions": "Get ready for more fancy moves, new modes, and online play in the sequel to NFL Street. Now you can jump 15 feet high to make catches off the wall, dive into the end zone, or pull off wild jukes. You can master these new abilities in seven new game modes, including \"crush theGet ready for more fancy moves, new modes, and online play in the sequel to NFL Street. Now you can jump 15 feet high to make catches off the wall, dive into the end zone, or pull off wild jukes. You can master these new abilities in seven new game modes, including \"crush the carrier\" and \"own the city.\" Create your own player, master new skills, and hit the streets both offline and online.… Expand"}, {"name": "Dead Rising 3", "details_link": "https://www.metacritic.com/game/xbox-one/dead-rising-3", "publisher": "Microsoft Game Studios", "release_date": "Nov 22 2013", "developers": ["Capcom Vancouver"], "platforms": "Xbox One", "num_players": "2 ", "genres": ["General", "Action", "Action Adventure", "General", "Open-World"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/081b54db73d931ba855fe2b21e159f26-98.jpg", "descriptions": "Available only on Xbox One, Dead Rising 3 is set ten years following the events of Fortune City in Dead Rising 2. Players are introduced to Nick Ramos, a young mechanic with a bizarre tattoo and an mysterious past, who has to find a way to escape a city full of zombies before a comingAvailable only on Xbox One, Dead Rising 3 is set ten years following the events of Fortune City in Dead Rising 2. Players are introduced to Nick Ramos, a young mechanic with a bizarre tattoo and an mysterious past, who has to find a way to escape a city full of zombies before a coming military strike wipes the city of Los Perdidos, California, and everyone in it, off the face of the Earth. Nick cannot do it on his own – he must hook up with other survivors to stay alive. They've got to fight their way out before it’s too late.… Expand"}, {"name": "Tales From The Borderlands: Episode 4 - Escape Plan Bravo", "details_link": "https://www.metacritic.com/game/playstation-4/tales-from-the-borderlands-episode-4---escape-plan-bravo", "publisher": "Telltale Games", "release_date": "Aug 18 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "General"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/3f2608bc849881394f2b514a17e5ea4e-98.jpg", "descriptions": "Captured by Vallory and her thugs, Rhys and Fiona are forced to keep searching for the Vault beacon - at gunpoint. The beacon is on the Hyperion moon base - Helios - while our heroes are on Pandora... so there's the annoying cold void of death known as 'space' to overcome. Even with the helpCaptured by Vallory and her thugs, Rhys and Fiona are forced to keep searching for the Vault beacon - at gunpoint. The beacon is on the Hyperion moon base - Helios - while our heroes are on Pandora... so there's the annoying cold void of death known as 'space' to overcome. Even with the help of a familiar face, and with a worryingly helpful Handsome Jack hitching a ride in Rhys’ head, getting on board the ominous ‘H’ is going to take every drop of guile, and quite possibly all the spunk you’ve got. Sacrifices will be made – can you make the tough choices needed to succeed?… Expand"}, {"name": "Mount & Blade: Warband", "details_link": "https://www.metacritic.com/game/pc/mount-blade-warband", "publisher": "Paradox Interactive", "release_date": "Mar 30 2010", "developers": ["Taleworlds Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 64 ", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 78, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/66cf3e915e0f2f47c6003b6e7f5ef03b-98.jpg", "descriptions": "The first expansion pack for Mount & Blade introduces an array of brand-new features, highlighted by a multiplayer capability that allows up to 64 players to participate."}, {"name": "Nancy Drew: The Ransom of the Seven Ships", "details_link": "https://www.metacritic.com/game/pc/nancy-drew-the-ransom-of-the-seven-ships", "publisher": "Her Interactive", "release_date": "Jul 14 2009", "developers": ["Her Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Modern"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/cf9a7a1fee862b7ed07b3ed7bfc3276a-98.jpg", "descriptions": "Your friend Bess Marvin is kidnapped and the only chance you have to save her is by solving a 300-year-old Bahamian mystery! Dangerous waters keep treasure hunters from exploring the reefs around Dread Isle, but this remote island might hide the riches of El Toro's lost fleet! Can you, asYour friend Bess Marvin is kidnapped and the only chance you have to save her is by solving a 300-year-old Bahamian mystery! Dangerous waters keep treasure hunters from exploring the reefs around Dread Isle, but this remote island might hide the riches of El Toro's lost fleet! Can you, as Nancy Drew, track down the treasure before time runs out? [Her Interactive]… Expand"}, {"name": "Madden NFL 08", "details_link": "https://www.metacritic.com/game/playstation-2/madden-nfl-08", "publisher": "EA Sports", "release_date": "Aug 14 2007", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 78, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/0/d5e4e6eb1d1a9b0f11994b68e49b0a97-98.jpg", "descriptions": "All-New Read & React System: New player skill icons identify on-field strengths and weaknesses, providing an immediate read on what your opponent is giving you. Quickly react, create mismatches, and exploit opponent weaknesses before every play. All-New Front Office Mode: Take full controlAll-New Read & React System: New player skill icons identify on-field strengths and weaknesses, providing an immediate read on what your opponent is giving you. Quickly react, create mismatches, and exploit opponent weaknesses before every play. All-New Front Office Mode: Take full control of every aspect of an NFL franchise. Construct a state-of-the-art stadium, set concession prices, hire your coaching staff, draft players, and manage the entire operation from the top down to build your dynasty. Your Ring of a Champion: Increase your Madden Gamer Level to help create and customize your own in-game championship ring. Madden Unmatched: All-new player moves, including auto-motion, backward passes and low-hitting tackles, plus ultra-smooth gameplay provide the most realistic NFL gaming experience ever. Control receivers and make spectacular catches or key possession receptions, or roam the secondary and jar the ball loose with big hits and ball-stripping tackles. [EA Sports]… Expand"}, {"name": "Tom Clancy's Splinter Cell Double Agent", "details_link": "https://www.metacritic.com/game/playstation-3/tom-clancys-splinter-cell-double-agent", "publisher": "Ubisoft", "release_date": "Mar 30 2007", "developers": ["Ubisoft Shanghai"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 78, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/a22b105388b8b43a29cef08d2f826484-98.jpg", "descriptions": "Veteran agent Sam Fisher is back. But he's never faced an enemy like this before. To stop a devastating terrorist attack, he must infiltrate a vicious terrorist group and destroy it from within. For the first time ever, experience the relentless tension and gut-wrenching dilemmas of life asVeteran agent Sam Fisher is back. But he's never faced an enemy like this before. To stop a devastating terrorist attack, he must infiltrate a vicious terrorist group and destroy it from within. For the first time ever, experience the relentless tension and gut-wrenching dilemmas of life as a double agent. As you infiltrate a terrorist organization in its American headquarters, you must carefully weigh the consequences of your actions. Kill too many criminals and you'll blow your cover. Hesitate too long and millions will die. Do whatever it takes to complete your mission, but get out alive. Dual objectives to fulfill: NSA government agents and terrorists will each want you to accomplish opposing tasks at the same time. Discover the tension of being a double agent: Use actual tactics employed by today’s real-life double agents to sabotage the terrorists' plans. Explore a branching storyline with multiple endings: Your choices have an impact on how the story and game play unfolds. Missions from all over the world, from Asia to Africa to the heart of the US. Experience extreme situations: underwater or in a sandstorm, hiding behind the dust or smoke – and even skydiving. Master the latest weapons and gadgets used by NSA government agents in addition to black-market terrorist weapons. Ubisoft has developed special features for the PS3 version, adding multiplayer maps and skins, as well as support for the SIXAXIS wireless controller in single player and multiplayer modes. [Ubisoft]… Expand"}, {"name": "LEGO Star Wars", "details_link": "https://www.metacritic.com/game/playstation-2/lego-star-wars", "publisher": "Eidos Interactive", "release_date": "Apr  2 2005", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 78, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/f3346c58b475acf04a24a86792005d36-98.jpg", "descriptions": "LEGO Star Wars combines two childhood favourites, LEGO and Star Wars, to create an innovative and exciting action-adventure title designed for young gamers. The game is based on \"The Phantom Menace,\" \"Attack of the Clones\" and the eagerly awaited \"Star Wars: Episode III Revenge of the Sith.\"LEGO Star Wars combines two childhood favourites, LEGO and Star Wars, to create an innovative and exciting action-adventure title designed for young gamers. The game is based on \"The Phantom Menace,\" \"Attack of the Clones\" and the eagerly awaited \"Star Wars: Episode III Revenge of the Sith.\" Blending the unique world of designs of LEGO toys with the unforgettable characters of the prequel eras of the Star Wars universe, LEGO Star Wars will offer dynamic vehicles, environments and characters to young players, who will be able to live all of the adventures of the most memorable and exciting scenes from the Star Wars films. [Eidos Interactive]… Expand"}, {"name": "RiME", "details_link": "https://www.metacritic.com/game/pc/rime", "publisher": "Tequila Works", "release_date": "May 26 2017", "developers": ["Tequila Works", "QLOC"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 78, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/83e1f115f02aa42ff3ecf2177eb8b1d8-98.jpg", "descriptions": "The story of a boy who must use his wits and ingenuity to survive - and ultimately escape from - a mysterious island and a terrible curse.\r An end, and a new beginning.\r\n\r\nA strange island with a sinister secret, and an open-world adventure with a difference. As a boy who finds he is keyThe story of a boy who must use his wits and ingenuity to survive - and ultimately escape from - a mysterious island and a terrible curse.\r An end, and a new beginning.\r A strange island with a sinister secret, and an open-world adventure with a difference. As a boy who finds he is key to solving a series of ancient puzzles, you'll use an enigmatic artefact to manipulate your environment and even time itself.\r Thanks to the innovative control offered by the DUALSHOCK 4 controller, you'll find that light, sound and touch are all essential in your bid to escape the island.… Expand"}, {"name": "Alien Hominid", "details_link": "https://www.metacritic.com/game/playstation-2/alien-hominid", "publisher": "O3 Entertainment", "release_date": "Nov 21 2004", "developers": ["The Behemoth"], "platforms": "PlayStation 2", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 78, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/e194c360e1415741d9849260f889c2a3-98.jpg", "descriptions": "Alien Hominid is a fast-paced 2D side scroller where players must run, jump and shoot their way across the globe in persuit of the alien's coveted UFO. This version of Alien Hominid has been built specifically for consoles and it shows. The backgrounds ooze with parallax. Shrapnel scattersAlien Hominid is a fast-paced 2D side scroller where players must run, jump and shoot their way across the globe in persuit of the alien's coveted UFO. This version of Alien Hominid has been built specifically for consoles and it shows. The backgrounds ooze with parallax. Shrapnel scatters all over the screen. The explosions are the greatest hand-animated explosions to ever grace a television screen. Some of the bosses are so huge that we need to zoom out the camera to show them in their entirety (it's a cool feature, kinda like the scaling in Samurai Shodown). There are 16 hot levels, complete with mini-bosses and main-bosses. We've brought back all your old favorites and thrown in tons more. This game is overflowing with enemies, and they come armed to the teeth. Have no fear, the alien's arsenal has been taken up a notch! You now have seven power-up weapons, which also upgrade your grenades. A charge shot has been added so you can hold down your button and unleash a giant ball of destruction. You can dig into the ground for defensive measures, then reach up and pull your enemies under. Enemy riding and head biting is still intact, but you can now also flip over an enemy and carry him, or throw him in eight directions! Even two-player has been added, with the classic \"press start to jump in at any time\" mechanics! Twice the firepower! [Behemoth]… Expand"}, {"name": "Call of the Sea", "details_link": "https://www.metacritic.com/game/pc/call-of-the-sea", "publisher": "Raw Fury", "release_date": "Dec  8 2020", "developers": ["Out of the Blue", "Inc.", "Out of the Blue Games S.L."], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/8e58efff0d90a321fd42d19904799584-98.jpg", "descriptions": "A weird tale of otherworldly mystery. Call of the Sea is a first-person adventure puzzle game set in the 1930s that tells the story of Norah, a woman on the trail of her missing husband's expedition. The search takes place on a strange but beautiful island in the South Pacific, filled withA weird tale of otherworldly mystery. Call of the Sea is a first-person adventure puzzle game set in the 1930s that tells the story of Norah, a woman on the trail of her missing husband's expedition. The search takes place on a strange but beautiful island in the South Pacific, filled with secrets waiting to be unearthed. It is an otherworldly tale of mystery, adventure, and self-discovery.… Expand"}, {"name": "Grand Slam Tennis", "details_link": "https://www.metacritic.com/game/wii/grand-slam-tennis", "publisher": "Electronic Arts", "release_date": "Jun  8 2009", "developers": ["EA Canada"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/7be89aeb6f77bfd936414fe1204defd7-98.jpg", "descriptions": "Specifically designed for the Wii, EA SPORTS Grand Slam Tennis puts the racket in the palm of your hand and delivers the deepest tennis experience.  Users feel like they are actually playing tennis, performing real forehands and backhands in their living rooms.  The game is one of the firstSpecifically designed for the Wii, EA SPORTS Grand Slam Tennis puts the racket in the palm of your hand and delivers the deepest tennis experience.  Users feel like they are actually playing tennis, performing real forehands and backhands in their living rooms.  The game is one of the first to be compatible with Wii MotionPlus, which enhances the one-to-one motion with added shot depth and precise ball placement.  [EA Sports]… Expand"}, {"name": "Switchball", "details_link": "https://www.metacritic.com/game/xbox-360/switchball", "publisher": "Sierra Online", "release_date": "Nov  7 2007", "developers": ["Atomic Elbow", "Atomic Elbow AB"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "8  Online", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "General"], "meta_score": 78, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/3ce75e726731b3c1e2f05738dfd34492-98.jpg", "descriptions": "[Xbox Live Arcade]  Switchball challenges players to control an ever-changing ball along a narrow and challenging course suspended in midair. A polymorphous ball exhibits different physical characteristics as it changes form as either a standard Marbleball, a feather-light Airball, an[Xbox Live Arcade]  Switchball challenges players to control an ever-changing ball along a narrow and challenging course suspended in midair. A polymorphous ball exhibits different physical characteristics as it changes form as either a standard Marbleball, a feather-light Airball, an electrically charged Powerball or a dense and powerful Metalball. Players will have to solve their way through challenging levels packed with tricky obstacles, traps and mazes. With beautifully rendered 3D environments including Skyworld, Iceworld, Caveworld, Cloudworld and Lavaworld, Switchcball features an advanced physics engine, allowing players to interact with objects just as they would in the real world. [Sierra Online]… Expand"}, {"name": "Wario Land: Shake It!", "details_link": "https://www.metacritic.com/game/wii/wario-land-shake-it!", "publisher": "Nintendo", "release_date": "Sep 22 2008", "developers": ["Good-Feel"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/d24977d4f19a33e17efcb1767d5eb99a-98.jpg", "descriptions": "(Also known as \"Wario Land: The Shake Dimension\")  Wario Land: Shake It!, a classic side-scroller, stars Wario, the smelly, bad-mannered alter ego of Mario. With the Wii Remote controller turned sideways like an old-school controller, veterans and newcomers alike can run, jump and smash(Also known as \"Wario Land: The Shake Dimension\")  Wario Land: Shake It!, a classic side-scroller, stars Wario, the smelly, bad-mannered alter ego of Mario. With the Wii Remote controller turned sideways like an old-school controller, veterans and newcomers alike can run, jump and smash their way through hectic side-scrolling stages. Players shake the Wii Remote to help Wario take down his enemies, empty bags of treasure or cause earthquakes. Best of all, there are numerous stages each offering multiple missions to keep players coming back again and again to unlock everything, collect more coins or just improve their best times. [Nintendo]… Expand"}, {"name": "Star Wars Republic Commando", "details_link": "https://www.metacritic.com/game/xbox/star-wars-republic-commando", "publisher": "LucasArts", "release_date": "Feb 28 2005", "developers": ["LucasArts"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox"], "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/1e14afd68dd22b2dd4fd23e501662434-98.jpg", "descriptions": "You can be part of an elite squad of soldiers in Star Wars Republic Commando. Play as one of a team of republic troops in the time between Star Wars episodes II and III. Your squad will be assigned a variety of missions ranging from hostage rescue to assassination on many recognizable worldsYou can be part of an elite squad of soldiers in Star Wars Republic Commando. Play as one of a team of republic troops in the time between Star Wars episodes II and III. Your squad will be assigned a variety of missions ranging from hostage rescue to assassination on many recognizable worlds from the Star Wars universe. You can play multiplayer game modes such as capture the flag and deathmatch online.… Expand"}, {"name": "The Awesome Adventures of Captain Spirit", "details_link": "https://www.metacritic.com/game/xbox-one/the-awesome-adventures-of-captain-spirit", "publisher": "Square Enix", "release_date": "Jun 26 2018", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/cc15d0be7c6284414563274d636541b7-98.jpg", "descriptions": "Meet Chris, a creative and imaginative 10-year-old boy who escapes reality with fantastical adventures as his alter ego, the Awesome Captain Spirit. Hearken back to your childhood and play a touching narrative experience from the directors and development team behind the BAFTA award-winningMeet Chris, a creative and imaginative 10-year-old boy who escapes reality with fantastical adventures as his alter ego, the Awesome Captain Spirit. Hearken back to your childhood and play a touching narrative experience from the directors and development team behind the BAFTA award-winning game Life is Strange. The Awesome Adventures of Captain Spirit is an original story set in the Life is Strange Universe that contains links to the brand-new story an characters of Life is Strange 2.… Expand"}, {"name": "Hue", "details_link": "https://www.metacritic.com/game/xbox-one/hue", "publisher": "Curve Digital", "release_date": "Aug 30 2016", "developers": ["Fiddlesticks Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One"], "genres": ["Puzzle", "Action"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/e5ab8623aff2ea160c5a53b09786c7ab-98.jpg", "descriptions": "Hue is a puzzle-platformer, where you alter the world by changing its background colour. You explore a dangerous grey land, unearthing coloured fragments on a journey to find your missing mother. As obstacles match the background, they disappear, creating new puzzles - full of peril,Hue is a puzzle-platformer, where you alter the world by changing its background colour. You explore a dangerous grey land, unearthing coloured fragments on a journey to find your missing mother. As obstacles match the background, they disappear, creating new puzzles - full of peril, mystery… and colours unseen. [Xbox.com]… Expand"}, {"name": "Ibb & Obb", "details_link": "https://www.metacritic.com/game/playstation-3/ibb-obb", "publisher": "Sparpweed", "release_date": "Aug  6 2013", "developers": ["Sparpweed"], "platforms": ["PC", "Switch", "PlayStation 3"], "num_players": "2 ", "genres": ["Miscellaneous", "Puzzle", "Action", "General", "General"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/8a73f56d51acf390dcee41e76e41e00f-98.jpg", "descriptions": "Ibb & Obb is a two player cooperative game set in a puzzle filled world where gravity goes both up and down."}, {"name": "Deadlight", "details_link": "https://www.metacritic.com/game/pc/deadlight", "publisher": "Microsoft Game Studios", "release_date": "Oct 25 2012", "developers": ["Tequila Works"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/5fd4364cf57686cc38baa8cd047d2f2d-98.jpg", "descriptions": "The world has ended. There is no hope. No new beginning. Only the survivors. DEADLIGHT follows the journey of Randall Wayne, a man searching for his family across Seattle during the aftermath of a 1980s event that has decimated life on earth. This visually stunning Cinematic SurvivalThe world has ended. There is no hope. No new beginning. Only the survivors. DEADLIGHT follows the journey of Randall Wayne, a man searching for his family across Seattle during the aftermath of a 1980s event that has decimated life on earth. This visually stunning Cinematic Survival Platformer will challenge you to run, jump, climb, and struggle for your life as you look for answers and the ones you love.… Expand"}, {"name": "Fallout 3: The Pitt", "details_link": "https://www.metacritic.com/game/pc/fallout-3-the-pitt", "publisher": "Bethesda Softworks", "release_date": "Mar 24 2009", "developers": ["Bethesda Game Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/7810a026356e50d74e39a948ff538bec-98.jpg", "descriptions": "[Downloadable Content]  Pittsburgh was once the industrial center of the pre-war world. The city was spared the horrors of nuclear fire, only to have its people infected by a nightmare plague of disease, infection, and mutation.  Travel to the ruins of this industrial city, now called The[Downloadable Content]  Pittsburgh was once the industrial center of the pre-war world. The city was spared the horrors of nuclear fire, only to have its people infected by a nightmare plague of disease, infection, and mutation.  Travel to the ruins of this industrial city, now called The Pitt, and discover a secret that could send shockwaves through the entire Wasteland. Battle vicious mutated Trogs, employ deadly new weapons like the AutoAxe and Infiltrator silenced assault rifle, and decide the fate of the infected slaves and slavers that call this city home. [Bathesda Softworks]… Expand"}, {"name": "Samurai Shodown", "details_link": "https://www.metacritic.com/game/xbox-one/samurai-shodown", "publisher": "SNK Corporation", "release_date": "Jun 25 2019", "developers": ["SNK Corporation"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 78, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/8e4be8cef51b9876631fa7e36695b3a4-98.jpg", "descriptions": "11 years have passed since the last series installment, and it is now time for SAMURAI SHODOWN to return in a brand-new game featuring high-end visuals and gameplay. Faithfully reproducing the game mechanics and atmosphere that contributed to the success of the series, SAMURAI SHODOWN11 years have passed since the last series installment, and it is now time for SAMURAI SHODOWN to return in a brand-new game featuring high-end visuals and gameplay. Faithfully reproducing the game mechanics and atmosphere that contributed to the success of the series, SAMURAI SHODOWN includes a feature that learns from players game actions and patterns in order to create CPU-controlled “ghost” characters. With a story set one year before the very first installment, a diverse cast of returning and new characters cross paths in order to fulfill their destinies. [SNK]… Expand"}, {"name": "Far Cry 5", "details_link": "https://www.metacritic.com/game/pc/far-cry-5", "publisher": "Ubisoft", "release_date": "Mar 27 2018", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/235320a4aa9192f200b7ce4e97a98273-98.jpg", "descriptions": "Welcome to Hope County, Montana. This idyllic location is home to a community of freedom-loving people - and a fanatical doomsday cult known by many as The Project at Eden's Gate. Led by the charismatic prophet Joseph Seed and his devoted siblings, Eden's Gate has been surreptitiouslyWelcome to Hope County, Montana. This idyllic location is home to a community of freedom-loving people - and a fanatical doomsday cult known by many as The Project at Eden's Gate. Led by the charismatic prophet Joseph Seed and his devoted siblings, Eden's Gate has been surreptitiously infiltrating all aspects of daily life. When your arrival incites the cult to violently assume control of the region, you have to rise up ans spark the fires of resistance to liberate the besieged community. Freely explore Hope Couny's rivers, lands and skies with the largest customisable weapon and vehicle roster ever in a Far Cry game. You are the hero of the story in a world that hits back with every strike, and where the places you discover and the locals you team up with will shape your story in ways you will never anticipate. [Ubisoft]… Expand"}, {"name": "LEGO Indiana Jones: The Original Adventures", "details_link": "https://www.metacritic.com/game/wii/lego-indiana-jones-the-original-adventures", "publisher": "LucasArts", "release_date": "Jun  3 2008", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "General"], "meta_score": 78, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/c0d64b92879ad34e9733ce540e26593c-98.jpg", "descriptions": "LEGO Indiana Jones: The Original Adventures takes the fun and creative construction of LEGO and combines it with the wits, daring and non-stop action from the original cinematic adventures that enthralled audiences everywhere (Indiana Jones and the Raiders of the Lost Ark, Indiana Jones andLEGO Indiana Jones: The Original Adventures takes the fun and creative construction of LEGO and combines it with the wits, daring and non-stop action from the original cinematic adventures that enthralled audiences everywhere (Indiana Jones and the Raiders of the Lost Ark, Indiana Jones and the Temple of Doom and Indiana Jones and the Last Crusade). With a unique tongue-in-cheek take on the original adventures, LEGO Indiana Jones follows Dr. Jones escapades through the jungles of South America to the mountaintops of India. Fans can build, battle and brawl their way through their favorite cinematic moments, from Indy's entanglements with snakes to his dashing boulder run. Pop culture's most iconic archeologist whips through all the classic moments with the help of a host of supporting characters including Marion Ravenwood and Short Round. Players can also mix and match the body parts of more than 60 playable characters to create new heroes just as they could in the LEGO Star Wars games. [LucasArts]… Expand"}, {"name": "RIDE 4", "details_link": "https://www.metacritic.com/game/xbox-one/ride-4", "publisher": "Milestone S.r.l", "release_date": "Oct  5 2020", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series X", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 78, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/2db31919ae8141b2e89378c23551b8bb-98.jpg", "descriptions": "Are you ready to live the best gaming experience that a motorcycle fan can get? RIDE 4 will spark your competitive soul with hundreds of bikes, dozens of tracks and a whole new level of realism."}, {"name": "Going Under", "details_link": "https://www.metacritic.com/game/pc/going-under", "publisher": "Team17", "release_date": "Sep 24 2020", "developers": ["AggroCrab"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/081d1a76d6c4c6e49e17ecd3b9a5289d-98.jpg", "descriptions": "Going Under is a roguelite-inspired dungeon crawler about exploring the cursed ruins of failed tech startups. You’ll wield office junk as weapons as you battle your way through the forsaken office complexes. Stab a demon with a thumbtack one moment, run over a goblin with a smart car theGoing Under is a roguelite-inspired dungeon crawler about exploring the cursed ruins of failed tech startups. You’ll wield office junk as weapons as you battle your way through the forsaken office complexes. Stab a demon with a thumbtack one moment, run over a goblin with a smart car the next–your options in combat are constantly changing. … Expand"}, {"name": "Pro Evolution Soccer 2014", "details_link": "https://www.metacritic.com/game/playstation-3/pro-evolution-soccer-2014", "publisher": "Konami", "release_date": "Sep 24 2013", "developers": ["Konami"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 78, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/6/7197b4ac38ced2dfe6599d39dee1c4fc-98.jpg", "descriptions": "PES 2014 centers everything on the ball including how it moves and how players use it. Trueball Tech allows the player to trap or knock on a pass using the analogue stick with detailed bar-centric physics determining the weight shift of the player and the height and speed of the pass, as toPES 2014 centers everything on the ball including how it moves and how players use it. Trueball Tech allows the player to trap or knock on a pass using the analogue stick with detailed bar-centric physics determining the weight shift of the player and the height and speed of the pass, as to how the player's body will automatically shape to receive it. Trueball Tech adds more freedom, with full 360-degree control within several yards around the player and the ability to shield the ball from opposing players, use deft controls to wrong-foot them, and intuitive methods to master close control. … Expand"}, {"name": "Skylanders Giants", "details_link": "https://www.metacritic.com/game/wii/skylanders-giants", "publisher": "Activision", "release_date": "Oct 21 2012", "developers": ["Toys for Bob"], "platforms": ["3DS", "PlayStation 3", "Wii U", "Xbox 360", "Wii"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 78, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/209f8949c700b2ae10b97ec58944da99-98.jpg", "descriptions": "Skylanders Giants is an all-new adventure for existing Skylanders toys that will also add 20 new characters--including eight giant ones--to the roster."}, {"name": "Chibi-Robo! Park Patrol", "details_link": "https://www.metacritic.com/game/ds/chibi-robo!-park-patrol", "publisher": "Nintendo", "release_date": "Sep 24 2007", "developers": ["Skip Ltd."], "platforms": "DS", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/a3439b03851b595878a3a0e49bbf9b25-98.jpg", "descriptions": "In the last Chibi-Robo adventure, our diminutive hero restored happiness to the Sanderson home, but in this DS sequel, he’s taking on the great outdoors. Playground equipment in the park is mysteriously disappearing and the flowers in the park have been transformed by evil monsters. It's upIn the last Chibi-Robo adventure, our diminutive hero restored happiness to the Sanderson home, but in this DS sequel, he’s taking on the great outdoors. Playground equipment in the park is mysteriously disappearing and the flowers in the park have been transformed by evil monsters. It's up to Chibi-Robo to save the day and make the park a nice place to visit again. This time around, Chibi-Robo gets to flex his mechanical muscles in new and interesting ways. He rides buggies, cars and boats across lawns and ponds, fights mysterious enemies with his trusty squirter, dances in the park to give life to the plants there and builds playground equipment to make the park a better place. [Nintendo]… Expand"}, {"name": "SNK 40th Anniversary Collection", "details_link": "https://www.metacritic.com/game/switch/snk-40th-anniversary-collection", "publisher": "NIS America", "release_date": "Nov 13 2018", "developers": ["Digital Eclipse", "SNK"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 78, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/045cc63f53b51990581eacbec1fcdc99-98.jpg", "descriptions": "2018 marks the 40th anniversary of legendary studio SNK. To celebrate this extraordinary milestone, a variety of classic arcade games from SNK's golden age are coming back together in one anthology on Nintendo Switch™. SNK 40th ANNIVERSARY COLLECTION is packed full of retro games and a2018 marks the 40th anniversary of legendary studio SNK. To celebrate this extraordinary milestone, a variety of classic arcade games from SNK's golden age are coming back together in one anthology on Nintendo Switch™. SNK 40th ANNIVERSARY COLLECTION is packed full of retro games and a treasure trove of features. Ikari Warriors...nuff said.… Expand"}, {"name": "Creature in the Well", "details_link": "https://www.metacritic.com/game/xbox-one/creature-in-the-well", "publisher": "Flight School Studio", "release_date": "Sep  6 2019", "developers": ["Flight School Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/240e7a12d863aefb9b3450910d891fdb-98.jpg", "descriptions": "Unlock the power of an ancient facility and face the ominous, all-seeing Creature in this unique pinball-inspired hack & slash. Creature in the Well is a top-down, pinball-inspired, hack-and-slash dungeon crawler. As the last remaining BOT-C unit, venture deep into a desert mountain toUnlock the power of an ancient facility and face the ominous, all-seeing Creature in this unique pinball-inspired hack & slash. Creature in the Well is a top-down, pinball-inspired, hack-and-slash dungeon crawler. As the last remaining BOT-C unit, venture deep into a desert mountain to restore power to an ancient facility, haunted by a desperate Creature. Uncover and upgrade powerful gear to free the city of Mirage from a deadly sandstorm.… Expand"}, {"name": "Dead Space 3", "details_link": "https://www.metacritic.com/game/xbox-360/dead-space-3", "publisher": "Electronic Arts", "release_date": "Feb  5 2013", "developers": ["Visceral Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "Action Adventure", "Shooter", "Shooter", "Linear", "Third-Person", "Sci-Fi", "Sci-Fi"], "meta_score": 78, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/5c86f78d9624e49b521a7c7a2f2bec91-98.jpg", "descriptions": "Dead Space 3 focuses on Isaac Clarke and merciless soldier John Carver who embark on a journey through space to discover the source of the Necromorph outbreak. Crash-landed on the frozen planet of Tau Volantis, Isaac searches the harsh environment for raw materials and scavenged parts. HeDead Space 3 focuses on Isaac Clarke and merciless soldier John Carver who embark on a journey through space to discover the source of the Necromorph outbreak. Crash-landed on the frozen planet of Tau Volantis, Isaac searches the harsh environment for raw materials and scavenged parts. He then puts his engineering skills to the test to create and customize weapons and survival tools. The ice planet hides the key to ending the Necromorph plague forever, but first Isaac needs to withstand avalanches, treacherous ice-climbs, and the violent wilderness. Facing deadlier evolved enemies and the brutal elements, Isaac can choose to team up, not only for his own survival, but for that of mankind’s. Play together with a cohort or do it alone as Isaac Clarke using the seamless new drop in, drop out co-op functionality.… Expand"}, {"name": "R.U.S.E.", "details_link": "https://www.metacritic.com/game/xbox-360/ruse", "publisher": "Ubisoft", "release_date": "Sep  7 2010", "developers": ["Eugen Systems"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/36b58bebb101788b0f5f1516482e0bc0-98.jpg", "descriptions": "R.U.S.E. is a real-time strategy game that allows players to bluff their enemies to lead their nation to victory, controlling the action using views that range seamlessly from the heart of the battlefield to the full theatre of war. Players are plunged into the action thanks to the exclusiveR.U.S.E. is a real-time strategy game that allows players to bluff their enemies to lead their nation to victory, controlling the action using views that range seamlessly from the heart of the battlefield to the full theatre of war. Players are plunged into the action thanks to the exclusive IRISZOOM Engine which offers an intuitive interface that allows for smooth, rapid transitions from a birds-eye view of the entire conflict, down into the heat of the battle and vice versa. In R.U.S.E., players use their brain as the ultimate weapon, fighting a war of perception, where the ability to deceive and mislead the enemy determines success. A first in a strategy game, R.U.S.E. promises to reinvigorate the genre by using deception to give new-found depth to the game play. [Ubisoft]… Expand"}, {"name": "Per Aspera", "details_link": "https://www.metacritic.com/game/pc/per-aspera", "publisher": "Raw Fury", "release_date": "Dec  3 2020", "developers": ["Tlon Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 78, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/8adec3e6ababdd741c978bf1e89e392b-98.jpg", "descriptions": "Experience city-building as never before — Overcome near-impossible odds to terraform Mars, cultivate the red-planet’s hidden resources, and unravel the past mysteries of those who’ve attempted the unbelievable feat. Humanity's future rests on your shoulders."}, {"name": "Galak-Z: The Dimensional", "details_link": "https://www.metacritic.com/game/pc/galak-z-the-dimensional", "publisher": "17-Bit", "release_date": "Oct 29 2015", "developers": ["17-Bit"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 78, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/ea6d45b35f1ca86e8ac61bedc87a61cb-98.jpg", "descriptions": "This hand painted intergalactic adventure takes you to the ends of the universe to fight enemies in brand new ways. Inspired by the classic sci-fi anime of the late 1970s and early 1980s as well as more modern shooters, developer 17-BIT has managed to squeeze both together to create a gameThis hand painted intergalactic adventure takes you to the ends of the universe to fight enemies in brand new ways. Inspired by the classic sci-fi anime of the late 1970s and early 1980s as well as more modern shooters, developer 17-BIT has managed to squeeze both together to create a game that promises the best of both worlds.… Expand"}, {"name": "Anomaly: Warzone Earth", "details_link": "https://www.metacritic.com/game/playstation-3/anomaly-warzone-earth", "publisher": "11 bit studios", "release_date": "Sep 11 2012", "developers": ["11 bit studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Strategy", "General", "Real-Time", "Sci-Fi", "General"], "meta_score": 78, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/7f7a0aacb3336f40491e8fe0ba357f37-98.jpg", "descriptions": "Blending fast-paced, explosive action with tactical battlefield command, Anomaly puts players in charge of a military convoy tasked with fighting back against the mysterious alien war machines that have begun to spring up in many of the world's largest cities. Players take part in battlesBlending fast-paced, explosive action with tactical battlefield command, Anomaly puts players in charge of a military convoy tasked with fighting back against the mysterious alien war machines that have begun to spring up in many of the world's largest cities. Players take part in battles personally to support and assist a hand-picked armor squad, utilizing their top-down tactical view to plot each and every turn of the convoy. As they progress through the story campaign and challenge modes, players will unlock upgrades and new units to build their ultimate destruction squad.… Expand"}, {"name": "Boktai 2: Solar Boy Django", "details_link": "https://www.metacritic.com/game/game-boy-advance/boktai-2-solar-boy-django", "publisher": "Kojima Productions", "release_date": "Oct 19 2004", "developers": ["KCEJ"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/f54aa7ae6fe52193441e28affca6a7ea-98.jpg", "descriptions": "Boktai 2 continues the adventures of Django the Solar Boy as he sets out to rid the world of evil vampires and demons. The second installment in the franchise brings back the solar sensor technology, which incorporates natural sunlight into gameplay. Take advantage of natural sunlightBoktai 2 continues the adventures of Django the Solar Boy as he sets out to rid the world of evil vampires and demons. The second installment in the franchise brings back the solar sensor technology, which incorporates natural sunlight into gameplay. Take advantage of natural sunlight through the built-in solar sensor on the Game Boy Advance cartridge to power up and fuse more than 60 weapons and items. Now you can head outdoors and battle enemies with more weapons, new characters, and a larger game environment.… Expand"}, {"name": "ESPN Major League Baseball", "details_link": "https://www.metacritic.com/game/xbox/espn-major-league-baseball", "publisher": "Sega", "release_date": "Apr  6 2004", "developers": ["Blue Shift"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/823b9c5447c3805d59482ccd822e54cc-98.jpg", "descriptions": "ESPN Major League Baseball takes baseball to the next level with Power Pitching, a new General Manager Mode, and an all-new ESPN presentation. Now you can take complete control of the mound with new pitches, pitch speeds, pitch interface, pitch animations, pitcher momentum, and exclusiveESPN Major League Baseball takes baseball to the next level with Power Pitching, a new General Manager Mode, and an all-new ESPN presentation. Now you can take complete control of the mound with new pitches, pitch speeds, pitch interface, pitch animations, pitcher momentum, and exclusive ESPN K-Zone pitch analysis. As the general manager of your team, you'll have to keep your club running on all cylinders or else answer to the owners. In addition to intuitive control and new modes, hundreds of new animations, such as broken bats and player reactions add to the MLB experience. … Expand"}, {"name": "Road Rash: Jailbreak", "details_link": "https://www.metacritic.com/game/game-boy-advance/road-rash-jailbreak", "publisher": "Electronic Arts", "release_date": "Sep 17 2003", "developers": ["Magic Pockets"], "platforms": "Game Boy Advance", "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/502938b306a62ebf002741465209bbee-98.jpg", "descriptions": "Road Rash Jailbreak puts combat racing right in the palm of your hand. You'll join a motorcycle gang in its attempt to break a friend out of jail. In each motorcycle race, you can use kicks, punches, and weapons to knock your competitors off their bikes. The game features multiple tracks andRoad Rash Jailbreak puts combat racing right in the palm of your hand. You'll join a motorcycle gang in its attempt to break a friend out of jail. In each motorcycle race, you can use kicks, punches, and weapons to knock your competitors off their bikes. The game features multiple tracks and terrains and a variety of gameplay modes. In both single-player and multiplayer modes, you must prove that you're the fastest and toughest biker of them all.… Expand"}, {"name": "Iridion II", "details_link": "https://www.metacritic.com/game/game-boy-advance/iridion-ii", "publisher": "Majesco Games", "release_date": "May 29 2003", "developers": ["Shin'en"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/36209a783b16c3608bf3fc00f411c654-98.jpg", "descriptions": "Iridion II is a great-looking shoot-'em-up that borrows many of its play nuances from the classics of yesteryear."}, {"name": "All-Star Baseball 2004", "details_link": "https://www.metacritic.com/game/playstation-2/all-star-baseball-2004", "publisher": "Acclaim", "release_date": "Mar  1 2003", "developers": ["Acclaim Studios Austin"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/800a827ef7ce1263c0bd397fe83b36e6-98.jpg", "descriptions": "Features on-line capabilities, featuring downloadable roster updates. History's greatest Negro League players such as Josh Gibson, Satchel Paige, and Buck O'Neil. All-new legends teams featuring Babe Ruth, Lou Gehrig, & Ty Cobb. Scenario mode where Derek Jeter introduces actual MLB footageFeatures on-line capabilities, featuring downloadable roster updates. History's greatest Negro League players such as Josh Gibson, Satchel Paige, and Buck O'Neil. All-new legends teams featuring Babe Ruth, Lou Gehrig, & Ty Cobb. Scenario mode where Derek Jeter introduces actual MLB footage to set-up in-game situations and recommendations. Pick-up game mode that enables you to choose up sides with your favorite players in all new stadiums. [Acclaim]… Expand"}, {"name": "Austerlitz: Napoleon's Greatest Victory", "details_link": "https://www.metacritic.com/game/pc/austerlitz-napoleons-greatest-victory", "publisher": "Shrapnel Games", "release_date": "Jul 10 2002", "developers": ["BreakAway Games"], "platforms": "PC", "genres": ["Strategy", "Wargame", "Real-Time", "Real-Time"], "meta_score": 78, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/7c3665a85482c2c66eb9535c6aa3af34-98.jpg", "descriptions": "When he saw the magnificent sunrise burning through the mist on the morning of the Battle of Austerlitz, Napoleon thought he could see his destiny.  The combined Russian and Austrian armies were following the French emperor's script to the letter.  The Allies believed they were superior inWhen he saw the magnificent sunrise burning through the mist on the morning of the Battle of Austerlitz, Napoleon thought he could see his destiny.  The combined Russian and Austrian armies were following the French emperor's script to the letter.  The Allies believed they were superior in the numbers and that Napoleon, who had fallen back from the best defensive position in the area, the Pratzen Heights, was afraid of a confrontation. The Allied high command was wrong. The latest game in The Greatest Battles Series.  Originally based on the Sid Meiers' \"Gettysburg\" engine, this game will be the basis for an entire new series of grand battles. [Shrapnel Games]… Expand"}, {"name": "Dropship: United Peace Force", "details_link": "https://www.metacritic.com/game/playstation-2/dropship-united-peace-force", "publisher": "Bam Entertainment", "release_date": "May 29 2002", "developers": ["SCEE"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Sci-Fi", "Futuristic Jet"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/8804061a4e3d7cbcdbea950041bfafe9-98.jpg", "descriptions": "In the year 2050, the United Nations and NATO have been replaced by the United Peacekeeping Force. Freshly recruited to the ranks, you must utilise a range of ground and air combat vehicles (including fighters, tanks and armoured assault vehicles) to enforce peace around the globe.In the year 2050, the United Nations and NATO have been replaced by the United Peacekeeping Force. Freshly recruited to the ranks, you must utilise a range of ground and air combat vehicles (including fighters, tanks and armoured assault vehicles) to enforce peace around the globe. Dropship's unique gameplay is a new take on the action genre, where your tactical decisions influence the success of the mission. A tense plot of political intrigue must also be negotiated if you're to succeed. From the mountains of Colombia to the wastelands of Kazakhstan, Dropship will call on all your battle skills in the struggle for victory. [SCEE]… Expand"}, {"name": "MotoGP 2", "details_link": "https://www.metacritic.com/game/playstation-2/motogp-2", "publisher": "Namco", "release_date": "Jan 22 2002", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/ae132b6e436a4f12e1e03c3d3df17be4-98.jpg", "descriptions": "MotoGP2 continues the adrenaline rush from last season. Brand new modes include racing against legends. New features such as 10 tracks, updated season stats, new weather conditions, tire options and more add to the thrilling excitement. [Namco]"}, {"name": "Luigi's Mansion", "details_link": "https://www.metacritic.com/game/gamecube/luigis-mansion", "publisher": "Nintendo", "release_date": "Nov 17 2001", "developers": ["Nintendo"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/c0d6be94a742f371539c27ba3667f13e-98.jpg", "descriptions": "Luigi steps out from the shadow of his brother Mario and into the gloomy shadows of a very haunted house in this, his first-ever starring role.  Armed with a flashlight and a customized vacuum cleaner, Luigi must rid the mansion of Boos and ghouls--and find his missing brother to boot.  AsLuigi steps out from the shadow of his brother Mario and into the gloomy shadows of a very haunted house in this, his first-ever starring role.  Armed with a flashlight and a customized vacuum cleaner, Luigi must rid the mansion of Boos and ghouls--and find his missing brother to boot.  As Luigi, you'll search for the keys that open the many locked doors; vacuum coins, cash, and gold bars; and explore vases, bookcases, and drawers.  From the brick-walled basement to the gloomy grounds, Luigi's Mansion is packed with chills, thrills, and creepy surprises.… Expand"}]