[
  {
    "name": "Planet Alpha",
    "details_link": "https://www.metacritic.com/game/xbox-one/planet-alpha",
    "publisher": "Team17",
    "release_date": "Sep  4 2018",
    "developers": [
      "Adrian Lazar"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 72,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/7/3572a1b5b81477e42d25e143dbe901af-98.jpg",
    "descriptions": "PLANET ALPHA, a beautiful alien world filled with mystery and danger. Pursued by relentless enemies, you must harness the power of night and day as you struggle to survive."
  },
  {
    "name": "Bad North",
    "details_link": "https://www.metacritic.com/game/switch/bad-north",
    "publisher": "Raw Fury",
    "release_date": "Aug 20 2018",
    "developers": [
      "Plausible Concept"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Strategy",
      "Real-Time",
      "General"
    ],
    "meta_score": 72,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/5/28ee3ee50c562d8eb41597caae383a52-98.jpg",
    "descriptions": "Bad North is a charming but brutal real-time tactics roguelite. Defend your idyllic island kingdom against a horde of Viking invaders, as you lead the desperate exodus of your people. Command your loyal subjects to take full tactical advantage of the unique shape of each island.EverythingBad North is a charming but brutal real-time tactics roguelite. Defend your idyllic island kingdom against a horde of Viking invaders, as you lead the desperate exodus of your people. Command your loyal subjects to take full tactical advantage of the unique shape of each island.Everything is at stake: fail, and watch the blood of your subjects stain the ground red.… Expand"
  },
  {
    "name": "Far Cry 5: Hours of Darkness",
    "details_link": "https://www.metacritic.com/game/pc/far-cry-5-hours-of-darkness",
    "publisher": "Ubisoft",
    "release_date": "Jun  5 2018",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 72,
    "users_score": 4.6,
    "image": "https://static.metacritic.com/images/products/games/9/e6e8b364e488eda10869be567b9cb26a-98.jpg",
    "descriptions": "Wendell Redler is more than just a Hope County resident, he's a veteran soldier of the Vietnam War. Listen to him recount his glory days as you travel back in time to war-torn Vietnam to take down Viet-Cong. Trapped behind enemy lines, rescue your squad mates and evacuate to safety in theWendell Redler is more than just a Hope County resident, he's a veteran soldier of the Vietnam War. Listen to him recount his glory days as you travel back in time to war-torn Vietnam to take down Viet-Cong. Trapped behind enemy lines, rescue your squad mates and evacuate to safety in the first war-based far cry. You must maneuver throughout this remote valley in Vietnam, and use survival instinct and stealth to save your team and get home. [Ubisoft]… Expand"
  },
  {
    "name": "All Walls Must Fall",
    "details_link": "https://www.metacritic.com/game/pc/all-walls-must-fall",
    "publisher": "inbetweengames",
    "release_date": "Feb 23 2018",
    "developers": [
      "inbetweengames"
    ],
    "platforms": [
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Real-Time",
      "General",
      "Tactics"
    ],
    "meta_score": 72,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/4/5cb3e7e7cb625a3e0da992d4780fd241-98.jpg",
    "descriptions": "All Walls Must Fall is a Tech-Noir Tactics game set in Berlin 2089, where the Cold War never ended."
  },
  {
    "name": "Valkyrie Drive: Bhikkhuni",
    "details_link": "https://www.metacritic.com/game/playstation-vita/valkyrie-drive-bhikkhuni",
    "publisher": "PQube",
    "release_date": "Oct 11 2016",
    "developers": [
      "Marvelous Inc."
    ],
    "platforms": [
      "PC",
      "PlayStation Vita"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Beat-'Em-Up",
      "2D",
      "3D"
    ],
    "meta_score": 72,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/0/2d053d40534b69a2876f286138aed998-98.jpg",
    "descriptions": "Action and adventure merge."
  },
  {
    "name": "Neon Chrome",
    "details_link": "https://www.metacritic.com/game/xbox-one/neon-chrome",
    "publisher": "10tons Entertainment",
    "release_date": "May 31 2016",
    "developers": [
      "10tons Entertainment",
      "10tons"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "PlayStation Vita",
      "Switch",
      "Xbox Series X",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shoot-'Em-Up",
      "Top-Down"
    ],
    "meta_score": 72,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/5/1c559f0af02aa18075be053e530a40e8-98.jpg",
    "descriptions": "Neon Chrome is a ruthless top-down cyberpunk shooter with rogue-like elements including procedural levels and ruthless gameplay. Blast your way through walls with guns and cybernetic abilities and try alternate approaches with different roles like the Assassin or the Cyber Psycho."
  },
  {
    "name": "Assassin's Creed Syndicate: Jack the Ripper",
    "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-syndicate-jack-the-ripper",
    "publisher": "Ubisoft",
    "release_date": "Dec 15 2015",
    "developers": [
      "Ubisoft Quebec"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 72,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/9/25f8f7684fda0b5d90ed69b15fa5a82a-98.jpg",
    "descriptions": "20 years after the events of Assassin’s Creed Syndicate, 'JACK THE RIPPER' has embarked on a brutal reign of terror that shocks London to its core and threatens the very existence of the Brotherhood of Assassins."
  },
  {
    "name": "Steel Empire",
    "details_link": "https://www.metacritic.com/game/3ds/steel-empire",
    "publisher": "Teyon",
    "release_date": "Jul 31 2014",
    "developers": [
      "Mebius"
    ],
    "platforms": [
      "PC",
      "3DS"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Scrolling",
      "Shoot-'Em-Up",
      "Vertical",
      "Horizontal"
    ],
    "meta_score": 72,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/9/6b78641bb15261feb39d9f5949534d2e-98.jpg",
    "descriptions": "Steel Empire is a steam punk shoot'em up game featuring a frantic combat filled with powerful enemies and insane obstacles. Enjoy a beautiful world and retro game-play as you dodge and shoot your way through classical stages. Choose one of 4 difficulty settings according to your set ofSteel Empire is a steam punk shoot'em up game featuring a frantic combat filled with powerful enemies and insane obstacles. Enjoy a beautiful world and retro game-play as you dodge and shoot your way through classical stages. Choose one of 4 difficulty settings according to your set of skills and fight the evil empire! See how well you did using the Replay Mode and show your worth by getting all achievements.\r Steel Empire, originally released on Sega Genesis and Game Boy Advance, is finally available on Nintendo 3DS!\r Features:\r-Dance with bullets and shoot down the enemy\r-7 complex stages full of adrenaline-pumping action and boss fights\r-Collect special power-ups and increase your firepower with a level-up system (up to 20 levels)\r-Enjoy the retro graphics providing new 3D effects\r-The classic is back! Legendary side-scrolling shooting action now flying into the Nintendo eShop!… Expand"
  },
  {
    "name": "Tetrobot and Co.",
    "details_link": "https://www.metacritic.com/game/pc/tetrobot-and-co",
    "publisher": "Swing Swing Submarine",
    "release_date": "Oct 22 2013",
    "developers": [
      "Swing Swing Submarine"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Wii U",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 72,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/5/91cca8abaa600d8b5c1d65bdea30137d-98.jpg",
    "descriptions": "Tetrobot is the world's most popular and reliable robot, but he's not perfect. That's why Maya has built him a microscopic little brother, Psychobot.\r Help Maya guide Psy through Tetrobot's cogs and circuits: by swallowing blocks of matter and spitting them out, they can repair anything.Tetrobot is the world's most popular and reliable robot, but he's not perfect. That's why Maya has built him a microscopic little brother, Psychobot.\r Help Maya guide Psy through Tetrobot's cogs and circuits: by swallowing blocks of matter and spitting them out, they can repair anything. Learn how pipes, lasers, fans and other electronic devices work, learn how to alter the chemical properties of slime, and collect all the memory blocks that you find on the way.\r The owners of damaged Tetrobots all around the world rely on Maya and Psy: they're the only people who can repair their precious robots.… Expand"
  },
  {
    "name": "Wings",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/wings",
    "publisher": "Metro3D",
    "release_date": "Feb 13 2003",
    "developers": [
      "Crawfish Interactive"
    ],
    "platforms": "Game Boy Advance",
    "genres": [
      "Action",
      "Shooter",
      "Rail"
    ],
    "meta_score": 72,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/0/48b3ad80a0bce526dacb4ec4b6632a17-98.jpg",
    "descriptions": "Take to the skies at the dawn of aviation in Europe's most brutal conflict! Relive the action, glory and daring of World War I through the eyes of a rookie pilot in the Allied or German forces. Soar to the top of your squadron as you fight through 220 missions over two separate campaigns.Take to the skies at the dawn of aviation in Europe's most brutal conflict! Relive the action, glory and daring of World War I through the eyes of a rookie pilot in the Allied or German forces. Soar to the top of your squadron as you fight through 220 missions over two separate campaigns. Strage the front lines, bomb enemy bases and engage cunning Aces in thrilling first-person dogfights. Defend the free world as an Allied pilot or conquer it in the name of the Kaiser!… Expand"
  },
  {
    "name": "Call of Duty Classic",
    "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-classic",
    "publisher": "Activision",
    "release_date": "Dec  2 2009",
    "developers": [
      "Infinity Ward"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "1-32 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Third-Person",
      "Historic",
      "Tactical",
      "Historic",
      "Arcade"
    ],
    "meta_score": 72,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/9/a121633443b8f6058a012154b91280c8-98.jpg",
    "descriptions": "[Xbox Live Arcade]  For the first time ever, Infinity Ward's 2003 award-winning game that launched a franchise comes to consoles in Call of Duty Classic. Relive the original Call of Duty experience in high definition, including online multiplayer. Battlefield action: Experience the cinematic[Xbox Live Arcade]  For the first time ever, Infinity Ward's 2003 award-winning game that launched a franchise comes to consoles in Call of Duty Classic. Relive the original Call of Duty experience in high definition, including online multiplayer. Battlefield action: Experience the cinematic intensity of World War II's biggest conflicts including D-Day, Stalingrad, and the Battle of Berlin. Play through 24 epic single-player missions across four interconnected campaigns. [Activision]… Expand"
  },
  {
    "name": "Skate It",
    "details_link": "https://www.metacritic.com/game/ds/skate-it",
    "publisher": "Electronic Arts",
    "release_date": "Nov 19 2008",
    "developers": [
      "Exient Entertainment"
    ],
    "platforms": "DS",
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Alternative",
      "Individual",
      "Skateboarding",
      "Skateboarding",
      "Skate / Skateboard"
    ],
    "meta_score": 72,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/1/ca49c02c12a96589ca9ae4d7d6d6baf8-98.jpg",
    "descriptions": "Skate It has Nintendo players riding with the skate pros, owning the best spots in San Vanelona and pulling off the sickest tricks using the popular FlickIt controls. Loaded with all-new gameplay features, Skate It breaks new ground by introducing innovative support for the Wii Balance BoardSkate It has Nintendo players riding with the skate pros, owning the best spots in San Vanelona and pulling off the sickest tricks using the popular FlickIt controls. Loaded with all-new gameplay features, Skate It breaks new ground by introducing innovative support for the Wii Balance Board which gives players a fresh way to create their own signature skateboarding style. Skate It unleashes the FlickIt revolution on to the Nintendo platforms, letting gamers use the Wii remote or the Nintendo DS stylus to string together their best tricks for the ultimate skate line. The Wii remote becomes a skateboard and reacts to gestures that mirror actual skate flips and moves. Players can also deepen this experience by planting their feet on the Wii Balance Board. Skate It brings the Skate franchise to a new level of creative ingenuity and gameplay excellence. [Electronic Arts]… Expand"
  },
  {
    "name": "Section 8",
    "details_link": "https://www.metacritic.com/game/playstation-3/section-8",
    "publisher": "TimeGate Studios",
    "release_date": "Mar 25 2010",
    "developers": [
      "TimeGate Studios"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 32 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 72,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/4/667bb97f743f87054961dcf2a614482f-98.jpg",
    "descriptions": "On the war-torn planets of tomorrow, mankind's greatest battle is about to begin. With its frontier colonies devastated by a growing insurrection, Earth dispatches the elite 8th Armored Infantry (nicknamed \"Section 8\") to repel the coming onslaught. The nickname refers to an old UnitedOn the war-torn planets of tomorrow, mankind's greatest battle is about to begin. With its frontier colonies devastated by a growing insurrection, Earth dispatches the elite 8th Armored Infantry (nicknamed \"Section 8\") to repel the coming onslaught. The nickname refers to an old United States military regulation where a soldier would be dismissed from service through being mentally unfit for duty. The near-suicidal missions that this division volunteers for brands them as insane by other military units. Section 8 deploys by 'burning in' from their orbital drop ships tens of thousands of feet above the battlefield, utilizing the most advanced arsenal of military hardware known to man. Their mission: to scout and secure difficult objectives and smash enemy defenses in lightning-quick assaults. An intense first-person shooter, Section 8 allows players to dynamically alter the flow of combat as they see fit. Employing tactical assets and on-demand vehicle deliveries, players are given unprecedented strategic control over epic sci-fi battlefields. [SouthPeak Interactive]… Expand"
  },
  {
    "name": "FIFA 07 Soccer",
    "details_link": "https://www.metacritic.com/game/ds/fifa-07-soccer",
    "publisher": "EA Sports",
    "release_date": "Oct  3 2006",
    "developers": [
      "EA Canada"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "DS"
    ],
    "num_players": "1 Player",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 72,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/0/06130902ca32c860c99ea05fdb9ace0b-98.jpg",
    "descriptions": "FIFA 07 delivers complete authenticity with licenses for all the world's top leagues, including MLS and Mexican 1st Division in North America, and 26 others from over 20 nations. This year, you have the power to shape your club's destiny in the EA Sports Interactive Leagues, a new onlineFIFA 07 delivers complete authenticity with licenses for all the world's top leagues, including MLS and Mexican 1st Division in North America, and 26 others from over 20 nations. This year, you have the power to shape your club's destiny in the EA Sports Interactive Leagues, a new online mode that enables you to pit your club against supporters of your real-world opponents. The online interactive leagues feature the F.A. Premier League, Bundesliga, French League and the Mexican 1st Division. [Electronic Arts]… Expand"
  },
  {
    "name": "Ninja Gaiden: Master Collection",
    "details_link": "https://www.metacritic.com/game/switch/ninja-gaiden-master-collection",
    "publisher": "Koei Tecmo Games",
    "release_date": "Jun 10 2021",
    "developers": [
      "Team Ninja"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 72,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/1/7f2958e56783a740a46a0baa908a10a2-98.jpg",
    "descriptions": "Three extremely high speed and intense ninja action games are now available in one package!Enjoy 3 games from the NINJA GAIDEN series in this single collection. \n\nThe nostalgic yet timeless high-speed action of the series unfolds on the latest hardware, so look forward to heated battlesThree extremely high speed and intense ninja action games are now available in one package!Enjoy 3 games from the NINJA GAIDEN series in this single collection. The nostalgic yet timeless high-speed action of the series unfolds on the latest hardware, so look forward to heated battles with fearsome opponents!In addition to Ryu Hayabusa, the 4 female characters Ayane, Rachel, Momiji, and Kasumi are also playable. Pair up favorite characters, and switch between characters during battles.The heroines included in this title are the same as the original versions. In addition, the characters that are playable and scenes (modes) vary for each title.Most of the previously released game modes and DLC costumes for each title are included in this thrilling collection. In addition to Ryu Hayabusa, each of the other characters also have many different costumes to choose from, allowing for action packed battles in outfits of your choice.Included Titles:* NINJA GAIDEN Sigma (NINJA GAIDEN )* NINJA GAIDEN Sigma 2 (NINJA GAIDEN 2)* NINJA GAIDEN 3: Razor's EdgeClassic Costumes Included DLC costumes included… Expand"
  },
  {
    "name": "Roogoo",
    "details_link": "https://www.metacritic.com/game/pc/roogoo",
    "publisher": "SouthPeak Games",
    "release_date": "Jun 24 2008",
    "developers": [
      "SouthPeak Games"
    ],
    "platforms": [
      "Xbox 360",
      "PC"
    ],
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Puzzle",
      "General",
      "Puzzle",
      "General"
    ],
    "meta_score": 72,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/9/a33c3f0ce4c08c0d7e00a5460851ab21-98.jpg",
    "descriptions": "Roogoo is an innovative and unusual 3D puzzle game that has players guide and stack different shaped blocks through various platforms to not only save planet Roo, but the entire Roogoo race. Roogoo tasks players with guiding meteors in the form of shaped blocks through a series of rotatingRoogoo is an innovative and unusual 3D puzzle game that has players guide and stack different shaped blocks through various platforms to not only save planet Roo, but the entire Roogoo race. Roogoo tasks players with guiding meteors in the form of shaped blocks through a series of rotating disks as a means of saving planet Roo and the entire Roogoo race. If aligned correctly, the disks allow the blocks to reach the ground and scores are awarded. Various obstacles and enemies will impede the blocks’ movement and with the flow of meteor blocks steadily increasing as the game progresses, players will have to think on their feet to save the Roogoo and rack up seriously high scores. [SouthPeak Interactive]… Expand"
  },
  {
    "name": "Dr. Mario Online RX",
    "details_link": "https://www.metacritic.com/game/wii/dr-mario-online-rx",
    "publisher": "Nintendo",
    "release_date": "May 26 2008",
    "developers": [
      "Arika",
      "Nintendo"
    ],
    "platforms": "Wii",
    "num_players": "4  Online",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Puzzle",
      "Puzzle",
      "Matching",
      "Matching"
    ],
    "meta_score": 72,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/1/20afb6e2e8368a012b4df629cbfc4dd3-98.jpg",
    "descriptions": "[WiiWare] Also known as \"Dr. Mario & Germ Buster\"  The doctor is in! Mario takes a break from his adventuring ways and once again dons his stethoscope for a new generation of germ-battling mayhem. In addition to the classic mode of using vitamins to exterminate viruses, you'll find two[WiiWare] Also known as \"Dr. Mario & Germ Buster\"  The doctor is in! Mario takes a break from his adventuring ways and once again dons his stethoscope for a new generation of germ-battling mayhem. In addition to the classic mode of using vitamins to exterminate viruses, you'll find two battle modes and an online multiplayer mode where you can hone your skills against players from around the world. Feel like challenging a friend who doesn't have Dr. Mario Online Rx? Then the WiiWare-exclusive Friend Battle Demo is just what the doctor ordered. Or maybe you'd like some help taking on those nasty viruses? Try out Virus Buster, where four players can simultaneously move capsules simply by pointing at them with a Wii Remote controller. Any way you look at it, Dr. Mario Online Rx is a prescription for fun that everyone can enjoy. [Nintendo]… Expand"
  },
  {
    "name": "Soulstice",
    "details_link": "https://www.metacritic.com/game/playstation-5/soulstice",
    "publisher": "Modus Games",
    "release_date": "Sep 20 2022",
    "developers": [
      "Reply Game Studios"
    ],
    "platforms": [
      "PC",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 72,
    "users_score": 5.1,
    "image": "https://static.metacritic.com/images/products/games/8/86002a78da52a93ab0255922f57d5db4-98.jpg",
    "descriptions": "The balance of the Holy Kingdom of Keidas is compromised when powerful, feral creatures known as \"Wraiths\" invade from the other side of the Veil, threatening to consume the living. The \"Chimeras\", hybrid warriors born of the union of two souls, are the only ones who can protect humankind.The balance of the Holy Kingdom of Keidas is compromised when powerful, feral creatures known as \"Wraiths\" invade from the other side of the Veil, threatening to consume the living. The \"Chimeras\", hybrid warriors born of the union of two souls, are the only ones who can protect humankind.\r Briar and Lute are two sisters who have been reborn as a Chimera. The transformation has granted Briar superhuman strength and resilience, while Lute, who was sacrificed in order to bind her soul to her sister's, has become a ghost with mystical powers. Voiced by Stefanie Joosten (Metal Gear Solid 5), Briar and Lute are sent on a mission to reclaim a city in ruins that has been ravaged by the Wraiths, only to discover that the Order they belong to has a far more complex plan in mind.\r Explore a dark world brimming with hidden mysteries, master a diverse combat system, and inhabit the dual forces of two sisters in a coming-of-age fantasy story with fast-paced action, vicious enemies and breathtaking boss fights.… Expand"
  },
  {
    "name": "GreedFall",
    "details_link": "https://www.metacritic.com/game/pc/greedfall",
    "publisher": "Focus Home Interactive",
    "release_date": "Sep  9 2019",
    "developers": [
      "Spiders"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 72,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/5/d3142bcc879aed702a3185944e8b9bb0-98.jpg",
    "descriptions": "Explore uncharted new lands as you set foot on a remote island seeping with magic, and filled with riches, lost secrets, and fantastic creatures. Forge this new world's destiny, as you befriend or betray companions and entire factions. With diplomacy, deception and force, become part of aExplore uncharted new lands as you set foot on a remote island seeping with magic, and filled with riches, lost secrets, and fantastic creatures. Forge this new world's destiny, as you befriend or betray companions and entire factions. With diplomacy, deception and force, become part of a living, evolving world - influence its course and shape your story.\r * Engage in a core roleplaying experience achieve quests and complete objectives in a multitude of different ways through combat, diplomacy, deception, or stealth.\r* Complete freedom in character progression play as a male or female, customize your appearance, and freely choose your abilities, spells and skills.\r* Delve into a mysterious world of magic begin a grand journey and uncover ancient secrets protected by supernatural beings, manifestations of the island's earthly magic.… Expand"
  },
  {
    "name": "Smart as...",
    "details_link": "https://www.metacritic.com/game/playstation-vita/smart-as",
    "publisher": "SCEA",
    "release_date": "Oct 23 2012",
    "developers": [
      "XDEV"
    ],
    "platforms": "PlayStation Vita",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Puzzle",
      "Logic",
      "Logic"
    ],
    "meta_score": 72,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/9/2873337a32eb211bec80873c6593647e-98.jpg",
    "descriptions": "Smart As is a logic puzzle game that utilizes the various features of the PlayStation VITA."
  },
  {
    "name": "Army of Two",
    "details_link": "https://www.metacritic.com/game/xbox-360/army-of-two",
    "publisher": "EA Games",
    "release_date": "Mar  6 2008",
    "developers": [
      "EA Montreal"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 72,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/9/86f302f87e684cfef6127b231c787925-98.jpg",
    "descriptions": "Army of Two throws gamers into hot spots ripped from current day headlines where they utilize unique TWO man strategies and tactics while seamlessly transitioning between playing with intelligent Partner AI (PAI) and a live player. When one man is not enough, it takes an army of two to fightArmy of Two throws gamers into hot spots ripped from current day headlines where they utilize unique TWO man strategies and tactics while seamlessly transitioning between playing with intelligent Partner AI (PAI) and a live player. When one man is not enough, it takes an army of two to fight through war, political turmoil and a conspiracy so vast it threatens the entire world. This is EA's first original title for the next-gen systems. Army of Two is the first game to put players inside tactical warfare involving Private Military Corporations. EA has built this game with co-operative TWO man gameplay as the centerpiece of the experience. Whether you’re playing with PAI or a friend, it's about the TWO man missions, TWO man strategies and the TWO man advantage that really sets this game apart. [Electronic Arts]… Expand"
  },
  {
    "name": "The Outer Worlds: Spacer's Choice Edition",
    "details_link": "https://www.metacritic.com/game/playstation-5/the-outer-worlds-spacers-choice-edition",
    "publisher": "Obsidian Entertainment",
    "release_date": "Mar  7 2023",
    "developers": [
      "Obsidian Entertainment"
    ],
    "platforms": [
      "PC",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Western-Style"
    ],
    "meta_score": 72,
    "users_score": 4.8,
    "image": "https://static.metacritic.com/images/products/games/8/e13d951cf67a6d74ccc0c0b9a3a4036b-98.jpg",
    "descriptions": "The Outer Worlds: Spacer’s Choice Edition includes the base game and all add-on content as the definitive way to play the beloved RPG from Obsidian Entertainment. This remastered masterpiece is optimized to be the absolute best version of The Outer Worlds… even if you choose to play thisThe Outer Worlds: Spacer’s Choice Edition includes the base game and all add-on content as the definitive way to play the beloved RPG from Obsidian Entertainment. This remastered masterpiece is optimized to be the absolute best version of The Outer Worlds… even if you choose to play this critically acclaimed RPG as the absolute worst version of your character. Lost in transit while on a colonist ship bound for the edge of the galaxy, you awake decades later only to find yourself in the midst of a deep conspiracy threatening to destroy the colony. Explore the various planets and locations of Halcyon, including the mysterious Gorgon Asteroid and delightful distilleries of Eridanos. As you encounter various factions, all vying for power, the character you decide to become will determine how this player-driven story unfolds.\rIn the corporate equation for the colony, you are the unplanned variable.… Expand"
  },
  {
    "name": "Loot River",
    "details_link": "https://www.metacritic.com/game/pc/loot-river",
    "publisher": "SUPERHOT PRESENTS",
    "release_date": "May  3 2022",
    "developers": [
      "straka.studio"
    ],
    "platforms": [
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "genres": [
      "Role-Playing",
      "Roguelike"
    ],
    "meta_score": 72,
    "users_score": 4.6,
    "image": "https://static.metacritic.com/images/products/games/7/9387921f8e459ced3978d9f9fac38aa4-98.jpg",
    "descriptions": "Explore procedurally generated labyrinths in a dungeon crawling action roguelike that combines tense, real-time combat with spatial block-shifting - slide blocks of ancient ruins, fight bestial abominations, loot, explore, level-up, strategize, cast powerful spells, die and wake up anew."
  },
  {
    "name": "Need for Speed Heat",
    "details_link": "https://www.metacritic.com/game/pc/need-for-speed-heat",
    "publisher": "Electronic Arts",
    "release_date": "Nov  8 2019",
    "developers": [
      "Ghost Games"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "Up to 16 ",
    "genres": [
      "Racing",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 72,
    "users_score": 5.6,
    "image": "https://static.metacritic.com/images/products/games/3/af13ba91d1b057fecdbce153cf6f694f-98.jpg",
    "descriptions": "Hustle by day and risk it all at night in Need for Speed Heat, a white-knuckle racer that pits you against a city's rogue police force as you battle your way into street racing's elite. By day compete in the Speedhunter Showdown -- a sanctioned competition where you earn bank to customizeHustle by day and risk it all at night in Need for Speed Heat, a white-knuckle racer that pits you against a city's rogue police force as you battle your way into street racing's elite. By day compete in the Speedhunter Showdown -- a sanctioned competition where you earn bank to customize and upgrade your garage of high-performance cars. When your ride's perfectly styled and hyper-tuned, and you're ready to ramp up the intensity, drive out into the night where you and your crew take on the competition in illicit street races that build your reputation and grant you access to bigger races and better parts. But under the cover of darkness patrols a rogue task force looking to bring you down and swipe all you've earned. Take them on and risk it all for underground glory or head back to your safehouse and begin another thrilling day. The roads, the risks, and the rides never end in this street racer where your crew rolls deep, your garage is full of hot cars, and the city's your nonstop playground.… Expand"
  },
  {
    "name": "Code Vein",
    "details_link": "https://www.metacritic.com/game/pc/code-vein",
    "publisher": "Bandai Namco Games",
    "release_date": "Sep 26 2019",
    "developers": [
      "Shift",
      "Bandai Namco Games"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "2 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 72,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/7/604eeaf2c05e8ff97093f3f0f6e06db6-98.jpg",
    "descriptions": "In the not too distant future, a mysterious disaster has brought collapse to the world as we know it. Towering skyscrapers, once symbols of prosperity, are now lifeless graves of humanity's past pierced by the Thorns of Judgment. At the center of the destruction lies a hidden society ofIn the not too distant future, a mysterious disaster has brought collapse to the world as we know it. Towering skyscrapers, once symbols of prosperity, are now lifeless graves of humanity's past pierced by the Thorns of Judgment. At the center of the destruction lies a hidden society of Revenants called Vein. This final stronghold is where the remaining few fight to survive, blessed with Gifts of power in exchange for their memories and a thirst for blood. Give into the bloodlust fully and risk becoming one of the Lost, fiendish ghouls devoid of any remaining humanity. Wandering aimlessly in search of blood, the Lost will stop at nothing to satisfy their hunger. Team up and embark on a journey to the ends of hell to unlock your past and escape your living nightmare in Code Vein.… Expand"
  },
  {
    "name": "Light Fall",
    "details_link": "https://www.metacritic.com/game/switch/light-fall",
    "publisher": "Bishop Games",
    "release_date": "Apr 26 2018",
    "developers": [
      "Bishop Games"
    ],
    "platforms": [
      "PC",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 72,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/6/1b21bdfcb6ee1a588ba521c8dac618c4-98.jpg",
    "descriptions": "Craft your path in this innovative 2D platformer. Master the use of your own platform to explore the Forgotten World of Numbra and save the land and its inhabitants from an imminent threat. Do you have what it takes to survive in perilous Numbra?\n\nWith the Shadow Core in hand, reach newCraft your path in this innovative 2D platformer. Master the use of your own platform to explore the Forgotten World of Numbra and save the land and its inhabitants from an imminent threat. Do you have what it takes to survive in perilous Numbra?With the Shadow Core in hand, reach new heights and explore every nook and cranny of Numbra. Wander through the Lunar Plain, the Marshlands of Sorrows, the Vipera's Forest and the Unknown Depths, where shortcuts, alternative paths, hidden collectibles and easter eggs await you in large numbers.… Expand"
  },
  {
    "name": "Shadow Warrior 2",
    "details_link": "https://www.metacritic.com/game/playstation-4/shadow-warrior-2",
    "publisher": "Devolver Digital",
    "release_date": "May 19 2017",
    "developers": [
      "Flying Wild Hog"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 72,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/9/c980bcc9058883ba2ac830484c228d6d-98.jpg",
    "descriptions": "Shadow Warrior 2 is the evolution of Flying Wild Hog’s offbeat first-person shooter following the further misadventures of former corporate shogun Lo Wang. Now surviving as a reclusive mercenary on the edge of a corrupted world, the formidable warrior must again wield a devastatingShadow Warrior 2 is the evolution of Flying Wild Hog’s offbeat first-person shooter following the further misadventures of former corporate shogun Lo Wang. Now surviving as a reclusive mercenary on the edge of a corrupted world, the formidable warrior must again wield a devastating combination of guns, blades, magic and wit to strike down the demonic legions overwhelming the world. Battle alongside allies online in four-player co-op or go it alone in spectacular procedurally-generated landscapes to complete daring missions and collect powerful new weapons, armor, and arcane relics of legend.… Expand"
  },
  {
    "name": "Dungeons & Dragons Heroes",
    "details_link": "https://www.metacritic.com/game/xbox/dungeons-dragons-heroes",
    "publisher": "Atari",
    "release_date": "Sep 17 2003",
    "developers": [
      "Atari"
    ],
    "platforms": "Xbox",
    "num_players": "1-4 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 72,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/4/8b43fcf3396a0d7f2abd1dc29c764c78-98.jpg",
    "descriptions": "Dungeons & Dragons Heroes is the first Dungeons & Dragons-branded experience created for the Xbox.  Built from the ground up, this action RPG takes you on journey through a world filled with magic and monsters, treasures and traps, and good and evil.  Your perilous quests take you throughDungeons & Dragons Heroes is the first Dungeons & Dragons-branded experience created for the Xbox.  Built from the ground up, this action RPG takes you on journey through a world filled with magic and monsters, treasures and traps, and good and evil.  Your perilous quests take you through alternate planes of existence with dungeons and gemstones.  Improve your skills as one of four distinct characters: Fighter, Wizard, Cleric, or Thief.  The game offers both single-player or cooperative multiplayer gameplay with up to four players.  Dungeons & Dragons Heroes gives you a chance to taste victory as only a true hero can.  … Expand"
  },
  {
    "name": "Destroy All Humans! 2 - Reprobed",
    "details_link": "https://www.metacritic.com/game/pc/destroy-all-humans!-2---reprobed",
    "publisher": "THQ Nordic",
    "release_date": "Aug 30 2022",
    "developers": [
      "Black Forest Games"
    ],
    "platforms": [
      "PlayStation 5",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General",
      "Open-World"
    ],
    "meta_score": 72,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/5/395ca97f43ff89010b190587691c5fe4-98.jpg",
    "descriptions": "Crypto is back with a license to probe. The alien invader returns, groovier than ever. Experience the swinging '60s in all its chemical-induced glory and take revenge on the KGB for blowing up your mothership. You'll have to form alliances with members of the very species you came to enslave."
  },
  {
    "name": "SIMULACRA",
    "details_link": "https://www.metacritic.com/game/playstation-4/simulacra",
    "publisher": "Wales Interactive",
    "release_date": "Dec  3 2019",
    "developers": [
      "Kaigan Games OU"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Virtual",
      "Virtual Life"
    ],
    "meta_score": 72,
    "users_score": 3.9,
    "image": "https://static.metacritic.com/images/products/games/0/b1114e939af9b0eb8b9a71dd8042be87-98.jpg",
    "descriptions": "Simulacra is an interactive FMV horror game about exploring a missing woman’s phone — from the creators of Sara is Missing. Recover lost files, piece back corrupted data, and retrace her final steps. Find her before it’s too late."
  },
  {
    "name": "PlayerUnknown's Battlegrounds",
    "details_link": "https://www.metacritic.com/game/playstation-4/playerunknowns-battlegrounds",
    "publisher": "PUBG Corporation",
    "release_date": "Dec  7 2018",
    "developers": [
      "PUBG Corporation"
    ],
    "platforms": [
      "PC",
      "Stadia",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to more than 64 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Tactical"
    ],
    "meta_score": 72,
    "users_score": 3.1,
    "image": "https://static.metacritic.com/images/products/games/9/7c055d3fa9f893190ed442ce0f9490f9-98.jpg",
    "descriptions": "From the makers of the best-selling PC phenomenon, PlayerUnknown's Battlegrounds drops players into a competitive survival battle where you'll engage in a heart-racing fight to be the last player left alive. Loot supplies, find weapons and gear-up to take on the competition. Emerge the loneFrom the makers of the best-selling PC phenomenon, PlayerUnknown's Battlegrounds drops players into a competitive survival battle where you'll engage in a heart-racing fight to be the last player left alive. Loot supplies, find weapons and gear-up to take on the competition. Emerge the lone survivor in a thrilling game experience full of unexpected, adrenaline-pumping moments.FEATURES:* The Battleground Awaits: Parachute onto a massive remote island with nothing but your wits and the clothes on your back. Explore, loot and locate weapons or use vehicles to find supplies and gear-up for fast-paced combat.* Claim Victory: Defeat every player on the map to earn your bragging rights as the last player left standing. Not just a Game. This is Battle Royale. * Xbox One X Enhanced: PlayerUnknown's Battlegrounds is Xbox One X Enhanced, with High Dynamic Range technology to bring out the true visual depth of the battleground.… Expand"
  },
  {
    "name": "Shape of the World",
    "details_link": "https://www.metacritic.com/game/playstation-4/shape-of-the-world",
    "publisher": "Hollow Tree Games",
    "release_date": "Jun  5 2018",
    "developers": [
      "Seaven Studio",
      "Hollow Tree Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 72,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/1/08abf68eb81dbcd0054ec7df76b0cfa4-98.jpg",
    "descriptions": "A first-person exploration game that grows around you. Without your presence, will the forest still come alive?"
  },
  {
    "name": "Screencheat",
    "details_link": "https://www.metacritic.com/game/xbox-one/screencheat",
    "publisher": "Surprise Attack",
    "release_date": "Mar  1 2016",
    "developers": [
      "Samurai Punk"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Tactical",
      "Arcade"
    ],
    "meta_score": 72,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/5/120a1f1f30605d059107efc082d09e9e-98.jpg",
    "descriptions": "Screencheat is the ridiculous split-screen shooter where everyone is invisible so you have to screencheat (Screencheat - verb: to look at your opponents screens. Stop screencheating you cheater!). Master a wide variety of one-hit kill weapons including a blunderbuss, a car engine that shootsScreencheat is the ridiculous split-screen shooter where everyone is invisible so you have to screencheat (Screencheat - verb: to look at your opponents screens. Stop screencheating you cheater!). Master a wide variety of one-hit kill weapons including a blunderbuss, a car engine that shoots bouncing plasma balls and a teddy bear loaded with explosives. Train your skills in the solo time trials then engage in fast and frantic combat with up to eight players locally on the couch or online. With colourful maps, unique modes and a huge number of customisation options including wacky mutators, Screencheat is the ultimate party FPS.… Expand"
  },
  {
    "name": "Amnesia: Memories",
    "details_link": "https://www.metacritic.com/game/playstation-vita/amnesia-memories",
    "publisher": "Idea Factory",
    "release_date": "Aug 25 2015",
    "developers": [
      "Idea Factory"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch",
      "PlayStation Vita"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Visual Novel"
    ],
    "meta_score": 72,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/2/35920ab9b73628f6206ac67ae1ed8556-98.jpg",
    "descriptions": "On the 1st of August, you awake as the Heroine, with previous memories of who you are somehow snatched away from you. In your confusion, a mysterious spirit named Orion appears to help you regain your memories.  Youll explore your own world as a complete stranger, trying to understand whatOn the 1st of August, you awake as the Heroine, with previous memories of who you are somehow snatched away from you. In your confusion, a mysterious spirit named Orion appears to help you regain your memories.  Youll explore your own world as a complete stranger, trying to understand what was once familiar all while hiding your condition from the five men close to you. Because, as Orion warns, you may jeopardize any chance of recovering your memories if anyone finds out. Its now up to you recover the past to rewrite your future love story!… Expand"
  },
  {
    "name": "Magicka 2",
    "details_link": "https://www.metacritic.com/game/playstation-4/magicka-2",
    "publisher": "Paradox Interactive",
    "release_date": "May 26 2015",
    "developers": [
      "Pieces Interactive"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Fantasy",
      "Action Adventure",
      "General"
    ],
    "meta_score": 72,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/6/ebb265cce71eab3344b1490d77a8ffd2-98.jpg",
    "descriptions": "Magicka 2 brings the spellcasting system, irreverent humor, and relationship-testing friendly fire into an all-new adventure with up to 4-player co-op for the PlayStation 4 and PC."
  },
  {
    "name": "Resident Evil 5",
    "details_link": "https://www.metacritic.com/game/switch/resident-evil-5",
    "publisher": "Capcom",
    "release_date": "Oct 29 2019",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One",
      "Switch"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 72,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/2/838800d505c3109842b6d6e53e288c13-98.jpg",
    "descriptions": "The biohazard threat has not ended: Just when it seemed that the menace of Resident Evil had been destroyed, along comes a new terror to send shivers down players' spines. Chris Redfield, returning Resident Evil hero, has followed the path of the evil literally around the globe. AfterThe biohazard threat has not ended: Just when it seemed that the menace of Resident Evil had been destroyed, along comes a new terror to send shivers down players' spines. Chris Redfield, returning Resident Evil hero, has followed the path of the evil literally around the globe. After joining a new organization, Chris heads to Africa where the latest bioterrorism threat is literally transforming the people and animals of the city into mindless, maddened creatures. He is joined by a new partner, Sheva Alomar, who lends her strength, intelligence and sharp-shooting skills to the mission. In order to survive, Chris and Sheva must work together to take on the challenges of discovering the truth behind this evil plot. Utilizing a revolutionary new 2-player co-op mode of gameplay, players assume control of either Chris or Sheva and experience Resident Evil in new ways. In Resident Evil 5, Capcom has players fearing the daylight as much as they have feared shadow in previous games.… Expand"
  },
  {
    "name": "Cities: Skylines - Snowfall",
    "details_link": "https://www.metacritic.com/game/pc/cities-skylines---snowfall",
    "publisher": "Paradox Interactive",
    "release_date": "Feb 18 2016",
    "developers": [
      "Colossal Order"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "genres": [
      "Strategy",
      "Management",
      "Government"
    ],
    "meta_score": 72,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/5/91dfa4a07569064bfa4f353557dec9ec-98.jpg",
    "descriptions": "In Snowfall, the difficulty heats up when the city cools down, thanks to a new in-game temperature reading that will have residents bundling up for warmth when the weather outside is frightful. Cosmetic weather, composed of rain and fog, will be added to Cities: Skylines as part of a freeIn Snowfall, the difficulty heats up when the city cools down, thanks to a new in-game temperature reading that will have residents bundling up for warmth when the weather outside is frightful. Cosmetic weather, composed of rain and fog, will be added to Cities: Skylines as part of a free update, along with other features to be announced soon. Players who own Snowfall will get to face new challenges such as ensuring that their city infrastructure can handle seasonal heating demands - and, when the snow starts falling, that the roads can stay clear. New snowplow services will be required to prevent traffic from freezing in place, while new all-weather trams and expanded public transit options can help residents and visitors alike get around town - and visit the new winter parks and landmarks available in Snowfall.… Expand"
  },
  {
    "name": "Rail Simulator",
    "details_link": "https://www.metacritic.com/game/pc/rail-simulator",
    "publisher": "Electronic Arts",
    "release_date": "Jan 16 2008",
    "developers": [
      "Kuju Entertainment"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Simulation",
      "Train",
      "Vehicle",
      "Train"
    ],
    "meta_score": 72,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/0/0df9a93bc05fbcde499efa525660591b-98.jpg",
    "descriptions": "Rail Simulator is the new train simulation game from Kuju Entertainment. Published by Electronic Arts, the world's largest publisher of computer and video games, Rail Simulator brings the railways to life for everyone from the casual train fan to the dedicated enthusiast. [Kuju Entertainment]"
  },
  {
    "name": "Dragon Ball Z: Budokai Tenkaichi",
    "details_link": "https://www.metacritic.com/game/playstation-2/dragon-ball-z-budokai-tenkaichi",
    "publisher": "Atari",
    "release_date": "Oct 18 2005",
    "developers": [
      "Spike"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 72,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/7/d6823699ab801aaf633a31388b5ab662-98.jpg",
    "descriptions": "Everything before it was just training. Dragon Ball Z: Budokai Tenkaichi combines fighting and flying in wide open, destructible 3D environments. In the air, on the ground or under water, DBZ Budokai Tenkaichi gives players the ability to battle with unprecedented power and freedom.Everything before it was just training. Dragon Ball Z: Budokai Tenkaichi combines fighting and flying in wide open, destructible 3D environments. In the air, on the ground or under water, DBZ Budokai Tenkaichi gives players the ability to battle with unprecedented power and freedom. Experience the intensity of DBZ fighting in an all-new way by combining melee combat, energy attacks and 3D flight with fully interactive recreation of the Dragon Ball universe. With its intense battles, high-speed flight and deep storyline, DBZ Budokai Tenkaichi offers players a \"superhero\" experience of epic proportions - it's the DBZ game fans have been waiting for. [Atari]… Expand"
  },
  {
    "name": "Marvel vs. Capcom: Infinite",
    "details_link": "https://www.metacritic.com/game/playstation-4/marvel-vs-capcom-infinite",
    "publisher": "Capcom",
    "release_date": "Sep 19 2017",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Fighting",
      "2D"
    ],
    "meta_score": 72,
    "users_score": 4.6,
    "image": "https://static.metacritic.com/images/products/games/2/06027e0c7c7e76808d1090a7f97a631a-98.jpg",
    "descriptions": "The epic clash between two storied universes returns with Marvel vs. Capcom: Infinite, the next era of the action-fighting game series. Marvel and Capcom universes collide like never before as iconic characters team up for action-packed player-versus-player combat."
  },
  {
    "name": "Pac 'n Roll",
    "details_link": "https://www.metacritic.com/game/ds/pac-n-roll",
    "publisher": "Namco",
    "release_date": "Aug 23 2005",
    "developers": [
      "Namco"
    ],
    "platforms": "DS",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "3D",
      "3D"
    ],
    "meta_score": 72,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/8/6200463354b23d6a9b34738a5ec5cdf9-98.jpg",
    "descriptions": "In Pac'N Roll, the inhabitants of Pac-World have been turned into spheres by the evil monster Golvis’ Ghost Light. Pac-Man must roll his way through Ghost-Land, collecting pellets and confronting Ghosts to save his family and restore peace to Pac-Land. Introducing an innovative new controlIn Pac'N Roll, the inhabitants of Pac-World have been turned into spheres by the evil monster Golvis’ Ghost Light. Pac-Man must roll his way through Ghost-Land, collecting pellets and confronting Ghosts to save his family and restore peace to Pac-Land. Introducing an innovative new control scheme, Pac'N Roll lets players control Pac-Man with the Nintendo DS stylus. Players can roll and dash around the environment as well as execute maneuvers such as hairpin turns, immediate stops and precision rolling with effortless strokes of the stylus. In his quest to save Pac-Land, Pac-Man will venture through stages such as Castle Pac, Gyro-Jungle and the Ghost House, while facing perilous hazards like moving floors, dash panels, jump zones and wind zones. Along the way, Pac-Man will find power-ups like the Winged Chocolate, allowing him to fly through the worlds and jump over Ghosts, or the \"Knight Chocolate,\" providing him with armor which grants him the power to crash through walls and withstand more damage. Pac’N Roll also includes the original Pac-Man arcade game, allowing up to two players to munch on pellets and claim the highest score. [Namco]… Expand"
  },
  {
    "name": "Dead Rising 2: Off the Record",
    "details_link": "https://www.metacritic.com/game/xbox-360/dead-rising-2-off-the-record",
    "publisher": "Capcom",
    "release_date": "Oct 11 2011",
    "developers": [
      "Capcom Vancouver"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox One",
      "Xbox 360"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action Adventure",
      "Horror",
      "Horror",
      "Open-World"
    ],
    "meta_score": 72,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/4/ebec6a13f1c83cb5782380e7e2470930-98.jpg",
    "descriptions": "Dead Rising 2: Off the Record, sees photojournalist and original hero of Dead Rising's Willamette incident, Frank West take center stage as players experience a reimagining of the Fortune City outbreak. Forget what you know about Dead Rising 2,\"Frank West is back in the game!\" The new, \"OffDead Rising 2: Off the Record, sees photojournalist and original hero of Dead Rising's Willamette incident, Frank West take center stage as players experience a reimagining of the Fortune City outbreak. Forget what you know about Dead Rising 2,\"Frank West is back in the game!\" The new, \"Off the Record\" storyline means an all new Dead Rising 2 experience. Frank will face off against more twisted enemies, build more outrageous combo weapons, follow his own unique mission structure and explore brand new areas of Fortune City to get his biggest scoop yet. Frank's come back means the return of his trusty camera, with players able to earn Prestige Points (PP) for specific photo opportunities that are graded against criteria such as horror, drama, erotica and brutality. In addition to the new scenario and gameplay enhancements, Dead Rising 2: Off the Record offers a suite of technical updates including load time optimizations, improved network performance and a host of system upgrades to deliver a more satisfying Dead Rising experience. … Expand"
  },
  {
    "name": "MouseCraft",
    "details_link": "https://www.metacritic.com/game/playstation-4/mousecraft",
    "publisher": "Curve Studios",
    "release_date": "Jul  8 2014",
    "developers": [
      "Crunching Koalas"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation Vita",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "General"
    ],
    "meta_score": 72,
    "users_score": 5.7,
    "image": "https://static.metacritic.com/images/products/games/8/ec73e9a527ba25d1f7b9b9043a292053-98.jpg",
    "descriptions": "Crunching Koalas, the team behind the title, promises that its debut outing combines the best elements of Tetris and Lemmings to create a puzzle experience that really tests your wits. Moreover, the game features a level editor, and is both cross-buy and cross-save compatible."
  },
  {
    "name": "Leisure Suit Larry: Wet Dreams Don't Dry",
    "details_link": "https://www.metacritic.com/game/pc/leisure-suit-larry-wet-dreams-dont-dry",
    "publisher": "CrazyBunch",
    "release_date": "Nov  7 2018",
    "developers": [
      "CrazyBunch"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Point-and-Click"
    ],
    "meta_score": 72,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/0/4d38fa8ad6ed25702dc8a27362fb0563-98.jpg",
    "descriptions": "Hey ladies, I’m back in business. My new adventure, Leisure Suit Larry - Wet Dreams Don’t Dry, takes me – whatever the route or twist of fate – from the end of the ’80s directly into the 21st century and wow, how the world has changed."
  },
  {
    "name": "Zanki Zero: Last Beginning",
    "details_link": "https://www.metacritic.com/game/playstation-4/zanki-zero-last-beginning",
    "publisher": "Spike Chunsoft",
    "release_date": "Apr  9 2019",
    "developers": [
      "Spike Chunsoft"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "General"
    ],
    "meta_score": 72,
    "users_score": 6.1,
    "image": "https://static.metacritic.com/images/products/games/1/b0b33fb50af86d8b72c31270dc39ae06-98.jpg",
    "descriptions": "Play from the POV of one of eight protagonists in each chapter and explore the dungeons, towers, and islands to uncover the deadly sins of the protagonists' pasts. Hunt for materials & food while fending off monsters in real-time battle environments; but don't forget to eat, sleep, & go toPlay from the POV of one of eight protagonists in each chapter and explore the dungeons, towers, and islands to uncover the deadly sins of the protagonists' pasts. Hunt for materials & food while fending off monsters in real-time battle environments; but don't forget to eat, sleep, & go to the bathroom (seriously, it's bad for your health & fatal for your party). With every life cycle lasting only 13 days, each clone’s stats, abilities, and capabilities differ as they grow from youths to old age. … Expand"
  },
  {
    "name": "Dead Rising 4: Frank's Big Package",
    "details_link": "https://www.metacritic.com/game/playstation-4/dead-rising-4-franks-big-package",
    "publisher": "Capcom",
    "release_date": "Dec  5 2017",
    "developers": [
      "Capcom Vancouver"
    ],
    "platforms": "PlayStation 4",
    "num_players": "Up to 4 ",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 72,
    "users_score": 5.2,
    "image": "https://static.metacritic.com/images/products/games/9/048720419dc4daca138ff6867924b296-98.jpg",
    "descriptions": "Dead Rising 4: Frank's Big Package is a special delivery that will let PlayStation 4 players unwrap the Dead Rising 4 main game, in addition to all other previously released game content. The new bundle will also introduce a game mode called \"Capcom Heroes,\" an all-new way to experience theDead Rising 4: Frank's Big Package is a special delivery that will let PlayStation 4 players unwrap the Dead Rising 4 main game, in addition to all other previously released game content. The new bundle will also introduce a game mode called \"Capcom Heroes,\" an all-new way to experience the Dead Rising 4 story that lets Frank West wear outfits and perform outrageous special attacks inspired by classic Capcom characters.In Dead Rising 4, players will step foot inside the seasonal festivities of Willamette, Colorado amidst a mysterious outbreak that is spreading across the Willamette Memorial Megaplex Mall and surrounding town. Photojournalist Frank West returns 16 years after the events of the original Dead Rising. An ordinary guy that finds himself in extraordinary situations, Frank seeks to uncover the truth behind a government conspiracy responsible for the outbreak. With intense action and an unmatched level of weapon and character customization, Dead Rising 4, delivers a heart pounding experience as players explore, scavenge and fight to survive in an open world sandbox on the brink of the next zombie apocalypse.… Expand"
  },
  {
    "name": "The Cave",
    "details_link": "https://www.metacritic.com/game/wii-u/the-cave",
    "publisher": "Sega",
    "release_date": "Jan 22 2013",
    "developers": [
      "Double Fine Productions"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "Wii U"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 72,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/2/8311091b08f7d76048b1767ed96b7e0b-98.jpg",
    "descriptions": "SEGA of America Inc. and Double Fine Productions have joined forces with legendary game designer, Ron Gilbert, to create The Cave. In this 2D puzzle action and adventure game, players will assemble a team of three from seven unlikely adventurers, each with their own unique personalities andSEGA of America Inc. and Double Fine Productions have joined forces with legendary game designer, Ron Gilbert, to create The Cave. In this 2D puzzle action and adventure game, players will assemble a team of three from seven unlikely adventurers, each with their own unique personalities and stories. From there, you will descend into the mysterious depths to explore locations including a subterranean amusement park and a medieval castle, not to mention a fully armed and ready-to-launch nuclear tipped ICBM. The Cave awaits.… Expand"
  },
  {
    "name": "Heavy Rain: Move Edition",
    "details_link": "https://www.metacritic.com/game/playstation-3/heavy-rain-move-edition",
    "publisher": "SCEA",
    "release_date": "Sep 22 2010",
    "developers": [
      "Quantic Dream"
    ],
    "platforms": "PlayStation 3",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Adventure",
      "3D",
      "Compilation",
      "Modern",
      "Third-Person"
    ],
    "meta_score": 72,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/5/1cd195c70254a6714ac1586ac98466a9-98.jpg",
    "descriptions": "Experience a gripping psychological crime thriller filled with innumerable twists and turns, where even the smallest actions and choices can cause dramatic consequences. The hunt is on for the Origami Killer, named after his calling card of leaving folded paper shapes on victims. FourExperience a gripping psychological crime thriller filled with innumerable twists and turns, where even the smallest actions and choices can cause dramatic consequences. The hunt is on for the Origami Killer, named after his calling card of leaving folded paper shapes on victims. Four characters, each with their own motives, take part in a desperate attempt to stop the killer from claiming a new victim.… Expand"
  },
  {
    "name": "Puzzle Quest: Galactrix",
    "details_link": "https://www.metacritic.com/game/playstation-3/puzzle-quest-galactrix",
    "publisher": "D3Publisher",
    "release_date": "May  7 2009",
    "developers": [
      "Infinite Interactive"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "2  Online",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Puzzle",
      "Puzzle",
      "Matching",
      "Matching"
    ],
    "meta_score": 72,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/3/12e08d3c36d8c189e266a3dc39e0c074-98.jpg",
    "descriptions": "Enjoy a new board, new weapons, new tactics and more in this incredibly addictive puzzle gameboard battle. Collect a fleet of customizable spaceships, which endow your player with new skills and abilities, and fight in over 150 battles. Save the galaxy in your custom-made fleet of starships.Enjoy a new board, new weapons, new tactics and more in this incredibly addictive puzzle gameboard battle. Collect a fleet of customizable spaceships, which endow your player with new skills and abilities, and fight in over 150 battles. Save the galaxy in your custom-made fleet of starships. Manipulate the puzzle gems in zero gravity on an all-new hexagonal puzzle board. Battle across the galaxy in multiplayer wars and compete for rankings in online leaderboards. Short, easy pick-up and play battles, with incredible depth and RPG-style character building.… Expand"
  },
  {
    "name": "Thrillville: Off the Rails",
    "details_link": "https://www.metacritic.com/game/psp/thrillville-off-the-rails",
    "publisher": "LucasArts",
    "release_date": "Oct  9 2007",
    "developers": [
      "Frontier Developments"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox 360",
      "PSP"
    ],
    "num_players": "2  Online",
    "genres": [
      "Strategy",
      "General",
      "General"
    ],
    "meta_score": 72,
    "users_score": 1.5,
    "image": "https://static.metacritic.com/images/products/games/8/580820358383e388086b940aacd66ff3-98.jpg",
    "descriptions": "Off the Rails lives up to its name with 20 death-defying rides so outrageous, they inspire the same word from every park visitor who sees them: \"WHOA!\" Players build these incredible \"WHOA Coasters\" to leap from one track to another, launch through the air like cannonballs, blast through aOff the Rails lives up to its name with 20 death-defying rides so outrageous, they inspire the same word from every park visitor who sees them: \"WHOA!\" Players build these incredible \"WHOA Coasters\" to leap from one track to another, launch through the air like cannonballs, blast through a burning rings of fire and more. A new lighthearted story ties together more than 100 missions, complete with 34 playable multiplayer theme-park games and social interaction with park guests that's better than ever. The in-depth conversations both advance the plot and suggest better ways to manage the park. But is every guest to be trusted? [LucasArts]… Expand"
  },
  {
    "name": "Uru: The Path of the Shell",
    "details_link": "https://www.metacritic.com/game/pc/uru-the-path-of-the-shell",
    "publisher": "Ubisoft",
    "release_date": "Jul  7 2004",
    "developers": [
      "Cyan Worlds"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Adventure",
      "3D",
      "First-Person",
      "Fantasy",
      "Fantasy"
    ],
    "meta_score": 72,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/7/340ab6a77c840792ac3a9fef4c415258-98.jpg",
    "descriptions": "Uru: The Path of the Shell is the third piece of Myst's Uru adventure. This adventure's complete boxed set, Uru: Complete Chronicles, includes the content in Uru: Ages Beyond Myst, Myst Uru: To D?ni (the free downloadable expansion released in February) and Uru: The Path of the Shell. TheUru: The Path of the Shell is the third piece of Myst's Uru adventure. This adventure's complete boxed set, Uru: Complete Chronicles, includes the content in Uru: Ages Beyond Myst, Myst Uru: To D?ni (the free downloadable expansion released in February) and Uru: The Path of the Shell. The Path of the Shell challenges and rewards players with many new puzzles, new clothing options (including reward clothing), new player journals, technical features (including swimming), and five all-new Relto customization options. [Ubisoft]… Expand"
  },
  {
    "name": "Shrek 2",
    "details_link": "https://www.metacritic.com/game/xbox/shrek-2",
    "publisher": "Activision",
    "release_date": "Apr 28 2004",
    "developers": [
      "Luxoflux",
      "Inc."
    ],
    "platforms": "Xbox",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 72,
    "users_score": 5.7,
    "image": "https://static.metacritic.com/images/products/games/0/3120e622e86dcb9158bcb4ba0731fc69-98.jpg",
    "descriptions": "Shrek 2 takes players on a twisted fairy tale adventure with Shrek and his buddies.  Revisit key locations from the movie sequel while discovering all-new locations and characters.  Shrek 2 combines squad-based action with traditional action adventure elements.  You control a team of fourShrek 2 takes players on a twisted fairy tale adventure with Shrek and his buddies.  Revisit key locations from the movie sequel while discovering all-new locations and characters.  Shrek 2 combines squad-based action with traditional action adventure elements.  You control a team of four and play as Shrek or any of his ten friends, switching between each to best utilize the character's unique abilities to solve puzzles, fight monsters, and complete wild and dangerous adventures.… Expand"
  },
  {
    "name": "Hunter: The Reckoning Redeemer",
    "details_link": "https://www.metacritic.com/game/xbox/hunter-the-reckoning-redeemer",
    "publisher": "VU Games",
    "release_date": "Oct 28 2003",
    "developers": [
      "High Voltage Software"
    ],
    "platforms": "Xbox",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 72,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/4/58413697510da7c47147e8560f80ccd5-98.jpg",
    "descriptions": "Kaylie Winter has trained hard every day for the last 10 years since her parents were murdered. Eager for justice, she joins the group of Hunters as the undead threaten the streets of Ashcroft once again. Now you can play as Kaylie, or any one of the original Hunters, in Hunter theKaylie Winter has trained hard every day for the last 10 years since her parents were murdered. Eager for justice, she joins the group of Hunters as the undead threaten the streets of Ashcroft once again. Now you can play as Kaylie, or any one of the original Hunters, in Hunter the Reckoning: Redeemer and battle heartless zombies, bloodthirsty vampires, and relentless bosses. Fight solo or cooperatively with three other friends and master all the weapons, magical Edges, and special moves of a Hunter.… Expand"
  },
  {
    "name": "Spyro: Attack of the Rhynocs",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/spyro-attack-of-the-rhynocs",
    "publisher": "VU Games",
    "release_date": "Oct 27 2003",
    "developers": [
      "Digital Eclipse"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 72,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/3/58bbe90b305241114062d9f8223bb590-98.jpg",
    "descriptions": "In a terrible mishap, Spyro, Sparx, and the Professor have inadvertently torn a hole in the fabric of space between the Rhynoc and Dragon Realms. Now, at the command of the elusive Ripto, droves of Rhynocs are pouring into the Dragon Realms in yet another attempt to make life miserable. AsIn a terrible mishap, Spyro, Sparx, and the Professor have inadvertently torn a hole in the fabric of space between the Rhynoc and Dragon Realms. Now, at the command of the elusive Ripto, droves of Rhynocs are pouring into the Dragon Realms in yet another attempt to make life miserable. As Spyro, Agent 9, or Sergeant Byrd, you must help the Professor close the hole quickly before the gate becomes too big and the two realms fuse together--permanently. You can use Spyro's new abilities, including the Head-Butt Slam, Cyclone Attack, Phoenix Vision, and more.… Expand"
  },
  {
    "name": "Jurassic Park: Operation Genesis",
    "details_link": "https://www.metacritic.com/game/pc/jurassic-park-operation-genesis",
    "publisher": "VU Games",
    "release_date": "Mar 10 2003",
    "developers": [
      "Blue Tongue Entertainment"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Tycoon",
      "Management",
      "Tycoon",
      "Business / Tycoon"
    ],
    "meta_score": 72,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/9/1d17984180adf372fc592808842d2f7f-98.jpg",
    "descriptions": "Now is your chance to fulfill Dr. John Hammond's dream by successfully designing and managing the ultimate dinosaur theme park. Jurassic Park: Operation Genesis allows gamers to create the most amazing theme park he world has ever seen. As the first ever fully 3D action-sim, OperationNow is your chance to fulfill Dr. John Hammond's dream by successfully designing and managing the ultimate dinosaur theme park. Jurassic Park: Operation Genesis allows gamers to create the most amazing theme park he world has ever seen. As the first ever fully 3D action-sim, Operation Genesis gives players two games in one. Either build the ultimate dinosaur theme park or engage in 12 action-packed missions that will truly test your gaming skills. Dream it. Build it. Survive it. This truly is Jurassic Park... your way! [Vivendi Universal]… Expand"
  },
  {
    "name": "The Scorpion King: Sword of Osiris",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/the-scorpion-king-sword-of-osiris",
    "publisher": "Universal Interactive",
    "release_date": "Mar 31 2002",
    "developers": [
      "WayForward"
    ],
    "platforms": "Game Boy Advance",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 72,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/2/46bcdaf9b7cf4760cf8c8d776856535c-98.jpg",
    "descriptions": "After the death of Memnon, the evil Menthu has risen to power determined to lead his legions of warriors and destroy Egypt once and for all. As the Scorpion King, you must journey through ancient deserts overpowering everything in your patch to find the Sword of Osiris and unleash its powersAfter the death of Memnon, the evil Menthu has risen to power determined to lead his legions of warriors and destroy Egypt once and for all. As the Scorpion King, you must journey through ancient deserts overpowering everything in your patch to find the Sword of Osiris and unleash its powers on Menthu.… Expand"
  },
  {
    "name": "James Bond 007: Agent Under Fire",
    "details_link": "https://www.metacritic.com/game/playstation-2/james-bond-007-agent-under-fire",
    "publisher": "Electronic Arts",
    "release_date": "Nov 13 2001",
    "developers": [
      "EA Redwood Shores"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Modern"
    ],
    "meta_score": 72,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/4/9014d8028158eaa9e43e77c83ea15cf9-98.jpg",
    "descriptions": "The devious plans of a criminal mastermind once again threaten to bring the world's greatest nations to their knees and only one man can save them. The game's mix of intense first-person action and white-knuckle driving levels will transport the player to exotic locations where they willThe devious plans of a criminal mastermind once again threaten to bring the world's greatest nations to their knees and only one man can save them. The game's mix of intense first-person action and white-knuckle driving levels will transport the player to exotic locations where they will come face-to-face with the world's most dangerous villains. Only the clever use of firepower and tricks of the spycraft trade will allow them to save the world.  [Electronic Arts]… Expand"
  },
  {
    "name": "Hidden & Dangerous",
    "details_link": "https://www.metacritic.com/game/dreamcast/hidden-dangerous",
    "publisher": "TalonSoft",
    "release_date": "Jul  9 2000",
    "developers": [
      "Illusion Softworks"
    ],
    "platforms": [
      "PC",
      "Dreamcast"
    ],
    "genres": [
      "Action",
      "General"
    ],
    "meta_score": 72,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/6/a67c7acfcc01712ac14ea1678b3eab8a-98.jpg",
    "descriptions": "The year is 1941. Your four-man special forces team has been shot down deep inside enemy territory and is now reliant on your cunning and tactical thinking to get them safely across the border. The odds are stacked against you. Have you got what it takes?"
  },
  {
    "name": "Dragon Ball: Fusions",
    "details_link": "https://www.metacritic.com/game/3ds/dragon-ball-fusions",
    "publisher": "Bandai Namco Games",
    "release_date": "Nov 22 2016",
    "developers": [
      "Ganbarion"
    ],
    "platforms": "3DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Trainer"
    ],
    "meta_score": 72,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/4/ae7e0dafea78fe0b6abec0307bba77c5-98.jpg",
    "descriptions": "Dragon Ball Fusions is the latest Dragon Ball experience for Nintendo 3DS! Its an RPG action game that combines fighting, customization, and collecting elements to bring Dragon Ball to the next level. It features a huge character roster from Dragon Ball all the way to Dragon Ball Super."
  },
  {
    "name": "Turnip Boy Commits Tax Evasion",
    "details_link": "https://www.metacritic.com/game/pc/turnip-boy-commits-tax-evasion",
    "publisher": "Yukon Wainczak",
    "release_date": "Apr 22 2021",
    "developers": [
      "Yukon Wainczak"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 72,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/3/78e47dfcb2c4faf61d68d13d17c6933c-98.jpg",
    "descriptions": "Play as an adorable yet trouble-making turnip. Avoid paying taxes, solve plantastic puzzles, harvest crops and battle massive beasts all in a journey to tear down a corrupt vegetable government!"
  },
  {
    "name": "Shank 2",
    "details_link": "https://www.metacritic.com/game/pc/shank-2",
    "publisher": "Electronic Arts",
    "release_date": "Feb  7 2012",
    "developers": [
      "Klei Entertainment"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "genres": [
      "Action",
      "Beat-'Em-Up",
      "Beat-'Em-Up",
      "2D"
    ],
    "meta_score": 72,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/3/7218c44ff73641593f0dee4cce4dffe6-98.jpg",
    "descriptions": "Shank 2 returns with a story of redemption as Shank, a former mob hitman with a dark and vengeful past, is thrust back into action when the lives of those close to him are endangered. Expanding on the original gameâ€™s rich and intuitive combat and control system, Shank 2 continuesShank 2 returns with a story of redemption as Shank, a former mob hitman with a dark and vengeful past, is thrust back into action when the lives of those close to him are endangered. Expanding on the original gameâ€™s rich and intuitive combat and control system, Shank 2 continues Klei's tradition of making fluid brawling controls and stunningly beautiful visuals that leapfrogs the competition in the 2D side-scrolling genre. The game also introduces an intense new, arcade-style survival co-op mode that has gamers working together to take down their foes, relying on the environment and weapon pick-ups for survival.… Expand"
  },
  {
    "name": "WWE 2K22",
    "details_link": "https://www.metacritic.com/game/pc/wwe-2k22",
    "publisher": "2K Games",
    "release_date": "Mar 11 2022",
    "developers": [
      "Take-Two Interactive",
      "Visual Concepts"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "genres": [
      "Sports",
      "Individual",
      "Combat",
      "Wrestling"
    ],
    "meta_score": 72,
    "users_score": 5.8,
    "image": "https://static.metacritic.com/images/products/games/2/e8ba59708dac5bb0e7d0cc5ad2afc146-98.jpg",
    "descriptions": "Get ripped out of the stands and hit with complete control of the WWE Universe. Hitting this hard has never been so easy. Everything from the controls to the graphics have been redesigned, and feels as real as being ringside at WrestleMania. Hit with the biggest and best-looking SuperstarsGet ripped out of the stands and hit with complete control of the WWE Universe. Hitting this hard has never been so easy. Everything from the controls to the graphics have been redesigned, and feels as real as being ringside at WrestleMania. Hit with the biggest and best-looking Superstars and Legends: The Rock, Sasha Banks, Ric Flair, Alexa Bliss & more.\r… Expand"
  },
  {
    "name": "Death's Gambit",
    "details_link": "https://www.metacritic.com/game/playstation-4/deaths-gambit",
    "publisher": "Adult Swim",
    "release_date": "Aug 14 2018",
    "developers": [
      "White Rabbit Interactive"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Role-Playing",
      "Platformer",
      "Action RPG",
      "Metroidvania"
    ],
    "meta_score": 72,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/8/de997a3100371c36b12cc7dc6a2e2a41-98.jpg",
    "descriptions": "Death's Gambit is a challenging Action-RPG through which you explore an alien medieval planet filled with beasts, knights, and horrors. As an agent of Death, bound to his service, banish your fears and endure the struggle that lies at the heart of Leydia."
  },
  {
    "name": "Wattam",
    "details_link": "https://www.metacritic.com/game/playstation-4/wattam",
    "publisher": "Annapurna Interactive",
    "release_date": "Dec 17 2019",
    "developers": [
      "Funomena"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "Adventure",
      "General",
      "3D",
      "Linear",
      "Third-Person"
    ],
    "meta_score": 72,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/1/066f17841e3eee0acee4f98c78278b3a-98.jpg",
    "descriptions": "The idea for this game came from when Keita was playing with his two-year old son, and wondered about what if all toys lived, and connected by themselves? It would be such a fun world to explore and play with! The word “Wattam” itself is actually composed of the Tamil and Japanese words forThe idea for this game came from when Keita was playing with his two-year old son, and wondered about what if all toys lived, and connected by themselves? It would be such a fun world to explore and play with! The word “Wattam” itself is actually composed of the Tamil and Japanese words for “making a circle” or “making a loop”. The initial prototype for this game was made by Keita and his friend Vikram, who are from these two cultures respectively, and this new word acknowledges one of the game’s core inspirations: making connections between different types of things.… Expand"
  },
  {
    "name": "Killing Floor",
    "details_link": "https://www.metacritic.com/game/pc/killing-floor",
    "publisher": "Tripwire Interactive",
    "release_date": "May 14 2009",
    "developers": [
      "Tripwire Interactive"
    ],
    "platforms": "PC",
    "num_players": "Up to 6 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 72,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/3/7adadae73a32af96275af9ad3f928ecf-98.jpg",
    "descriptions": "It’s a co-op survival horror game. Up to 6 players in online co-op mode, or just you, on your own, playing the Solo mode. The aim - cleanse each area of zombies, in waves, until you get to the last one. The Big One. The Patriarch. Then exterminate him, too. Actually, they aren’t \"zombies\".It’s a co-op survival horror game. Up to 6 players in online co-op mode, or just you, on your own, playing the Solo mode. The aim - cleanse each area of zombies, in waves, until you get to the last one. The Big One. The Patriarch. Then exterminate him, too. Actually, they aren’t \"zombies\". They are the left-over \"specimens\" from a cheap and dirty government program to clone soldier-monsters. The basic ones will just munch on your arm and try to disembowel you. The bigger ones were the first ones they tried arming. Nothing much. Just a chainsaw or a blade for starters. They had just got on to the chain gun and rockets when the government tried to secretly shut down their secret program. But, in the typical way these things go, the program didn’t want to be shut down. The specimens got loose. No-one was left alive to turn off the specimen-cloning equipment. And now they are running amok. Well, some of them are running amok. Others are shambling amok or even jumping amok, but you get the idea. The police were sent in, but that wasn't even a challenge for the specimens. The first army units hadn't been warned what to expect. The screams of its got a bloody chainsaw!\" over the radios probably didn’t do much for morale, as whole units were chewed up. Quite literally, in some cases, of course. And now, there is just you. And a few friends. The few survivors from the first police and army units thrown in. Of course, you can’t tell anyone anything, because that would be a breach of the Official Secrets Act 1911, 1920, 1989. And that would be a disciplinary offense. So just get in there and do your bit for Queen and Country. Zombies. Lots of them. Big ones, little ones. Armed and Dangerous. JUST MAKE THEM ALL GO AWAY! [Tripwire]… Expand"
  },
  {
    "name": "El Hijo: A Wild West Tale",
    "details_link": "https://www.metacritic.com/game/switch/el-hijo-a-wild-west-tale",
    "publisher": "HandyGames",
    "release_date": "Mar 25 2021",
    "developers": [
      "Honig Studios"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Stadia",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General",
      "Linear"
    ],
    "meta_score": 72,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/4/207e9d852276bb16bc616b7789283641-98.jpg",
    "descriptions": "El Hijo: A Wild West Tale is an exciting spaghetti-western stealth game, in which you guide a 6-year-old boy on his quest to find his mother.As a six-year-old, \"El Hijo\" must always sneak past the dangers of his world. As he overcomes his challenges, he gains self-confidence and cunningEl Hijo: A Wild West Tale is an exciting spaghetti-western stealth game, in which you guide a 6-year-old boy on his quest to find his mother.As a six-year-old, \"El Hijo\" must always sneak past the dangers of his world. As he overcomes his challenges, he gains self-confidence and cunning and with it more schemes to get past his foes. On his journey, he will find himself in a remote monastery, a harsh and unforgiving stretch of desert and a frontier town rife with crime and villainy.The journey begins when a farmer and her son El Hijo are attacked by bandits who raze their farm to the ground. The mother decides to leave \"El Hijo\" at a secluded monastery in order to protect him. However, El Hijo decides that the monastic life is not for him and decides to escape. \"El Hijo - A Wild West Tale\" is a non-violent stealth game. Violence is instead exchanged with the mischievous, playfulness of a young child. Shadowplay is in the core of the game and \"El Hijo\" will often have to hide. Without needlessly adding new mechanics, the gameplay is extended naturally, as variations of existing mechanics are gradually introduced and then combined with each other to increase the challenge. These twists on familiar mechanics are often a product of the varied, increasingly dangerous environments that \"El Hijo\" must traverse to reach his ultimate goal.… Expand"
  },
  {
    "name": "Tannenberg",
    "details_link": "https://www.metacritic.com/game/xbox-one/tannenberg",
    "publisher": "Blackmill Games",
    "release_date": "Jul 24 2020",
    "developers": [
      "M2H"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox Series X",
      "Xbox One"
    ],
    "num_players": "Up to 40 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Tactical"
    ],
    "meta_score": 72,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/1/bf5f443888ddb1ac0a7e0a906ddd31a0-98.jpg",
    "descriptions": "Experience authentic First World War action with 64 player battles of maneuver on the Eastern Front. Warfare between the Russian Empire and the Central Powers is a tense battle for dominance – stay close to your squad to survive!"
  },
  {
    "name": "10 Second Ninja",
    "details_link": "https://www.metacritic.com/game/pc/10-second-ninja",
    "publisher": "Mastertronic",
    "release_date": "Mar  5 2014",
    "developers": [
      "GameDesignDan"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 72,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/6/a6e1c1344927fe0a5255ba8b0fd54871-98.jpg",
    "descriptions": "Ninjas are cool, this is an established fact of the universe. Nazi Robots from space are not cool, they are the complete opposite of cool, and Robot Hitler is out to get you, the world's first ninja.You have 10 seconds to destroy all Nazi Robots in your vicinity. IT. IS. ON.\n\nBecome theNinjas are cool, this is an established fact of the universe. Nazi Robots from space are not cool, they are the complete opposite of cool, and Robot Hitler is out to get you, the world's first ninja.You have 10 seconds to destroy all Nazi Robots in your vicinity. IT. IS. ON.Become the ultimate Ninja and take down Robot Hitler's automated autocracy in this blisteringly fast platformer.Ready, Steady, Ninja!… Expand"
  },
  {
    "name": "Guitar Hero: On Tour Decades",
    "details_link": "https://www.metacritic.com/game/ds/guitar-hero-on-tour-decades",
    "publisher": "Activision",
    "release_date": "Nov 16 2008",
    "developers": [
      "Vicarious Visions"
    ],
    "platforms": "DS",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 72,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/0/811ce573c06c6fef5599aa9bb5f1e06f-98.jpg",
    "descriptions": "Guitar Hero On Tour: Decades allows gamers to unleash their inner rockstar anytime, anywhere and for the first time ever share their music with friends as they embark on a tour through the decades of rock.  Compatible with Guitar Hero: On Tour, the game leverages the technology of itsGuitar Hero On Tour: Decades allows gamers to unleash their inner rockstar anytime, anywhere and for the first time ever share their music with friends as they embark on a tour through the decades of rock.  Compatible with Guitar Hero: On Tour, the game leverages the technology of its predecessor and expands the experience with a new progression taking players on a musical journey from the classics of the 1970’s through today’s greatest hits.  With a new library of music, characters and venues, the game delivers a portable way for gamers to unleash their inner rockstar while playing through the history of rock ’n’ roll. [Activision]… Expand"
  },
  {
    "name": "Jam Sessions",
    "details_link": "https://www.metacritic.com/game/ds/jam-sessions",
    "publisher": "Ubisoft",
    "release_date": "Sep 11 2007",
    "developers": [
      "Plato"
    ],
    "platforms": "DS",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 72,
    "users_score": 5.3,
    "image": "https://static.metacritic.com/images/products/games/4/b95100027314aed1ce1739ba1da32cc3-98.jpg",
    "descriptions": "Jam Sessions is a music experience that transforms the Nintendo DS system into a portable guitar. Players literally strum the guitar via the Touch Screen and select chords with the +Control Pad. Now even the most \"non-musical\" person to become an instant rock star. The portability of the DSJam Sessions is a music experience that transforms the Nintendo DS system into a portable guitar. Players literally strum the guitar via the Touch Screen and select chords with the +Control Pad. Now even the most \"non-musical\" person to become an instant rock star. The portability of the DS system makes Jam Sessions a concert-on-the-go, perfect for parties, commuting to school/work and other social gatherings. Jam Sessions appeals to a wide audience of music lovers and creative souls. [Ubisoft]… Expand"
  },
  {
    "name": "Marvel's Guardians of the Galaxy - Episode 2: Under Pressure",
    "details_link": "https://www.metacritic.com/game/pc/marvels-guardians-of-the-galaxy---episode-2-under-pressure",
    "publisher": "Telltale Games",
    "release_date": "Jun  6 2017",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "genres": [
      "Action",
      "Adventure",
      "General",
      "3D",
      "Third-Person"
    ],
    "meta_score": 72,
    "users_score": 5.9,
    "image": "https://static.metacritic.com/images/products/games/98w-game.jpg",
    "descriptions": "From Earth to the Milano to Knowhere and beyond, and set to the beat of awesome music, this five-part episodic series puts you in the rocket-powered boots of Star-Lord in an original Guardians adventure."
  },
  {
    "name": "Batman: Arkham City - Harley Quinn's Revenge",
    "details_link": "https://www.metacritic.com/game/xbox-360/batman-arkham-city---harley-quinns-revenge",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "May 29 2012",
    "developers": [
      "Rocksteady Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Action Adventure",
      "Fantasy",
      "Fantasy",
      "Open-World"
    ],
    "meta_score": 72,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/0/b0c4e3e368912482adaae88727aef24e-98.jpg",
    "descriptions": "As the dust settles in Gotham City, Batman is pulled back into Arkham City by its last remaining super-criminal - Harley Quinn. Now more lethal than ever and leading a homicidal gang of her own, she is hell-bent on taking her revenge against the Dark Knight."
  },
  {
    "name": "Battletoads",
    "details_link": "https://www.metacritic.com/game/xbox-one/battletoads",
    "publisher": "Rare Ltd.",
    "release_date": "Aug 20 2020",
    "developers": [
      "Rare Ltd.",
      "Dlala Studios"
    ],
    "platforms": [
      "PC",
      "Xbox One"
    ],
    "num_players": "Up to 3 ",
    "genres": [
      "Action",
      "General"
    ],
    "meta_score": 72,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/4/ecb3c37c24c0b26b8aabfbfc1c0c0995-98.jpg",
    "descriptions": "The Battletoads are Back. Rash, Zitz and Pimple are returning at last to Morph Attack their way through an all-new action-packed adventure of choreographed chaos, and couch co-op may never be the same again. 1-3 players take control of the Battletoads and team up to storm through wild andThe Battletoads are Back. Rash, Zitz and Pimple are returning at last to Morph Attack their way through an all-new action-packed adventure of choreographed chaos, and couch co-op may never be the same again. 1-3 players take control of the Battletoads and team up to storm through wild and unpredictable stages with only one rule expect the unexpected. Teamwork makes the dream work in a drop-in, drop-out gameplay blast, filled with over-the-top combat that anyone can enjoy, but only a True 'Toad can master. With a unique hand-animated cartoon style and packed with memorable characters and locations, the Battletoads are back for a larger-than-life brawl across the universe that promises to be fun alone, and unforgettable together.… Expand"
  },
  {
    "name": "Kitty Powers' Matchmaker",
    "details_link": "https://www.metacritic.com/game/playstation-4/kitty-powers-matchmaker",
    "publisher": "STELLAR ENTERTAINMENT SOFTWARE LTD",
    "release_date": "Feb  7 2017",
    "developers": [
      "STELLAR ENTERTAINMENT SOFTWARE LTD"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action",
      "Strategy",
      "General",
      "Management",
      "Business / Tycoon"
    ],
    "meta_score": 72,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/8/46c9d80e80744b70488597dedfdb4723-98.jpg",
    "descriptions": "Kitty Powers’ Matchmaker is a dating simulator with a difference. Manage your own matchmaking agency with the guidance of your fabulous boss, drag queen diva Kitty Powers. Match a parade of desperate clients with candidates from Kitty’s little black book and guide them through awkwardKitty Powers’ Matchmaker is a dating simulator with a difference. Manage your own matchmaking agency with the guidance of your fabulous boss, drag queen diva Kitty Powers. Match a parade of desperate clients with candidates from Kitty’s little black book and guide them through awkward conversations and dozens of perilous dating dilemmas. Are you ready to bring romance to the world? Or will you leave a sea of broken hearts in your wake? [Playstation.com]… Expand"
  },
  {
    "name": "Lichtspeer",
    "details_link": "https://www.metacritic.com/game/pc/lichtspeer",
    "publisher": "Lichthund",
    "release_date": "Sep 27 2016",
    "developers": [
      "Lichthund"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 72,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/7/8681db7ca742e300a22d505f4dec5b58-98.jpg",
    "descriptions": "Lichtspeer is an action arcade lightspear-throwing simulator based in ancient germanic future."
  },
  {
    "name": "Borderlands 2: Sir Hammerlock's Big Game Hunt",
    "details_link": "https://www.metacritic.com/game/xbox-360/borderlands-2-sir-hammerlocks-big-game-hunt",
    "publisher": "2K Games",
    "release_date": "Jan 15 2013",
    "developers": [
      "Gearbox Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 72,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/7/c1186e5e3da3f7406255b1571dea3b07-98.jpg",
    "descriptions": "In Sir Hammerlock’s Big Game Hunt players enter an uncharted territory deep in the swamps of Pandora where a very large Hyperion ship has crashed. The wreckage is believed to have stockpiles of loot. But watch yourself because mutated creatures, and armies of savages also had their interestIn Sir Hammerlock’s Big Game Hunt players enter an uncharted territory deep in the swamps of Pandora where a very large Hyperion ship has crashed. The wreckage is believed to have stockpiles of loot. But watch yourself because mutated creatures, and armies of savages also had their interest piqued by the ship. As ferocious and deadly as they may seem, the mysterious Professor Nakayama claims to be their diabolical leader, and he’s calling all the shots. This add-on includes new guns, new loot, new bosses, a new location, a new vehicle and new skins & heads.… Expand"
  },
  {
    "name": "Capcom Classics Collection Vol. 2",
    "details_link": "https://www.metacritic.com/game/xbox/capcom-classics-collection-vol-2",
    "publisher": "Capcom",
    "release_date": "Nov 24 2006",
    "developers": [
      "Digital Eclipse"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 72,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/4/b8b07a3d1d933c06b08f3a754d2dd619-98.jpg",
    "descriptions": "Capcom Classics Collection Vol. 2 reacquaints players with the revolutionary games of their time while providing countless rounds of quarter-free entertainment. Each treasured favourite contains bountiful bonus features including remixed soundtracks, original art and history that will leaveCapcom Classics Collection Vol. 2 reacquaints players with the revolutionary games of their time while providing countless rounds of quarter-free entertainment. Each treasured favourite contains bountiful bonus features including remixed soundtracks, original art and history that will leave everyone wanting for more. Homes will turn into virtual arcade halls as this 20-in-1 compilation will have players flashing back to the good old days and introduce to a new generation the titles that helped define Capcom's legacy as a leading worldwide developer and publisher.… Expand"
  },
  {
    "name": "Tembo the Badass Elephant",
    "details_link": "https://www.metacritic.com/game/playstation-4/tembo-the-badass-elephant",
    "publisher": "Sega",
    "release_date": "Jul 21 2015",
    "developers": [
      "Game Freak"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 72,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/7/9afede852699070f8e89ccebeafcdace-98.jpg",
    "descriptions": "TEMBO THE BADASS ELEPHANT is a larger than life, 2D side-scrolling action adventure from the creative geniuses behind the Pokémon games"
  },
  {
    "name": "Dark Sector",
    "details_link": "https://www.metacritic.com/game/xbox-360/dark-sector",
    "publisher": "D3Publisher",
    "release_date": "Mar 25 2008",
    "developers": [
      "Digital Extremes"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 10 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 72,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/3/093d1a551c56cdb9e2a1cf83e3f305f6-98.jpg",
    "descriptions": "An all-new and original action-thriller designed exclusively for next-generation consoles, Dark Sector thrusts players into the role of Hayden Tenno, an elite black-ops agent sent on a dangerous mission into a decaying Eastern European city that hides a deadly Cold War secret. Attacked by anAn all-new and original action-thriller designed exclusively for next-generation consoles, Dark Sector thrusts players into the role of Hayden Tenno, an elite black-ops agent sent on a dangerous mission into a decaying Eastern European city that hides a deadly Cold War secret. Attacked by an unknown enemy, he awakens to find part of his body altered by an infection that has granted him inhuman abilities and he must learn to evolve along with his powers, to survive and to become a hero. A dark, gritty experience packed with fast action, incredible superpowers and an engaging story. [D3Publisher of America]… Expand"
  },
  {
    "name": "Evil Dead: The Game",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/evil-dead-the-game",
    "publisher": "Saber Interactive",
    "release_date": "May 13 2022",
    "developers": [
      "Saber Interactive"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "Up to 5 ",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 72,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/6/6a54555fd64c12c0571cc1338b22d2cf-98.jpg",
    "descriptions": "Step into the shoes of Ash Williams or his friends from the iconic Evil Dead franchise and work together in a game loaded with over-the-top co-op and PVP multiplayer action! Play as a team of four survivors, exploring, looting, crafting, managing your fear, and finding key items to seal theStep into the shoes of Ash Williams or his friends from the iconic Evil Dead franchise and work together in a game loaded with over-the-top co-op and PVP multiplayer action! Play as a team of four survivors, exploring, looting, crafting, managing your fear, and finding key items to seal the breach between worlds in a game inspired by all three original Evil Dead films as well as the Starz original Ash vs Evil Dead television series.\r ICONIC CHARACTERS\rPlay as characters from throughout the Evil Dead universe, including Ash, Scotty, Lord Arthur, Kelly Maxwell, Pablo Simon Bolivar, and more, with new dialogue performed by Bruce Campbell and others!\r PLAY AS GOOD OR EVIL...\rFight for the forces of good or take control of the powerful Kandarian Demon to hunt Ash and other players while possessing Deadites, the environment, and even the survivors themselves as you seek to swallow their souls!\r OVER THE TOP VISUALS\rWhether you're tearing a Deadite in two with Ash's famous chainsaw hand or flying through the map as the Kandarian Demon in spirit form, the game captures the look and feel of the Evil Dead franchise in all its glory, with realistic visuals and a physics-based gore system that brings the horror to life! \r\rTHIS...IS MY BROOMSTICK!\rBrandish your short barrel shotgun, chainsaw, cleavers and more to do some delightfully gruesome violence against the armies of darkness.\r Evil Dead: The Game features multiplayer co-op and PvP for PC, Xbox One, Xbox X|S, PlayStation 4, PlayStation 5, and Nintendo Switch.… Expand"
  },
  {
    "name": "Phoenotopia: Awakening",
    "details_link": "https://www.metacritic.com/game/switch/phoenotopia-awakening",
    "publisher": "Cape Cosmic",
    "release_date": "Aug 20 2020",
    "developers": [
      "Cape Cosmic"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 72,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/1/d6084fdc356387db1e50920387cf4d30-98.jpg",
    "descriptions": "Join Gail, a simple villager, who must heed the call for adventure when a great star ship appears in the night sky and abducts all the adults. As the new oldest member of her fragmented community, she must set out to solve this great mystery. Little does she know of the grand adventureJoin Gail, a simple villager, who must heed the call for adventure when a great star ship appears in the night sky and abducts all the adults. As the new oldest member of her fragmented community, she must set out to solve this great mystery. Little does she know of the grand adventure before her, the evil lurking in the shadows, and the role she would play in the fight for Earth’s very existence!\r Features:\r- A narrative-driven single player adventure filled with charming characters, vibrant towns, and dangerous dungeons.\r- Over 10 different weapons & tools with which to combat enemies and solve puzzles. Fly with rocket boots! Blast with bombs! Play the flute!\r- Fight against over 50 different enemy types and 12 boss encounters.\r- A world brimming with secrets! Find 33 Energy Gems, 55 Heart Pieces and 111 Moonstones.\r- An achievement system, with 33 badges to earn, for players seeking extra challenge and replayability.\r- Over 60 original songs ranging from mellow piano and orchestra to raging synth/metal rockers and bagpipes!\r- A main campaign length estimated at 25 hours of playtime. 50 hours for completionists.\r Solve the great mystery of the Phoenix!… Expand"
  },
  {
    "name": "Metal Gear Solid V: Metal Gear Online",
    "details_link": "https://www.metacritic.com/game/playstation-4/metal-gear-solid-v-metal-gear-online",
    "publisher": "Konami",
    "release_date": "Oct  6 2015",
    "developers": [
      "Kojima Productions"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 72,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/7/c017faf70bceeb4c220cea1b05a48f99-98.jpg",
    "descriptions": "METAL GEAR ONLINE is an online multiplayer battle mode based on the game system of METAL GEAR SOLID V: THE PHANTOM PAIN.METAL GEAR ONLINE is built around a dedicated squad-based competitive multiplayer structure, which has been fully redesigned with the familiar gameplay and aestheticMETAL GEAR ONLINE is an online multiplayer battle mode based on the game system of METAL GEAR SOLID V: THE PHANTOM PAIN.METAL GEAR ONLINE is built around a dedicated squad-based competitive multiplayer structure, which has been fully redesigned with the familiar gameplay and aesthetic styling of the acclaimed METAL GEAR SOLID series. The online element introduces Tactical Team Operations and features a 'class system' that more uniquely defines the strengths and abilities of player characters on the battlefield. Players can select from 3 distinct classes: Scout, Enforcer and Infiltrator.… Expand"
  },
  {
    "name": "Super Swing Golf",
    "details_link": "https://www.metacritic.com/game/wii/super-swing-golf",
    "publisher": "Tecmo",
    "release_date": "Dec 12 2006",
    "developers": [
      "Tecmo",
      "Ntreev Soft"
    ],
    "platforms": "Wii",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Sports",
      "Traditional",
      "Individual",
      "Golf",
      "Sim",
      "Sim"
    ],
    "meta_score": 72,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/4/5bb08c93b9402aa40ccc16c1b0ac2ad2-98.jpg",
    "descriptions": "Super Swing Golf takes advantage of the power of the Wii and provides a rich, newly designed, casual golf game that revolutionizes the way video game golf is played, putting the player in control of the club and the course. The Super Swing: The Wii controller provides a new level of gamingSuper Swing Golf takes advantage of the power of the Wii and provides a rich, newly designed, casual golf game that revolutionizes the way video game golf is played, putting the player in control of the club and the course. The Super Swing: The Wii controller provides a new level of gaming interaction, sensing motion, depth, positioning and targeting dictated by the movement of the controller itself allowing the controller to act as the golf club. A back-swing sets the amount of power of the swing and the angle of controller when hitting the ball defines whether the ball will hook or slice. Improved character texture and molding and the newly designed costumes bring this title to life in this uniquely designed fantasy world. Hit the lynx in Single Mode to play through Story Mode, Free Mode, or Challenge Mode. In Story Mode, the game proceeds along with the story of each character and will diverge according to the results of the match. Try out Battle Mode to take on others in Match Play, Stroke Play, and Party Play. [Tecmo]… Expand"
  },
  {
    "name": "Potion Permit",
    "details_link": "https://www.metacritic.com/game/switch/potion-permit",
    "publisher": "PQube",
    "release_date": "Sep 22 2022",
    "developers": [
      "MassHive Media"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "General",
      "Japanese-Style"
    ],
    "meta_score": 72,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/1/2f0d407553d509dcca0f46a6676d281d-98.jpg",
    "descriptions": "The town of Moonbury has always been wary of the advances of the outside world, preferring to rely on their traditional methods of healing. Until one day, when the mayor's daughter falls ill, and the local witch doctor can do nothing to help her, they are forced to look outside their smallThe town of Moonbury has always been wary of the advances of the outside world, preferring to rely on their traditional methods of healing. Until one day, when the mayor's daughter falls ill, and the local witch doctor can do nothing to help her, they are forced to look outside their small community for help.The Medical Association decides to send their most accomplished chemist - you - to help cure the mayor's daughter and convince the residents of Moonbury of the wonders of modern alchemy. Gain their trust and tend to each person when they fall ill in this open-ended sim RPG.… Expand"
  },
  {
    "name": "Martha is Dead",
    "details_link": "https://www.metacritic.com/game/playstation-5/martha-is-dead",
    "publisher": "Wired Productions",
    "release_date": "Feb 24 2022",
    "developers": [
      "LKA"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "First-Person"
    ],
    "meta_score": 72,
    "users_score": 5.6,
    "image": "https://static.metacritic.com/images/products/games/3/cbb0e0c99ab8264c5f37df48cf981e89-98.jpg",
    "descriptions": "Martha Is Dead is a dark first-person psychological thriller, set in 1944 Italy, that blurs the lines between reality, superstition and the tragedy of war."
  },
  {
    "name": "The Splatters",
    "details_link": "https://www.metacritic.com/game/xbox-360/the-splatters",
    "publisher": "Microsoft Game Studios",
    "release_date": "Apr 11 2012",
    "developers": [
      "SpikySnail Games Studio"
    ],
    "platforms": "Xbox 360",
    "genres": [
      "Puzzle",
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Puzzle",
      "Action"
    ],
    "meta_score": 72,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/8/0de3cd0e52d939ceba9884bdac336fa9-98.jpg",
    "descriptions": "The Splatters are acrobatic masters with a unique death wish - to blow themselves up with style. In this action-puzzler, you unlock and master a variety of stunts and perform spectacular moves to clear out each stage in the most dramatic way possible. With its fast-paced, splattery liquidThe Splatters are acrobatic masters with a unique death wish - to blow themselves up with style. In this action-puzzler, you unlock and master a variety of stunts and perform spectacular moves to clear out each stage in the most dramatic way possible. With its fast-paced, splattery liquid physics engine you won't play the same way twice. And using Splatter TV, an in-game feature for sharing game clips, you pick up a myriad of new moves as you watch the world’s top players perform their combos. It’s a messy, colorful show of skill and destruction. Life can be short. DIE WITH STYLE.… Expand"
  },
  {
    "name": "Majin and the Forsaken Kingdom",
    "details_link": "https://www.metacritic.com/game/playstation-3/majin-and-the-forsaken-kingdom",
    "publisher": "Namco Bandai Games America",
    "release_date": "Nov 23 2010",
    "developers": [
      "Game Republic"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "General",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 72,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/6/18413271a004a80bdd93af91e3c95cfc-98.jpg",
    "descriptions": "In Majin and the Forsaken Kingdom, a once thriving society is suddenly engulfed by a dark force that nearly eradicates all of its inhabitants. Many tried to reclaim their fallen homeland but were annihilated by strange warriors who rose from the darkness. A hundred years later, a cunningIn Majin and the Forsaken Kingdom, a once thriving society is suddenly engulfed by a dark force that nearly eradicates all of its inhabitants. Many tried to reclaim their fallen homeland but were annihilated by strange warriors who rose from the darkness. A hundred years later, a cunning young outsider is drawn to this forsaken kingdom where he encounters and befriends Majin, a mysterious monster-like being with incredible strength. Now in an effort to restore the empire, the two set out to uncover Majin's forgotten past and the secrets that lie within the ancient land.… Expand"
  },
  {
    "name": "The Walking Dead: The Telltale Series - The Final Season Episode 1: Done Running",
    "details_link": "https://www.metacritic.com/game/xbox-one/the-walking-dead-the-telltale-series---the-final-season-episode-1-done-running",
    "publisher": "Telltale Games",
    "release_date": "Aug 14 2018",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Point-and-Click"
    ],
    "meta_score": 72,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/4/18d0199a2c0b471a98156e7cb93df9e5-98.jpg",
    "descriptions": "After years on the road facing threats both living and dead, a secluded school might finally be Clementine's chance for a home. But protecting it will mean sacrifice. Clem must build a life and become a leader while still watching over AJ, an orphaned boy and the closest thing to family sheAfter years on the road facing threats both living and dead, a secluded school might finally be Clementine's chance for a home. But protecting it will mean sacrifice. Clem must build a life and become a leader while still watching over AJ, an orphaned boy and the closest thing to family she has left. In this gripping, emotional final season, you will define your relationships, fight the undead, and determine how Clementine's story ends.… Expand"
  },
  {
    "name": "Fe",
    "details_link": "https://www.metacritic.com/game/switch/fe",
    "publisher": "Electronic Arts",
    "release_date": "Feb 16 2018",
    "developers": [
      "Zoink!"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "General",
      "Open-World"
    ],
    "meta_score": 72,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/4/f009bc0a2b076af7e9c783e87e9a2d45-98.jpg",
    "descriptions": "In Fe, players are enchanted by the natural surroundings as they uncover secrets, complete side quests, and meet the mystical creatures of the forest. Players climb, glide and dig as they voyage through the open experience meeting, interacting and rescuing plants and animals from the SilentIn Fe, players are enchanted by the natural surroundings as they uncover secrets, complete side quests, and meet the mystical creatures of the forest. Players climb, glide and dig as they voyage through the open experience meeting, interacting and rescuing plants and animals from the Silent Ones, the machine antagonists that are threatening the forest. Through unparalleled freedom of exploration in a world full of discoveries to uncover, players become Fe and never want to leave. [Electronic Arts]… Expand"
  },
  {
    "name": "FIFA Manager 12",
    "details_link": "https://www.metacritic.com/game/pc/fifa-manager-12",
    "publisher": "Electronic Arts",
    "release_date": "Oct 18 2011",
    "developers": [
      "Bright Future GmbH"
    ],
    "platforms": "PC",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Management",
      "Management"
    ],
    "meta_score": 72,
    "users_score": 4.5,
    "image": "https://static.metacritic.com/images/products/games/2/9e6d3168ccfd555ad420f5bef5901a92-98.jpg",
    "descriptions": "FIFA Manager 12 features improvements to virtually all areas of the game, including major enhancements to the 3D mode, finances, transfers and the calendar. Changes to the 3D mode create a more realistic experience, and include new logic, new player artificial intelligence, and markedFIFA Manager 12 features improvements to virtually all areas of the game, including major enhancements to the 3D mode, finances, transfers and the calendar. Changes to the 3D mode create a more realistic experience, and include new logic, new player artificial intelligence, and marked improvements to tactics, substitutions and the conduct of opposing managers. In addition, a new intuitive user interface makes it possible for players to retrieve all the data relevant to the game within seconds and to issue precise tactical instructions to their teams.… Expand"
  },
  {
    "name": "Divinity II: The Dragon Knight Saga",
    "details_link": "https://www.metacritic.com/game/xbox-360/divinity-ii-the-dragon-knight-saga",
    "publisher": "Atlus",
    "release_date": "Apr 12 2011",
    "developers": [
      "Larian Studios Games"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Miscellaneous",
      "Action RPG",
      "Compilation"
    ],
    "meta_score": 72,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/5/5a7ee717dc25438f53f55c8cdd4cb9bd-98.jpg",
    "descriptions": "Divinity II - The Dragon Knight Saga includes the original adventure \"Ego Draconis\", and \"Flames of Vengeance\", the Dragon Knight's new adventure that continues the epic story and adds dozens of hours of additional gameplay. Divinity II - Ego Draconis appears here as anDivinity II - The Dragon Knight Saga includes the original adventure \"Ego Draconis\", and \"Flames of Vengeance\", the Dragon Knight's new adventure that continues the epic story and adds dozens of hours of additional gameplay. Divinity II - Ego Draconis appears here as an entirely new and re-mastered edition with improved graphics and content that make the game even more beautiful and more impressive than ever before!… Expand"
  },
  {
    "name": "Overlord II",
    "details_link": "https://www.metacritic.com/game/playstation-3/overlord-ii",
    "publisher": "Codemasters",
    "release_date": "Jun 23 2009",
    "developers": [
      "Triumph Studios"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "2 ",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 72,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/0/575d8c858ebc0c9ecd2bfb894932bf22-98.jpg",
    "descriptions": "Overlord II is the sequel to the warped fantasy action adventure that had players being delightfully despotic. In Overlord II, a new Overlord and a more powerful army of Minions take on an entire empire in a truly epic adventure, inspired by the rise of the Roman Empire. As the GloriousOverlord II is the sequel to the warped fantasy action adventure that had players being delightfully despotic. In Overlord II, a new Overlord and a more powerful army of Minions take on an entire empire in a truly epic adventure, inspired by the rise of the Roman Empire. As the Glorious Empire conquers kingdoms and destroys any sign of magic it finds, it's time to go Minion Maximus and send in the horde. The Minions return smarter, deadlier (and funnier) and are ready to fight in large scale battles that will see their wild pack mentality squaring up to the organised legions of the Glorious Empire. As ever, they'll do anything and everything the Overlord commands of them, especially now that they can run ravage and wreck buildings and scenery. They've also learned how to ride: In Overlord II Minions mount up and ride wolves and other magical creatures around the landscape and take them into battle, making our band of merry fighters faster and fiercer than ever before. [Codemasters]… Expand"
  },
  {
    "name": "FIFA Soccer 10",
    "details_link": "https://www.metacritic.com/game/pc/fifa-soccer-10",
    "publisher": "EA Sports",
    "release_date": "Oct 26 2009",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 72,
    "users_score": 4.7,
    "image": "https://static.metacritic.com/images/products/games/5/ae0236db1d39907b1fc0999dcb70ccb9-98.jpg",
    "descriptions": "On the pitch, critical gameplay fundamentals have been enhanced to ensure that FIFA Soccer 10 mirrors real-world soccer, providing more sophisticated ball control, and physical interaction between players. In addition, players now move, behave and position themselves more realistically. OnOn the pitch, critical gameplay fundamentals have been enhanced to ensure that FIFA Soccer 10 mirrors real-world soccer, providing more sophisticated ball control, and physical interaction between players. In addition, players now move, behave and position themselves more realistically. On attack, players analyze space more effectively, curve their runs in an attempt to stay onside, create passing lanes naturally, and drive for more variety in attacking options. On defense, new concepts like position priority enable defenders to multitask so dangerous spaces left open by teammates out of position are covered. Plus, slide tackle targeting, press marking, and better-urgency clearance logic provide new options that make defending a tactical skill in FIFA Soccer 10. In goal, a myriad of improvements and refinements to goalkeeper intelligence result in a more responsive and powerful rushing system and ultra-realistic saves. Better balance on lofted through balls, improved goalkeeper intelligence, more realistic shooting mechanics with less shots hitting the goal posts, a practice arena to perfect skills, and a more immersive soccer experience through continuous play and quick free kicks are just a few of the issues raised by fans and addressed in FIFA Soccer 10. Three new innovations revealed today at E3 have been developed to change the player control experience in FIFA Soccer 10. The first-ever true 360 degree dribbling system gives players finer control of the ball, enabling them to find spaces between defenders that previously were not possible. Using an all-new animation technology, skilled dribblers now have the ability to face the defender and use highly responsive lateral dribbling to skip past him. An innovative concept called Freedom in Physical Play enables players to perform wider dribble touches and new collision sharing creates a varied, less predictable, and extended fight for possession between the dribbler and a defender.\rFIFA Soccer 10 also features a deeper iteration of the ever-popular Manager Mode with more than 50 major improvements, including new match realism, realistic player transfers based on multiple decision points, and true-to-life player growth curves. [Electronic Arts]… Expand"
  },
  {
    "name": "Bear and Breakfast",
    "details_link": "https://www.metacritic.com/game/switch/bear-and-breakfast",
    "publisher": "Armor Games",
    "release_date": "Sep 15 2022",
    "developers": [
      "Gummy Cat Studio",
      "Gummy Cat"
    ],
    "platforms": [
      "PC",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Management",
      "Business / Tycoon"
    ],
    "meta_score": 72,
    "users_score": 4.7,
    "image": "https://static.metacritic.com/images/products/games/8/b14405e11aa7e3f75c6c4ed621c6254e-98.jpg",
    "descriptions": "Bear and Breakfast is a laid-back management adventure game where you play as a well-meaning bear trying to run a B+B in the woods. Hank and his friends find an abandoned shack and, equipped with their teenage ingenuity, turn it into a money-making bed and breakfast scheme for unsuspectingBear and Breakfast is a laid-back management adventure game where you play as a well-meaning bear trying to run a B+B in the woods. Hank and his friends find an abandoned shack and, equipped with their teenage ingenuity, turn it into a money-making bed and breakfast scheme for unsuspecting tourists. As your business expands so do the mysteries of the forest, and Hank soon finds himself uncovering a plot deeper than the wilderness itself.… Expand"
  },
  {
    "name": "Metal Max Xeno Reborn",
    "details_link": "https://www.metacritic.com/game/playstation-4/metal-max-xeno-reborn",
    "publisher": "PQube",
    "release_date": "Jun 10 2022",
    "developers": [
      "Kadokawa"
    ],
    "platforms": [
      "PC",
      "Switch",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "General"
    ],
    "meta_score": 72,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/6/dfbdf606f2e073420e9c826e50d05d77-98.jpg",
    "descriptions": "Humanity is on the brink of extinction and the last remaining survivors look to push back against the machines.Half a century ago of war against the mother computer NOA has reduced even Asia's largest metropolis, TOKIO, to rubble.\n\nExplore this desolate wasteland and battle your wayHumanity is on the brink of extinction and the last remaining survivors look to push back against the machines.Half a century ago of war against the mother computer NOA has reduced even Asia's largest metropolis, TOKIO, to rubble.Explore this desolate wasteland and battle your way through onslaughts of enemies. Salvage, modify and hit back using tanks, weaponry and faithful battle dog, Pochi, to reclaim a future for the human race!Set in a devastated world called Dystokio, Metal Max Xeno: Reborn is a nonlinear, open world, JRPG with real-time battle and vehicle combat elements. Take control of Talis and search for other survivors who wish to fight back against the machines of NOA. There are no limits to where you can go, no matter your progression in the game.… Expand"
  },
  {
    "name": "RollerCoaster Tycoon 3: Complete Edition",
    "details_link": "https://www.metacritic.com/game/switch/rollercoaster-tycoon-3-complete-edition",
    "publisher": "Frontier Foundry",
    "release_date": "Sep 24 2020",
    "developers": [
      "Frontier Developments"
    ],
    "platforms": [
      "PC",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Management",
      "Business / Tycoon"
    ],
    "meta_score": 72,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/9/aa4912b720b4369bdf6d90c11d76b35f-98.jpg",
    "descriptions": "Build the park of a lifetime and rediscover the critically acclaimed rollercoaster simulation bestseller. Brought to life in this new Complete Edition, relive the full RollerCoaster Tycoon 3 experience or dive in for the first time and feel the thrill of a genre-defining classic, completeBuild the park of a lifetime and rediscover the critically acclaimed rollercoaster simulation bestseller. Brought to life in this new Complete Edition, relive the full RollerCoaster Tycoon 3 experience or dive in for the first time and feel the thrill of a genre-defining classic, complete with both Soaked! and Wild! expansion packs. Your Park. Your Way. Whatever you want to create, RollerCoaster Tycoon 3 gives you the tools and freedom to build the amusement park of your dreams. Manage like a tycoon and make your way to the top\rControl park finances, shops, services and staff to succeed in dozens of scenarios. Become a true tycoon and embark on your promising new career, or create your ideal park without money woes in sandbox mode. Satisfy your guests’ needs and keep your park running smoothly to succeed. Get ready to get ‘Soaked!’ and venture into the ‘Wild!’\rThis complete edition includes all content from both Soaked! and Wild! expansion packs. Relish the added challenge of creating and managing exhilarating waterparks and spectacular animal habitats. Reimagined for Nintendo Switch. Experience a reimagined interface on the go with intuitive new controls designed to help you build the ultimate theme park anytime, anywhere. Ride the Rides. Ride your creations with RollerCoaster Tycoon 3’s signature coaster cam.… Expand"
  },
  {
    "name": "Minecraft Dungeons",
    "details_link": "https://www.metacritic.com/game/switch/minecraft-dungeons",
    "publisher": "Mojang AB",
    "release_date": "May 26 2020",
    "developers": [
      "Mojang AB"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action Adventure",
      "Open-World",
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 72,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/0/1b36814f7fc9c68586b2cfa1832bbbad-98.jpg",
    "descriptions": "Fight your way through an all-new action-adventure game, inspired by classic dungeon crawlers and set in the Minecraft universe! Brave the dungeons alone, or team up with friends! Up to four players can battle together through action-packed, treasure-stuffed, wildly varied levels – all in anFight your way through an all-new action-adventure game, inspired by classic dungeon crawlers and set in the Minecraft universe! Brave the dungeons alone, or team up with friends! Up to four players can battle together through action-packed, treasure-stuffed, wildly varied levels – all in an epic quest to save the villagers and take down the evil Arch-Illager. Discover a trove of powerful new weapons and items that will help you defeat ruthless swarms of new-and-nasty mobs. Fight or flee through canyons, swamps and – of course – mines! Any adventurer brave or foolish enough to explore this blocky and beautiful world will need to come prepared. So quickly, gear up!… Expand"
  },
  {
    "name": "Daemon X Machina",
    "details_link": "https://www.metacritic.com/game/pc/daemon-x-machina",
    "publisher": "XSEED Games",
    "release_date": "Feb 13 2020",
    "developers": [
      "Marvelous First Studio"
    ],
    "platforms": [
      "Switch",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Simulation",
      "Vehicle",
      "Combat"
    ],
    "meta_score": 72,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/3/fd016a159f68ad23478ac1008cacd297-98.jpg",
    "descriptions": "The future of mech-actions games is here!Defend the planet and defeat corrupted A.I. controlled robots using your Arsenal, a fully customizable mechanized battle suit. Choose and equip your Arsenal with a multitude of weapons, obtain more from downed enemy Arsenals, and swap them on theThe future of mech-actions games is here!Defend the planet and defeat corrupted A.I. controlled robots using your Arsenal, a fully customizable mechanized battle suit. Choose and equip your Arsenal with a multitude of weapons, obtain more from downed enemy Arsenals, and swap them on the fly to suit your strategy in the face of ever-changing threats that may bring the end of the world.It was the greatest disaster in recorded history The moon tore apart, turning the sky into a kaleidoscope of red light that illuminated all who watched from below. Survive this apocalyptic new age as a mercenary and pilot powerful mechs in this brand-new action game from Kenichiro Tsukuda (Armored Core) and mech designer Shoji Kawamori (Super Dimensional Fortress Macross).Features:* The player's avatar is customizable with a variety of options* Each Arsenal can be equipped with different weapons on its arms and shoulders, as well as reserve weaponry on its back that can be swapped out during battle* Defeated enemies drop ammo and weapons, which the player can obtain and use on the fly* Online and local wireless multiplayer modes support up to 4 players… Expand"
  },
  {
    "name": "Mugsters",
    "details_link": "https://www.metacritic.com/game/playstation-4/mugsters",
    "publisher": "Team17",
    "release_date": "Jul 17 2018",
    "developers": [
      "Reinkout Games"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 72,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/9/a9b6864207f636004153f0def05d5a1b-98.jpg",
    "descriptions": "Aliens have taken over the planet and enslaved humanity. Only you have the know-how to drive back the dastardly threat, free your fellow Earthlings, and save the world."
  },
  {
    "name": "de Blob",
    "details_link": "https://www.metacritic.com/game/switch/de-blob",
    "publisher": "THQ Nordic",
    "release_date": "Jun 26 2018",
    "developers": [
      "Blue Tongue Entertainment"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 72,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/7/9c8b04bd15d812e00f13bd180751d6cb-98.jpg",
    "descriptions": "Launch a Color Revolution!\r Only de Blob can flip, smash, and paint his way into the all-powerful INKT Corporation to launch a color revolution and save Chroma City from a future without color.\r\n\r\n* Paint the city and smash your way past inky enemies to save the citizens.\r\n* Dodge inkLaunch a Color Revolution!\r Only de Blob can flip, smash, and paint his way into the all-powerful INKT Corporation to launch a color revolution and save Chroma City from a future without color.\r * Paint the city and smash your way past inky enemies to save the citizens.\r* Dodge ink cannons, flatten INKT tanks and outsmart inky soldiers.\r* Compete as ink levels rise and wind cannons fire in nine multiplayer modes.… Expand"
  }
]