[{"name": "Gran Turismo 6", "details_link": "https://www.metacritic.com/game/playstation-3/gran-turismo-6", "publisher": "SCEA", "release_date": "Dec  6 2013", "developers": ["Polyphony Digital"], "platforms": "PlayStation 3", "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/dbd355fe8b425f0a2ffe3b808303ee40-98.jpg", "descriptions": "Gran Turismo 6 is a comprehensive racing simulator that allows fans to drive a prolific collection of cars on the world's most legendary racetracks."}, {"name": "Strong Bad's Cool Game for Attractive People Episode 4: Dangeresque 3: The Criminal Projective", "details_link": "https://www.metacritic.com/game/pc/strong-bads-cool-game-for-attractive-people-episode-4-dangeresque-3-the-criminal-projective", "publisher": "Telltale Games", "release_date": "Nov 17 2008", "developers": ["Telltale Games"], "platforms": "PC", "genres": ["Miscellaneous", "Adventure", "General", "Compilation"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/fc464f3810631efcb1f2846751a85022-98.jpg", "descriptions": "Move over, generically buff action heroes. Strong Bad is here to show you how it's done in his hand-crafted cinematic masterpiece, Dangeresque 3: The Criminal Projective. You play Dangeresque, a dirty cop in pursuit of a little action and several big sacks of cash. Can our hero stay aliveMove over, generically buff action heroes. Strong Bad is here to show you how it's done in his hand-crafted cinematic masterpiece, Dangeresque 3: The Criminal Projective. You play Dangeresque, a dirty cop in pursuit of a little action and several big sacks of cash. Can our hero stay alive long enough to defeat his arch-nemesis, save the world and get the girl? Looks like he's gonna have to jump. [TellTale Games]… Expand"}, {"name": "DIRT 5", "details_link": "https://www.metacritic.com/game/xbox-series-x/dirt-5", "publisher": "Codemasters", "release_date": "Nov 10 2020", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 81, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/a8fc66c7aabc41c3bc153ee130c9749a-98.jpg", "descriptions": "Let Loose in DIRT 5 -  the boldest off-road racing experience ever, with a star-studded Career, four-player split-screen, innovative online modes, livery editor and more. Blaze a trail on global tracks, covering gravel, ice, snow and sand, with cars ranging from rally icons, to trucks, to GT heroes."}, {"name": "GoldenEye 007", "details_link": "https://www.metacritic.com/game/wii/goldeneye-007", "publisher": "Activision", "release_date": "Nov  2 2010", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": "Wii", "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/8930712ee4ec147df2d91395975d53bf-98.jpg", "descriptions": "Developed exclusively for Wii and based on the GoldenEye film, GoldenEye 007 gives players the chance to use the lethal, gritty style of Daniel Craig's James Bond to outwit, outmaneuver and overtake an arms syndicate that threatens the world in an innovative, modern take on the legendaryDeveloped exclusively for Wii and based on the GoldenEye film, GoldenEye 007 gives players the chance to use the lethal, gritty style of Daniel Craig's James Bond to outwit, outmaneuver and overtake an arms syndicate that threatens the world in an innovative, modern take on the legendary GoldenEye movie.  GoldenEye 007 features an unprecedented lineup of four-player split-screen multiplayer options that encourage social gaming, with over 50 total characters, including eight classic Bond characters, ten maps, three standard modes and 17 special modifiers that allow gamers to create hundreds of game combinations. GoldenEye 007 also features online multiplayer for up to eight players designed for seasoned FPS online gamers with unique modes and a robust XP system for unlockables and achievements.… Expand"}, {"name": "Kirby: Nightmare in Dream Land", "details_link": "https://www.metacritic.com/game/game-boy-advance/kirby-nightmare-in-dream-land", "publisher": "Nintendo", "release_date": "Dec  2 2002", "developers": ["HAL Labs"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/76016b3f23a0c0b329cfd3f55a9ee908-98.jpg", "descriptions": "When King Dedede steals the Star Rod, it's up to Kirby to recover the fragmented pieces from Triple D's underlings and restore power to the Fountain of Dreams.  Kirby: Nightmare in Dream Land is an action-packed side-scrolling adventure chock full of awesome copy abilities and fast-movingWhen King Dedede steals the Star Rod, it's up to Kirby to recover the fragmented pieces from Triple D's underlings and restore power to the Fountain of Dreams.  Kirby: Nightmare in Dream Land is an action-packed side-scrolling adventure chock full of awesome copy abilities and fast-moving gameplay.  Kirby may not look tough, but he can float over dangerous obstacles, eat enemy projectiles, and copy his enemies' abilities.  You can use these skills in the single-player story mode or multiplayer mode with up to three friends using the Game Boy Advance Link cable.… Expand"}, {"name": "Rochard", "details_link": "https://www.metacritic.com/game/pc/rochard", "publisher": "Recoil Games", "release_date": "Nov 15 2011", "developers": ["Recoil Games"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/8fd09efd4198be165753bde6b417ce3e-98.jpg", "descriptions": "Developed by Recoil Games, Rochard is a fun and original space adventure game that features a resourceful hero, ominous villains, rugged machinery, big explosions, even bigger stunts and sharp oneliners. The game tests players' coordination and wits as they use gravity to their advantage,Developed by Recoil Games, Rochard is a fun and original space adventure game that features a resourceful hero, ominous villains, rugged machinery, big explosions, even bigger stunts and sharp oneliners. The game tests players' coordination and wits as they use gravity to their advantage, changing it at will to solve environmental puzzles and advance through each level. By using the upgradable G-Lifter, the main tool of the game, players can lift and maneuver heavy objects around the environment, and can eventually swing, jump and propel themselves huge distances throughout each level.… Expand"}, {"name": "The Dishwasher: Vampire Smile", "details_link": "https://www.metacritic.com/game/xbox-360/the-dishwasher-vampire-smile", "publisher": "Microsoft Game Studios", "release_date": "Apr  6 2011", "developers": ["Ska Studios"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/b27f587254a3dd7068f46212da92e966-98.jpg", "descriptions": "The followup to 2009's Dead Samurai, The Dishwasher: Vampire Smile is a combo-fueled, fast-paced, stylistic 2D action platformer that features the series’ staple gritty, graphic novel-inspired art style, built on a brand new engine that allows for an even more visually gruesome experience."}, {"name": "DREDGE", "details_link": "https://www.metacritic.com/game/playstation-5/dredge", "publisher": "Team17", "release_date": "Mar 30 2023", "developers": ["Black Salt Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Adventure", "General"], "meta_score": 81, "users_score": 9.4, "image": "https://static.metacritic.com/images/products/games/5/fa79eceb613935a99820965f45366aff-98.jpg", "descriptions": "Dredge is a fishing adventure with a sinister undercurrent. Sell your catch, upgrade your vessel and dredge the depths for long-buried relics. Explore the stories of the strange locals and discover why some things are best left forgotten. \r\rSomeone wants very badly to retrieve relics lostDredge is a fishing adventure with a sinister undercurrent. Sell your catch, upgrade your vessel and dredge the depths for long-buried relics. Explore the stories of the strange locals and discover why some things are best left forgotten. \r\rSomeone wants very badly to retrieve relics lost to the ocean floor. The work is lucrative, but can you trust them? What will they use the relics for? And will they ever be satisfied?\r It's not just the sharp rocks and shallow reefs you need to watch out for - keep your eyes on the depths below and the sky above. The biggest threat to your safety might come from within.… Expand"}, {"name": "SIFU", "details_link": "https://www.metacritic.com/game/playstation-5/sifu", "publisher": "Sloclap", "release_date": "Feb  8 2022", "developers": ["Sloclap"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/62e06a54ddb7e38b9068ae91fd25b096-98.jpg", "descriptions": "Sifu is a stylish yet gritty beat-em-up, featuring visceral hand-to-hand combat in a contemporary urban setting. From Sloclap, creators of acclaimed PS4 fighting game Absolver, Sifu follows a young kung fu student on a path of revenge, hunting for the murderers of his family. One againstSifu is a stylish yet gritty beat-em-up, featuring visceral hand-to-hand combat in a contemporary urban setting. From Sloclap, creators of acclaimed PS4 fighting game Absolver, Sifu follows a young kung fu student on a path of revenge, hunting for the murderers of his family. One against all, he has no allies and countless enemies. He will have to rely on his unique mastery of kung fu to prevail and preserve his family’s legacy.\r… Expand"}, {"name": "Dungeon Encounters", "details_link": "https://www.metacritic.com/game/switch/dungeon-encounters", "publisher": "Square Enix", "release_date": "Oct 14 2021", "developers": ["Square Enix", "Cattle Call"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/9ac4cf8ede134c3aac6e75886252fabf-98.jpg", "descriptions": "A new dungeon exploration RPG where you must strategize to survive. An otherworldly labyrinth has suddenly appeared on the outskirts of a quiet town. Make clever use of your abilities to chart the depths, overcome obstacles and defeat your foes in thrilling battles. From some of the keyA new dungeon exploration RPG where you must strategize to survive. An otherworldly labyrinth has suddenly appeared on the outskirts of a quiet town. Make clever use of your abilities to chart the depths, overcome obstacles and defeat your foes in thrilling battles. From some of the key development team behind the legendary FINAL FANTASY franchise, DUNGEON ENCOUNTERS is a dungeon exploration RPG where you must strategize to survive. The streamlined interface gives you the freedom to prepare and manage your party as you strive to reach the final floor.\r During your expeditions, you'll discover rare and powerful items, meet lost adventurers who might just become new allies, and come face-to-face with deadly monsters.\r Do you have what it takes to overcome the numerous trials that await you and discover the dungeon's secrets?\r ■Events\rBy uncovering and visiting spaces with white numbers, you may obtain items, unlock and change abilities, restore your party to health, find hidden merchants, and much more.\r Battle encounters, marked with black numbers, are hidden throughout the map. However, they can be revealed with a special ability, allowing you to choose when and where to engage your enemies.\r Previously discovered events will be recorded in the Event Log, a valuable resource that allows you to reference past experiences to tackle future challenges.\r ■Battles\rTest your strategies in thrilling battles, featuring the Active Time Battle (ATB) system made famous by the FINAL FANTASY series.\r Under the direction of Ito Hiroyuki, creator of the ATB system, battles play out in real-time, utilizing a polished and refined iteration of this classic design, which promises exciting, challenging combat.\r ■Map\rThe blank map awaits you, and by exploring and investigating every tile on each level, you will be awarded ability points. Navigate obstacles, including secret passages and hidden traps, and conquer the dungeon!\r… Expand"}, {"name": "SnowRunner", "details_link": "https://www.metacritic.com/game/xbox-one/snowrunner", "publisher": "Focus Home Interactive", "release_date": "Apr 28 2020", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Simulation", "Racing", "Arcade", "Vehicle", "Automobile", "Civilian"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/d4ac26357db6cfd1d6fa04f34828b141-98.jpg", "descriptions": "SnowRunner puts you in the driver's seat of powerful vehicles as you conquer extreme open environments with the most advanced terrain simulation ever. Drive 40 vehicles from brands such as Ford, Chevrolet, and Freightliner as you leave your mark on an untamed open world.Overcome mud,SnowRunner puts you in the driver's seat of powerful vehicles as you conquer extreme open environments with the most advanced terrain simulation ever. Drive 40 vehicles from brands such as Ford, Chevrolet, and Freightliner as you leave your mark on an untamed open world.Overcome mud, torrential waters, snow, and frozen lakes while taking on perilous contracts and missions. Expand and customize your fleet with many upgrades and accessories including an exhaust snorkel for heavy waters or chain tires to battle the snow.… Expand"}, {"name": "Middle-earth: Shadow of War", "details_link": "https://www.metacritic.com/game/xbox-one/middle-earth-shadow-of-war", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 10 2017", "developers": ["Monolith Productions"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "2 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 81, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/2/96be41c1ca7f51f733f09790e7116b98-98.jpg", "descriptions": "Experience an epic open world brought to life by the Nemesis System. Forge a new Ring of Power, conquer Fortresses in massive battles and dominate Mordor with your personal orc army in Middle-earth: Shadow of War. Go behind enemy lines to forge your army, conquer Fortresses and dominateExperience an epic open world brought to life by the Nemesis System. Forge a new Ring of Power, conquer Fortresses in massive battles and dominate Mordor with your personal orc army in Middle-earth: Shadow of War. Go behind enemy lines to forge your army, conquer Fortresses and dominate Mordor from within. Experience how the award-winning Nemesis System creates unique personal stories with every enemy and follower, and confront the full power of the Dark Lord Sauron and his Ringwraiths in this epic new story of Middle-earth. In Middle-earth: Shadow of War, nothing will be forgotten.… Expand"}, {"name": "Fallout 3: Broken Steel", "details_link": "https://www.metacritic.com/game/pc/fallout-3-broken-steel", "publisher": "Bethesda Softworks", "release_date": "May  5 2009", "developers": ["Bethesda Game Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Role-Playing", "First-Person", "First-Person", "General", "Western-Style"], "meta_score": 81, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/6273dbc75fff37a9b51aa73b4f8ff12a-98.jpg", "descriptions": "(Downloadable Content)  Continue your existing Fallout 3 game and finish the fight against the Enclave remnants alongside Liberty Prime. Broken Steel moves the level cap for your character from 20 to 30, allowing you to experience even more of the game, including new perks and achievements.(Downloadable Content)  Continue your existing Fallout 3 game and finish the fight against the Enclave remnants alongside Liberty Prime. Broken Steel moves the level cap for your character from 20 to 30, allowing you to experience even more of the game, including new perks and achievements. Story: You may have dealt the Enclave a serious blow at Project Purity, but their forces are still out there, and still pose a grave threat to the people and security of the Capital Wasteland.  In Broken Steel, you'll continue your current Fallout 3 character past the events of Project Purity, and work with the Brotherhood of Steel to eradicate the Enclave threat once and for all. Travel to new locations like the Olney Powerworks, wield destructive new weapons like the Tesla Cannon, and fight powerful new creatures like the Super Mutant Overlord. [Bethesda Softworks]… Expand"}, {"name": "Cyber Shadow", "details_link": "https://www.metacritic.com/game/xbox-one/cyber-shadow", "publisher": "Yacht Club Games", "release_date": "Jan 26 2021", "developers": ["Mechanical Head Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/5ba4a007b79600ad93ef77aa122afc36-98.jpg", "descriptions": "The world has been taken over by synthetic lifeforms. A desperate plea for help sets Shadow, the sole survivor of his clan, on one last mission to uncover what started the path to perpetual ruin."}, {"name": "Winning Eleven: Pro Evolution Soccer 2007", "details_link": "https://www.metacritic.com/game/psp/winning-eleven-pro-evolution-soccer-2007", "publisher": "Konami", "release_date": "Feb  6 2007", "developers": ["KCET"], "platforms": ["Xbox 360", "PSP"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/7bb1687fae6e65ce9b9123fa4090089b-98.jpg", "descriptions": "PES 6 once again features the graphical and gameplay tweaks that enable each new title to play completely differently from previous incarnations. The shooting system has been the subject of extensive retouching, now enabling players to pull off much more accurate snap shots as well as beingPES 6 once again features the graphical and gameplay tweaks that enable each new title to play completely differently from previous incarnations. The shooting system has been the subject of extensive retouching, now enabling players to pull off much more accurate snap shots as well as being able to exert a much larger feeling of control when going for quick half volleys or difficult full volleys. The intelligence of players has seen a marked improvement. For example, players now make more realistic runs into space, often pointing where they would like the ball played. The physical aspect has also been beefed up, with strikers using their sheer presence to turn defenders and likewise, the defenders stepping a yard away to enable them to force players away from goal and not letting them spin into dangerous positions. PES 6 also has a number of new teams licensed for inclusion, with the International roster now featuring the official kits for Argentina, the Netherlands, Italy, Spain and Sweden. New gameplay modes have been added and features like the much loved Master League mode also returns, together with a host of new tricks, feints and animations that can be used to bamboozle your opposition. [Konami]… Expand"}, {"name": "Persona Q2: New Cinema Labyrinth", "details_link": "https://www.metacritic.com/game/3ds/persona-q2-new-cinema-labyrinth", "publisher": "Atlus", "release_date": "Jun  4 2019", "developers": ["Atlus"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/3491926991215e3e2624481037c106b3-98.jpg", "descriptions": "Joker Takes Center Stage - Experience a thought-provoking story from the perspective of the protagonist from Persona 5 as you along with the other Phantom Thieves meet the S.E.E.S. from Persona 3 and the Investigation Team from Persona 4 in a cinematic world!."}, {"name": "Catherine: Full Body", "details_link": "https://www.metacritic.com/game/playstation-4/catherine-full-body", "publisher": "Atlus", "release_date": "Sep  3 2019", "developers": ["Atlus"], "platforms": ["Switch", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "Survival"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/0c316fdee9ee604097b5be38e83411c6-98.jpg", "descriptions": "Our indecisive protagonist, Vincent, has been with his long-time girlfriend, Katherine, for five years. But instead of taking the next step into marriage, Vincent finds himself in an affair with the provocative blonde bombshell, Catherine! Thrown into discord by his own infidelity, he findsOur indecisive protagonist, Vincent, has been with his long-time girlfriend, Katherine, for five years. But instead of taking the next step into marriage, Vincent finds himself in an affair with the provocative blonde bombshell, Catherine! Thrown into discord by his own infidelity, he finds solace in the innocent Rin – further complicating matters. Adding to Vincent’s dilemma, he begins having nightmares that force him to climb for his life... Will he survive the trials and tribulations of love, or fall to temptations?… Expand"}, {"name": "Borderlands 3", "details_link": "https://www.metacritic.com/game/pc/borderlands-3", "publisher": "2K Games", "release_date": "Sep 13 2019", "developers": ["Gearbox Software"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 81, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/7293f3162e87760e12b3d01fa53e84bf-98.jpg", "descriptions": "At the hard edge of the galaxy lies a group of planets ruthlessly exploited by militarized corporations. Brimming with loot and violence, this is your home – the Borderlands. Answering the call of the Siren champion Lilith, four Vault Hunters charge head-first into a spray of bullets, blood,At the hard edge of the galaxy lies a group of planets ruthlessly exploited by militarized corporations. Brimming with loot and violence, this is your home – the Borderlands. Answering the call of the Siren champion Lilith, four Vault Hunters charge head-first into a spray of bullets, blood, and bandits to recover a map to ancient Vaults and prevent a universe-destroying power from falling into the wrong hands. The rest is history. Fearless renegade mercenaries on the wildest interplanetary treasure hunt of all time. FL4K is a wandering robotic tracker whose cold steel heart warms only for their pet beasts. Amara beats bad guys into pancakes with her psychic fists. Moze’s best friend is a 10-ton walking killing machine. And Zane, the semi-retired corporate hitman... well, he’s Zane.  Hunting Alone? No problem! Shoot and loot your way through the Borderlands, discovering the region’s untold stories and piling high your increasingly deadly cache of goodies and weapons. [2K Games]… Expand"}, {"name": "SnowRunner", "details_link": "https://www.metacritic.com/game/playstation-4/snowrunner", "publisher": "Focus Home Interactive", "release_date": "Apr 28 2020", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Simulation", "Racing", "Arcade", "Vehicle", "Automobile", "Civilian"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/44d88d643dbbfb5c237ddfc8d629a6a5-98.jpg", "descriptions": "SnowRunner puts you in the driver's seat of powerful vehicles as you conquer extreme open environments with the most advanced terrain simulation ever. Drive 40 vehicles from brands such as Ford, Chevrolet, and Freightliner as you leave your mark on an untamed open world.\rOvercome mud,SnowRunner puts you in the driver's seat of powerful vehicles as you conquer extreme open environments with the most advanced terrain simulation ever. Drive 40 vehicles from brands such as Ford, Chevrolet, and Freightliner as you leave your mark on an untamed open world.\rOvercome mud, torrential waters, snow, and frozen lakes while taking on perilous contracts and missions. Expand and customize your fleet with many upgrades and accessories including an exhaust snorkel for heavy waters or chain tires to battle the snow.… Expand"}, {"name": "Patapon 2", "details_link": "https://www.metacritic.com/game/psp/patapon-2", "publisher": "SCEA", "release_date": "May  5 2009", "developers": ["SCE Japan Studio"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Action", "General", "General"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/6b3486708beb67fa7649b2d0e0a72e17-98.jpg", "descriptions": "The story of the Patapon tribe marches forth as they hunt for the fabled Earthend. Shipwrecked in a new and strange continent the Patapon are depending on you, their god, to lead them safely through this perilous new land. As you guide the tribe through this new world with your mysticalThe story of the Patapon tribe marches forth as they hunt for the fabled Earthend. Shipwrecked in a new and strange continent the Patapon are depending on you, their god, to lead them safely through this perilous new land. As you guide the tribe through this new world with your mystical drum, they will come face to face with a new tribe, encounter a mysterious and mighty Hero Patapon and uncover the ruins of Patapolis, a mystical place long spoken of by the Patapon. All-new modes to Patapon 2 include thrilling multiplayer stages, a huge array of missions and deep tutorials that will have you drumming to the beat of the Patapon in no time. Head to patapon-game.com for the captivating mini-game, The Art Of War, where the goal is to collect as many Patapon characters as you can and then immortalise your battle with the Patapon Wallpaper creator. Lead your loyal followers through 60 rhythmic stages. Keep the beat going with tons of hidden items and mini-games to reveal. Drum along with friends and tackle multiplayer missions. [Sony]… Expand"}, {"name": "Tiger Woods PGA Tour 06", "details_link": "https://www.metacritic.com/game/pc/tiger-woods-pga-tour-06", "publisher": "EA Sports", "release_date": "Sep 20 2005", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/8c67514ee347011a44dcad37292acf0e-98.jpg", "descriptions": "Prove yourself as the greatest golfer of all time by taking on the legends in the prime of their careers -- on their terms. Do you have what it takes to beat Jack Nicklaus in his heyday with a bag full of wooden clubs or Tiger Woods with his modern-day equipment? For the first time, bothProve yourself as the greatest golfer of all time by taking on the legends in the prime of their careers -- on their terms. Do you have what it takes to beat Jack Nicklaus in his heyday with a bag full of wooden clubs or Tiger Woods with his modern-day equipment? For the first time, both analog sticks control each shot from tee to green. The left analog stick controls your swing, and the right analog Shape Stick dictates ball trajectory and putt strength. Back your challenges with wagers before any shot or round. Bigger odds are given to special accomplishments, so reap the largest rewards for nailing the toughest shots. Experience 15 beautifully detailed courses including Pebble Beach Golf Links, St Andrews, Reflection Bay, Doral Golf Resort, and more as you play as or against Tiger Woods and 16 other PGA TOUR players, including the newly added Chris DiMarco, Mike Weir, Ian Poulter, and Luke Donald. New Gamebreaker Meter: Build confidence to trigger Gamebreaker situations, and boost your power and accuracy by making great shots and posting low scores. [Electronic Arts]… Expand"}, {"name": "Rollerdrome", "details_link": "https://www.metacritic.com/game/pc/rollerdrome", "publisher": "Private Division", "release_date": "Aug 16 2022", "developers": ["roll7"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/7031798948cc993a2dc3f5b45f401a6a-98.jpg", "descriptions": "The year is 2030, and you are a competitor in a brutal new bloodsport – Rollerdrome. Combine stylish skate tricks with devastating slow-mo kills, picking your weapons with care to land the killing blow and make it to the end of the round… and maybe, with enough skill and hard work, to theThe year is 2030, and you are a competitor in a brutal new bloodsport – Rollerdrome. Combine stylish skate tricks with devastating slow-mo kills, picking your weapons with care to land the killing blow and make it to the end of the round… and maybe, with enough skill and hard work, to the end of the Championship. [Roll7]… Expand"}, {"name": "CrossCode", "details_link": "https://www.metacritic.com/game/playstation-4/crosscode", "publisher": "DECK13 Spotlight", "release_date": "Jul  9 2020", "developers": ["Radical Fish Games"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/b25da20f5d5712a247772a51ee05c186-98.jpg", "descriptions": "A retro-inspired 2D Action RPG set in the distant future. A story about the distant future of gaming - from an unexpected angle. Plenty of characters and plot twists included. Master the bouncing ball mechanics and solve a whole bunch of puzzles. CrossCode has fast, action-packed combatA retro-inspired 2D Action RPG set in the distant future. A story about the distant future of gaming - from an unexpected angle. Plenty of characters and plot twists included. Master the bouncing ball mechanics and solve a whole bunch of puzzles. CrossCode has fast, action-packed combat filled with damage numbers. And we still managed to squeeze some strategy in there. Be a proper avatar and master all 4 elements: Cold, Heat, Shock and Wave. What, those are not the right elements? No idea what you are talking about. Being a proper RPG, CrossCode comes with tons of skills, equipment, items, NPCs, quests and all those fun little things consuming your precious time. CrossCode is full of awesome: huge hostile cyborg crabs, a seaman with a jetpack and head-banging meerkats. … Expand"}, {"name": "Timespinner", "details_link": "https://www.metacritic.com/game/playstation-4/timespinner", "publisher": "Chucklefish", "release_date": "Sep 25 2018", "developers": ["Lunar Ray Games"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Action", "Platformer", "2D", "Metroidvania"], "meta_score": 81, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/311a66c63ac81bcbf8e62092eaf77fe9-98.jpg", "descriptions": "Timespinner is a story-driven adventure, inspired by classic 90s action-platformers. Timekeeper Lunais is on a quest to avenge her slain family, using time-bending powers to explore an interconnected world."}, {"name": "Joe Danger 2: The Movie", "details_link": "https://www.metacritic.com/game/playstation-vita/joe-danger-2-the-movie", "publisher": "Hello Games", "release_date": "Jan 13 2015", "developers": ["Four Door Lemon"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation Vita"], "genres": ["Action", "Racing", "General", "Arcade", "Other"], "meta_score": 81, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/aa2d1af8372ab22b271e57c564306f6e-98.jpg", "descriptions": "On the set of the greatest blockbuster \"Movie\" ever made, create your own action film scene by scene, performing every stunt yourself. Using dozens of stunt vehicles and spanning every action film genre imaginable perfect every stunt to thrill the audience, or crack them up withOn the set of the greatest blockbuster \"Movie\" ever made, create your own action film scene by scene, performing every stunt yourself. Using dozens of stunt vehicles and spanning every action film genre imaginable perfect every stunt to thrill the audience, or crack them up with your failed attempts. Strap on the helmet of Joe Danger, and defy death to impress the Director.… Expand"}, {"name": "MadWorld", "details_link": "https://www.metacritic.com/game/wii/madworld", "publisher": "Sega", "release_date": "Mar 10 2009", "developers": ["PlatinumGames"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 81, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/a33159f9e5701bc2629536381ee666ae-98.jpg", "descriptions": "MadWorld is a game with highly stylized black and white graphics, over-the-top violence and visceral action which incorporating a layer of unexpected, irreverent comedy that makes the experience unlike any other. In MadWorld, Varrigan City is under siege by a terrorist group simply known asMadWorld is a game with highly stylized black and white graphics, over-the-top violence and visceral action which incorporating a layer of unexpected, irreverent comedy that makes the experience unlike any other. In MadWorld, Varrigan City is under siege by a terrorist group simply known as \"The Organizers.\" They have isolated its citizens from the rest of the world, and have turned the city into a bizarre and twisted game show environment called \"Death Watch.\" In this game of survival, all the citizens have become reluctant contestants and they are pitted against unknown enemies in the ultimate battle of life or death, where only the strongest will prevail. As Jack, players make their way through the various levels and environments in Varrigan City, crafting clever traps and using various weapons – chainsaws, street signs, and daggers, to name a few – to destroy enemies who threaten their lives. The Wii Remote and Nunchuk are used in a variety of motions that mimic the action on screen. Lively sports commentators call out moves as players execute them, and darkly comical finishing moves add a level of irreverence that contributes to the game's unique tone. Along with the exaggerated characters, upbeat pace and bloody visuals that define \"Death Watch,\" a variety of crazed mini-games called \"Blood Bath Challenges\" are scattered among the levels, giving players a chance to upgrade weapons and increase overall scores. [Sega]… Expand"}, {"name": "Metal Arms: Glitch in the System", "details_link": "https://www.metacritic.com/game/playstation-2/metal-arms-glitch-in-the-system", "publisher": "VU Games", "release_date": "Nov 18 2003", "developers": ["Mass Media"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 81, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/8afd85feb1a894bbdbf1429195e26aa7-98.jpg", "descriptions": "Defiant. Determined. Destructive. Blast your way to victory as Glitch, the gun-slinging, half-ton menacing bot of Droid City. Found as scrap metal, but transformed into destructive machinery, Glitch is determined to free his people from the evil clutches of General Corrosive and his maniacalDefiant. Determined. Destructive. Blast your way to victory as Glitch, the gun-slinging, half-ton menacing bot of Droid City. Found as scrap metal, but transformed into destructive machinery, Glitch is determined to free his people from the evil clutches of General Corrosive and his maniacal army of Mil bots. Unleash a world of pain as you annihilate the General's sinister plan to dominate the world, and salvage the robot race! [Vivendi Universal]… Expand"}, {"name": "The Walking Dead: Saints & Sinners", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-saints-sinners", "publisher": "Skydance Interactive", "release_date": "Jan 23 2020", "developers": ["Skydance Interactive"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Survival"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/71ce02c95f178078928944646c2aa7f9-98.jpg", "descriptions": "Saints & Sinners is a game unlike any other in The Walking Dead universe. Every challenge you face and decision you make is driven by YOU. Fight the undead, scavenge through the flooded ruins of New Orleans, and face gut-wrenching choices for you and the other survivors. Live The Walking Dead."}, {"name": "Final Fantasy XV", "details_link": "https://www.metacritic.com/game/playstation-4/final-fantasy-xv", "publisher": "Square Enix", "release_date": "Nov 29 2016", "developers": ["Square Enix"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/701af0a315397863b82509050147dc02-98.jpg", "descriptions": "FINAL FANTASY XV is a fantasy based on reality. Escaping the flames of war, Noctis, the Crown Prince of the Kingdom of Lucis, embarks on an epic journey with his best friends through a world of larger-than-life beasts, amazing wonders to behold, and dungeons filled with danger in hopes ofFINAL FANTASY XV is a fantasy based on reality. Escaping the flames of war, Noctis, the Crown Prince of the Kingdom of Lucis, embarks on an epic journey with his best friends through a world of larger-than-life beasts, amazing wonders to behold, and dungeons filled with danger in hopes of finding the strength to take back his homeland and end the battle. [Square-Enix]… Expand"}, {"name": "RollerCoaster Tycoon 3", "details_link": "https://www.metacritic.com/game/pc/rollercoaster-tycoon-3", "publisher": "Atari", "release_date": "Oct 26 2004", "developers": ["Frontier Developments"], "platforms": ["iPhone/iPad", "PC"], "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 81, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/c40d71d436a61c8eff1677a287593d6a-98.jpg", "descriptions": "RollerCoaster Tycoon 3 takes the series to new heights with brand new features including 3-D graphics, giving players complete control of views around the park, and a front seat to the action with a new Coaster Cam feature that allows players to ride the roller coasters. RollerCoaster TycoonRollerCoaster Tycoon 3 takes the series to new heights with brand new features including 3-D graphics, giving players complete control of views around the park, and a front seat to the action with a new Coaster Cam feature that allows players to ride the roller coasters. RollerCoaster Tycoon 3 also features new gameplay elements that fans have been asking for - including diversity of guests, added group behavior and improved guest AI - and many other new features which build upon the fun and addictive nature of the original game. [Atari]… Expand"}, {"name": "Going Under", "details_link": "https://www.metacritic.com/game/switch/going-under", "publisher": "Team17", "release_date": "Sep 24 2020", "developers": ["AggroCrab"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 81, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/b800918855d48df61156ca32c658d533-98.jpg", "descriptions": "Going Under is a satirical dungeon crawler about exploring the cursed ruins of failed tech startups.\r As an unpaid intern in the dystopian city of Neo-Cascadia, you’ll wield office junk as weaponry as you make your way through the offbeat procedural dungeons beneath your company campus.Going Under is a satirical dungeon crawler about exploring the cursed ruins of failed tech startups.\r As an unpaid intern in the dystopian city of Neo-Cascadia, you’ll wield office junk as weaponry as you make your way through the offbeat procedural dungeons beneath your company campus.\r [The Future is Wack]\r Failed businesses no longer just cease to exist--they sink beneath the earth, and their employees are cursed to wander the halls for eternity as monsters. It’s your duty to put these monsters out of their misery and repossess their assets--so that your boss can afford a new car, or something.\r [Not All Heroes Get Paychecks]\r Battle through the remains of failed startups themed off of gig workers, dating sites, and cryptocurrency. Uncover the true motives of your employer, a carbonated drink startup known as Fizzle, and their parent company, a subscription box manufacturer with an army of helpful shipping drones. Make friends with your co-workers! Hire a freelance goblin! Date a slime! Invest in crypto! Set a rideshare on fire!\r [Fight Flexibly]\r In the dungeons of Going Under, almost everything can be used as a weapon, from laptops to brooms to body pillows. Proper weapons can be found as well, but even they can break at a moment’s notice if you aren’t careful. Playing cautiously and picking the right weapon for the situation are musts if you intend on surviving your internship.… Expand"}, {"name": "Dragon's Dogma: Dark Arisen", "details_link": "https://www.metacritic.com/game/pc/dragons-dogma-dark-arisen", "publisher": "Capcom", "release_date": "Jan 15 2016", "developers": ["Capcom", "QLOC"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/f3ae9f438b203b0f75107a7e7ba409df-98.jpg", "descriptions": "The next chapter in the Dragon’s Dogma franchise delivers a huge brand new area, missions, enemies and more, plus all of the content from the original game."}, {"name": "Genshin Impact", "details_link": "https://www.metacritic.com/game/playstation-4/genshin-impact", "publisher": "miHoYo", "release_date": "Sep 28 2020", "developers": ["miHoYo"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 81, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/7/60b816b79caf79eca805308ec89f8c0c-98.jpg", "descriptions": "Welcome to the beautiful fantasy world of Teyvat. Step into a huge open-world of adventure and mystery, where heroic quests await. As a traveller from another world, you must find your lost sibling and unravel Teyvat's many secrets. Joined by Paimon, a kind-hearted sprite guide, your missionWelcome to the beautiful fantasy world of Teyvat. Step into a huge open-world of adventure and mystery, where heroic quests await. As a traveller from another world, you must find your lost sibling and unravel Teyvat's many secrets. Joined by Paimon, a kind-hearted sprite guide, your mission takes you through beautiful forests, bustling towns, and treacherous dungeons. And while your journey may put you into the path of merciless foes and fiendish puzzles you can count on numerous playable allies to join your custom party of four, harnessing the power of the elements to overcome all obstacles. \r\rKey Features: \r\rExplore Teyvat however you want\rFly across the open-world, swim in a massive sea, climb mountains, and stray off the beaten path. Whether you decide to follow the storyline or just enjoy the gorgeous environment, Teyvat is yours to discover. \r\rAdd up to four party members\rChoose who fights by your side, with over 30 characters to meet and create your party witheach possessing different abilities, personalities, and combat styles. Will you pick Jean, the acting grand master of the knights? Or Lisa, a witch harnessing the raw force of lightning?\r Master the seven elements\rControl and combine Pyro, Hydro, Electro, Anemo, Dendro, Cryo, and Geo to solve challenging puzzles and unleash powerful attacks.\r Travel alone or hunt together\rCharge head-on into battles by yourself, or invite your friends to join the fight against dangerous monsters, and discover the secrets of this vast world together.… Expand"}, {"name": "Puyo Puyo Tetris", "details_link": "https://www.metacritic.com/game/switch/puyo-puyo-tetris", "publisher": "Sega", "release_date": "Apr 25 2017", "developers": ["Sonic Team"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Puzzle", "Matching", "Stacking"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/6a006dfd93afbef7d9ed5bb8c07d1bcc-98.jpg", "descriptions": "Two puzzle game juggernauts collide as Tetris, one of the largest-selling and recognized brands in gaming history, and Puyo Puyo from SEGA have combined to create a fun-to-play, fast-paced, competitive party game like no other! The game has tons of different styles of gameplay  from theTwo puzzle game juggernauts collide as Tetris, one of the largest-selling and recognized brands in gaming history, and Puyo Puyo from SEGA have combined to create a fun-to-play, fast-paced, competitive party game like no other! The game has tons of different styles of gameplay  from the single-player Adventure and Challenge modes to the ferocious competition of the up-to-four player Arcade modes. There's plenty of Tetris/Puyo variety, even an in-game Shop where players can unlock new characters, new skins for Puyos and Tetriminos, new backgrounds and more.\r Features:\r *    Adventure  Single-player mode offers ten unique acts, each with ten stages featuring different characters from the Puyo Puyo and Tetris universes. Each stage contains unique challenges players will need to overcome in order to win and move on!\r*    Multiplayer Arcade  For up to four local players, Multiplayer Arcade offers a wealth of variety that will bring out players' competitive nature!\r*    Online  Players can try their puzzle skills on a global scale by playing any of the multiplayer modes with up to four players online, in Puzzle League or Free Play modes.\r*    Solo Arcade  Play any of the Multiplayer Arcade modes against the CPU in Battle or Endurance matches, or try the single-player Challenges!… Expand"}, {"name": "Overcooked! 2", "details_link": "https://www.metacritic.com/game/pc/overcooked!-2", "publisher": "Team17", "release_date": "Aug  7 2018", "developers": ["Ghost Town Games Ltd."], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Arcade"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/38730f5c31428f70c337b0bb5274313b-98.jpg", "descriptions": "Overcooked returns with a brand-new helping of chaotic cooking action! Journey back to the Onion Kingdom and assemble your team of chefs in classic couch co-op or online play for up to four players. Hold onto your aprons... it's time to save the world (again!)FEATURES:\n\n* Online/LocalOvercooked returns with a brand-new helping of chaotic cooking action! Journey back to the Onion Kingdom and assemble your team of chefs in classic couch co-op or online play for up to four players. Hold onto your aprons... it's time to save the world (again!)FEATURES:* Online/Local Multiplayer Madness - You'll knead to work together to get the highest score in chaotic local and online multiplayer.* Feast Your Eyes On This - Cook in new kitchens ranging from sushi restaurants, magic schools and mines!* Romaine Calm! - Travel through teleporters, across moving platforms and save time by throwing ingredients across dynamic kitchens that shift and evolve.* Whet Your Appetite! - Cook up a range of new recipes including sushi, cakes, burgers and pizzas.… Expand"}, {"name": "Guild Wars 2: Heart of Thorns", "details_link": "https://www.metacritic.com/game/pc/guild-wars-2-heart-of-thorns", "publisher": "NCSOFT", "release_date": "Oct 23 2015", "developers": ["ArenaNet"], "platforms": "PC", "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/8f154f3db8db477aea69c16395462ecc-98.jpg", "descriptions": "Explore new training opportunities for your character beyond level 80 and master abilities like hang gliding in the jungle, tearing the bark off of heavily armored Mordrem, or building new collections that earn precursors to a legendary weapon."}, {"name": "AaaaaAAaaaAAAaaAAAAaAAAAA!!!: A Reckless Disregard for Gravity", "details_link": "https://www.metacritic.com/game/pc/aaaaaaaaaaaaaaaaaaaaaaaaa!!!-a-reckless-disregard-for-gravity", "publisher": "Dejobaan Games", "release_date": "Sep  3 2009", "developers": ["Dejobaan Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Sports", "General", "Platformer", "3D"], "meta_score": 81, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/82b3e31d769b11acee65ba7cae19a7c1-98.jpg", "descriptions": "BASE jump through a floating city, creating your own stunts to delight your fans. You dive off a skyscraper, relying on quick reflexes to negotiate the intricate tangle of girders that make up the floating city. All eyes are on you as the judges mark your score. One hundred points forBASE jump through a floating city, creating your own stunts to delight your fans. You dive off a skyscraper, relying on quick reflexes to negotiate the intricate tangle of girders that make up the floating city. All eyes are on you as the judges mark your score. One hundred points for hugging those exposed struts as you fall. A thousand for planting a kiss on the side of that building. Twisting and turning, you thread the needle between two billboards, earning cheers from your fans. But while reflexes are important, it's quick thinking that gets you the win. One block away, you spot a crowd of protesters decrying your sport, and make a split second decision. You break off course, stare them straight in the eye, and flip them the finger. They explode into a burst of fury, but the judges absolutely love it, bumping you up to first place. Now all you have to do is to make that landing without ending up a loose sack of broken bones. [Steam]… Expand"}, {"name": "Tiger Woods PGA Tour 07", "details_link": "https://www.metacritic.com/game/playstation-3/tiger-woods-pga-tour-07", "publisher": "EA Sports", "release_date": "Nov 14 2006", "developers": ["EA Redwood Shores"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 81, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/4/26b1d0f7fff745370e1cc0f0ff234902-98.jpg", "descriptions": "Tiger Woods Comes Alive — See and feel every emotion in complete detail with the introduction of all-new Universal Capture (UCAP) technology. Play Under Pressure — With bigger galleries, mass crowd movement from hole to hole, and cheers from nearby greens, all eyes are on you in tournamentTiger Woods Comes Alive — See and feel every emotion in complete detail with the introduction of all-new Universal Capture (UCAP) technology. Play Under Pressure — With bigger galleries, mass crowd movement from hole to hole, and cheers from nearby greens, all eyes are on you in tournament play. Enhanced Career Mode — From working on your driving to mastering your putting skills, craft your game with training challenges in the Practice Facility, then take on the world's best golfers on the World Tour. All-New Championship Courses — The course content doubles with the addition of new licensed courses, including Firestone Country Club, Glen Abbey, Princeville, Spyglass Hill, St Andrews, and Bandon Dunes. The game features 15 of the world's top players, including Tiger Woods, John Daly, Vijay Singh, Ian Poulter, Michael Campbell, and Annika Sorenstam, the most decorated golfer on the LPGA Tour. Show Your GameFace — The innovative character creation tool is revamped with deeper modifications, more apparel, equipment licenses, and specialty items. Challenge up to three players in five new game modes, or play in online tournaments complete with money lists, full stat tracking, league leaders, and more. More Game Modes — Work on your game or take on a friend in Match Play, Battle Golf, 21, OneBall, and more. [EA Sports]… Expand"}, {"name": "Pokemon Puzzle League", "details_link": "https://www.metacritic.com/game/nintendo-64/pokemon-puzzle-league", "publisher": "Nintendo", "release_date": "Sep  1 2000", "developers": ["Nintendo"], "platforms": "Nintendo 64", "genres": ["Miscellaneous", "Puzzle", "Matching"], "meta_score": 81, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/58ca4287d8e5dc83f89762f5813185b6-98.jpg", "descriptions": "Discover the most frantic, frenzied, fun-filled Pokémon challenge ever--Pokémon Puzzle League! Line up three or more blocks of the same type to clear them off the screen. Create chains and combos to send garbage to your opponent. Collect badges from other PokémonDiscover the most frantic, frenzied, fun-filled Pokémon challenge ever--Pokémon Puzzle League! Line up three or more blocks of the same type to clear them off the screen. Create chains and combos to send garbage to your opponent. Collect badges from other Pokémon trainers to earn the right to enter the ultimate competition... a battle against the mysterious Puzzle Master!… Expand"}, {"name": "The Sims 2 University", "details_link": "https://www.metacritic.com/game/pc/the-sims-2-university", "publisher": "EA Games", "release_date": "Feb 28 2005", "developers": ["Maxis"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/2f57fe92969155f7374d34811c27de8d-98.jpg", "descriptions": "In The Sims 2 University, the first expansion pack for the highly-acclaimed The Sims 2 PC game,  players for the first time will play through the new \"young adult\" life stage as their Sims head off to college and join the campus crowd. Whether they live in the dorms or rush a fraternity orIn The Sims 2 University, the first expansion pack for the highly-acclaimed The Sims 2 PC game,  players for the first time will play through the new \"young adult\" life stage as their Sims head off to college and join the campus crowd. Whether they live in the dorms or rush a fraternity or sorority that's just the beginning...Sims can choose from one of 11 majors and by keeping their grades on track, they?ll secure a final degree and open up 4 new career paths.  Players will enjoy all-new college based wants and fears that are tied to their Sims? social life and academic goals which will lead to new rewards and powers that will help them achieve their goals and aspirations in college and beyond. Pranks, parties and college social interactions add to the excitement while your Sims explore campus locations such as college lounges, pool halls, gyms and coffee houses.  As in real life, if your Sims start running low on funds, they can earn Simoleans by picking up a part time job, like tutoring, or engaging in riskier affairs like printing money as a member of the \"secret society.\" Of course, making the right decisions can lead to your Sim to the ultimate goal of becoming \"Big Sim on Campus\" in The Sims 2 University. [Electronic Arts]… Expand"}, {"name": "The Legend of Heroes: Trails of Cold Steel IV", "details_link": "https://www.metacritic.com/game/playstation-4/the-legend-of-heroes-trails-of-cold-steel-iv", "publisher": "NIS America", "release_date": "Oct 27 2020", "developers": ["Falcom"], "platforms": ["PC", "Stadia", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/52d04e16e153ad07a6f1ad4c77e3f575-98.jpg", "descriptions": "The Erebonian Empire is on the brink of all out war! Taking place shortly after the ending of Trails of Cold Steel III, the heroes of Class VII find themselves against the full force of the Empire in an attempt to stop its path of total domination. Further, the hero of the Erebonian CivilThe Erebonian Empire is on the brink of all out war! Taking place shortly after the ending of Trails of Cold Steel III, the heroes of Class VII find themselves against the full force of the Empire in an attempt to stop its path of total domination. Further, the hero of the Erebonian Civil War and Class VII's instructor, Rean Schwarzer, has gone missing. Now, the students of Class VII, old and new, must unite with heroes from all over the continent to create the only chance the world has to be spared from total destruction.… Expand"}, {"name": "Skulls of the Shogun", "details_link": "https://www.metacritic.com/game/xbox-360/skulls-of-the-shogun", "publisher": "Microsoft Game Studios", "release_date": "Jan 30 2013", "developers": ["17 Bit", "17-Bit"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox 360"], "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy", "Tactics"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/d5c548e3490ee38f320799af47585fe9-98.jpg", "descriptions": "Los Angeles, California and Seattle, Washington  Haunted Temple Studios announces Skulls of the Shogun, an invigorating cocktail of 1960s flavored sorcery and strategy  in development for major gaming platforms. Washing up on the shores of the afterlife, players meet and join forces withLos Angeles, California and Seattle, Washington  Haunted Temple Studios announces Skulls of the Shogun, an invigorating cocktail of 1960s flavored sorcery and strategy  in development for major gaming platforms. Washing up on the shores of the afterlife, players meet and join forces with vibrant ghost-samurai warriors, magical animal-monks, and mustachioed samurai generals on the way to capture Skulls of the Shogun.  With its roots in classic turn-based strategy gaming, Skulls of the Shogun retains depth and adds a smooth, simple interface that makes it accessible and enjoyable even to players new to the genre.  Players immerse themselves in battle with fun and unique game play features amidst lush, eerie environments.  Also featuring 4-player local and networked multi-player and an original score inspired by old samurai films and dub, Skulls of the Shogun offers simple-yet-deep, refined and offbeat game-play.… Expand"}, {"name": "Far Cry 3: Blood Dragon", "details_link": "https://www.metacritic.com/game/pc/far-cry-3-blood-dragon", "publisher": "Ubisoft", "release_date": "May  1 2013", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 3", "PlayStation 4", "Stadia", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/f2b15febe2ef9b431873a9adb9a7d957-98.jpg", "descriptions": "Far Cry 3: Blood Dragon is a spin-off that contains around eight hours of original content and features a single open-world island to explore, with many of Far Cry 3's gameplay systems and mechanics making a return."}, {"name": "SIFU", "details_link": "https://www.metacritic.com/game/switch/sifu", "publisher": "Microids", "release_date": "Nov  8 2022", "developers": ["Sloclap"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/0fa2ad27726d9d80e509f8e19f2e9939-98.jpg", "descriptions": "Sifu is the story of a young Kung Fu student on a path of revenge, hunting for the murderers of his family. One against all, he has no allies, and countless enemies. He has to rely on his unique mastery of Kung Fu as well as a mysterious pendant to prevail, and preserve his family's legacy.Sifu is the story of a young Kung Fu student on a path of revenge, hunting for the murderers of his family. One against all, he has no allies, and countless enemies. He has to rely on his unique mastery of Kung Fu as well as a mysterious pendant to prevail, and preserve his family's legacy.The hunt for your enemies will take you through the hidden corners of the city, from the gang-ridden suburbs to the cold hallways of the corporate towers. You have got one day, and countless enemies on your way. For every mistake, time will be the price to pay.Careful positioning and clever use of the environment to your advantage are key to your survival. Use everything at your disposal: throwable objects, makeshift weapons, windows and ledges... The odds are stacked against you, and you will be offered no mercy.Kung Fu is mastery through practice, a path for both the body and the mind. Learn from your errors, unlock unique skills, and find the strength within yourself to master the devastating techniques of Pak-Mei Kung-Fu.… Expand"}, {"name": "Assassin's Creed", "details_link": "https://www.metacritic.com/game/playstation-3/assassins-creed", "publisher": "Ubisoft", "release_date": "Nov 13 2007", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/47a07cfe67fc167e248e4ac7a6e243e6-98.jpg", "descriptions": "The first game in the Assassin's Creed franchise is set in 1191 AD, when the Third Crusade was tearing the Holy Land apart. Shrouded in secrecy and feared for their ruthlessness, the Assassins intend to stop the hostilities by suppressing both sides of the conflict. Players, assuming theThe first game in the Assassin's Creed franchise is set in 1191 AD, when the Third Crusade was tearing the Holy Land apart. Shrouded in secrecy and feared for their ruthlessness, the Assassins intend to stop the hostilities by suppressing both sides of the conflict. Players, assuming the role of the main character Altair, have the power to throw their immediate environment into chaos and to shape events during this pivotal moment in history. [Ubisoft]… Expand"}, {"name": "Happy Game", "details_link": "https://www.metacritic.com/game/pc/happy-game", "publisher": "Amanita Design", "release_date": "Oct 28 2021", "developers": ["Amanita Design"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/60c6fb1932b60081bfa71c3527150989-98.jpg", "descriptions": "A little boy falls asleep to a horrible nightmare. Can you make him happy again?Brand new psychedelic horror adventure from the creators of Botanicula and CHUCHEL.\n\nEndure and escape three unforgettable nightmares.\n\nSolve deeply disturbing puzzles in (not so) charming environments.\n\nDealA little boy falls asleep to a horrible nightmare. Can you make him happy again?Brand new psychedelic horror adventure from the creators of Botanicula and CHUCHEL.Endure and escape three unforgettable nightmares.Solve deeply disturbing puzzles in (not so) charming environments.Deal with suspicious smiley faces and pink bunnies.Creepy songs and screeches from the Czech freakfolk band DVA.… Expand"}, {"name": "Borderlands: The Zombie Island of Dr. Ned", "details_link": "https://www.metacritic.com/game/xbox-360/borderlands-the-zombie-island-of-dr-ned", "publisher": "2K Games", "release_date": "Nov 24 2009", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/e5c04c0bfc6cf6cf36ed7c2b9c001bca-98.jpg", "descriptions": "(Downloadable Content)  The Zombie Island of Dr. Ned is an add-on pack for Borderlands with new enemy types, new missions, and new ... surprises. The Jakobs Corporation would like to invite you to experience the splendor of a corporate owned small town known as Jakobs Cove.  Any rumors you(Downloadable Content)  The Zombie Island of Dr. Ned is an add-on pack for Borderlands with new enemy types, new missions, and new ... surprises. The Jakobs Corporation would like to invite you to experience the splendor of a corporate owned small town known as Jakobs Cove.  Any rumors you may have heard about the \"undead\" walking our streets are completely preposterous and we officially deny them all.  If those rumors turn out to be true simply purchase a firearm from the conveniently located Jakobs Brand Vending Machines and aim for the head.  Also, would you mind saving our employees?  (Non-union only please).… Expand"}, {"name": "SUPERBEAT: XONiC", "details_link": "https://www.metacritic.com/game/playstation-vita/superbeat-xonic", "publisher": "PM Studios Inc.", "release_date": "Nov 10 2015", "developers": ["Nurijoy"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PlayStation Vita"], "genres": ["Action", "Rhythm", "Music"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/f62dc7294f4ed238efcfa51c6bfbb912-98.jpg", "descriptions": "Fully compatible with PlayStation TV."}, {"name": "IL-2 Sturmovik: Birds of Prey", "details_link": "https://www.metacritic.com/game/playstation-3/il-2-sturmovik-birds-of-prey", "publisher": "1C", "release_date": "Sep  8 2009", "developers": ["Gaijin Entertainment"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/1c6b5ec3bc039a7b2eb202b92ae722c8-98.jpg", "descriptions": "IL-2 Sturmovik: Birds of Prey is based around the large-scale aerial combat and ground military operations of World War II. Players can participate in some of the war's most famous battles piloting fighters, battle planes and heavy bombers across a range of thrilling missions. There are fiveIL-2 Sturmovik: Birds of Prey is based around the large-scale aerial combat and ground military operations of World War II. Players can participate in some of the war's most famous battles piloting fighters, battle planes and heavy bombers across a range of thrilling missions. There are five theatres of war to engage in 0 The Battle of Britain, Stalingrad, Berlin, Sicily and Korsun' representing the main airborne battles of World War II in Europe. IL-2 Sturmovik: Birds of Prey also boasts an all new damage effects engine as well as advanced environmental visuals enriching the game play. Players can see real time damage to the aircraft such as holes in the wings and trail lines during dog fights. IL-2 Sturmovik: Birds of Prey features hundreds of airplanes taking part in air battles. The unique environmental engine also produces highly detailed, realistic landscapes that allow players to see breathtaking ground support actions. [505 Games]… Expand"}, {"name": "Ni no Kuni II: Revenant Kingdom", "details_link": "https://www.metacritic.com/game/pc/ni-no-kuni-ii-revenant-kingdom", "publisher": "Level 5", "release_date": "Mar 23 2018", "developers": ["Level 5"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/048440f39cb7c0a8da80aa72ef692d05-98.jpg", "descriptions": "Re-enter the animated world of Ni no Kuni in the sequel to the role-playing masterpiece developed by LEVEL-5. \r\rExplore a beautifully crafted world and experience the gripping story in an all-new RPG adventure. LEVEL-5 reunites with Yoshiyuki Momose on character design and Music created byRe-enter the animated world of Ni no Kuni in the sequel to the role-playing masterpiece developed by LEVEL-5. \r\rExplore a beautifully crafted world and experience the gripping story in an all-new RPG adventure. LEVEL-5 reunites with Yoshiyuki Momose on character design and Music created by Joe Hisaishi in the production of the next Ni no Kuni tale.… Expand"}, {"name": "FORM", "details_link": "https://www.metacritic.com/game/pc/form", "publisher": "Charm Games", "release_date": "Jun  1 2017", "developers": ["Charm Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "First-Person"], "meta_score": 81, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/6d1d09c3c3b2cc101152c4beb978aacf-98.jpg", "descriptions": "Enter a surreal adventure where puzzles are built from dreams and memories. Solve the mystery behind an ancient artifact. Advance through a world that transforms around you. Transcend this existence."}, {"name": "MLB 14: The Show", "details_link": "https://www.metacritic.com/game/playstation-3/mlb-14-the-show", "publisher": "SCEA", "release_date": "Apr  1 2014", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 4", "PlayStation Vita", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 81, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/b58304bda0d0b3502b1bf3949ce88875-98.jpg", "descriptions": "MLB 14 The Show is a realistic baseball game that allows players to feel the MLB experience with moments such as when you're called up to the majors, a sacrifice fly to left field, or crushing a walk-off homer to win it all."}, {"name": "Bravely Second: End Layer", "details_link": "https://www.metacritic.com/game/3ds/bravely-second-end-layer", "publisher": "Square Enix", "release_date": "Apr 15 2016", "developers": ["Silicon Studio"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/9e26e618b6db0d3d619c5a9e7f7386af-98.jpg", "descriptions": "The successor to Square Enix’s Bravely Default game. Time has passed since the events of the previous game, bringing about plenty of new dangers to encounter. Agnés Oblige has been kidnapped, and as a knight in her service, it’s up to our hero, Yew, to save her."}, {"name": "Terraria", "details_link": "https://www.metacritic.com/game/xbox-360/terraria", "publisher": "505 Games", "release_date": "Mar 27 2013", "developers": ["Engine Software"], "platforms": ["3DS", "iPhone/iPad", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Stadia", "Switch", "Wii U", "Xbox One", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "Action Adventure", "Platformer", "Platformer", "Sandbox", "2D", "2D"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/84fba28aa12b38db724146d0db5a908c-98.jpg", "descriptions": "Terraria? What's that?\r Terraria is a land of adventure! A land of mystery! A land that's yours to shape, to defend and to enjoy. Your options in Terraria are limitless, are you an action gamer with an itchy trigger finger? A master builder? A collector? An explorer? There's something forTerraria? What's that?\r Terraria is a land of adventure! A land of mystery! A land that's yours to shape, to defend and to enjoy. Your options in Terraria are limitless, are you an action gamer with an itchy trigger finger? A master builder? A collector? An explorer? There's something for everyone here.\r Dig, fight, explore, build! Nothing is impossible in this action-packed adventure game. The world is your canvas and the ground itself is your paint.\r Grab your tools and go! Make weapons to fight off a variety of enemies in numerous biomes. Dig deep underground to find accessories, money, and other useful things. Gather resources to create everything you need to make the world your own. Build a house, a fort, or even a castle. People will move in to live there and perhaps even sell you different wares to assist you on your journey.\r But beware, there are even more challenges awaiting you... Are you up to the task?\r Key features:\r - Sandbox Play\r- Randomly generated worlds\r- Free Content Updates… Expand"}, {"name": "Sid Meier's Civilization: Beyond Earth", "details_link": "https://www.metacritic.com/game/pc/sid-meiers-civilization-beyond-earth", "publisher": "2K Games", "release_date": "Oct 23 2014", "developers": ["Firaxis Games"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "General", "4X"], "meta_score": 81, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/9c283e114a851995e741c2ca20df65e8-98.jpg", "descriptions": "Sid Meier's Civilization: Beyond Earth sends players on an expedition from Earth to lead their people into a new frontier to explore and colonize an alien planet, and create a new civilization."}, {"name": "Marvel's Midnight Suns", "details_link": "https://www.metacritic.com/game/playstation-5/marvels-midnight-suns", "publisher": "2K Games", "release_date": "Dec  2 2022", "developers": ["Firaxis Games"], "platforms": ["PC", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 81, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/cf23681faf7ff3c011f70590bc01b388-98.jpg", "descriptions": "After centuries of sleep, Lilith, Mother of Demons, has been revived by Hydra through a twist of dark magic and science. Lilith stops at nothing to complete an ancient prophecy and bring back her evil master, Chthon. Pushed to the brink, the Avengers desperately look to fight fire withAfter centuries of sleep, Lilith, Mother of Demons, has been revived by Hydra through a twist of dark magic and science. Lilith stops at nothing to complete an ancient prophecy and bring back her evil master, Chthon. Pushed to the brink, the Avengers desperately look to fight fire with hellfire and enlist the help of the Midnight Suns - Nico Minoru, Blade, Magik and Ghost Rider - young heroes with powers deeply rooted in the supernatural, formed to prevent the very prophecy Lilith aims to fulfill.\r In the face of fallen allies and the fate of the world at stake, it will be up to you to rise up against the darkness!\r Marvel's Midnight Suns is a new tactical RPG set in the darker side of the Marvel Universe, putting you face-to-face against demonic forces of the underworld as you team up with and live among the Midnight Suns, Earth's last line of defense.… Expand"}, {"name": "Pro Evolution Soccer 2018", "details_link": "https://www.metacritic.com/game/pc/pro-evolution-soccer-2018", "publisher": "Konami", "release_date": "Sep 12 2017", "developers": ["Konami"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 81, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/b334bd48baf54f67a5b21b447468f4bf-98.jpg", "descriptions": "PES League Integration – Compete with PES League in new modes including myClub"}, {"name": "EA Sports Active", "details_link": "https://www.metacritic.com/game/wii/ea-sports-active", "publisher": "EA Sports", "release_date": "May 19 2009", "developers": ["EA Canada"], "platforms": "Wii", "genres": ["Sports", "Miscellaneous", "General", "Exercise / Fitness"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/fd56ba758a3c38c8f0d8073aa501f61b-98.jpg", "descriptions": "EA SPORTS Active is a customizable fitness program. Working out with a friend is a great way to stay motivated. That's why EA SPORTS Active features a Multiplayer mode. The split-screen view allows you and a buddy to work out side-by-side. And if you’re up for some butt-kicking, MultiplayerEA SPORTS Active is a customizable fitness program. Working out with a friend is a great way to stay motivated. That's why EA SPORTS Active features a Multiplayer mode. The split-screen view allows you and a buddy to work out side-by-side. And if you’re up for some butt-kicking, Multiplayer mode will pit you against each other in a race to the finish line. Just like a personal trainer at the gym, EA SPORTS Active's virtual trainer guides and motivates you to reach your fitness goals. Throughout each workout you'll get clear instructions, instant feedback, just the right amount of encouragement, and valuable tips to help you achieve maximum results. Finally, a personal trainer that doesn't charge by the hour! Dancing, inline skating, tennis and volleyball are just a few of the more than 25 exercises and activities that combine fitness and fun in an EA SPORTS Active workout. You’ll be breaking a sweat in no time with exercises that target your upper body, lower body and cardio. With so much variety, you’ll never be bored with your workout again. [Electronic Arts]… Expand"}, {"name": "Crysis Remastered Trilogy", "details_link": "https://www.metacritic.com/game/xbox-one/crysis-remastered-trilogy", "publisher": "Crytek", "release_date": "Oct 15 2021", "developers": ["Crytek"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/c96bcbbcaada0c38e75243faa56eed81-98.jpg", "descriptions": "The classic first person shooter from Crytek is back with the action packed gameplay, sandbox world, and thrilling epic battles you loved the first time around. Crysis Remastered Trilogy includes each of the single player campaigns from the legendary first person shooters Crysis, Crysis 2,The classic first person shooter from Crytek is back with the action packed gameplay, sandbox world, and thrilling epic battles you loved the first time around. Crysis Remastered Trilogy includes each of the single player campaigns from the legendary first person shooters Crysis, Crysis 2, and Crysis 3, optimized for today's hardware. Relive the adventure in this great value all in one bundle.Features:* Crysis Remastered: What begins as a simple rescue mission becomes the battleground of a new war as alien invaders swarm over a chain of Lingshan islands. Playing as super soldier Nomad, you are armed with a powerful Nanosuit equipped with Speed, Strength, Armor, and Cloaking abilities. Use avast arsenal of modular weaponry and adapt your tactics and gear to dominate enemies in an enormous sandbox world.* Crysis 2 Remastered: Aliens have returned to a world ravaged by climate disasters. As the invaders lay waste to New York and begin an assault that threatens the total annihilation of humankind, only you have the technology to lead the fightback. Equipped with the upgraded Nanosuit 2.0, customize your suit and weapons in real time and unlock powerful new abilities in the battle for humanity's survival.* Crysis 3 Remastered: Returning to the fight as super soldier Prophet, the search for the alien Alpha Ceph continues, but now you must also expose the truth behind the C.E.L.L. corporation, which has turned New York City into a sprawling urban rainforest sheltered by a giant nanodome. Fight through seven distinct districts and decimate your opponents in a blaze of brute force using the Nanosuit's superior technology, or use stealth to achieve your goals and become humanity's silent savior. Equipped with your powerful and deadly new Predator Bow, there's no wrong way to save the world.… Expand"}, {"name": "Awesomenauts Assemble!", "details_link": "https://www.metacritic.com/game/xbox-one/awesomenauts-assemble!", "publisher": "Ronimo Games", "release_date": "Sep  7 2016", "developers": ["Abstraction Games", "Ronimo Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Strategy", "Real-Time", "MOBA"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/e866bd801bed7a3feb32acd59699d306-98.jpg", "descriptions": "The game features the most awesome mercenaries in the galaxy in their fight for territorial supremacy. Awesomenauts brings Russian monkeys with jetpacks, giant robots, and lots of other mighty aliens to the two-dimensional console battlefield. Combining classic platforming-action with modernThe game features the most awesome mercenaries in the galaxy in their fight for territorial supremacy. Awesomenauts brings Russian monkeys with jetpacks, giant robots, and lots of other mighty aliens to the two-dimensional console battlefield. Combining classic platforming-action with modern online multiplayer functionality, the action-packed gameplay offers everything the 16-bit generation and modern gamers love.… Expand"}, {"name": "Plants vs. Zombies", "details_link": "https://www.metacritic.com/game/ds/plants-vs-zombies", "publisher": "PopCap", "release_date": "Jan 18 2011", "developers": ["TOSE"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360", "DS"], "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "General", "General", "Fantasy", "Defense"], "meta_score": 81, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/1a3ca9fac4998e1bd6c8065b1aab2796-98.jpg", "descriptions": "PopCap games brings Plants vs. Zombies to the Nintendo DS for on the go play."}, {"name": "Warhammer 40,000: Chaos Gate - Daemonhunters", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-chaos-gate---daemonhunters", "publisher": "Frontier Foundry", "release_date": "May  5 2022", "developers": ["Complex Games Inc."], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Real-Time", "Tactics"], "meta_score": 81, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/92235e9e6975ff9b15607026f3a87e0f-98.jpg", "descriptions": "Lead humanity's greatest weapon, the Grey Knights, in this fast-paced turn-based tactical RPG. Root out and purge a galaxy-spanning plague in a cinematic, story-driven campaign, using the tactics and talents of your own personalised squad of Daemonhunters. Forge Your Champions - Grey KnightsLead humanity's greatest weapon, the Grey Knights, in this fast-paced turn-based tactical RPG. Root out and purge a galaxy-spanning plague in a cinematic, story-driven campaign, using the tactics and talents of your own personalised squad of Daemonhunters. Forge Your Champions - Grey Knights are humanity's greatest weapon. A secretive yet supremely powerful chapter of Space Marines sworn to eradicate corruption, these legendary Daemonhunters are dedicated to combating the minions of Chaos. Lead your own personalised squad against a galaxy-wide plot to infect worlds with a cosmic plague, The Bloom. \r\rPlan Your Strategy \rMaster a turn-based tactical game full of satisfyingly strategic action. Choose powerful classes, wield incredible weapons, use environments to your advantage, and target specific enemy weak points to hinder the advance of an ever-evolving and mutating threat. \r\rEnter the 41st Millennium \rPenned by acclaimed Black Library author Aaron Dembski-Bowden, immerse yourself in a compelling story set in the grimdark universe of Warhammer 40,000. Meet famous faces, engage iconic foes, and discover what it takes to lead a squad of elite warriors battling to prevent galaxy-wide destruction in the 41st millennium.… Expand"}, {"name": "Assassin's Creed Origins", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-origins", "publisher": "Ubisoft", "release_date": "Oct 27 2017", "developers": ["Ubisoft", "Ubisoft Montreal"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "Edutainment", "Open-World"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/9afc93af3cf76a282f6f9e599bfe590e-98.jpg", "descriptions": "Set in mysterious Ancient Egypt, Assassin’s Creed Origins is a new beginning. Experience a new way to fight while exploring the Great Pyramids and hidden tombs across the country of Ancient Egypt, and encounter many memorable storylines along your journey. And discover the origin story ofSet in mysterious Ancient Egypt, Assassin’s Creed Origins is a new beginning. Experience a new way to fight while exploring the Great Pyramids and hidden tombs across the country of Ancient Egypt, and encounter many memorable storylines along your journey. And discover the origin story of the Assassin's Brotherhood. [Ubisoft]… Expand"}, {"name": "Marvel's Midnight Suns", "details_link": "https://www.metacritic.com/game/xbox-series-x/marvels-midnight-suns", "publisher": "2K Games", "release_date": "Dec  2 2022", "developers": ["Firaxis Games"], "platforms": ["PC", "PlayStation 5", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/9a7a577888b46bb68f2d98c01d9b5605-98.jpg", "descriptions": "After centuries of sleep, Lilith, Mother of Demons, has been revived by Hydra through a twist of dark magic and science. Lilith stops at nothing to complete an ancient prophecy and bring back her evil master, Chthon. Pushed to the brink, the Avengers desperately look to fight fire withAfter centuries of sleep, Lilith, Mother of Demons, has been revived by Hydra through a twist of dark magic and science. Lilith stops at nothing to complete an ancient prophecy and bring back her evil master, Chthon. Pushed to the brink, the Avengers desperately look to fight fire with hellfire and enlist the help of the Midnight Suns - Nico Minoru, Blade, Magik and Ghost Rider - young heroes with powers deeply rooted in the supernatural, formed to prevent the very prophecy Lilith aims to fulfill.\r In the face of fallen allies and the fate of the world at stake, it will be up to you to rise up against the darkness!\r Marvel's Midnight Suns is a new tactical RPG set in the darker side of the Marvel Universe, putting you face-to-face against demonic forces of the underworld as you team up with and live among the Midnight Suns, Earth's last line of defense.… Expand"}, {"name": "Captain Toad: Treasure Tracker - Special Episode", "details_link": "https://www.metacritic.com/game/switch/captain-toad-treasure-tracker---special-episode", "publisher": "Nintendo", "release_date": "Mar 14 2019", "developers": ["Nintendo Software Technology"], "platforms": "Switch", "genres": ["Puzzle", "Action", "Platformer", "3D"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/7ecd53e0d6370b192daf89cf7a9470d3-98.jpg", "descriptions": null}, {"name": "Hatsune Miku: Project Diva f", "details_link": "https://www.metacritic.com/game/playstation-vita/hatsune-miku-project-diva-f", "publisher": "Sega", "release_date": "Mar  4 2014", "developers": ["Sega"], "platforms": ["PlayStation 3", "PlayStation Vita"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/94794ed4b688267935639f2d64684d10-98.jpg", "descriptions": "Hatsune Miku: Project Diva F lets players join Hatsune Miku in an all-new rhythm video game featuring selections from her popular songs."}, {"name": "Tales of Vesperia: Definitive Edition", "details_link": "https://www.metacritic.com/game/playstation-4/tales-of-vesperia-definitive-edition", "publisher": "Bandai Namco Games", "release_date": "Jan 11 2019", "developers": ["Bandai Namco Games", "QLOC"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/97936d92dadc0691951d79bae3a80912-98.jpg", "descriptions": "Tales of Vesperia: Definitive Edition celebrates the 10th anniversary of this RPG with new fully playable characters, events and other additional content never released outside of Japan. Follow Yuri Lowell, a former Imperial Knight, as he befriends a colorful cast of characters throughoutTales of Vesperia: Definitive Edition celebrates the 10th anniversary of this RPG with new fully playable characters, events and other additional content never released outside of Japan. Follow Yuri Lowell, a former Imperial Knight, as he befriends a colorful cast of characters throughout the world of Terca Lumireis and finds himself in the middle of a nefarious plot that threatens the destruction of the entire planet.… Expand"}, {"name": "Halo: Reach Remastered", "details_link": "https://www.metacritic.com/game/pc/halo-reach-remastered", "publisher": "Xbox Game Studios", "release_date": "Dec  3 2019", "developers": ["343 Industries"], "platforms": ["Xbox One", "PC"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/19746ec2a4287bad05e7d1be64c7780c-98.jpg", "descriptions": "Halo: Reach* comes to PC as the first installment of Halo: The Master Chief Collection. Now optimized for PC, experience the heroic story of Noble Team, a group of Spartans, who through great sacrifice and courage, saved countless lives in the face of impossible odds. The planet Reach isHalo: Reach* comes to PC as the first installment of Halo: The Master Chief Collection. Now optimized for PC, experience the heroic story of Noble Team, a group of Spartans, who through great sacrifice and courage, saved countless lives in the face of impossible odds. The planet Reach is humanity’s last line of defense between the encroaching Covenant and their ultimate goal, the destruction of Earth. If it falls, humanity will be pushed to the brink of destruction. … Expand"}, {"name": "Madden NFL 07", "details_link": "https://www.metacritic.com/game/wii/madden-nfl-07", "publisher": "EA Sports", "release_date": "Nov 14 2006", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/e69413878dcd342373ee02b0d3f51f7b-98.jpg", "descriptions": "With the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback andWith the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback and smash through, overpower, or slash away from would-be tacklers as you fight for every yard. Innovative rushing controls give you a game-breaking ground attack featuring all-new jukes, cutbacks, and the distinct running styles of your favorite backs. Conceived as an entirely original football experience on the Wii, the game puts players on the field like never before. Using the console’s unique remote to pass, kick, snap, throw, catch and run, players interact with the game in an entirely new way. Boasting massive gameplay innovations inspired by the motion sensor of the remote, Madden NFL 07 maximizes the power and unique design of the game system. [Electronic Arts]… Expand"}, {"name": "Laser League", "details_link": "https://www.metacritic.com/game/xbox-one/laser-league", "publisher": "505 Games", "release_date": "May 10 2018", "developers": ["roll7"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Sports", "Team", "Futuristic"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/f03a37cb777ba3c0224d39777c0fd3b6-98.jpg", "descriptions": "Blink and you are dead! LASER LEAGUE is the new last-word in high-speed, future-sports team action. Battle against the opposition for control of nodes that bathe the arena in deadly light. Evade rival coloured beams, and fry your opponents with speed, strength and strategy."}, {"name": "escapeVektor: Chapter 1", "details_link": "https://www.metacritic.com/game/wii/escapevektor-chapter-1", "publisher": "Nnooo", "release_date": "Sep 29 2011", "developers": ["Nnooo"], "platforms": "Wii", "genres": ["Miscellaneous", "Action Adventure", "Puzzle", "Action", "Modern"], "meta_score": 81, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/6af59454f3b0d235e465d9b28fb00470-98.jpg", "descriptions": "Help Vektor escape the clutches of the evil CPU & its army of Patrols, Hunters and Interceptors.\r Vektor has been locked inside your Central Processing Unit. He is not sure how he got there or how long he has been there but he needs your help to escape. The CPU has disabled Vektor'sHelp Vektor escape the clutches of the evil CPU & its army of Patrols, Hunters and Interceptors.\r Vektor has been locked inside your Central Processing Unit. He is not sure how he got there or how long he has been there but he needs your help to escape. The CPU has disabled Vektor's ability to move around independently but he is an expert coder.\r Work with Vektor to help him escape the evil clutches of the CPU. Direct him through the CPU's labyrinth, avoiding enemy Patrols, Hunters and Interceptors. You must move fast as the CPU can adapt quickly to your escape. Vektor will code new abilities for you to combat the increasing power of the CPU, but his fate lies in your hands.\r Features\r - 30 levels of Retro Arcade Adventure action!\r- Boost and Blast your way through each level\r- Evade, escape and destroy enemies\r- Uncover the story behind Vektor's imprisonment… Expand"}, {"name": "LostWinds", "details_link": "https://www.metacritic.com/game/wii/lostwinds", "publisher": "Frontier Developments", "release_date": "May 12 2008", "developers": ["Frontier Developments"], "platforms": ["iPhone/iPad", "PC", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 81, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/7/1fe4d066878d13cc4c4a90be53289d39-98.jpg", "descriptions": "[WiiWare]  LostWinds is a fresh, enchanting adventure that lets you wield the awesome powers of Enril the wind Spirit - from raging tornados to the gentlest breeze – to guide and protect Toku, a young boy who is the only one who can help you release the curse placed upon the world of[WiiWare]  LostWinds is a fresh, enchanting adventure that lets you wield the awesome powers of Enril the wind Spirit - from raging tornados to the gentlest breeze – to guide and protect Toku, a young boy who is the only one who can help you release the curse placed upon the world of Mistralis and its people by evil Balasar. [Nintendo]… Expand"}, {"name": "The Bug Butcher", "details_link": "https://www.metacritic.com/game/pc/the-bug-butcher", "publisher": "Awfully Nice Studios", "release_date": "Jan 19 2016", "developers": ["Awfully Nice Studios"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/5e3ac43f8ddf6baa1c44735ef0760ec4-98.jpg", "descriptions": "A fast paced action shooter inspired by the arcade classic Super Pang. Use a wide selection of weapons and powerups to tear through increasingly challenging levels."}, {"name": "WWE SmackDown! vs. Raw 2006", "details_link": "https://www.metacritic.com/game/psp/wwe-smackdown!-vs-raw-2006", "publisher": "THQ", "release_date": "Dec 13 2005", "developers": ["Yuke's"], "platforms": ["PlayStation 2", "PSP"], "num_players": "1-4 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/34f953e1cad7b5480e622aee23f7bbb7-98.jpg", "descriptions": "SmackDown vs. RAW 2006 delivers the deepest and most realistic wrestling experience ever. New high-resolution textures and motion-captured technology bring WWE programming to life like never before. The improved fighting system brings a new level of realism and tactical thinking to matches.SmackDown vs. RAW 2006 delivers the deepest and most realistic wrestling experience ever. New high-resolution textures and motion-captured technology bring WWE programming to life like never before. The improved fighting system brings a new level of realism and tactical thinking to matches. Lace up your boots for the definitive wrestling experience. Features over 50 playable WWE Superstars. Robust Create-A-Superstar and Create-A-Championship modes. Full Season Mode and dozens of exhibitions. PS2 to PSP Connectivity. Transfer season mode and created characters between the two game systems. Exclusive PSP Features: Party Mode -- WWE mini-games with wireless multiplayer support. Exclusive PSP unlockables: up to 4 player multiplayer wireless gaming. [THQ]… Expand"}, {"name": "Visage", "details_link": "https://www.metacritic.com/game/pc/visage", "publisher": "SadSquare Studio", "release_date": "Oct 29 2020", "developers": ["SadSquare Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 81, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/2/cc66a899285fc9e32ccd0875fad54b3b-98.jpg", "descriptions": "Visage is a first-person psychological horror game. Explore a mysterious ever-changing house in a slow-paced, atmospheric world that combines both uncannily comforting and horrifyingly realistic environments, and enjoy a genuinely terrifying experience."}, {"name": "Final Fantasy XII: Revenant Wings", "details_link": "https://www.metacritic.com/game/ds/final-fantasy-xii-revenant-wings", "publisher": "Square Enix", "release_date": "Nov 20 2007", "developers": ["Square Enix", "Think and Feel"], "platforms": "DS", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Fantasy", "Fantasy", "Tactics"], "meta_score": 81, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/5/a6467dcf62905ac4d9f5e9885795543d-98.jpg", "descriptions": "One year after the events of FINAL FANTASY XII, the young protagonist Vaan travels the skies of Ivalice with his trusted navigator Penelo at his side. Their treasure hunting adventures take them to the sky continent of Lemurés where they meet Llyud, a member of the aegyl race. TheseOne year after the events of FINAL FANTASY XII, the young protagonist Vaan travels the skies of Ivalice with his trusted navigator Penelo at his side. Their treasure hunting adventures take them to the sky continent of Lemurés where they meet Llyud, a member of the aegyl race. These mysterious winged people have been living on the floating continent for centuries, but a disturbance has allowed treasure-seeking sky pirates to breach their once-hidden territory. It falls to Vaan and his band of young sky pirates to stand up against the trespassers, and defend this extraordinary world and its people.… Expand"}, {"name": "SoulCalibur V", "details_link": "https://www.metacritic.com/game/playstation-3/soulcalibur-v", "publisher": "Namco Bandai Games", "release_date": "Jan 31 2012", "developers": ["Project Soul"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 81, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/1e2b5adc9e7ffba6a436d32465906262-98.jpg", "descriptions": "Developed by the Project Soul team, SOULCALIBUR V begins 17 years after the events of SOULCALIBUR IV with new heroes and returning warriors clashing in a showdown between good and evil. The tale of Patroklos, son of Sophitia Alexandra, unfolds as his family's destiny intertwines with theDeveloped by the Project Soul team, SOULCALIBUR V begins 17 years after the events of SOULCALIBUR IV with new heroes and returning warriors clashing in a showdown between good and evil. The tale of Patroklos, son of Sophitia Alexandra, unfolds as his family's destiny intertwines with the Soul swords. With the series' 8-way run, allowing for true 3D movement during matches, a refined battle system, and fine graphics, SOULCALIBUR V might be for anyone looking for a knock-down, drag-out fight. … Expand"}, {"name": "The Legend of Tianding", "details_link": "https://www.metacritic.com/game/pc/the-legend-of-tianding", "publisher": "Creative Games Computer Graphics Corporation", "release_date": "Nov  1 2021", "developers": ["Neon Doctrine"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Platformer", "Action", "Beat-'Em-Up", "2D"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/d30add5bcd6d3a23f9da8dee166c5098-98.jpg", "descriptions": "The Legend of Tianding is a sidescrolling action game about Liao Tianding, the legendary Taiwanese Folk Hero. Explore the dazzling streets of Colonial Japanese Taiwan in the early 20th century."}, {"name": "Project CARS", "details_link": "https://www.metacritic.com/game/xbox-one/project-cars", "publisher": "Bandai Namco Games", "release_date": "May 12 2015", "developers": ["Slightly Mad Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "General", "Automobile"], "meta_score": 81, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/eb36932cae20231d701a80f319b4b3ae-98.jpg", "descriptions": "Create a driver, pick from a variety of motorsports, and shift into high gear to chase a number of Historic Goals and ultimate recognition in the Hall Of Fame. Then test your skills online either in competitive fully-loaded race weekends, leaderboard-based time challenges, orCreate a driver, pick from a variety of motorsports, and shift into high gear to chase a number of Historic Goals and ultimate recognition in the Hall Of Fame. Then test your skills online either in competitive fully-loaded race weekends, leaderboard-based time challenges, or continually-updated community events.… Expand"}, {"name": "Pool Nation", "details_link": "https://www.metacritic.com/game/playstation-3/pool-nation", "publisher": "Cherry Pop Games", "release_date": "Jun 25 2013", "developers": ["Cherry Pop Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Sports", "Miscellaneous", "Parlor", "Individual", "Billiards", "Billiards"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/578fd1c2438f75c5bc8cd851d1c29803-98.jpg", "descriptions": "See the adoring looks on the faces of  See impressionable small children, as you take on the best of the best in the Pool Nation tour. They're impressed alright. They wish they were you. Soundly beating the final, toughest opponent, you can almost sense the tears of pride in their eyes asSee the adoring looks on the faces of  See impressionable small children, as you take on the best of the best in the Pool Nation tour. They're impressed alright. They wish they were you. Soundly beating the final, toughest opponent, you can almost sense the tears of pride in their eyes as you unlock the final character decal – you've collected the lot. Soak up their admiration. You've  collected earned it.… Expand"}, {"name": "Swords & Soldiers", "details_link": "https://www.metacritic.com/game/playstation-3/swords-soldiers", "publisher": "Ronimo Games", "release_date": "Sep 28 2010", "developers": ["Ronimo Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "Switch", "Wii U", "PlayStation 3"], "genres": ["General", "Strategy", "General"], "meta_score": 81, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/0454ba716af58bef3b7cec0ffd59fbdd-98.jpg", "descriptions": "Rewrite history as you take control of the brutal Vikings, the devious Aztecs or the crafty Chinese in their global quest to win the favor of the Gods! Swords & Soldiers is a side-scrolling strategy game that lets you control an entire army and lets you wield devastating magicalRewrite history as you take control of the brutal Vikings, the devious Aztecs or the crafty Chinese in their global quest to win the favor of the Gods! Swords & Soldiers is a side-scrolling strategy game that lets you control an entire army and lets you wield devastating magical abilities. Demolish your enemy's castle at the end of these two-dimensional battlefields and lead your troops to victory! Featuring hours of single-player campaign gameplay, challenging skirmishes and frantic local multiplayer matches that let you take the fight to your friends! If that still isn't enough for you, there are several compelling challenge modes to unlock that will test your abilities to their limits in a bid for that one glorious high score! … Expand"}, {"name": "Super Scribblenauts", "details_link": "https://www.metacritic.com/game/ds/super-scribblenauts", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 12 2010", "developers": ["5TH Cell"], "platforms": "DS", "num_players": "2 ", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "Puzzle", "General"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/f4d1cda18055ed8a6dfdb5620b32f2e0-98.jpg", "descriptions": "In this new game created and developed by 5TH Cell, players use the stylus and touch screen to help Maxwell, the game’s hero, acquire the \"Starite,\" the prize earned from solving the puzzle in even more robust challenges and redesigned levels.  Players now have the ability to writeIn this new game created and developed by 5TH Cell, players use the stylus and touch screen to help Maxwell, the game’s hero, acquire the \"Starite,\" the prize earned from solving the puzzle in even more robust challenges and redesigned levels.  Players now have the ability to write any object that comes to mind and modify it in any way they desire using adjectives to reach the goal in each level.  Adjectives can change the color, size, elements, behaviors and many other aspects of the object they are describing. Multiple adjectives can be combined together to produce incredibly creative objects, allowing the player's imagination to run wild for a truly unique and individualistic experience. … Expand"}, {"name": "DREDGE", "details_link": "https://www.metacritic.com/game/pc/dredge", "publisher": "Team17", "release_date": "Mar 30 2023", "developers": ["Black Salt Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/1306c1cbc2bf134a03c6d2ab959c5987-98.jpg", "descriptions": "Dredge is a fishing adventure with a sinister undercurrent. Sell your catch, upgrade your vessel and dredge the depths for long-buried relics. Explore the stories of the strange locals and discover why some things are best left forgotten. \r\rStarting from your new home in a group of islandsDredge is a fishing adventure with a sinister undercurrent. Sell your catch, upgrade your vessel and dredge the depths for long-buried relics. Explore the stories of the strange locals and discover why some things are best left forgotten. \r\rStarting from your new home in a group of islands known as The Marrows, upgrade your engines and set sail for the neighboring regions - each with their own unique fish, personalities and secrets.\rDredge up forgotten treasures. Outsmart unremembered terrors.\r Someone wants very badly to retrieve relics lost to the ocean floor. The work is lucrative, but can you trust them? What will they use the relics for? And will they ever be satisfied?\r It's not just the sharp rocks and shallow reefs you need to watch out for - keep your eyes on the depths below and the sky above. The biggest threat to your safety might come from within.… Expand"}, {"name": "The Legend of Zelda: Skyward Sword HD", "details_link": "https://www.metacritic.com/game/switch/the-legend-of-zelda-skyward-sword-hd", "publisher": "Nintendo", "release_date": "Jul 16 2021", "developers": ["Tantalus", "Nintendo"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 81, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/73256d4a09d608ca4e827ff334278946-98.jpg", "descriptions": "Take to the skies, draw your sword, and experience the earliest story in the Legend of Zelda series. Join Link in his high-flying quest to save Zelda, a childhood friend who must confront her destiny. Soar between floating islands and descend to the treacherous surface world in this updatedTake to the skies, draw your sword, and experience the earliest story in the Legend of Zelda series. Join Link in his high-flying quest to save Zelda, a childhood friend who must confront her destiny. Soar between floating islands and descend to the treacherous surface world in this updated HD version of the Legend of Zelda: Skyward Sword. Master realistic swordplay that matches your movements. Swing your sword and angle your slashes to uncover and break through opponents’ defenses using intuitive motion controls. Link will match the angle of each strike you make with the Joy-Con controller, creating immersive swordplay that relies on strategy and accuracy. Movements feel smoother and more immediate thanks to the Nintendo Switch system’s increased processing power and HD graphics. Take advantage of the newly-added button only control scheme—perfect for playing in handheld mode or on the Nintendo Switch Lite system.… Expand"}, {"name": "Sackboy: A Big Adventure", "details_link": "https://www.metacritic.com/game/pc/sackboy-a-big-adventure", "publisher": "PlayStation PC", "release_date": "Oct 27 2022", "developers": ["Sumo Digital"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/a5151bcf7e20736ddecccb05e7ca6ef9-98.jpg", "descriptions": "Iconic PlayStation hero Sackboy bursts back into breathtaking action with a huge, fun and frantic 3D multiplayer platforming adventure and a whole new edgy sackitude!The dastardly Vex (a near-mythical being born of chaos and fear, no less) kidnaps Sackboy's friends and forces them to buildIconic PlayStation hero Sackboy bursts back into breathtaking action with a huge, fun and frantic 3D multiplayer platforming adventure and a whole new edgy sackitude!The dastardly Vex (a near-mythical being born of chaos and fear, no less) kidnaps Sackboy's friends and forces them to build his Topsy Turver. Set off alone or with your bravest friends on a whirlwind of capers across the snowiest mountains, the leafiest jungles, the wettest underwater realms and the, uh, spaciest of space colonies.Take down Vex. Save the sack-folk. Save the day. It's time to fulfil your destiny, Sackboy. From woolly wonderkid and hessian hero rise our Knitted Knight.… Expand"}, {"name": "F1 22", "details_link": "https://www.metacritic.com/game/xbox-series-x/f1-22", "publisher": "Electronic Arts", "release_date": "Jun 28 2022", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 22 ", "genres": ["Action", "General", "Racing", "Simulation", "Automobile"], "meta_score": 81, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/7/7653e58ba1c44bc0e39625112730416c-98.jpg", "descriptions": "Enter the new era of Formula 1® in EA SPORTS™ F1® 22, the official videogame of the 2022 FIA Formula One World Championship™. Take your seat for a new season as redesigned cars and overhauled rules redefine race day, test your skills around the new Miami International Autodrome, and get aEnter the new era of Formula 1® in EA SPORTS™ F1® 22, the official videogame of the 2022 FIA Formula One World Championship™. Take your seat for a new season as redesigned cars and overhauled rules redefine race day, test your skills around the new Miami International Autodrome, and get a taste of the glitz and glamour in F1® Life. Race the stunning new cars of the Formula 1® 2022 season with the authentic lineup of all 20 drivers and 10 teams, and take control of your race experience with new immersive or broadcast race sequences. Create a team and take them to the front of the grid with new depth in the acclaimed My Team career mode, race head-to-head in split-screen or multiplayer, or change the pace by taking supercars from some of the sport’s biggest names to the track in our all new Pirelli Hot Laps feature.… Expand"}, {"name": "Embracelet", "details_link": "https://www.metacritic.com/game/switch/embracelet", "publisher": "machineboy", "release_date": "Sep 24 2020", "developers": ["machineboy"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Puzzle", "Action", "3D", "Third-Person"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/78adb05d5354d386f0455a030f3edea6-98.jpg", "descriptions": "Embracelet is an adventure game set in Northern Norway - a unique coming of age story about love, loss, friendship and family - and a magical bracelet with mysterious powers. Embracelet is a puzzle adventure game with a gripping story, gentle and satisfying puzzles, exploration and aEmbracelet is an adventure game set in Northern Norway - a unique coming of age story about love, loss, friendship and family - and a magical bracelet with mysterious powers. Embracelet is a puzzle adventure game with a gripping story, gentle and satisfying puzzles, exploration and a beautiful, orchestral soundtrack. You play as Jesper, a Norwegian teenager who lives with his mom in the city. One day he is handed an old bracelet by his Grandfather who grew up in a fishing community up north. This bracelet has powers - strange, mysterious powers. Jesper is given the task to unravel the mystery behind the bracelet. Where does it come from? Who does it belong to? And why did his Grandfather leave the island and his old life behind?… Expand"}, {"name": "Sonic the Hedgehog 4: Episode I", "details_link": "https://www.metacritic.com/game/wii/sonic-the-hedgehog-4-episode-i", "publisher": "Sega", "release_date": "Oct 11 2010", "developers": ["Sonic Team"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 81, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/c56921a0125b1c23f6df14ad640afdac-98.jpg", "descriptions": "Sonic is back for his fourth installment in the classic 2D series, revamped from the ground up."}, {"name": "NCAA Football 09", "details_link": "https://www.metacritic.com/game/playstation-3/ncaa-football-09", "publisher": "Electronic Arts", "release_date": "Jul 15 2008", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/17ce2d1092e9926b8709563bacc32b2f-98.jpg", "descriptions": "College football has never before felt more wide open than in NCAA Football 09. Gamers can experience the excitement of making big plays on the field, as they have the ability to directly control and influence the game through the all-new break away animation engine. With huge cut-backCollege football has never before felt more wide open than in NCAA Football 09. Gamers can experience the excitement of making big plays on the field, as they have the ability to directly control and influence the game through the all-new break away animation engine. With huge cut-back lanes, new tackling animations and wider blocking holes, NCAA Football 09 offers a host of offensive opportunities. NCAA Football 09 also brings the atmosphere, pageantry and tradition of college football to life. Through the redesigned stadiums, which reflect even more detail of each school’s individual playing field, to the dynamic sidelines filled with school colors, cheerleaders and mascots, players feel the excitement of college gameday. Players can gain Home Field Advantage as the intensity of the home crowd rises and rattles the composure of opposing teams. All 120 Football Bowl Subdivision schools are represented in the game and players can even customize the in-game atmosphere with their own personal music collection. Off the field, NCAA Football 09 features its most robust Dynasty Mode yet, inviting fans to create and manage a perennial powerhouse program from landing blue-chip recruits to winning championships on the field. For the first time ever, Dynasty goes online with up to 12 competitors to recruit head-to-head, customize schedules and play for up to 60 seasons. [Electronic Arts]… Expand"}, {"name": "Disney's Toontown Online", "details_link": "https://www.metacritic.com/game/pc/disneys-toontown-online", "publisher": "Sony Platform Publishing", "release_date": "Oct  6 2005", "developers": ["Disney Interactive Studios"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/e0530df92db11d47ab915065c82e55db-98.jpg", "descriptions": "Disney?s Toontown Online is the first massively multiplayer 3D online game created for kids of all ages. Toontown is built on the principles of traditional Role Playing Games (RPGs) and Massively Multiplayer Games (MMPs). Its game play, however, has been expanded and modified to appeal toDisney?s Toontown Online is the first massively multiplayer 3D online game created for kids of all ages. Toontown is built on the principles of traditional Role Playing Games (RPGs) and Massively Multiplayer Games (MMPs). Its game play, however, has been expanded and modified to appeal to casual gamers and through several years of testing, Toontown has developed a core fan base among the gaming community. A non-violent game alternative, Toontown Online is a fun filled, ever changing online Toon world where players become Toons and join together to save the world from the evil Cogs. Toontown is under siege from an evil band of business robots called the Cogs. An unsuspecting Scrooge McDuck accidentally unleashed the money-hungry robots on the Town and they are attempting to turn the colorful world of Toontown into a black and white metropolis of skyscrapers and businesses. The player's job, as a Toon, is to help stop the Cogs and rescue the town.… Expand"}, {"name": "Mortal Kombat: Deception", "details_link": "https://www.metacritic.com/game/xbox/mortal-kombat-deception", "publisher": "Midway", "release_date": "Oct  4 2004", "developers": ["Midway"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 81, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/8f8ffbb7f97749073aeb842f2c94d902-98.jpg", "descriptions": "Mortal Kombat: Deception takes the series to the next level with multiple fatalities per character, interactive backgrounds, and new game modes. For the first time in the Mortal Kombat series, you can play a free-roaming Konquest mode, board games, and a puzzle game, in addition to theMortal Kombat: Deception takes the series to the next level with multiple fatalities per character, interactive backgrounds, and new game modes. For the first time in the Mortal Kombat series, you can play a free-roaming Konquest mode, board games, and a puzzle game, in addition to the enhanced one-on-one fighting mode. Mortal Kombat: Deception supports online play for both the PS2 and Xbox Live and features online matches and tournaments as well as online gameplay capabilities for both the board game and puzzle modes.… Expand"}, {"name": "Mario vs. Donkey Kong", "details_link": "https://www.metacritic.com/game/game-boy-advance/mario-vs-donkey-kong", "publisher": "Nintendo", "release_date": "May 24 2004", "developers": ["Nintendo"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/476f5ee2d91e93a65c7a21b7bc20cb4d-98.jpg", "descriptions": "After years of apparent goodwill, Mario and Donkey Kong are at it again--this time, on Game Boy Advance. Donkey Kong has stolen all the Mini-Mario toys from the Mario Toy Co., and now it's up to Mario to hunt down his longtime nemesis and retrieve the pilfered goods. As Mario, you must raceAfter years of apparent goodwill, Mario and Donkey Kong are at it again--this time, on Game Boy Advance. Donkey Kong has stolen all the Mini-Mario toys from the Mario Toy Co., and now it's up to Mario to hunt down his longtime nemesis and retrieve the pilfered goods. As Mario, you must race through challenging levels while finding keys and releasing Mini Marios before time runs out. Along the way, you'll master new moves that can help you overcome new puzzles.… Expand"}, {"name": "Combat Mission 3: Afrika Korps", "details_link": "https://www.metacritic.com/game/pc/combat-mission-3-afrika-korps", "publisher": "cdv Software", "release_date": "Dec  3 2003", "developers": ["Big Time Software"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Wargame", "Real-Time", "General"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/30ddfae9a576e749be31bc36b397d008-98.jpg", "descriptions": "Combat Mission: Afrika Korps (CMAK) is the latest game in the award winning Combat Mission series. Based on the same engine as Combat Mission: Barbarossa to Berlin (Wargame of the Year 2002 - Computer Gaming World and the 2002 Best Turn Based Strategy Game - PC Gamer), it introduces a numberCombat Mission: Afrika Korps (CMAK) is the latest game in the award winning Combat Mission series. Based on the same engine as Combat Mission: Barbarossa to Berlin (Wargame of the Year 2002 - Computer Gaming World and the 2002 Best Turn Based Strategy Game - PC Gamer), it introduces a number of important upgrades and changes relevant for the fighting in the North African deserts, the Italian mountains and the island of Crete, such as multi-turreted tanks, dust clouds kicked up by artillery and moving vehicles plus much more. Combat Mission: Afrika Korps is a 1-2 player, hybrid turn-based/realtime 3D simulation of WWII tactical warfare in parts of the Mediterranean Theater including North Africa, Italy, Sicily and Crete from 1940 to 1945. [Battlefront.com]… Expand"}, {"name": "EverQuest: The Planes of Power", "details_link": "https://www.metacritic.com/game/pc/everquest-the-planes-of-power", "publisher": "Sony Online Entertainment", "release_date": "Oct 28 2002", "developers": ["Sony Online Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/4f7f86fa85e0d3800e95300f5cf7060d-98.jpg", "descriptions": "Cross over to realms of ancient power, where legendary creatures guard long-hidden secrets. EverQuest: The Planes of Power will take you to places not meant for mortal eyes, reveal treasures and challenges mightier than any before, and bring you face to face with the gods themselves. PrepareCross over to realms of ancient power, where legendary creatures guard long-hidden secrets. EverQuest: The Planes of Power will take you to places not meant for mortal eyes, reveal treasures and challenges mightier than any before, and bring you face to face with the gods themselves. Prepare yourself, the Planes await! [Sony]… Expand"}, {"name": "Rails Across America", "details_link": "https://www.metacritic.com/game/pc/rails-across-america", "publisher": "Strategy First", "release_date": "Sep 18 2001", "developers": ["Flying Lab Software"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "General", "General"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/8c8f5c3f2b56d3f0f871968770b91c16-98.jpg", "descriptions": "A game of railroad empires in North America, covering the period from 1830 to the near future. It is a real-time strategy with a \"sim\" flavor. Rails allows hundreds of tracks with thousands of trains crossing the continent. Players must focus on where to expand, where to compete, and when toA game of railroad empires in North America, covering the period from 1830 to the near future. It is a real-time strategy with a \"sim\" flavor. Rails allows hundreds of tracks with thousands of trains crossing the continent. Players must focus on where to expand, where to compete, and when to call in favors from government officials, union leaders, and other powerful figures.  [Strategy First]… Expand"}, {"name": "007: The World is Not Enough", "details_link": "https://www.metacritic.com/game/nintendo-64/007-the-world-is-not-enough", "publisher": "Electronic Arts", "release_date": "Nov  1 2000", "developers": ["Eurocom Entertainment Software"], "platforms": "Nintendo 64", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/ada6dd6ddf0bffd73977243b000f480d-98.jpg", "descriptions": "Experience the intensity of being the world's top secret agent. Equipped with a full arsenal of of Q-Lab gadgets and weaponry, you must be suave, resourceful, and lethal as you carry out action-packed missions based on the blockbuster movie. Are you cool under pressure? Deadly whenExperience the intensity of being the world's top secret agent. Equipped with a full arsenal of of Q-Lab gadgets and weaponry, you must be suave, resourceful, and lethal as you carry out action-packed missions based on the blockbuster movie. Are you cool under pressure? Deadly when necessary? Of course you are -- you're Bond...James Bond.… Expand"}, {"name": "Flanker 2.0", "details_link": "https://www.metacritic.com/game/pc/flanker-20", "publisher": "SSI", "release_date": "Sep 30 1999", "developers": ["Flying Legends"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Simulation", "Flight", "Modern Jet", "Modern Jet", "Combat"], "meta_score": 81, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/6634965cc2878962e90a186a3ad50f39-98.jpg", "descriptions": "The usefulness of any combat system is a weapon. Flanker has a wide variety of air to air and air to ground missile and bomb systems which have realistic behavior and power. Using Russian satellite imagery Flanker provides photo-realistic terrain. The perfect flight dynamics, new 3D soundThe usefulness of any combat system is a weapon. Flanker has a wide variety of air to air and air to ground missile and bomb systems which have realistic behavior and power. Using Russian satellite imagery Flanker provides photo-realistic terrain. The perfect flight dynamics, new 3D sound system, and accurate damage modeling offers players a true combat experience. [Eagle Dynamics]… Expand"}, {"name": "Wasteland 2", "details_link": "https://www.metacritic.com/game/pc/wasteland-2", "publisher": "InXile Entertainment", "release_date": "Sep 18 2014", "developers": ["InXile Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["PC-style RPG", "General", "Role-Playing", "PC-style RPG", "Western-Style"], "meta_score": 81, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/44c7a66e48dfd77bd30522bbc50077ec-98.jpg", "descriptions": "Wasteland 2 is the direct sequel to the first ever post-apocalyptic computer RPG. The original Wasteland was the inspiration for the FALLOUT series of games, and the first RPG to allow players to split parties for tactical considerations, to face players with moral choices, and to make themWasteland 2 is the direct sequel to the first ever post-apocalyptic computer RPG. The original Wasteland was the inspiration for the FALLOUT series of games, and the first RPG to allow players to split parties for tactical considerations, to face players with moral choices, and to make them deal with the consequences of their actions. It was the first to provide far more than the one-key-for-one-lock style of puzzle solving. It was groundbreaking, which is why IGN named it one of the top 25 PC games of all time, Computer Gaming World named it the Adventure Game of the year in 1988, and it was short-listed for inclusion in the Smithsonian Institutions current Art of the Computer Game exhibition.\r Wasteland was set in a dangerous, post-apocalyptic world in the American Southwest. Over the course of adventures rangers would receive promotions, acquire new skills and equipment, then face new challenges with outcomes that changed depending on the strategy used to defeat them. The game featured a strong storyline which required painful decisions by players; and a storyline that allowed for maximum re-playability. Wasteland 2, with your participation and insights, will recapture all that and provide more.  It'll finally be the game worthy to be a Wasteland sequel, as challenging and rewarding as the original, with all added capacity and dazzle of games today.… Expand"}, {"name": "Muramasa: The Demon Blade", "details_link": "https://www.metacritic.com/game/wii/muramasa-the-demon-blade", "publisher": "Ignition Entertainment", "release_date": "Sep  8 2009", "developers": ["Vanillaware"], "platforms": ["PlayStation Vita", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/393f6587b9522ca0962ae1b348613e92-98.jpg", "descriptions": "Based on ancient Japanese lore, Murumasa: The Demon Blade plunges players into the mystical Genroku era, ruled by the skilled shogun Tsunayoshi Tokogawa. But this culture is threatened; Tokogawa’s thirst for power leads to a conflict over the enormously powerful, though cursed, Demon Blades.Based on ancient Japanese lore, Murumasa: The Demon Blade plunges players into the mystical Genroku era, ruled by the skilled shogun Tsunayoshi Tokogawa. But this culture is threatened; Tokogawa’s thirst for power leads to a conflict over the enormously powerful, though cursed, Demon Blades. Used in hatred, drenched in blood, the cursed blades condemn those who use them to tragedy, madness, and untimely deaths. As chaos spreads, denizens from the netherworld breach their realm as these malevolent swords summon evil spirits - and the Dragon and Demon Gods as well. Featuring hand-drawn 2D art reflecting the heritage and tone of the storyline, Muramasa: The Demon Blade transports players into a little known mythology, envisioned by the creators of the critically acclaimed Odin Sphere. Players take on the role of a male ninja or female kunoichi, utilizing their ninja prowess to traverse the clever side-scrolling levels that feature vertical progression as well as the traditional horizontal stage advancement. [XSeed Games]… Expand"}, {"name": "Anno 1800", "details_link": "https://www.metacritic.com/game/pc/anno-1800", "publisher": "Ubisoft", "release_date": "Apr 16 2019", "developers": ["Blue Byte"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/a16dacdbb54800713e4518e850d88675-98.jpg", "descriptions": "Anno 1800 – Lead the Industrial Revolution! Welcome to the dawn of the Industrial Age. The path you choose will define your world. Are you an innovator or an exploiter? A conqueror or a liberator? How the world remembers your name is up to you."}]