[{"name": "From the Abyss", "details_link": "https://www.metacritic.com/game/ds/from-the-abyss", "publisher": "Aksys Games", "release_date": "Aug 26 2008", "developers": ["Sonic Powered"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 59, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/596ad4216f06891f04d876780e6e35f9-98.jpg", "descriptions": "Those who have spent much time with action RPGs in the mold of Secret of Mana should find the gameplay in From the Abyss at least somewhat familiar. You choose from among a selection of class-based characters and venture into a world of randomized levels and real-time combat. A top-downThose who have spent much time with action RPGs in the mold of Secret of Mana should find the gameplay in From the Abyss at least somewhat familiar. You choose from among a selection of class-based characters and venture into a world of randomized levels and real-time combat. A top-down angle gives you a view of the 16-bit-era visuals, which look nice alongside some of the more elaborate spell effects. [GameSpot]… Expand"}, {"name": "NBA Live 15", "details_link": "https://www.metacritic.com/game/playstation-4/nba-live-15", "publisher": "Electronic Arts", "release_date": "Oct 28 2014", "developers": ["EA Sports"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Arcade"], "meta_score": 59, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/82aa4143d5bc8c8d0b519d297f4fc1b2-98.jpg", "descriptions": "LIVE Seasons mode is back this year with new content updated daily, all season long. New Hot Spot Challenges within BIG Moments task players with replicating game-defining moments from real-world NBA games as closely as possible, while NBA Rewind lets you replay entire contests, jumping inLIVE Seasons mode is back this year with new content updated daily, all season long. New Hot Spot Challenges within BIG Moments task players with replicating game-defining moments from real-world NBA games as closely as possible, while NBA Rewind lets you replay entire contests, jumping in and out whenever you like. Replicate (or stop) a big run from last night’s marquee match-up, hop in to take the game-winning shot, replay the entire game from tip-off to final whistle or anything in between. Content in LIVE Seasons is refreshed throughout the NBA Season. [EA Sports]… Expand"}, {"name": "Naruto Shippuden: Ultimate Ninja Impact", "details_link": "https://www.metacritic.com/game/psp/naruto-shippuden-ultimate-ninja-impact", "publisher": "Namco Bandai Games", "release_date": "Oct 18 2011", "developers": ["Racjin"], "platforms": "PSP", "num_players": "2 ", "genres": ["Action", "Fighting", "Beat-'Em-Up", "Fighting", "3D", "3D"], "meta_score": 59, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/3227e1291250496f35521961e58f44ce-98.jpg", "descriptions": "NARUTO SHIPPUDEN: Ultimate Ninja Impact lets players unleash their honed Jutsu skills through exciting single-player and multiplayer modes.  Story Battle lets fans become part of explosive NARUTO SHIPPUDEN fights straight from the anime with more events and battle sequences than ever beforeNARUTO SHIPPUDEN: Ultimate Ninja Impact lets players unleash their honed Jutsu skills through exciting single-player and multiplayer modes.  Story Battle lets fans become part of explosive NARUTO SHIPPUDEN fights straight from the anime with more events and battle sequences than ever before on the PSP.  Tag Battle lets two friends connect through Ad-hoc to team up and complete over 20 missions cooperatively, while Versus Battle lets players battle against each other with their persistent customized characters across all modes.  Over 20 characters are available to choose from across the NARUTO SHIPPUDEN universe with customization options that carry through each mode within the game.… Expand"}, {"name": "Disney's Aladdin", "details_link": "https://www.metacritic.com/game/game-boy-advance/disneys-aladdin", "publisher": "Capcom", "release_date": "Sep 28 2004", "developers": ["Disney Interactive"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 59, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/5a97296cb874207866140ce590a43033-98.jpg", "descriptions": "Based on the classic game for the SNES and Disney's animated film, Disney's Aladdin joins the Game Boy Advance library with all-new features. In this side-scrolling platform game, you'll take the role of Aladdin and his mischievous monkey, Abu, as they throw apples, climb ropes, and rideBased on the classic game for the SNES and Disney's animated film, Disney's Aladdin joins the Game Boy Advance library with all-new features. In this side-scrolling platform game, you'll take the role of Aladdin and his mischievous monkey, Abu, as they throw apples, climb ropes, and ride magic carpets to find out their destinies. Disney's Aladdin features a bonus stage for each level and a variety of environments to explore, including Jafar's castle, the Genie's lamp, and an ancient pyramid.… Expand"}, {"name": "TARTARUS", "details_link": "https://www.metacritic.com/game/pc/tartarus", "publisher": "Abyss Gameworks", "release_date": "Nov 21 2017", "developers": ["Abyss Gameworks"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 59, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/ed461b5349f7f8574b5d774a4d868839-98.jpg", "descriptions": "In the year of 2230, Mining and Research vessel Tartarus (MRS TARTARUS 220478) activates the security protocol near Neptune without any sign. The only chance for crew to survive is to reach the Bridge and restart all systems one by one before the ship crashes into Neptune. We are playing asIn the year of 2230, Mining and Research vessel Tartarus (MRS TARTARUS 220478) activates the security protocol near Neptune without any sign. The only chance for crew to survive is to reach the Bridge and restart all systems one by one before the ship crashes into Neptune. We are playing as Cooper(cook and miner of the ship) who has no education or training about electronics or pilotage; to overcome this, vessels engineer ''Andrews'' is helping us as much as he can. Though it's not as easy as it sounds...… Expand"}, {"name": "Face Noir", "details_link": "https://www.metacritic.com/game/pc/face-noir", "publisher": "Phoenix Online Publishing", "release_date": "Jul 18 2013", "developers": ["Mad Orange"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 59, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/a7b3305a9e9d3bb7191467083dd46bbe-98.jpg", "descriptions": "Black Thursday. That is how the press rechristened that October 24th, 1929, a day in which U.S. began to face the darkest years of his history: the Great Depression years. All the great values professed by this nation vanished within a couple of months, the American dream was dead and trustBlack Thursday. That is how the press rechristened that October 24th, 1929, a day in which U.S. began to face the darkest years of his history: the Great Depression years. All the great values professed by this nation vanished within a couple of months, the American dream was dead and trust in God begun to shake. Few years had been enough for people to show their real side: false, mean and, above all, open to bribery. But the one thing I would have never imagined is how far corruption had gone; so far that somebody would actually try to bribe God. And now here I am, a gun barrel pointed at me, a corpse on my conscience, and a young lady to protect. How could this ever happen? How is it possible that everything has stemmed from a series of coincidences? Do you believe in Destiny? ...I don`t. [Mad Orange]… Expand"}, {"name": "NBA Live 16", "details_link": "https://www.metacritic.com/game/playstation-4/nba-live-16", "publisher": "EA Sports", "release_date": "Sep 29 2015", "developers": ["EA Sports"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Sim"], "meta_score": 59, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/7a74767b9214b068f73bf15e5c380edf-98.jpg", "descriptions": "LIVE Pro-Am is a fast-paced way to Rise Together with your friends. Pro-Am features LIVE Run and Summer Circuit, two online multiplayer modes that let you compete on iconic indoor and outdoor courts across North America. Play 5-on-5 street ball in LIVE Run. Meet NBA greats on the courts thatLIVE Pro-Am is a fast-paced way to Rise Together with your friends. Pro-Am features LIVE Run and Summer Circuit, two online multiplayer modes that let you compete on iconic indoor and outdoor courts across North America. Play 5-on-5 street ball in LIVE Run. Meet NBA greats on the courts that made them famous in Summer Circuit. … Expand"}, {"name": "Tamagotchi Connection: Corner Shop", "details_link": "https://www.metacritic.com/game/ds/tamagotchi-connection-corner-shop", "publisher": "Bandai", "release_date": "Jan 31 2006", "developers": ["NanaOn-Sha"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Strategy", "Breeding/Constructing", "General", "Breeding/Constructing", "Virtual", "Career"], "meta_score": 59, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/175f670aef2bd42d2bcfc9717dfb8275-98.jpg", "descriptions": "Join your Tamagotchi friends as they open their first shop. Keep your customers happy and watch your business grow. Partner with your favorite Tamagotchi character. Choose your shop type and open for business. Clean teeth, do laundry, perform music and more for your customers. Swap itemsJoin your Tamagotchi friends as they open their first shop. Keep your customers happy and watch your business grow. Partner with your favorite Tamagotchi character. Choose your shop type and open for business. Clean teeth, do laundry, perform music and more for your customers. Swap items with your friends wirelessly. Unlock secret codes for your Tamagotchi Connection virtual pet! [Bandai]… Expand"}, {"name": "Rain World", "details_link": "https://www.metacritic.com/game/playstation-4/rain-world", "publisher": "Adult Swim", "release_date": "Mar 28 2017", "developers": ["Videocult", "Warp Digital Entertainment"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 59, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/28acab816beb32009af27098b72b9a11-98.jpg", "descriptions": "Assume the role of a nomadic slugcat, both predator and prey in a broken ecosystem. Grab your spear and brave the industrial wastes, hunting enough food to survive, but be wary— other, bigger creatures have the same plan... and slugcats look delicious."}, {"name": "Harvest Moon: Skytree Village", "details_link": "https://www.metacritic.com/game/3ds/harvest-moon-skytree-village", "publisher": "Natsume", "release_date": "Nov  8 2016", "developers": ["Natsume"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["General", "Strategy", "Management", "Business / Tycoon"], "meta_score": 59, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/5874b826a84d5376ed3ab59c68cbf012-98.jpg", "descriptions": "Revive the Land, Save a Village. Many people used to live in Skytree Village, and the land was lush and green. However, the power of the Harvest Goddess gradually began to wane, and the land became parched and dry. It's up to you revive the seven Skytrees to bring life back to this desolateRevive the Land, Save a Village. Many people used to live in Skytree Village, and the land was lush and green. However, the power of the Harvest Goddess gradually began to wane, and the land became parched and dry. It's up to you revive the seven Skytrees to bring life back to this desolate land. With user-friendly tutorials, you will immediately be able to jump into the thick of things, customizing your farm by raising and lowering the land, creating rivers, ponds, and more. Upgraded tools will assist you shaping the land more efficiently, and afterwards you can kick back and relax in your boat to do a spot of fishing. Play as a boy or a girl, woo bachelors and bachelorettes, and start a family.… Expand"}, {"name": "Damascus Gear: Operation Tokyo", "details_link": "https://www.metacritic.com/game/playstation-vita/damascus-gear-operation-tokyo", "publisher": "Arc System Works", "release_date": "Mar 24 2015", "developers": ["Arc System Works"], "platforms": ["Switch", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 59, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/f5fe659917d92d2c0653c9ab3a93860e-98.jpg", "descriptions": "As one of the members of FREYA, the robot-fightin’-est outfit on the planet, you’ll use your GEAR (good robot) to beat the ever-loving snot out of the RAGE (bad robots, anagram of “GEAR”). And these mechanics just wouldn’t be RPG-inspired if they didn’t involve picking parts off the metallicAs one of the members of FREYA, the robot-fightin’-est outfit on the planet, you’ll use your GEAR (good robot) to beat the ever-loving snot out of the RAGE (bad robots, anagram of “GEAR”). And these mechanics just wouldn’t be RPG-inspired if they didn’t involve picking parts off the metallic corpses of your defeated foes and bolting them onto your own rattling, death-dealing hulk of steel. So naturally you can do that too.… Expand"}, {"name": "Eragon", "details_link": "https://www.metacritic.com/game/psp/eragon", "publisher": "Sierra Entertainment", "release_date": "Nov 14 2006", "developers": ["Amaze Entertainment", "Vivendi Games"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PSP"], "num_players": "1-4 ", "genres": ["Action", "Role-Playing", "Action Adventure", "Shooter", "General", "Fantasy", "Beat-'Em-Up", "Japanese-Style", "Third-Person", "3D", "Fantasy"], "meta_score": 59, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/6674c747fb63b3edc9fce4af7e46d699-98.jpg", "descriptions": "Play as Eragon and his dragon as they set out to fulfill their destiny. Endure perilous travels, adventure and heart-pounding combat as you live the epic events of the movie. Disable and dispatch enemies with the unparalleled skills of a true Dragon Ride. Eragon's combat system features aPlay as Eragon and his dragon as they set out to fulfill their destiny. Endure perilous travels, adventure and heart-pounding combat as you live the epic events of the movie. Disable and dispatch enemies with the unparalleled skills of a true Dragon Ride. Eragon's combat system features a variety of blistering attacks and defences, including a unique degradable block system. Extensive Dragon Combat – Ride Saphira and blast your enemies with bursts of fire, and call in devastating dragon attacks during melee battles. Eragon features multiplayer co-op with team attack bonuses and dragon fight/flight combo gameplay. Full cooperation from the film production team provides faithful implementation of the movie's look-and-feel. As Eragon discovers the powers hidden within him he learns to unleash magical attacks to decimate his foes. [Vivendi Games]… Expand"}, {"name": "Postal 2: Share the Pain", "details_link": "https://www.metacritic.com/game/pc/postal-2-share-the-pain", "publisher": "Running With Scissors", "release_date": "Dec 17 2003", "developers": ["Running With Scissors"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 59, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/b68b8448a6f6b9375494fa585b247eff-98.jpg", "descriptions": "POSTAL 2: Share The Pain combines the complete, enhanced POSTAL 2 single player game with the brand new multiplayer Share The Pain gameplay! Explore full 3-D open ended environments. Interact with over 100 unique NPC's including Gary Coleman, marching bands, dogs, cats and elephants,POSTAL 2: Share The Pain combines the complete, enhanced POSTAL 2 single player game with the brand new multiplayer Share The Pain gameplay! Explore full 3-D open ended environments. Interact with over 100 unique NPC's including Gary Coleman, marching bands, dogs, cats and elephants, protesters, policemen and civilians, with or without weapons. POSTAL 2 is all about choice; experiment with everyone and everything. Also includes 14 multiplayer levels: SNATCH: Fight for the fabulous Postal Babes! Snatch the enemy babe and score! GRAB: Battle to collect all 10 bags, each bag makes you stronger! DEATHMATCH: Chose from 25 characters including Gary Coleman and Osama. TEAM DEATHMATCH: 19 insane teams including Team Taliban and The Gimps. [Running With Scissors]… Expand"}, {"name": "Playboy: The Mansion", "details_link": "https://www.metacritic.com/game/pc/playboy-the-mansion", "publisher": "Arush Entertainment", "release_date": "Jan 25 2005", "developers": ["Cyberlore Studios"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 59, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/1/17f4b01dd2ac561ad71df99fb20ffdaa-98.jpg", "descriptions": "Now you can be Heff!  Playboy: The Mansion blends state-of-the-art social simulation with traditional role-playing and empire-building gameplay. As Hugh Hefner, you build the Playboy mansion and magazine into a dynamic cultural icon and powerful brand. Rub shoulders with stunning women andNow you can be Heff!  Playboy: The Mansion blends state-of-the-art social simulation with traditional role-playing and empire-building gameplay. As Hugh Hefner, you build the Playboy mansion and magazine into a dynamic cultural icon and powerful brand. Rub shoulders with stunning women and stimulating celebrities as you pursue the ultimate Playboy lifestyle. Grow famous and gain exclusive access to the Playboy Archives, including footage of the world-famous Playboy Mansion. This is the ultimate lifestyle game, allowing the gamer to \"Play Hef\" and live the good life.  The player is in charge of running the Playboy Empire and must put out a magazine each month. In order to generate content for the magazine, the Virtual Hef will throw incredible parties with celebrities and rockstars in tow.  The social management of the parties will enable the player to acquire content for the magazine, including the unique, sexy Photo Shoot feature which the gamer will use to get his or her cover shot.  With a broad depth of gameplay, and a simulation experience of the ultimate lifestyle, PTM lets a gamer Play Hef, build the dream and live the good life. [ARUSH]… Expand"}, {"name": "A Knight's Quest", "details_link": "https://www.metacritic.com/game/switch/a-knights-quest", "publisher": "Curve Digital", "release_date": "Oct 10 2019", "developers": ["Sky9"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 59, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/8/ea87e50ce73bf70533a9c1e17a6637da-98.jpg", "descriptions": "A gorgeous action adventure on an epic scale. Play as Rusty, a clumsy adventurer who accidentally sets about the end of the world. Solve mind-bending puzzles, fight challenging enemies, defeat huge bosses and platform your way through a fantastic open world."}, {"name": "Dynasty Warriors: Strikeforce", "details_link": "https://www.metacritic.com/game/xbox-360/dynasty-warriors-strikeforce", "publisher": "Koei", "release_date": "Feb 16 2010", "developers": ["Omega Force"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 59, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/0727f23b2a5c6b0eaab8a8832dff7c91-98.jpg", "descriptions": "Infiltrate enemy strongholds with three of your friends in Dynasty Warriors: Strikeforce."}, {"name": "Big Mutha Truckers", "details_link": "https://www.metacritic.com/game/xbox/big-mutha-truckers", "publisher": "Empire Interactive", "release_date": "Jun 20 2003", "developers": ["Eutechnyx"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Driving", "Racing", "Truck"], "meta_score": 59, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/9/167fac054100ec0c7bc412ffc771fc50-98.jpg", "descriptions": "It's a redneck family fight to see who inherits the family trucking business.  As one of four zany characters in Big Mutha Truckers including Bobbie-Sue, Cletus, Earl, and Rawkus, you have 60 days to earn the most money by hauling cargo.  Drive various massive 18-wheelers around five citiesIt's a redneck family fight to see who inherits the family trucking business.  As one of four zany characters in Big Mutha Truckers including Bobbie-Sue, Cletus, Earl, and Rawkus, you have 60 days to earn the most money by hauling cargo.  Drive various massive 18-wheelers around five cities as you battle bikers, avoid truck-jackers, outrun the corrupt police force, and discover new routes and bonuses.  The race to the finish is full of obstacles--don't let anything get in your way.… Expand"}, {"name": "Sega Rally Championship", "details_link": "https://www.metacritic.com/game/game-boy-advance/sega-rally-championship", "publisher": "Sega", "release_date": "Mar 10 2003", "developers": ["Sega"], "platforms": "Game Boy Advance", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/7294bfb6666ad9ef70358dcab3619582-98.jpg", "descriptions": "It takes a driver with nerves of steel to take a high-powered racecar on the open road. Brave snowdrifts on ice-covered mountains, catch air off huge sand dunes in the desert, or careen around corners in the European countryside. Intensify the action by linking with 3 friends and goingIt takes a driver with nerves of steel to take a high-powered racecar on the open road. Brave snowdrifts on ice-covered mountains, catch air off huge sand dunes in the desert, or careen around corners in the European countryside. Intensify the action by linking with 3 friends and going head-to-head in a 4-player race to the finish.… Expand"}, {"name": "Cabela's Big Game Hunter", "details_link": "https://www.metacritic.com/game/playstation-2/cabelas-big-game-hunter", "publisher": "Activision", "release_date": "Nov 26 2002", "developers": ["Sand Grain Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Sports", "Nature", "Hunting"], "meta_score": 59, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/4782c68869cd87b192e0c40f0abaff79-98.jpg", "descriptions": "Choose from a variety of different hunters and an array of firearm, clothing, gear and equipment options. Explore numerous rugged, wild hunting terrains and use the detailed on-screen map to stay informed of the location of your vehicle, campsite, lodge and prime hunting spots. An in-gameChoose from a variety of different hunters and an array of firearm, clothing, gear and equipment options. Explore numerous rugged, wild hunting terrains and use the detailed on-screen map to stay informed of the location of your vehicle, campsite, lodge and prime hunting spots. An in-game guide offers tips and advice, and keeps you hot-on-the-trail of trophy game. A health meter lets you know when inclement weather, lack of food and water or run-ins with dangerous animals are taking their toll. The Trophy Beacon and X-Ray option gives novice hunters the necessary information for a quick, clean kill and aids in downed-game recovery. [Cabela's]… Expand"}, {"name": "The Lord of the Rings: The Fellowship of the Ring", "details_link": "https://www.metacritic.com/game/playstation-2/the-lord-of-the-rings-the-fellowship-of-the-ring", "publisher": "Black Label Games", "release_date": "Oct 16 2002", "developers": ["Surreal Software"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 59, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/aeb4988341cf63770fabb4e7eeeb64a0-98.jpg", "descriptions": "Undertake a fantastic journey following the same path as the Fellowship in the book. Play as either Frodo, Aragorn, or Gandalf the Grey. As you take the fabled One Ring closer to its fate, you will explore the most dangerous wilds of Middle-earth from the Shire to the very edge of Mordor.Undertake a fantastic journey following the same path as the Fellowship in the book. Play as either Frodo, Aragorn, or Gandalf the Grey. As you take the fabled One Ring closer to its fate, you will explore the most dangerous wilds of Middle-earth from the Shire to the very edge of Mordor. [Universal Interactive]… Expand"}, {"name": "Maximum Capacity: Hotel Giant", "details_link": "https://www.metacritic.com/game/pc/maximum-capacity-hotel-giant", "publisher": "JoWooD Entertainment AG", "release_date": "Jun 24 2002", "developers": ["JoWooD Entertainment AG"], "platforms": "PC", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 59, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/321db8308ad65806fa73456e36f75022-98.jpg", "descriptions": "From a small, family-owned bed and breakfast to a large, secluded mega-hotel for the stars: hotels come in all shape and styles. Be at the forefront of the tourism industry, owning and running a hotel. Starting out small with a hotel for business travelers, players are challenged to build aFrom a small, family-owned bed and breakfast to a large, secluded mega-hotel for the stars: hotels come in all shape and styles. Be at the forefront of the tourism industry, owning and running a hotel. Starting out small with a hotel for business travelers, players are challenged to build a successful business, overcoming all obstacles that the world of business management can throw at them. With over 26 different complexes to choose from, players are able to create a tailor-made hotel that exactly meets their dreams and the needs of the virtual guests. [JoWood Productions]… Expand"}, {"name": "Dark Planet: Battle for Natrolis", "details_link": "https://www.metacritic.com/game/pc/dark-planet-battle-for-natrolis", "publisher": "Ubisoft", "release_date": "Mar 20 2002", "developers": ["Creative Edge Software"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 59, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/04d76115a2e0b6042f58fccbd5663f79-98.jpg", "descriptions": "For eons, the planet Natrolis was controlled by the magic of the reptilian Sorin race. But when a fleet of tech-powered humans arrives to colonize the surface, they awaken the unimaginable: the Dreil, a hyper evolved insectoid warrior race hibernating deep within the planet's core. Now, allFor eons, the planet Natrolis was controlled by the magic of the reptilian Sorin race. But when a fleet of tech-powered humans arrives to colonize the surface, they awaken the unimaginable: the Dreil, a hyper evolved insectoid warrior race hibernating deep within the planet's core. Now, all three forces collide in a mortal struggle for domination. [Ubi Soft]… Expand"}, {"name": "Conflict Zone", "details_link": "https://www.metacritic.com/game/pc/conflict-zone", "publisher": "Ubisoft", "release_date": "Oct 31 2001", "developers": ["MASA Group"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 59, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/77a1c3ec374195c9aa9b780214fcdbf0-98.jpg", "descriptions": "It's early 21st century and the majority of the world's countries have created the International Corps for Peace, an organisation dedicated to  bringing about world peace. However, not all countries are keen to be  involved and these persist in generating conflicts through the  organisationIt's early 21st century and the majority of the world's countries have created the International Corps for Peace, an organisation dedicated to  bringing about world peace. However, not all countries are keen to be  involved and these persist in generating conflicts through the  organisation GHOST. A secret organisation, which warrants only the  economic interests of its members without any attachment to morals,  GHOST, does not hesitate to create crisis situations with the goal of  destabilising the world-wide equilibrium and endanger any chance of  peace?[Ubi Soft]… Expand"}, {"name": "Matchpoint: Tennis Championships", "details_link": "https://www.metacritic.com/game/xbox-series-x/matchpoint-tennis-championships", "publisher": "Kalypso", "release_date": "Jul  7 2022", "developers": ["Torus Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "2 ", "genres": ["Sports", "Individual", "Tennis"], "meta_score": 59, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/0/4b264f425897529c7d38b292b430f673-98.jpg", "descriptions": "The season starts now – grab your racket and become the world’s next tennis champion. Your opponent is on the court and the crowd waits for a promising challenger for the grand finale…  Are you ready for Matchpoint? Matchpoint – Tennis Championships is a modern take on tennis, featuring aThe season starts now – grab your racket and become the world’s next tennis champion. Your opponent is on the court and the crowd waits for a promising challenger for the grand finale…  Are you ready for Matchpoint? Matchpoint – Tennis Championships is a modern take on tennis, featuring a true-to-life on-court experience supported by a deep career mode and unique rivalry system. The game places a strong focus on tactical realism, positioning and aiming, allowing the player to move their superstar in exactly the right way to get the most out of their shots. Matchpoint – Tennis Championships combines slick character animations, authentic ball physics and enhanced player control to replicate the realistic rhythm of the game - every swing and hit feeling unique and satisfying.\r… Expand"}, {"name": "Blacksad: Under the Skin", "details_link": "https://www.metacritic.com/game/playstation-4/blacksad-under-the-skin", "publisher": "Microids", "release_date": "Dec 10 2019", "developers": ["Pendulo Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 59, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/0c029c8deba30149acf10b5adf53c710-98.jpg", "descriptions": "A dark corruption scandal in the heart of the New York City's underworld for charismatic detective John Blacksad!The 50s, New York City: Joe Dunn, owner of a boxing club, is found dead. Meanwhile, rising star Bobby Yale, due to take to the ring for the most important fight of his career,A dark corruption scandal in the heart of the New York City's underworld for charismatic detective John Blacksad!The 50s, New York City: Joe Dunn, owner of a boxing club, is found dead. Meanwhile, rising star Bobby Yale, due to take to the ring for the most important fight of his career, has mysteriously disappeared. Sonia Dunn, Joe's daughter, takes over the gym and must deal with its financial woes. She hires private detective John Blacksad to investigate Yale's disappearance. This sinister case will take our investigator to the darkest, most dismal depths of New York.With its anthropomorphic characters and its incredible 1950s feel, BLACKSAD: Under the Skin promises all the eerily dark adventure of a detective novel, just like the eponymous comic book series.Conduct the investigation in your own way. Make use of your feline senses as you hunt for new clues. Make decisions on behalf of Blacksad and influence the outcome of the case.… Expand"}, {"name": "LEGO Worlds", "details_link": "https://www.metacritic.com/game/switch/lego-worlds", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep  5 2017", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 59, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/fc1059c588e45f85170a0e654ca98df0-98.jpg", "descriptions": "LEGO Worlds is an open environment of procedurally-generated Worlds made entirely of LEGO bricks which you can freely manipulate and dynamically populate with LEGO models. Create anything you can imagine one brick at a time, or use large-scale landscaping tools to create vast mountain rangesLEGO Worlds is an open environment of procedurally-generated Worlds made entirely of LEGO bricks which you can freely manipulate and dynamically populate with LEGO models. Create anything you can imagine one brick at a time, or use large-scale landscaping tools to create vast mountain ranges and dot your world with tropical islands. Drop in prefabricated structures to build and customize any world to your liking. Explore using helicopters, dragons, motorbikes or even gorillas and unlock treasures that enhance your gameplay. Watch your creations come to life through characters and creatures that interact with you and each other in unexpected ways. In LEGO Worlds, anything is possible!… Expand"}, {"name": "Tetris Ultimate", "details_link": "https://www.metacritic.com/game/xbox-one/tetris-ultimate", "publisher": "Ubisoft", "release_date": "Dec 16 2014", "developers": ["Ubisoft", "Ubisoft San Francisco"], "platforms": ["3DS", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One"], "genres": ["Miscellaneous", "Puzzle", "Stacking"], "meta_score": 59, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/3/7989a37a1c5536efe640cf73981e0c1d-98.jpg", "descriptions": "The world’s most-loved puzzle game arrives on next-gen consoles, and is better than ever in Tetris® Ultimate. With six exciting modes, fun new features, and unique visuals, the evolution of this iconic game is the ultimate must-have on next-gen consoles."}, {"name": "Squeeballs Party", "details_link": "https://www.metacritic.com/game/wii/squeeballs-party", "publisher": "Performance Designed Products", "release_date": "Oct 12 2009", "developers": ["Performance Designed Products"], "platforms": ["iPhone/iPad", "Wii"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Party", "Party / Minigame", "General"], "meta_score": 59, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/60216f0461a05b4b199e5ffd4936a58b-98.jpg", "descriptions": "Squeeballs are small creatures manufactured on a secret island somewhere in the Pacific Ocean. Before they can be sold to children as toys around the world, Squeeballs must be fully tested…to the point of destruction. That's where the player comes in. They blow up, slice, smack, punch, bowl,Squeeballs are small creatures manufactured on a secret island somewhere in the Pacific Ocean. Before they can be sold to children as toys around the world, Squeeballs must be fully tested…to the point of destruction. That's where the player comes in. They blow up, slice, smack, punch, bowl, shoot and skim the Squeeballs through 11 main game challenges. [PDP]… Expand"}, {"name": "Alter Ego (2010)", "details_link": "https://www.metacritic.com/game/pc/alter-ego-2010", "publisher": "bitComposer Games", "release_date": "Aug  3 2010", "developers": ["Viva Media", "Viva Media", "LLC"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "Horror", "Horror", "Survival", "Point-and-Click"], "meta_score": 59, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/3b14e1a2556036723664af41c988914f-98.jpg", "descriptions": "In the town of Plymouth the body of recently buried Sir William disappears under strange circumstances. This peculiar news would not stir such tremendous public interest if it was not Sir William himself. He was investigated several times during his life and although the police never managedIn the town of Plymouth the body of recently buried Sir William disappears under strange circumstances. This peculiar news would not stir such tremendous public interest if it was not Sir William himself. He was investigated several times during his life and although the police never managed to press charges against him, scary legends about his bloody crimes live on among the town people. There were only a few left who were willing to serve him and were brave enough to stand the look at his lifeless face. And most of them run away in horror after his death and series of murders that followed it. Police are helpless and not able to move forward with the case. The town is thrown into a state of panic and fear.… Expand"}, {"name": "Mega Man Star Force 3: Red Joker", "details_link": "https://www.metacritic.com/game/ds/mega-man-star-force-3-red-joker", "publisher": "Capcom", "release_date": "Jun 30 2009", "developers": ["Capcom"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 59, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/bb03039e868668d07e2513c0749b2ff4-98.jpg", "descriptions": "As in the previous games, Mega Man Star Force 3 is a unique blend of an action and role-playing game (RPG), combining the high intensity combat that is the hallmark of Mega Man® games with Star Force’s strategic battle system. By defeating enemies and boss characters, players earn battleAs in the previous games, Mega Man Star Force 3 is a unique blend of an action and role-playing game (RPG), combining the high intensity combat that is the hallmark of Mega Man® games with Star Force’s strategic battle system. By defeating enemies and boss characters, players earn battle cards that enhance and evolve Mega Man’s abilities and attacks. New to Mega Man Star Force 3 are Noise Changes, random enhancements that change Mega Man’s form and unlock new abilities. The two versions of the game, Black Ace and Red Joker, each have over 100 unique Noise Types that can be combined with Mega Man to unlock elemental powers based on earth, air, water and fire. The new Noise feature will add an exciting randomness to battles, encouraging players to explore, collect and battle across the digital world of Mega Man Star Force 3. In Mega Man Star Force 3, players travel between the physical world and the digital world via electromagnetic waves that form wave roads. Geo Stelar, the protagonist of the game, can see these wave roads by using his unique visualizer tool. Once in the digital world, Geo can merge with the electronic life-form known as Omega-Xis to become Mega Man. The wave roads are being overrun by mysterious noise that change the player’s environment and powers in different ways. This noise is being generated by an approaching gigantic meteor that threatens both the physical and digital worlds of Mega Man Star Force 3, forcing Geo Stellar and his crew to fight the oncoming threat to save two worlds. Fortunately, Mega Man discovers that he can control the Noise, using the new Noise Change system to transform into many different forms, including the ultimate Black Ace or Red Joker forms. [Capcom]… Expand"}, {"name": "Open Season", "details_link": "https://www.metacritic.com/game/xbox-360/open-season", "publisher": "Ubisoft", "release_date": "Sep 19 2006", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 59, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/d4e781ab3a4abe5db2ffb78f2e248f03-98.jpg", "descriptions": "Team up with a cast of crazy critters, unleashing your animal instincts in Open Season, the game – a riotous romp in the great outdoors in which a rowdy brood of forest animals turns the tables on a bunch of unsuspecting hunters.  When a domesticated grizzly named Boog gets lured intoTeam up with a cast of crazy critters, unleashing your animal instincts in Open Season, the game – a riotous romp in the great outdoors in which a rowdy brood of forest animals turns the tables on a bunch of unsuspecting hunters.  When a domesticated grizzly named Boog gets lured into leaving the creature comforts of home by a fast-talking mule deer named Elliott, he finds himself lost in the woods just three days before hunting season begins. Forced to \"rough it\" in the great outdoors, Boog goes native, rallying all the forest animals to take back their home and send the hunters packing. Interact with Beth, Shaw, and all your animal favorites from the Open Season film. Throw skunk bombs, hurl rabbits, use acorn-firing squirrels, and pull outrageous woodland pranks to scare the pants off the hunters. Roll in a giant snowball, ride the rapids on a floating outhouse, zip through tunnels in a crazy mine cart ride, and take on more madcap adventures as Boog discovers how to go from \"Mild\" to \"Wild\". Challenge your friends or team up together in 4-player mini-games. [Ubisoft]… Expand"}, {"name": "GRIP: Combat Racing", "details_link": "https://www.metacritic.com/game/switch/grip-combat-racing", "publisher": "Wired Productions", "release_date": "Nov  6 2018", "developers": ["Caged Element Inc."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 10 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 59, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/4a384f9e199eed99cc113e9691d96fe3-98.jpg", "descriptions": "GRIP is a high octane, hardcore combat racer, packing ferocious speed and armed to the teeth with heavy weapons. Harnessing gravity defying physics alongside a bristling arsenal of outlandish weapons, GRIP delivers the fastest, most competitive racing experience ever. Scale walls, ceilingsGRIP is a high octane, hardcore combat racer, packing ferocious speed and armed to the teeth with heavy weapons. Harnessing gravity defying physics alongside a bristling arsenal of outlandish weapons, GRIP delivers the fastest, most competitive racing experience ever. Scale walls, ceilings and anything else you can get your tyres on to... as you master tantalising tracks, tricks and perform mind-blowing stunts to race your way across the cosmos. … Expand"}, {"name": "DreamWorks How to Train Your Dragon", "details_link": "https://www.metacritic.com/game/wii/dreamworks-how-to-train-your-dragon", "publisher": "Activision", "release_date": "Mar 23 2010", "developers": ["Etranges Libellules"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 59, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/22c909d3092d7ee8f1bdbf4d10d3cfa2-98.jpg", "descriptions": "How to Train Your Dragon video game launches gamers into a third-person action-adventure as a Viking hero where they must embark upon an epic quest to become the ultimate dragon trainer. Gamers can play as characters “Hiccup” or Astrid” on the vast Island of Berk, which features expandedHow to Train Your Dragon video game launches gamers into a third-person action-adventure as a Viking hero where they must embark upon an epic quest to become the ultimate dragon trainer. Gamers can play as characters “Hiccup” or Astrid” on the vast Island of Berk, which features expanded locales from the film including Vikings’ Village, Wild Zone, Training Zone and Fight Arena. In this truly larger-than-life adventure, players will train dragons, explore environments and battle in prestigious dragon tournaments as they battle for Viking victory. Plus, gamers can become the Dragon hero of their living room as they square-off with friends and family in endless head-to-head multi-player combat. [Activision]… Expand"}, {"name": "Watchmen: The End Is Nigh Complete Experience", "details_link": "https://www.metacritic.com/game/playstation-3/watchmen-the-end-is-nigh-complete-experience", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jul 21 2009", "developers": ["Deadline Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 59, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/7e818083181168a097e06c8544645005-98.jpg", "descriptions": "Watchmen: The Complete Experience includes the Director's Cut Blu-Ray version of the Watchmen film in addition to the two Watchmen game episodes which further explore the origins of Rorschach and Nite Owl. Watchmen: The End is Nigh Part 1 follows Rorschach and Nite Owl as they track down theWatchmen: The Complete Experience includes the Director's Cut Blu-Ray version of the Watchmen film in addition to the two Watchmen game episodes which further explore the origins of Rorschach and Nite Owl. Watchmen: The End is Nigh Part 1 follows Rorschach and Nite Owl as they track down the evil Underboss, who has broken out of prison and set his violent thugs loose in New York City. The city needs saviours and only masked vigilantes will answer the call. Watchmen: The End is Nigh Part 2 delves further into the partnership of Rorschach and Nite Owl before the hero-banning Keene Act. In Part 2, Rorschach contacts Nite Owl to get his help in solving the case of a missing girl, Violet Greene. Along the way Rorschach uncovers that a woman from his past is involved with the disappearance, leading to a conflict of interest between the partners.… Expand"}, {"name": "Green Lantern: Rise of the Manhunters", "details_link": "https://www.metacritic.com/game/xbox-360/green-lantern-rise-of-the-manhunters", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun  7 2011", "developers": ["Double Helix Games"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 59, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/d31061af1916f05d39bd759b9aec509d-98.jpg", "descriptions": "Green Lantern: Rise of the Manhunters is inspired by the feature film, which brings the enduringly popular DC Comics super hero to the big screen for the first time and which stars Ryan Reynolds in the title role as Hal Jordan, the newest member of the Green Lantern Corps.  In the videogameGreen Lantern: Rise of the Manhunters is inspired by the feature film, which brings the enduringly popular DC Comics super hero to the big screen for the first time and which stars Ryan Reynolds in the title role as Hal Jordan, the newest member of the Green Lantern Corps.  In the videogame players will utilize over a dozen constructs and take flight across the deepest parts of the Universe to restore intergalactic order by wielding the ultimate weapon: the Green Lantern power ring.… Expand"}, {"name": "One Punch Man: A Hero Nobody Knows", "details_link": "https://www.metacritic.com/game/xbox-one/one-punch-man-a-hero-nobody-knows", "publisher": "Bandai Namco Games", "release_date": "Feb 28 2020", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 59, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/7/b86432d3830ba21704420f0a928b32c5-98.jpg", "descriptions": "Experience the world of ONE-PUNCH MAN for yourself in “ONE PUNCH MAN: A HERO NOBODY KNOWS”. Form a team of your favorite heroes and villains.\rGrow your techniques and see who reigns supreme in this ONE-PUNCH MAN game."}, {"name": "Bionicle Heroes", "details_link": "https://www.metacritic.com/game/xbox-360/bionicle-heroes", "publisher": "Eidos Interactive", "release_date": "Nov 15 2006", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Sci-Fi", "Sci-Fi", "General", "Shooter", "First-Person", "Third-Person", "Arcade"], "meta_score": 59, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/5651d3ef2ae9f6507fa21d6060c601db-98.jpg", "descriptions": "Bionicle Heroes brings to life the most powerful and exciting LEGO characters ever seen in one game, in an action-packed world of adventure and discovery. Take control of a young hero as he steps out of the real world and into the strange and dangerous universe of Bionicle. Only by masteringBionicle Heroes brings to life the most powerful and exciting LEGO characters ever seen in one game, in an action-packed world of adventure and discovery. Take control of a young hero as he steps out of the real world and into the strange and dangerous universe of Bionicle. Only by mastering the powers and special abilities of the greatest Bionicle heroes will he be able to overcome the many challenges ahead. [Eidos Interactive]… Expand"}, {"name": "Coded Arms", "details_link": "https://www.metacritic.com/game/psp/coded-arms", "publisher": "Konami", "release_date": "Jul  6 2005", "developers": ["Konami"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Action", "Adventure", "Shooter", "3D", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 59, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/fcb2525026c1128d0193a62494b8cb19-98.jpg", "descriptions": "Konami's first entry into the FPS genre, Coded Arms takes place in an abandoned virtual reality system and its portal site inside a giant computer network. The VR system was originally created as a combat training simulator in the event of an alien invasion. However, during the developmentKonami's first entry into the FPS genre, Coded Arms takes place in an abandoned virtual reality system and its portal site inside a giant computer network. The VR system was originally created as a combat training simulator in the event of an alien invasion. However, during the development of the simulation program, a major flaw was discovered and development was cancelled and left abandoned. During this time when the program was not monitored, it kept evolving within the computer network and eventually turned into a vast and brutal VR world populated with virtual alien invaders, dangerous computer bugs and the VR system’s own security bots. Players assume the role of a computer hacker who infiltrates the abandoned virtual reality system. Gamers use up to 30 weapons and power-ups that they discover while exploring the expansive single player mode. Coded Arms utilizes the PSP handheld system's wireless capabilities for multiplayer action for up to four people. [Konami]… Expand"}, {"name": "Killzone HD", "details_link": "https://www.metacritic.com/game/playstation-3/killzone-hd", "publisher": "SCEA", "release_date": "Oct 23 2012", "developers": ["Guerrilla", "Supermassive Games"], "platforms": "PlayStation 3", "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 59, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/e62986146f0f384b232fd4892626cdc8-98.jpg", "descriptions": "Killzone HD is a first-person shooter in which players assume the role of elite soldiers defending a colonial planet that has fallen under siege."}, {"name": "Super Monkey Ball: Step & Roll", "details_link": "https://www.metacritic.com/game/wii/super-monkey-ball-step-roll", "publisher": "Sega", "release_date": "Feb  9 2010", "developers": ["Sega"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 59, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/3a1f3ee64efbc2fbf0e01569e9a4acdd-98.jpg", "descriptions": "The loveable characters from the original Super Monkey Ball, AiAi, MeeMee, GonGon and Baby, are back with all new mind-blowing puzzles and party games specifically designed to fully utilize the Wii Balance Board and the Wii Remote and Nunchuk. Super Monkey Ball Step & Roll adds a dynamicThe loveable characters from the original Super Monkey Ball, AiAi, MeeMee, GonGon and Baby, are back with all new mind-blowing puzzles and party games specifically designed to fully utilize the Wii Balance Board and the Wii Remote and Nunchuk. Super Monkey Ball Step & Roll adds a dynamic level of interactive gameplay with the use of the Wii Balance Board while still remaining true to the original franchise with zany level design. Gamers will physically feel what it would be like to roll around in a Monkey Ball and have tons of fun doing it. Known for its challenging levels and most recently its innovative ways to control AiAi and his friends (Wii versions); gamers are immersed into the Monkey Ball world like never thought possible before. This newest installment of the popular series offers new single-player puzzle levels and multiple new Party Games giving players more variety of gameplay than ever. Super Monkey Ball Step & Roll's myriad of game modes is sure to inspire friendly living room competition between family and friends. [Sega]… Expand"}, {"name": "The Hobbit", "details_link": "https://www.metacritic.com/game/playstation-2/the-hobbit", "publisher": "Sierra Entertainment", "release_date": "Nov 11 2003", "developers": ["Inevitable Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 59, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/3249bc38ea58f06b912ebad7d7b185ce-98.jpg", "descriptions": "Set in the mythical world of Middle-earth, The Hobbit is an action adventure game in which the player assumes the role of Bilbo Baggins. Control Bilbo from his peaceful Hobbit hole in Hobbiton into the dark and harrowing Mirkwood forest and finally to the Lonely Mountain, in which lies SmaugSet in the mythical world of Middle-earth, The Hobbit is an action adventure game in which the player assumes the role of Bilbo Baggins. Control Bilbo from his peaceful Hobbit hole in Hobbiton into the dark and harrowing Mirkwood forest and finally to the Lonely Mountain, in which lies Smaug the dragon. Sent on a journey by Gandalf the wizard along with Thorin the dwarf and his stout and sturdy cohorts, Bilbo will acquire items, knowledge, and in the case of a Hobbit, courage to help him complete the quest as he comes face to face with elves, trolls, orcs, spiders, wolves, and more. [Sierra]… Expand"}, {"name": "Bright Memory: Infinite", "details_link": "https://www.metacritic.com/game/switch/bright-memory-infinite", "publisher": "Playism", "release_date": "Jul 21 2022", "developers": ["FYQD-Studio"], "platforms": ["PC", "PlayStation 5", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 59, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/74c79ed9ad1effb60ed322b2302ff81e-98.jpg", "descriptions": "A lightning-fast fusion of the FPS and action genres.\r Bright Memory: Infinite is set in a sprawling, futuristic metropolis in the year 2036. A strange phenomenon for which scientists can find no explanation has occurred in the skies around the world. The Supernatural Science ResearchA lightning-fast fusion of the FPS and action genres.\r Bright Memory: Infinite is set in a sprawling, futuristic metropolis in the year 2036. A strange phenomenon for which scientists can find no explanation has occurred in the skies around the world. The Supernatural Science Research Organization (SRO) has sent agents out to various regions to investigate this phenomenon. It is soon discovered that these strange occurrences are connected to an archaic mystery an as-of-yet unknown history of two worlds, about to come to light...\r Bright Memory: Infinite combines the FPS and action genres to deliver a high-octane experience. Mix and match available skills and abilities to unleash magnificient combos on your enemies. Your trusted sword allows you to slash through crowds of enemies and even repel their gunfire. The guns you come across in-game can be customized with a variety of ammunitions. Choose between incendiary bombs, sticky grenades, homing missiles, and more to suit your situation.\r Created by FYQD-Studio, Bright Memory: Infinite is the sequel to the popular Bright Memory. However, the sequel features an all-new world, along with newly created improved battle system and level design.… Expand"}, {"name": "RPG Maker MV", "details_link": "https://www.metacritic.com/game/switch/rpg-maker-mv", "publisher": "NIS America", "release_date": "Sep  8 2020", "developers": ["Kadokawa"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Application"], "meta_score": 59, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/87f4cbe6d8811682cee3894abefe93c4-98.jpg", "descriptions": "An epic journey begins... with YOU! Become a master game developer with RPG Maker MV. With an arsenal of tools at your fingertips, create elaborate, exciting, and memorable video games straight from your console! Then, share your adventures online with other players, who can enjoy your epicAn epic journey begins... with YOU! Become a master game developer with RPG Maker MV. With an arsenal of tools at your fingertips, create elaborate, exciting, and memorable video games straight from your console! Then, share your adventures online with other players, who can enjoy your epic chronicles! The possibilities are endless with the latest and greatest RPG Maker software. With hundreds of assets and an infinite number of ways to create your game, turn your dream tale into the next great video game!Features:* Your Next Adventure Begins Here -- A high fantasy tale of knights and dragons? A modern story of high school romance? A chronicle of gods and demons? If you can dream it, you can make it!* Game Development Made Easy -- Say goodbye to complicated coding! This software provides ease of navigating and development with straightforward world and character creation, overworld customization, and more!* Make, Upload, Play! -- Enjoy games made by fellow gamers with the RPG Maker MV Player, free for download and play, even without the RPG Maker MV software!* An Endless Fountain of Customization -- With hundreds of graphical assets and an infinite number of possibilities to create your very own world and story, the sky's the limit!… Expand"}, {"name": "Drug Dealer Simulator", "details_link": "https://www.metacritic.com/game/pc/drug-dealer-simulator", "publisher": "Movie Games S.A.", "release_date": "Apr 16 2020", "developers": ["Byterunners Game Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 59, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/f733e682cedb916c25f8ebfe000f38d0-98.jpg", "descriptions": "Have you ever thought about expanding your own crime empire, without the legal and moral consequences? SIMULATE IT! Now you will finally be able to crawl into the dark alleys of the drug dealing business! Become a street business mastermind, or a ruthless gangster - it's up to you!"}, {"name": "Vambrace: Cold Soul", "details_link": "https://www.metacritic.com/game/switch/vambrace-cold-soul", "publisher": "Headup Games", "release_date": "Aug 29 2019", "developers": ["Devespresso Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 59, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/0bea45be892f32955cdfd737a3554b00-98.jpg", "descriptions": "The King of Shades has cursed the great city of Icenaire. Now cast under a permanent blight of frost fall, its former residents have returned from the dead as mad Wraiths. Survivors take refuge deep underground where they lead a desperate campaign against this unearthly power. WoefullyThe King of Shades has cursed the great city of Icenaire. Now cast under a permanent blight of frost fall, its former residents have returned from the dead as mad Wraiths. Survivors take refuge deep underground where they lead a desperate campaign against this unearthly power. Woefully outmatched, they are forced into hiding as the King of Shades amasses an army of the undead above them. One fateful day, a mysterious stranger appears in the city with an enchanted vambrace. She may now be their only hope...You are Evelia Lyric, bearer of the Aetherbrace and the only human capable of entering Icenaire. The survivors now look to you as their best hope against the King of Shades. Only one problem... you're woefully outmatched, and survival is not guaranteed.Vambrace: Cold Soul is a narrative-driven game filled with memorable characters, brutal challenges, and deep strategy. To succeed, you must choose perceptive party leaders, camp to recuperate, navigate strange encounters, and survive deadly combat. Will you scavenge for supplies to sell or use them to craft new items for your next expedition? The surface of Icenaire is cold and unforgiving. So, prepare your party well before departing... lest you join the cursed city's undead.… Expand"}, {"name": "Darksiders III: Keepers of the Void", "details_link": "https://www.metacritic.com/game/playstation-4/darksiders-iii-keepers-of-the-void", "publisher": "THQ Nordic", "release_date": "Jul 16 2019", "developers": ["Gunfire Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Open-World"], "meta_score": 59, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/4/2b6b8be6cdbdf71455631c233953b2cd-98.jpg", "descriptions": "On a quest from Vulgrim, Fury must travel into the Serpent Holes to remove an ancient threat that resides there. All new locations, puzzles, and enemies await the chance to test Fury's abilities. As a reward, she can unlock all new weapon forms for the Hollows as well as the biggest prizeOn a quest from Vulgrim, Fury must travel into the Serpent Holes to remove an ancient threat that resides there. All new locations, puzzles, and enemies await the chance to test Fury's abilities. As a reward, she can unlock all new weapon forms for the Hollows as well as the biggest prize of them all: The Abyssal Armor.… Expand"}, {"name": "Coffee Crisis", "details_link": "https://www.metacritic.com/game/switch/coffee-crisis", "publisher": "Mega Cat Studios", "release_date": "Nov 30 2018", "developers": ["Mega Cat Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 59, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/5/200cd2902c39bbe1c81fb59216ae3faa-98.jpg", "descriptions": "Coffee Crisis is an arcade-style beat 'em up that pays homage to the 90's era of classic arcade and 16-bit brawlers. The Smurglian race has come to Earth and they're not leaving until they steal our most prized commodities: our metal music, the best coffee, and all of the WiFi. Get in theCoffee Crisis is an arcade-style beat 'em up that pays homage to the 90's era of classic arcade and 16-bit brawlers. The Smurglian race has come to Earth and they're not leaving until they steal our most prized commodities: our metal music, the best coffee, and all of the WiFi. Get in the shoes of the only baristas on Earth with enough heavy metal in their veins to fend off this alien assault. … Expand"}, {"name": "X4: Foundations", "details_link": "https://www.metacritic.com/game/pc/x4-foundations", "publisher": "Egosoft", "release_date": "Nov 30 2018", "developers": ["Egosoft"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Action Adventure", "General", "Space", "Combat"], "meta_score": 59, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/5d0afa82451f3e8a5824465ad77eb73f-98.jpg", "descriptions": "X4: FOUNDATIONS, the long awaited sequel in the successful X series, brings our most sophisticated universe SIMULATION ever. Fly every ship, EXPLORE space or manage an empire; TRADE, FIGHT, BUILD and THINK carefully, while you embark on an epic journey."}, {"name": "Devious Dungeon", "details_link": "https://www.metacritic.com/game/switch/devious-dungeon", "publisher": "Ratalaika Games", "release_date": "Mar 30 2018", "developers": ["Noodlecake Studios"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 59, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/caf1cbc75184db5db1ad787c4261d93e-98.jpg", "descriptions": "Devious Dungeon is a medieval action platforming game by the creators of Random Heroes and League of Evil!"}, {"name": "Astro Duel Deluxe", "details_link": "https://www.metacritic.com/game/switch/astro-duel-deluxe", "publisher": "Panic Button", "release_date": "May 30 2017", "developers": ["Panic Button"], "platforms": ["iPhone/iPad", "PC", "Switch"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 59, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/87d282541937b115fc9ac33904d8a322-98.jpg", "descriptions": "Battle your friends in space! (Then run over their pilots!)\r Astro Duel Deluxe includes new features and gameplay created for the Nintendo Switch!\r\n\r\nASTRO DUEL DELUXE is a fun, frenetic same-screen local multiplayer party game for 1 to 6 players!\r\n\r\nGame rounds are quick and defeat isBattle your friends in space! (Then run over their pilots!)\r Astro Duel Deluxe includes new features and gameplay created for the Nintendo Switch!\r ASTRO DUEL DELUXE is a fun, frenetic same-screen local multiplayer party game for 1 to 6 players!\r Game rounds are quick and defeat is sudden as you blast enemy ships, or run over your friends' shipless pilots. (Hilarity ahead!)\r FEATURES\r -Play anywhere  On the TV, on the go, or even face up on a table or floor!\r-Play with multiple controller types (including touch screen)\r-Wipe out your friends' squad in \"Team Annihilation\" mode\r-6-player \"Chaos\" mode (More open arenas support Free-For-All and 3v3)\r-Pilot Selection  Pick from 6 pilots to control, including Box Cat and Chomper\r-Instant Replay after completing each round\r-Additional music\r-Wacky \"Touch\" mode  Ships can only turn in one direction!\r-Battle your friends or team up to take on CPU opponents\r-Run over pilots in \"Pilot Hunters\" mode, battle for the most kills in \"Ship Hunters,\" or join forces in \"Team Deathmatch\"\r-Arm your ship with offensive and defensive powerups including missiles, lasers, jousters and shields\r-Dynamic arenas provide a host of hiding places and hazards  Avoid turrets, death beams, and black holes\r-Mix up play with Game Modifiers (enable asteroids, starting power-ups, super dashes, and so much more)… Expand"}, {"name": "Chase: Cold Case Investigations - Distant Memories", "details_link": "https://www.metacritic.com/game/3ds/chase-cold-case-investigations---distant-memories", "publisher": "Aksys Games", "release_date": "Oct 13 2016", "developers": ["Arc System Works"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 59, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/1b1630501ab0dc53161fd2cc010d157d-98.jpg", "descriptions": "Chase down the Truth!\r Chase: Cold Case Investigations ~Distant Memories~ is an adventure mystery game from the mind of Taisuke Kanasaki, director of the famed Hotel Dusk: Room 215! Join the exploits of two gritty detectives whose sense of justice and raw instinct drive them to seek theChase down the Truth!\r Chase: Cold Case Investigations ~Distant Memories~ is an adventure mystery game from the mind of Taisuke Kanasaki, director of the famed Hotel Dusk: Room 215! Join the exploits of two gritty detectives whose sense of justice and raw instinct drive them to seek the truth. Put your sleuthing skills to the challenge by re-investigating old crime scenes and solving cold cases by searching for clues and interrogating perps! Find leads by diving head first into old investigation notes, crime scene photos and eye witness reports as you put together all the pieces. Once you have a solid lead, interrogate persons of interest to see what they do (or don't) know. Grill perps by asking tough questions, but be careful! Ask the wrong questions and your Interrogation Gauge will deplete. Ask too many wrong questions and it's Game Over!… Expand"}, {"name": "Necropolis", "details_link": "https://www.metacritic.com/game/pc/necropolis", "publisher": "Harebrained Schemes LLC", "release_date": "Jul 12 2016", "developers": ["Harebrained Schemes LLC"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action Adventure", "General"], "meta_score": 59, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/ef292925e4300eac5bb0cc3d09126d4d-98.jpg", "descriptions": "NECROPOLIS is a blend of third-person action and procedural dungeon-delving. And perma-death. Adventure alone or with up to three friends in a magical deathtrap that reconstructs itself each time you play. Will you find the exit, or die trying?"}, {"name": "Dream (2013)", "details_link": "https://www.metacritic.com/game/pc/dream-2013", "publisher": "Mastertronic", "release_date": "Jul 13 2015", "developers": ["HyperSloth"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "General"], "meta_score": 59, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/b2e9ae050dba154cec0aef33b22808bc-98.jpg", "descriptions": "Dream is an exploration game that takes place within the subconscious mind of Howard Phillips, a young man whose waking hours are tedious and dull, but whose dreams are lucid and powerful."}, {"name": "NHL 15", "details_link": "https://www.metacritic.com/game/xbox-one/nhl-15", "publisher": "Electronic Arts", "release_date": "Sep  9 2014", "developers": ["EA Sports"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim"], "meta_score": 59, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/3/dc2a1035a9d03c61a9eab1487357af5e-98.jpg", "descriptions": "The Skill Stick purports to give more control to the player. Protect the puck, receive passes without breaking stride, and discover an arsenal of sweet new dekes, all with an intuitive right stick control scheme. The game features Doc Emrick, Eddie Olczyk and analyst Ray Ferraro providingThe Skill Stick purports to give more control to the player. Protect the puck, receive passes without breaking stride, and discover an arsenal of sweet new dekes, all with an intuitive right stick control scheme. The game features Doc Emrick, Eddie Olczyk and analyst Ray Ferraro providing play-by-play and commentary throughout the proceedings.… Expand"}, {"name": "Lifeless Planet", "details_link": "https://www.metacritic.com/game/pc/lifeless-planet", "publisher": "Lace Mamba Global", "release_date": "Mar  6 2014", "developers": ["Stage 2 Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Sci-Fi", "Action Adventure", "General"], "meta_score": 59, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/a9d644fe81878bf2d6870fba28553377-98.jpg", "descriptions": "While seeking life on a distant planet, an astronaut discovers an abandoned Russian town. He suspects his mission is a hoax until a mysterious young woman saves him from a strange and deadly phenomenon... Lifeless Planet is a third-person action-adventure that features an old-school sci-fiWhile seeking life on a distant planet, an astronaut discovers an abandoned Russian town. He suspects his mission is a hoax until a mysterious young woman saves him from a strange and deadly phenomenon... Lifeless Planet is a third-person action-adventure that features an old-school sci-fi story and spectacular environments in the spirit of classic action-adventures. … Expand"}, {"name": "Defiance", "details_link": "https://www.metacritic.com/game/playstation-3/defiance", "publisher": "Trion Worlds", "release_date": "Apr  2 2013", "developers": ["Trion Worlds"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Sci-Fi", "Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 59, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/d56b7dc3a64d8318e83a4eaa2633a62e-98.jpg", "descriptions": "Defiance is the first multi-platform shooter MMO which interconnects with a global television program by cable channel Syfy."}, {"name": "Wanted Corp", "details_link": "https://www.metacritic.com/game/playstation-3/wanted-corp", "publisher": "Zoo Entertainment", "release_date": "Dec  6 2011", "developers": ["EKO Software", "Zoo Entertainment"], "platforms": ["PC", "PlayStation Vita", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Shoot-'Em-Up", "Sci-Fi", "Sci-Fi", "Top-Down"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/43e367d4d65d75b6d0f8616a5393a4ec-98.jpg", "descriptions": "In Wanted Corp, players become bounty hunters to capture ruthless fugitives who have escaped from a prison ship that crash-landed on an alien planet. Taking on the roles of Neal H. MadDogg, a heavy weapons expert, and Irina Zimoy, a psychic powerhouse, players can toggle between charactersIn Wanted Corp, players become bounty hunters to capture ruthless fugitives who have escaped from a prison ship that crash-landed on an alien planet. Taking on the roles of Neal H. MadDogg, a heavy weapons expert, and Irina Zimoy, a psychic powerhouse, players can toggle between characters and choose to play in single-player, local or online co-op gameplay modes.… Expand"}, {"name": "Faery: Legends of Avalon", "details_link": "https://www.metacritic.com/game/pc/faery-legends-of-avalon", "publisher": "Focus Home Interactive", "release_date": "May  6 2011", "developers": ["Spiders"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 59, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/cd51e4b115262a01664b3f5383881482-98.jpg", "descriptions": "Faery: Legends of Avalon is a Role Playing / Adventure game packed with an original and unique atmosphere, and a graphics design close to illustration. The game immerses players in a fantasy world inhabited by many colourful characters and magical creatures."}, {"name": "LEGO Battles: Ninjago", "details_link": "https://www.metacritic.com/game/ds/lego-battles-ninjago", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr 12 2011", "developers": ["Hellbent Games"], "platforms": "DS", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 59, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/c7686442e2fc9175a10c308af6516341-98.jpg", "descriptions": "Produced by critically acclaimed TT Games and developed by Hellbent Games, LEGO Battles: Ninjago allows players to become a master of Spinjitzu, an art form in which characters spin and become tornadoes to defeat their enemies, as they restore harmony to the world. Players can choose to playProduced by critically acclaimed TT Games and developed by Hellbent Games, LEGO Battles: Ninjago allows players to become a master of Spinjitzu, an art form in which characters spin and become tornadoes to defeat their enemies, as they restore harmony to the world. Players can choose to play both \"good\" and \"evil\" single-player campaigns, test their skills in a variety of Battle Mode challenges, or play with family and friends in exciting multiplayer showdowns.… Expand"}, {"name": "Dark Void", "details_link": "https://www.metacritic.com/game/playstation-3/dark-void", "publisher": "Capcom", "release_date": "Jan 19 2010", "developers": ["Airtight Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 59, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/0c6a7ae41c7141954eb5bfee256cf557-98.jpg", "descriptions": "Dark Void is a sci-fi action-adventure game that combines an adrenaline-fuelled blend of aerial and on-foot combat set in a parallel universe called \"The Void\". Players assume the role of Will; a pilot dropped into incredible circumstances while on a routine air cargo flight crashes in theDark Void is a sci-fi action-adventure game that combines an adrenaline-fuelled blend of aerial and on-foot combat set in a parallel universe called \"The Void\". Players assume the role of Will; a pilot dropped into incredible circumstances while on a routine air cargo flight crashes in the Bermuda triangle leading him to be trapped in the Void. This unlikely hero soon finds himself swept into a desperate struggle for survival at the head of a group called The Survivors. Trapped in the Void, these resistance fighters are battling to hold off a mysterious alien race that plans to threaten Earth. Dark Void's unique combination of in-air and on-ground combat creates a thrilling new gameplay dynamic to the third-person shooter experience. Taking 3D action to a whole new level, Dark Void's vertical combat system allows players to dangle from thousand foot drops as they take cover and drop enemies from above and below, bringing a whole new sense of vulnerability and thrill to the player. Defying gravity in vertical combat is only half the battle as, over time, Will is upgraded to a powerful rocket pack which allows for fierce in-air combat as gamers are able to fly through the void at unparallel speeds shooting down anything that gets in their path. Blasting away at massive bosses has never been this much fun as Dark Void offers a unique grip system made up of a variety of grip-based mini-games including skyjacking UFOs mid-flight. [Capcom]… Expand"}, {"name": "Cocoto Platform Jumper", "details_link": "https://www.metacritic.com/game/wii/cocoto-platform-jumper", "publisher": "Neko Entertainment", "release_date": "Apr 27 2009", "developers": ["Neko Entertainment"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "3D", "2D", "3D"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/e70194eec320b5417a2828e3f3a72e5c-98.jpg", "descriptions": "[WiiWare]  A long time ago in a faraway land, strange little creatures lived in the depths of Abyss. Cocoto, his little devil friends and the mysterious Fairy protect the secret of the magma — the source of their power — in a magic cauldron. Meanwhile, Zaron, the god of lightning who lusts[WiiWare]  A long time ago in a faraway land, strange little creatures lived in the depths of Abyss. Cocoto, his little devil friends and the mysterious Fairy protect the secret of the magma — the source of their power — in a magic cauldron. Meanwhile, Zaron, the god of lightning who lusts after this force, is up to something. He can count on the rulers of the other kingdoms that Cocoto must cross. The tragic kidnapping of Shiny, Baggy and Neuro has left Cocoto alone to watch over the cauldron. Refusing to leave his friends, he will set out to find them with Fairy. [Nintendo]… Expand"}, {"name": "Walt Disney Pictures Bolt", "details_link": "https://www.metacritic.com/game/playstation-3/walt-disney-pictures-bolt", "publisher": "Disney Interactive Studios", "release_date": "Nov 18 2008", "developers": ["Avalanche Software"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 59, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/0dfcde9debd2572df818f241901f3867-98.jpg", "descriptions": "Players take on the heroic personas of the TV star dog, Bolt, and his owner, Penny, from the high-action television series featured within the Disney film. As Bolt, players can use his superpowers, including laser vision and his superbark, which sends out a sonic blast to devastatePlayers take on the heroic personas of the TV star dog, Bolt, and his owner, Penny, from the high-action television series featured within the Disney film. As Bolt, players can use his superpowers, including laser vision and his superbark, which sends out a sonic blast to devastate opponents, and as Penny, players utilize stealth, hacking skills and a wheelbar, inspired by her scooter seen in the movie, to outwit enemies. [Disney Interactive Studios]… Expand"}, {"name": "Obscure: The Aftermath", "details_link": "https://www.metacritic.com/game/pc/obscure-the-aftermath", "publisher": "Ignition Entertainment", "release_date": "Mar 25 2008", "developers": ["Hydravision"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 59, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/2179b8efa0ebf12da66bb5edbb990aa5-98.jpg", "descriptions": "(Also known as \"Obscure II\")  Two years ago, at Leafmore High, a group of young teenagers were trapped inside their school and hunted by monsters that had been released by the maniac headmaster. Some of them survived that terrible night, while others perished. Now, the survivors have picked(Also known as \"Obscure II\")  Two years ago, at Leafmore High, a group of young teenagers were trapped inside their school and hunted by monsters that had been released by the maniac headmaster. Some of them survived that terrible night, while others perished. Now, the survivors have picked up their lives and joined college. But all is not right on Fallcreek University; strange black flowers have suddenly sprung up everywhere on the campus. While experimenting with these flowers in class, a dangerous substance is discovered that induces strange but vivid dreams. But a handful of students find out that there is more to the flowers than anyone could have expected; when the seeds finally germinate, a bad trip suddenly turns into a horrible reality... Features 6 charismatic characters with unique skills; unique coop mode: second player can join in at any time; highly detailed and rich 3D environment; find clues and solve various rddles and mysteries; and a vast variety of weapons and horrifying monsters. [Playlogic]… Expand"}, {"name": "NASCAR 08", "details_link": "https://www.metacritic.com/game/xbox-360/nascar-08", "publisher": "EA Sports", "release_date": "Jul 23 2007", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "Stock Car", "Stock Car", "Automobile"], "meta_score": 59, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/7/007d544dee0ac4fcf7e4ed3c63594fcc-98.jpg", "descriptions": "Take the wheel and drive your way to the NASCAR Nextel Cup Series championship. As the new rookie driver on the circuit, develop your racing skills to gain licenses and contracts from hungry owners and unlock legendary top performing cars from NASCAR's biggest stars. Gain new experiencesTake the wheel and drive your way to the NASCAR Nextel Cup Series championship. As the new rookie driver on the circuit, develop your racing skills to gain licenses and contracts from hungry owners and unlock legendary top performing cars from NASCAR's biggest stars. Gain new experiences during every race then modify your car's handling with over 40 tuning options to truly master every track. Share your setups with NASCAR's gaming community, then challenge the field in live races with up to 16 players online. Experience tomorrow's racing today in NASCAR 08. [Electronic Arts]… Expand"}, {"name": "Nicktoons: Battle for Volcano Island", "details_link": "https://www.metacritic.com/game/playstation-2/nicktoons-battle-for-volcano-island", "publisher": "THQ", "release_date": "Oct 24 2006", "developers": ["Blue Tongue Entertainment"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 59, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/16ec2cd3a625d3b416670bcc8495a36a-98.jpg", "descriptions": "An ancient evil known as Mawgu threatens to take control of Volcano Island, and it's up to our Nicktoons heroes to defeat him. Join SpongeBob, Timmy Turner and Danny Phantom, along with new recruits Patrick Star, Sandy Cheeks and Samantha Manson for all out battle on...Volcano Island! PlayAn ancient evil known as Mawgu threatens to take control of Volcano Island, and it's up to our Nicktoons heroes to defeat him. Join SpongeBob, Timmy Turner and Danny Phantom, along with new recruits Patrick Star, Sandy Cheeks and Samantha Manson for all out battle on...Volcano Island! Play as SpongeBob, Danny Phantom, Timmy Turner, Patrick Star, Sandy Cheeks, or Samatha Mason. Unlock bonus levels and crazy costumes. Three different game modes: Single Play, Download Play, and Wireless Play. Multi-player mayhem: Join or leave the game at anytime. [THQ]… Expand"}, {"name": "Garfield: A Tail of Two Kitties", "details_link": "https://www.metacritic.com/game/ds/garfield-a-tail-of-two-kitties", "publisher": "The Game Factory", "release_date": "Oct 17 2006", "developers": ["Two Tribes"], "platforms": ["PC", "DS"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 59, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/189affdb92f43de562fe384ffc9d1e16-98.jpg", "descriptions": "Having snuck into Jon's luggage to travel to London, Garfield befriends the royal cat Prince XII and the other animals at Carlyle Castle.  After a long day, Garfield is relaxing in his hotel when he receives a royal invitation from Prince: \"Dear Garfield... to celebrate... royal portion ofHaving snuck into Jon's luggage to travel to London, Garfield befriends the royal cat Prince XII and the other animals at Carlyle Castle.  After a long day, Garfield is relaxing in his hotel when he receives a royal invitation from Prince: \"Dear Garfield... to celebrate... royal portion of lasagna... in two hours time...\" Swoosh! Garfield is already out the door. His stomach is nearly empty so there is no time - much less lasagna - to waste!!!  When he arrives at the castle the gates are closed and no one is there to let him in. Will he make it inside in time or miss his dinner invitation? Players will help the famished feline find an alternative way into the castle as they guide him through the exciting environments from the movie. A Tail of Two Kitties is a fresh game experience mixed with special NDS specific elements and lots of fun. With a choice of ways to overcome many of the challenges the player must use their creativity and logic to find the best solution. [The Game Factory]… Expand"}, {"name": "Armored Core: Last Raven", "details_link": "https://www.metacritic.com/game/playstation-2/armored-core-last-raven", "publisher": "Agetec Inc.", "release_date": "Jun 13 2006", "developers": ["From Software"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 59, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/4598f44d8764bd7c2d463e952ba21c37-98.jpg", "descriptions": "Two powerful groups, the Alliance and the Vertex, are fighting for world dominance and victory hinges upon the \"Raven\" pilots. You are a Raven, an elite mech warrior who must choose sides between the fighting powers. Ravens face the ultimate decision in the fight for survival, either toTwo powerful groups, the Alliance and the Vertex, are fighting for world dominance and victory hinges upon the \"Raven\" pilots. You are a Raven, an elite mech warrior who must choose sides between the fighting powers. Ravens face the ultimate decision in the fight for survival, either to fiercely defend their chosen side or fight alone and face the wrath of all Ravens. [Agetec Inc.]… Expand"}, {"name": "Harry Potter and the Sorcerer's Stone", "details_link": "https://www.metacritic.com/game/xbox/harry-potter-and-the-sorcerers-stone", "publisher": "EA Games", "release_date": "Dec  9 2003", "developers": ["Warthog"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 59, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/ddbf26fd4d280734837e57f1a952a61c-98.jpg", "descriptions": "Leave the nonmagical world behind and enroll in Hogwarts School of Witchcraft and Wizardry in Harry Potter and The Sorcerer's Stone.  As Harry Potter, you will hone your magical skills and advance through three terms of study during Harry's first year at Hogwarts.  Each term will challengeLeave the nonmagical world behind and enroll in Hogwarts School of Witchcraft and Wizardry in Harry Potter and The Sorcerer's Stone.  As Harry Potter, you will hone your magical skills and advance through three terms of study during Harry's first year at Hogwarts.  Each term will challenge you to meet a number of objectives, such as collecting and mixing potions with Professor Snape or piloting a flying broom through the Forbidden Forest in search of Neville Longbottom's Remembrall.  In order to pass the first year of study, players must complete over 29 different objectives, while avoiding enemies and obstacles.… Expand"}, {"name": "Bloody Roar 4", "details_link": "https://www.metacritic.com/game/playstation-2/bloody-roar-4", "publisher": "Hudson", "release_date": "Nov 11 2003", "developers": ["Eighting"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 59, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/6e2dc16d298f6fa9d19ce52cdf9fdab4-98.jpg", "descriptions": "Bloody Roar returns and is darker, bloodier and fiercer than ever! 14 returning fighters are joined by three brand-new characters in the newest battle of the beast-fighters. Transform into ferocious inner-beasts and attack with fangs and claws in 3D fighting areas to see who is the ultimateBloody Roar returns and is darker, bloodier and fiercer than ever! 14 returning fighters are joined by three brand-new characters in the newest battle of the beast-fighters. Transform into ferocious inner-beasts and attack with fangs and claws in 3D fighting areas to see who is the ultimate beast-fighter champion! Balance power and health with the new \"Zoanthropes Guage\". Dramatic story mode for each fighter. 9 modes of gameplay including Arcade and Character Development. Full 3D combat system with aerial juggles, counters, blocks, chains. [Konami]… Expand"}, {"name": "Teenage Mutant Ninja Turtles", "details_link": "https://www.metacritic.com/game/playstation-2/teenage-mutant-ninja-turtles", "publisher": "Konami", "release_date": "Oct 21 2003", "developers": ["KCE Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 59, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/fd66a5b0ce3e83adbd3ab33222072f79-98.jpg", "descriptions": "Be your favorite Teenage Mutant Ninja Turtle and master your ultimate ninja skills in their action packed world. Roam NYC streets, scour underground sewers and fight your way across rooftops on a collision course with The Shredder and his vile pack of Foot Ninjas. Master ninja butt-kickin'Be your favorite Teenage Mutant Ninja Turtle and master your ultimate ninja skills in their action packed world. Roam NYC streets, scour underground sewers and fight your way across rooftops on a collision course with The Shredder and his vile pack of Foot Ninjas. Master ninja butt-kickin' skills in action-based gameplay. Discover scrolls and items to unlock special attack moves and effects. Interact with characters such as Splinter and Casey Jones . Faithful representation of the FoxBox's TMNT animated series. [Konami]… Expand"}, {"name": "Robin Hood: Defender of the Crown", "details_link": "https://www.metacritic.com/game/playstation-2/robin-hood-defender-of-the-crown", "publisher": "Capcom", "release_date": "Sep 30 2003", "developers": ["Cinemaware"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Historic"], "meta_score": 59, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/bd5e26b1826c563ab072a777813927d0-98.jpg", "descriptions": "Users take on the role of Robin Hood on a quest to restore peace in England. The throne has been stolen by the evil Prince John. Robin Hood must battle his way through the country in a wide range of action sequences and fighting styles to restore the throne to the rightful king. The gameUsers take on the role of Robin Hood on a quest to restore peace in England. The throne has been stolen by the evil Prince John. Robin Hood must battle his way through the country in a wide range of action sequences and fighting styles to restore the throne to the rightful king. The game blends action with strategy and RPG elements to immerse the player in the epic tale of Robin Hood. Battle your way through five types of medieval combat, including archery,jousting, sword fighting, siege warfare and army battles. Multiple endings ? eight different paths dependent on player performance and decisions. 38 territories to conquer. Includes all main characters from the Robin Hood story: Little John, Friar Tuck, Will Scarlet, Maid Marian and more. [Capcom]… Expand"}, {"name": "Top Gun: Combat Zones", "details_link": "https://www.metacritic.com/game/gamecube/top-gun-combat-zones", "publisher": "Titus Software", "release_date": "Oct 24 2002", "developers": ["Titus Software"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Simulation", "Flight", "Modern Jet"], "meta_score": 59, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/f3940ae664783d0e03390a7ad8da70d8-98.jpg", "descriptions": "Jump into the cockpits of the Navy's top planes with Top Gun: Combat Zones. With the F-14, F-18, and F-22 under your control, you must embark on dangerous low-level missions throughout hazardous canyons and across vast cityscapes. Eliminate ground or air targets in Southeast Asia, GulfJump into the cockpits of the Navy's top planes with Top Gun: Combat Zones. With the F-14, F-18, and F-22 under your control, you must embark on dangerous low-level missions throughout hazardous canyons and across vast cityscapes. Eliminate ground or air targets in Southeast Asia, Gulf States, Arctic Circle, and Miramar Base. The game offers 36 intense missions and a replay mode that lets you review each one through different camera angles.… Expand"}, {"name": "4x4 EVO 2", "details_link": "https://www.metacritic.com/game/xbox/4x4-evo-2", "publisher": "Gathering", "release_date": "Nov 14 2001", "developers": ["Terminal Reality"], "platforms": ["PC", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 59, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/d7e0f6c97f928549b0a0fd147a62ea74-98.jpg", "descriptions": "Professional drivers get paid by winning races and in career mode so do you. Win fast money and deck out your truck from over 125 upgrades like performance shocks, race tires, brush guards, roll bars, snorkels, working winches and performance exhaust to increase vehicle power and speed."}, {"name": "Monster House", "details_link": "https://www.metacritic.com/game/playstation-2/monster-house", "publisher": "THQ", "release_date": "Jul 18 2006", "developers": ["Artificial Mind and Movement"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 59, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/0c14f5d11fa3a33bcf1bd8b0e398eb4c-98.jpg", "descriptions": "Do you have what it takes to save the neighborhood? The Monster House allows players to experience key moments of the movie as they uncover the mysteries of the house in order to save their neighborhood. Players also take on unique adventures that were inspired by the film. With threeDo you have what it takes to save the neighborhood? The Monster House allows players to experience key moments of the movie as they uncover the mysteries of the house in order to save their neighborhood. Players also take on unique adventures that were inspired by the film. With three playable characters, fans of the film enjoy seeing the movie come to life in their living rooms. Explore a living, breathing house full of traps and mystery. Use water blasters to battle creatures created from a combination of different household objects. Spooky surprises and unexpected random events keep players constantly on their guard. Play \"Thou art dead\", the 2D arcade game that appears in the movie. [THQ]… Expand"}, {"name": "L.A. Rush", "details_link": "https://www.metacritic.com/game/xbox/la-rush", "publisher": "Midway", "release_date": "Oct 11 2005", "developers": ["Midway"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 59, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/2/21f256591e80cebbca2d97f454c3e5aa-98.jpg", "descriptions": "Midway brings its Rush racing series to Los Angeles in L.A. Rush. You can steal, upgrade, and race more than 50 different licensed cars from a highly tuned import to exotic racers. As you earn cash in story mode, you can change both the performance of your car or pimp it visually at WestMidway brings its Rush racing series to Los Angeles in L.A. Rush. You can steal, upgrade, and race more than 50 different licensed cars from a highly tuned import to exotic racers. As you earn cash in story mode, you can change both the performance of your car or pimp it visually at West Coast Customs. You can also race head-to-head on the tracks that you have unlocked with split-screen multiplayer mode.… Expand"}, {"name": "Ultimate Band", "details_link": "https://www.metacritic.com/game/wii/ultimate-band", "publisher": "Disney Interactive Studios", "release_date": "Nov 18 2008", "developers": ["Disney Interactive Studios"], "platforms": ["PlayStation 2", "Wii"], "num_players": "1-4 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 59, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/3595c356f6f39ab4e91922d7978c7eb4-98.jpg", "descriptions": "Ultimate Band for Wii allows players to live the life of a rock star, by advancing their music careers and popularity from playing in a neighborhood garage to performing in front of an international audience at a world famous venue. Ultimate Band utilizes the innovative Wii Remote andUltimate Band for Wii allows players to live the life of a rock star, by advancing their music careers and popularity from playing in a neighborhood garage to performing in front of an international audience at a world famous venue. Ultimate Band utilizes the innovative Wii Remote and Nunchuk™ to give fans the ability to play the drums, bass guitar, lead guitar, or take on the role of the front man.  Players can also create and customize characters that reflect their own unique personalities and attributes. Along the way, players will unlock new songs, venues, and accessories that can be used to customize their band members. [Disney Interactive Studio]… Expand"}, {"name": "Sonic Riders", "details_link": "https://www.metacritic.com/game/gamecube/sonic-riders", "publisher": "Sega", "release_date": "Feb 21 2006", "developers": ["Sonic Team"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Other"], "meta_score": 59, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/a18dcb6db1151df28f5ec6db4ff3c512-98.jpg", "descriptions": "The Sonic series takes to the track in the combat racing game, Sonic Riders. Dr. Eggman has challenged Sonic and friends to race in his World Grand Prix, and you can enter the event and try to unravel his mysterious plot. The races happen on floating boards and include tricks, fighting, andThe Sonic series takes to the track in the combat racing game, Sonic Riders. Dr. Eggman has challenged Sonic and friends to race in his World Grand Prix, and you can enter the event and try to unravel his mysterious plot. The races happen on floating boards and include tricks, fighting, and racing. You can customize your character with upgraded equipment as you race down 13 different tracks through a handful of game modes. You can also challenge three of your friends to multiplayer races.… Expand"}, {"name": "Nucleus", "details_link": "https://www.metacritic.com/game/playstation-3/nucleus", "publisher": "SCEA", "release_date": "Jul 31 2007", "developers": ["Kuju Entertainment"], "platforms": "PlayStation 3", "num_players": "1-2 ", "genres": ["Action", "General", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 59, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/48e1ede2727779835d7a1687e7986be7-98.jpg", "descriptions": "[Dowloadable Game] Nucleus is a shooter that tasks the player with ridding a human body of a spreading virus."}, {"name": "Skellboy", "details_link": "https://www.metacritic.com/game/switch/skellboy", "publisher": "Fabraz", "release_date": "Jan 30 2020", "developers": ["Umaiki Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 59, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/3f279824acb8f61ba1667ffb80f0dad8-98.jpg", "descriptions": "Life was peaceful in the Cubold Kingdom until the king's evil court magician got dumped by the princess. With his heart broken and his rage fueled, he called upon the evil spirits to resurrect the dead and the kingdom's long forgotten monstrosities. What he doesn't realize in his fury isLife was peaceful in the Cubold Kingdom until the king's evil court magician got dumped by the princess. With his heart broken and his rage fueled, he called upon the evil spirits to resurrect the dead and the kingdom's long forgotten monstrosities. What he doesn't realize in his fury is that he accidentally summoned an ancient hero as well... Skippy! Travel across the beautifully rendered kingdom of Cubold and take full advantage of your resurrected, skeletal body! Swap out body parts to acquire new abilities during your adventure or pick up a new weapon to vanquish the evil magician's lackeys. … Expand"}, {"name": "Skater XL", "details_link": "https://www.metacritic.com/game/xbox-one/skater-xl", "publisher": "Easy Day Studios Pty Ltd", "release_date": "Jul 28 2020", "developers": ["Easy Day Studios Pty Ltd"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Skate / Skateboard"], "meta_score": 59, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/6/f74140f756de1756a23b4e8f10dcd103-98.jpg", "descriptions": "Skater XL is a head first dive into the skateboarding world, where style, creativity and the perfect trick is yours to define. Create, combine, and style tricks with unparalleled board control as you hit iconic California locations where street legends have left their mark. Play as skatingSkater XL is a head first dive into the skateboarding world, where style, creativity and the perfect trick is yours to define. Create, combine, and style tricks with unparalleled board control as you hit iconic California locations where street legends have left their mark. Play as skating icons Tiago Lemos, Evan Smith, Tom Asta or Brandon Westgate on your way to becoming a skateboarding pro. Dive into the digital skate subculture, with featured community created mods, brands, 'zines, and maps. Hit more than 60 real skate spots connected by block after block of plazas, schools, pools, buildings, car parks and corridors.… Expand"}, {"name": "Schrodinger's Cat and the Raiders of the Lost Quark", "details_link": "https://www.metacritic.com/game/pc/schrodingers-cat-and-the-raiders-of-the-lost-quark", "publisher": "Team17", "release_date": "Sep 23 2014", "developers": ["Italic Pig"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 59, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/9db9df929e8b6efde25c9c53c090b84f-98.jpg", "descriptions": "Schrödinger’s Cat is a puzzle laden platform game, set in a quantum physics world. A disaster at a subatomic holiday destination has caused all the primitive particles to escape. Help Schrödinger’s Cat round them up."}, {"name": "Lost in Blue 3", "details_link": "https://www.metacritic.com/game/ds/lost-in-blue-3", "publisher": "Konami", "release_date": "Mar 18 2008", "developers": ["Matrix Software"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Survival", "Modern", "Third-Person", "Modern"], "meta_score": 59, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/71ace796dc8f8a02232f6d0bcff60f82-98.jpg", "descriptions": "Lost in Blue 3 marks the return of the original \"survival adventure\" game for the Nintendo DS. Guide one of four playable characters, each with their own hidden past and unique strengths, through exotic locales on a mysterious island while surviving the elements to stay alive. Work alone orLost in Blue 3 marks the return of the original \"survival adventure\" game for the Nintendo DS. Guide one of four playable characters, each with their own hidden past and unique strengths, through exotic locales on a mysterious island while surviving the elements to stay alive. Work alone or cooperatively with other characters to gather food, explore the island, and hunt dangerous wildlife. Use a character’s abilities to dictate which path you’ll take to uncover the mysteries of the island and ultimately engineer your escape. [Konami]… Expand"}, {"name": "Chris Sawyer's Locomotion", "details_link": "https://www.metacritic.com/game/pc/chris-sawyers-locomotion", "publisher": "Atari", "release_date": "Sep  9 2004", "developers": ["Chris Sawyer"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 59, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/368191f599f0555f4e06de0b57e0348b-98.jpg", "descriptions": "Chris Sawyer's Locomotion challenges you to build and operate a money-making transport network by linking passengers and cargo to their destinations. Put together a profitable company by constructing transportation routes between growing cities and their industries. Race against otherChris Sawyer's Locomotion challenges you to build and operate a money-making transport network by linking passengers and cargo to their destinations. Put together a profitable company by constructing transportation routes between growing cities and their industries. Race against other companies to make the most lucrative connections and rake in the cash. Or just sit back and enjoy the detailed world in action as you build and play with moving vehicles such as trains, buses, ships, and aircraft. Construct a variety of vehicles: trains, buses, trams, trucks, aircraft and ships. Discover time periods from 1900 to 2000, with appropriate vehicle types, buildings, industries, and background music. Connect roads and tracks with an easy-to-use interface familiar to any \"RollerCoaster Tycoon\" fan. Compete against up to 14 other simulated transport companies. Challenge a friend with head-to-head multiplayer. Build your transportation empire in three different areas of the world ? North American, British, and Alpine. Delve into over 40 pre-designed scenarios, or randomly generate your own unique scenarios. [Atari]… Expand"}, {"name": "Summer in Mara", "details_link": "https://www.metacritic.com/game/switch/summer-in-mara", "publisher": "Chibig", "release_date": "Jun 16 2020", "developers": ["Chibig"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 59, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/079f458b53dfcb2ec8977247e59fbf83-98.jpg", "descriptions": "'Summer in Mara' is a summer adventure with easy-RPG elements and farming, crafting, and exploring mechanics set in a tropical archipelago.'Summer in Mara' is a single player experience in a calm, relaxing environment, with a handmade look and a interesting narrative. You will be Koa, a'Summer in Mara' is a summer adventure with easy-RPG elements and farming, crafting, and exploring mechanics set in a tropical archipelago.'Summer in Mara' is a single player experience in a calm, relaxing environment, with a handmade look and a interesting narrative. You will be Koa, a little adventurer who wants to explore the world that surrounds her.In 'Summer in Mara' you'll have to take care of your own island, harvest your crops, create new tools and buildings, and sail with your boat to discover new islands and secrets.KEY FEATURES- 'Summer in Mara' is an adventure and farming game, with an archipelago full of islands and secrets to explore.- Day and night cycle with climate events.- More than 100 quests to make the world a better place.- Over 20 characters to meet and trade with. Befriend them!- Improve your boat, make it bigger, better and faster.- More than 130 inventory items to make, use and trade.- Unlock and acquire new abilities and skills for Koa, helping her to craft, trade and explore in an easy-RPG system.You'll have your own island, but taking care of something like that is a lot of hard work. You'll be able to plant trees to get wood and craft new tools and buildings with it. Or create crop fields to grow all kinds of vegetables. You'll also have a farm with chickens and pigs to take care of. But be careful, because this isn't as easy as it looks! You'll also be able to fish in a pond on the island, cut trees with your hatchet, build things with your hammer and use a hoe to help you harvest your island.Koa will need your help. With an easy-RPG system, she can acquire new abilities and grow stronger. We want you to feel like you're growing up with Koa, bonding with her and with all the other people in the archipelago.You'll be able to sail to new islands and find treasures and other secrets in the middle of the sea with your trusty boat which you can upgrade with a little effort and time.With new islands comes new people. You'll talk and trade with over twenty characters, each one with their own story and lifes. They'll give you quests, hints about the world or just anecdotes about their life and travels. Getting to know them is a very important part in the game, so we put much effort in making them unique and interesting.But not all of the people you find will be friendly. An evil corporation called Elite wants to conquer Mara and exploit the ocean. Napopo is one of their first victims, a strange creature that will seek Koa for help.… Expand"}, {"name": "Utawarerumono Zan", "details_link": "https://www.metacritic.com/game/playstation-4/utawarerumono-zan", "publisher": "NIS America", "release_date": "Sep 10 2019", "developers": ["Tamsoft", "Aqua Plus"], "platforms": "PlayStation 4", "num_players": "Up to 4 ", "genres": ["Action", "Role-Playing", "General", "Action RPG"], "meta_score": 59, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/9/64ba7b17d47402122ad385c04d8230ec-98.jpg", "descriptions": "Unveil a lost legend in a new light with Utawarerumono: Zan! This action-packed brawler is a reimagination of the story of Haku, a man with no memories, and the great conflict that consumes the land he calls home. Venture through dynamic battlefields, unleash devastating special moves, andUnveil a lost legend in a new light with Utawarerumono: Zan! This action-packed brawler is a reimagination of the story of Haku, a man with no memories, and the great conflict that consumes the land he calls home. Venture through dynamic battlefields, unleash devastating special moves, and experience a grand tale of war and destiny.… Expand"}, {"name": "Pokemon Mystery Dungeon: Explorers of Darkness", "details_link": "https://www.metacritic.com/game/ds/pokemon-mystery-dungeon-explorers-of-darkness", "publisher": "Nintendo", "release_date": "Apr 20 2008", "developers": ["ChunSoft"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Roguelike"], "meta_score": 59, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/3078612a06128c71783d7e2967ee440e-98.jpg", "descriptions": "In this pair of action-packed adventures, players journey as actual Pokemon through a fantastic land untouched by humans. Before the game starts, players take a test to help them figure out which of 16 Pokemon best represents their personalities. Players then experience their adventureIn this pair of action-packed adventures, players journey as actual Pokemon through a fantastic land untouched by humans. Before the game starts, players take a test to help them figure out which of 16 Pokemon best represents their personalities. Players then experience their adventure through the eyes of a Pokemon as they explore the land and embark on an epic journey through time and darkness. They talk and team up with other Pokemon to set out on an epic voyage while navigating an endless array of randomly generated dungeons. More than 490 Pokemon populate these new games, guaranteeing strategic, intense battles and infinite possibilities, no matter which Pokemon players become. To widen their circle of Pokemon friends, Nintendo Wi-Fi Connection lets users engage in wireless rescue operations and send alerts to their friends via e-mail or mobile text message. [Nintendo]… Expand"}, {"name": "Lemmings", "details_link": "https://www.metacritic.com/game/playstation-3/lemmings", "publisher": "SCEE", "release_date": "Dec  7 2006", "developers": ["Team17"], "platforms": "PlayStation 3", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 59, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/18ca95e5312dcae5ced51f268e57c762-98.jpg", "descriptions": "[Downloadable Game]  The Lemmings are on the loose with 40 new high-def levels. The processing power of the PS3 takes the classic game to a new dimension, from detailed environments to richer animation. Danger is only a step away for the little green-haired beings, so it's up to you to guide[Downloadable Game]  The Lemmings are on the loose with 40 new high-def levels. The processing power of the PS3 takes the classic game to a new dimension, from detailed environments to richer animation. Danger is only a step away for the little green-haired beings, so it's up to you to guide them through all-new puzzling levels of digging, climbing, bashing and building. With new features like teleporters and cloning machines for fiendish puzzle possibilities, collectible abilities adding a whole new layer of depth, dynamically-lit levels for heightened tension, and find-your-way-in-the-dark play, there's more challenge than ever before. Only you can save the Lemmings, so what are you waiting for? Global Online Rankings enable gamers to check their rank versus the world. [SCEA]… Expand"}, {"name": "The Simpsons Game", "details_link": "https://www.metacritic.com/game/psp/the-simpsons-game", "publisher": "EA Games", "release_date": "Nov  5 2007", "developers": ["Electronic Arts", "Rebellion"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 59, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/ffe109f3779f076f703db309b5f80d4a-98.jpg", "descriptions": "The Simpsons Game features a hilarious, sprawling, and mind-busting storyline crafted by the TV show's Emmy Award-winning writers. The action-comedy also features the full cast of voice actors from the TV show who reprise their roles for the game. In The Simpsons Game, Homer, Marge, Bart,The Simpsons Game features a hilarious, sprawling, and mind-busting storyline crafted by the TV show's Emmy Award-winning writers. The action-comedy also features the full cast of voice actors from the TV show who reprise their roles for the game. In The Simpsons Game, Homer, Marge, Bart, and Lisa use exciting, all-new powers to save the world from rising chaos. To help the Simpsons, gamers at home must journey through all of Springfield (as well as vast worlds beyond!), vanquish an amazing array of villains, and fight their way through parodies of popular games. [Electronic Arts]… Expand"}, {"name": "Godstrike", "details_link": "https://www.metacritic.com/game/switch/godstrike", "publisher": "Freedom LLC", "release_date": "Apr 15 2021", "developers": ["Freedom LLC"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/09fa0424445c8e26c21a7fb873481534-98.jpg", "descriptions": "Centuries after a divine power divided itself between seven mysterious masks, chaos reigns. Now inhabiting vessels called Heralds, these seven entities spend eternity fighting each other as the world decays around them. That is, all but one. Talaal, the forgotten seventh mask, and its newCenturies after a divine power divided itself between seven mysterious masks, chaos reigns. Now inhabiting vessels called Heralds, these seven entities spend eternity fighting each other as the world decays around them. That is, all but one. Talaal, the forgotten seventh mask, and its new Herald Yissia stand alone. Only together can they stop their siblings’ apocalyptic war. Don the mask of Talaal and duel against devilish monstrosities in multi-stage boss battles with breakneck speed. Go in guns blazing, weaving through oncoming fire, and unleashing a torrent of heavenly abilities to overcome adversaries as quickly as possible. Time is of the essence, because in Godstrike as the seconds count down, so too does our hero’s health bar. Time is both life and a currency. Talaal and Yissia lose valuable seconds needed to complete their mission for every hit they take. So the pair must make calculated moves before each showdown, shuffling between an ever-expanding stockpile of skills to help defend against their foes’ strengths while taking advantage of weaknesses.… Expand"}, {"name": "Ignite (2011)", "details_link": "https://www.metacritic.com/game/pc/ignite-2011", "publisher": "Just A Game", "release_date": "Oct 28 2011", "developers": ["Nemesys"], "platforms": "PC", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 59, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/b7a956284aebc5621ec592f35b279bb3-98.jpg", "descriptions": "In Ignite every race is different. Each race brings something new as you try winning the race by using any of the strategies or switch between them during the race. The key factor in the game is the SCORE. You collect score while racing. Every stunt that you perform will award you with aIn Ignite every race is different. Each race brings something new as you try winning the race by using any of the strategies or switch between them during the race. The key factor in the game is the SCORE. You collect score while racing. Every stunt that you perform will award you with a certain number of score. Hitting objects, driving fast, drifting they all give you a certain number of score. When you reach 1000 you can burn away your score as nitro thus getting an edge over the others. If you are in the lead you can hit more objects thus gather more score. However hitting objects may cause you to make a mistake and crash into something that is immovable. If you can be patient and gather more than 2000 score, your nitro will be even stronger. Another tactic is to select one of the super cars which are fast and have a good traction. In this case you won't gather that much score but most probably you won't need it because you don't need nitro to stay ahead. Another way to win is to gather your score and never burn it since at the end all score points are converted to time and is subtracted from your overall time and you may jump ahead the winner.… Expand"}, {"name": "Need for Speed Undercover", "details_link": "https://www.metacritic.com/game/ds/need-for-speed-undercover", "publisher": "Electronic Arts", "release_date": "Nov 17 2008", "developers": ["Firebrand Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "DS"], "num_players": "1 Player", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 59, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/6/60c39fb1e4204cf9560f6e6492b307de-98.jpg", "descriptions": "You never thought it could turn out like this—an all-out chase where you’re the hunted. And the hunter. Now you must get behind the wheel and risk everything to infiltrate a ruthless international crime syndicate and take them down. The man you’re after is a maniac behind the wheel, and he’sYou never thought it could turn out like this—an all-out chase where you’re the hunted. And the hunter. Now you must get behind the wheel and risk everything to infiltrate a ruthless international crime syndicate and take them down. The man you’re after is a maniac behind the wheel, and he’s driving like his life depends on escape, which maybe it does. He’s the one with all the answers you need, you will track him down. Needless to say, that fleet of police cruisers in your rearview mirror won’t make things any easier. It will take all of your experience—and every ounce of skill—to outrun the law, take down the enemy, and unlock the truth that puts an end to this chase once and for all.… Expand"}, {"name": "Rapala Pro Fishing", "details_link": "https://www.metacritic.com/game/xbox/rapala-pro-fishing", "publisher": "Activision Value", "release_date": "Aug 31 2004", "developers": ["FUN Labs"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Sports", "Nature", "Fishing"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/80eeacb2f260bb1629f6c2feddc8ecb9-98.jpg", "descriptions": "Grab your tackle box, launch the bass boat and LET'S GO! Rapala Pro Fishing sets the standard for all fishing games. Never before has a fishing game brought you all this: authentic Rapala fishing gear, guided fishing trips with Rapala's Pro Staff and a BOATLOAD OF ACTION! Time to set theGrab your tackle box, launch the bass boat and LET'S GO! Rapala Pro Fishing sets the standard for all fishing games. Never before has a fishing game brought you all this: authentic Rapala fishing gear, guided fishing trips with Rapala's Pro Staff and a BOATLOAD OF ACTION! Time to set the hook and land that TROPHY of a lifetime!… Expand"}, {"name": "Tom Clancy's Rainbow Six: Lockdown", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-rainbow-six-lockdown", "publisher": "Ubisoft", "release_date": "Feb 16 2006", "developers": ["Red Storm Entertainment", "Ubisoft Montreal"], "platforms": ["PlayStation 2", "PC"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 59, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/e12f6053426145fea4eebf5d47bd8f64-98.jpg", "descriptions": "Command Team Rainbow in their toughest mission yet. When one of your own is taken hostage, do you follow orders or do you break them in order to save the life of one of your own men? The next Rainbow Six title features a thrilling single-player campaign that has you playing as either theCommand Team Rainbow in their toughest mission yet. When one of your own is taken hostage, do you follow orders or do you break them in order to save the life of one of your own men? The next Rainbow Six title features a thrilling single-player campaign that has you playing as either the confident team leader, Ding Chavez, who never leaves a man behind, or as the team's arrogant sniper, Dieter Weber, who never misses a shot. The final result: a totally immersive experience - which becomes even more compelling when gamers go online to play against other fans from around the world, using voice chat to communicate with one another. New weapons and equipment: Complete your mission with all of the tools of the trade including new items like motion trackers, battering rams, and the deadly MTAR-21 micro assault rifle. Stunning graphics and ultra-realistic \"ragdoll\" physics deliver staggering realism and spectacular close quarter firefights. [Ubisoft]… Expand"}, {"name": "Asterix & Obelix: Kick Buttix", "details_link": "https://www.metacritic.com/game/playstation-2/asterix-obelix-kick-buttix", "publisher": "Atari", "release_date": "Sep 14 2004", "developers": ["Etranges Libellules"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 59, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/d85f058723b09724f226453870feacca-98.jpg", "descriptions": "The year is 50 BC. Gaul is entirely occupied by the Romans. Well, not entirely? One small village of indomitable Gauls still holds out against the invaders. Among these resolute Gauls are our two heroes: Asterix and Obelix. One day, when Asterix and Obelix are out hunting, Caesar's troopsThe year is 50 BC. Gaul is entirely occupied by the Romans. Well, not entirely? One small village of indomitable Gauls still holds out against the invaders. Among these resolute Gauls are our two heroes: Asterix and Obelix. One day, when Asterix and Obelix are out hunting, Caesar's troops take advantage of their absence and capture the other villagers. Even worse, the invaders also seize the druid, Getafix, along with the magic strength potion he was brewing! Caesar has left nothing to chance. The Gaulish prisoners are triple-locked to carts, each closely guarded by a whole legion of Romans. The carts are taken to the farthest corners of the Roman Empire, and the cauldron of potion is on its way to Rome. When they return to their village, Asterix and Obelix quickly figure out what has happened, and they immediately search for their friends. So begins an adventure of historic proportions. [Atari]… Expand"}, {"name": "Disney Sports Football", "details_link": "https://www.metacritic.com/game/gamecube/disney-sports-football", "publisher": "Konami", "release_date": "Dec  8 2002", "developers": ["KCEO"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/d779326afbc00591a03e6a9f7250ff5f-98.jpg", "descriptions": "Get ready for hard-hitting tackles and wild touchdowns as Mickey, Goofy, and other Disney characters take to the gridiron. In Disney Sports Football, you'll create a team and compete in four modes: Challenge, Cup, Exhibition, and Practice. You'll have plenty of running and passing plays,Get ready for hard-hitting tackles and wild touchdowns as Mickey, Goofy, and other Disney characters take to the gridiron. In Disney Sports Football, you'll create a team and compete in four modes: Challenge, Cup, Exhibition, and Practice. You'll have plenty of running and passing plays, offensive and defensive formations, and turbo moves to master, plus magic items to boost your team's performance. In single or multiplayer modes, you'll face a variety of opponents inside fantastic stadiums.… Expand"}, {"name": "The Lord of the Rings: The Fellowship of the Ring", "details_link": "https://www.metacritic.com/game/xbox/the-lord-of-the-rings-the-fellowship-of-the-ring", "publisher": "Black Label Games", "release_date": "Sep 26 2002", "developers": ["WXP"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 59, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/8f4abfe02d1422fa53d381da8d69559a-98.jpg", "descriptions": "J.R.R. Tolkien's Middle-earth is a land of beauty, magic, and darkness. In The Lord of the Rings: The Fellowship of the Ring, you follow Tolkien's narrative from the Shire to the halls of Moria, and finally to the banks of the River Anduin. Gameplay alternates between melee, archery,J.R.R. Tolkien's Middle-earth is a land of beauty, magic, and darkness. In The Lord of the Rings: The Fellowship of the Ring, you follow Tolkien's narrative from the Shire to the halls of Moria, and finally to the banks of the River Anduin. Gameplay alternates between melee, archery, sorcery, and stealth as you control Frodo, Gandalf, and Aragorn. Join this band of heroes in their quest to destroy the One Ring, which contains all the power of the dark lord Sauron.… Expand"}, {"name": "Pryzm Chapter One: The Dark Unicorn", "details_link": "https://www.metacritic.com/game/playstation-2/pryzm-chapter-one-the-dark-unicorn", "publisher": "TDK Mediactive", "release_date": "Jun 10 2002", "developers": ["Digital Illusions"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 59, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/6/5e0f971dbf04fa84d0aa63e67b95d509-98.jpg", "descriptions": "A corrupting plague of dark magic grips the world... once lush lands have turned barren, and the inhabitants have become hostile mutant creatures. Now, join the quest of a unique young unicorn and a tenacious old troll in a desperate bid to find and destroy the source of the curse. JourneyA corrupting plague of dark magic grips the world... once lush lands have turned barren, and the inhabitants have become hostile mutant creatures. Now, join the quest of a unique young unicorn and a tenacious old troll in a desperate bid to find and destroy the source of the curse. Journey through four vast and eerie lands - each with four levels to explore. Cast eight powerful spells against 24 bizarre mutant enemies. Battle five gargantuan bosses and sub-bosses. Restore lands and inhabitants to health and witness their amazing transformation. [TDK Mediactive]… Expand"}, {"name": "Motor Mayhem: Vehicular Combat League", "details_link": "https://www.metacritic.com/game/playstation-2/motor-mayhem-vehicular-combat-league", "publisher": "Infogrames", "release_date": "Jun 20 2001", "developers": ["Beyond Games"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Car Combat"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/8aac16782bd9c317d4729a81b68a7267-98.jpg", "descriptions": "Another car combat game (released, oddly, at the same time as \"Twisted Metal: Black\"), this one of the post-apocalyptic variety, features Quick Start and Career Modes with 3 kinds of tournaments:  Eliminator, Deathmatch and Endurance."}, {"name": "Sonic: Lost World", "details_link": "https://www.metacritic.com/game/3ds/sonic-lost-world", "publisher": "Sega", "release_date": "Oct 29 2013", "developers": ["Dimps Corporation"], "platforms": ["PC", "Wii U", "3DS"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 59, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/4b50d1e2c65b1d06f34611b4b672db75-98.jpg", "descriptions": "Sonic Lost World sees Sonic partner with Dr. Eggman to take on six menacing creatures known as the Deadly Six."}, {"name": "Expedition Zero", "details_link": "https://www.metacritic.com/game/pc/expedition-zero", "publisher": "tinyBuild", "release_date": "Mar 24 2022", "developers": ["Enigmatic Machines LTD."], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/97846426b350d66e4df9a346dc71f4bb-98.jpg", "descriptions": "Expedition Zero - survival horror set in the anomaly zone of the northern forest. Face the dreadful forest monster and find a way to defeat it.Explore the corrupted forest and abandoned research facilities to uncover the truth about the top-secret expedition. Limited resources can be usedExpedition Zero - survival horror set in the anomaly zone of the northern forest. Face the dreadful forest monster and find a way to defeat it.Explore the corrupted forest and abandoned research facilities to uncover the truth about the top-secret expedition. Limited resources can be used to enhance your abilities and chances of survival in extreme conditions.Could you escape the zone or reveal the secrets it keeps?… Expand"}]