[
  {
    "name": "Escape Academy",
    "details_link": "https://www.metacritic.com/game/pc/escape-academy",
    "publisher": "iam8bit",
    "release_date": "Jul 13 2022",
    "developers": [
      "Coin Crew Games"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "2 ",
    "genres": [
      "Adventure",
      "3D",
      "First-Person"
    ],
    "meta_score": 79,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/1/10958503da69cb2d405631a90ebd127c-98.jpg",
    "descriptions": "You've just arrived at Escape Academy, a school where promising students train to become the ultimate Escape Room Master. Play over a dozen masterfully hand crafted rooms, designed by experienced experts in the field of REAL LIFE escape rooms. Experience the entirety of Escape Academy aloneYou've just arrived at Escape Academy, a school where promising students train to become the ultimate Escape Room Master. Play over a dozen masterfully hand crafted rooms, designed by experienced experts in the field of REAL LIFE escape rooms. Experience the entirety of Escape Academy alone in single player OR through two player co-operative play. Available in local or online splitscreen. Explore the campus of Escape Academy and get to know the faculty, a colorful cast of characters, each an expert in the art of Escape. And some with secrets yet to be uncovered... … Expand"
  },
  {
    "name": "Telling Lies",
    "details_link": "https://www.metacritic.com/game/playstation-4/telling-lies",
    "publisher": "Annapurna Interactive",
    "release_date": "Apr 28 2020",
    "developers": [
      "Sam Barlow"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 79,
    "users_score": 5.6,
    "image": "https://static.metacritic.com/images/products/games/1/f9c595523ec84fe2ad0f1dcbf59427cb-98.jpg",
    "descriptions": "An investigative thriller game with non-linear storytelling, Telling Lies revolves around a cache of secretly recorded video conversations. Starring Logan Marshall-Green, Alexandra Shipp, Kerry Bishé, Angela Sarafyan and directed by Sam Barlow, creator of Her Story and Silent Hill: ShatteredAn investigative thriller game with non-linear storytelling, Telling Lies revolves around a cache of secretly recorded video conversations. Starring Logan Marshall-Green, Alexandra Shipp, Kerry Bishé, Angela Sarafyan and directed by Sam Barlow, creator of Her Story and Silent Hill: Shattered Memories.… Expand"
  },
  {
    "name": "Wide Ocean Big Jacket",
    "details_link": "https://www.metacritic.com/game/switch/wide-ocean-big-jacket",
    "publisher": "Tender Claws",
    "release_date": "Feb  4 2020",
    "developers": [
      "Turnfollow"
    ],
    "platforms": [
      "PC",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "Point-and-Click",
      "Third-Person"
    ],
    "meta_score": 79,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/6/577ce811c62560f25d624b2beff50bde-98.jpg",
    "descriptions": "Take part in a classic camping trip: Roast hot dogs on the fire, go birdwatching, tell ghost stories, grab a beverage from the cooler and do cartwheels on the beach.\r WOBJ is a short story game including 20 chapters, 4 playable characters, 10,000 words of dialog and 8 explorable areas, allTake part in a classic camping trip: Roast hot dogs on the fire, go birdwatching, tell ghost stories, grab a beverage from the cooler and do cartwheels on the beach.\r WOBJ is a short story game including 20 chapters, 4 playable characters, 10,000 words of dialog and 8 explorable areas, all rendered in a beautiful 2D/3D art style.… Expand"
  },
  {
    "name": "Chess Ultra",
    "details_link": "https://www.metacritic.com/game/switch/chess-ultra",
    "publisher": "Ripstone",
    "release_date": "Nov  2 2017",
    "developers": [
      "Ripstone"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "2 ",
    "genres": [
      "Miscellaneous",
      "Board / Card Game"
    ],
    "meta_score": 79,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/2/0567859a6d4fd26e3e825ce4fa83af35-98.jpg",
    "descriptions": "Introducing the most breathtaking chess game ever made.Chess Ultra features stunning visuals, seamless online multiplayer and Grandmaster-approved AI to offer the ultimate chess experience.\n\nExplore an array of intricately crafted environments and choose from a selection of iconic chessIntroducing the most breathtaking chess game ever made.Chess Ultra features stunning visuals, seamless online multiplayer and Grandmaster-approved AI to offer the ultimate chess experience.Explore an array of intricately crafted environments and choose from a selection of iconic chess sets designed with both the modern and traditional chess player in mind.Whether you're a beginner or a veteran of the great game, Chess Ultra has something to offer for players of all ages and ability.… Expand"
  },
  {
    "name": "Kameo: Elements of Power",
    "details_link": "https://www.metacritic.com/game/xbox-360/kameo-elements-of-power",
    "publisher": "Microsoft Game Studios",
    "release_date": "Nov  7 2005",
    "developers": [
      "Rare Ltd."
    ],
    "platforms": "Xbox 360",
    "num_players": "1-2 ",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 79,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/5/4863cd14b8bf40b0c2d03e0acc1954b4-98.jpg",
    "descriptions": "Kameo: Elements of Power is an epic adventure, full of exploration and intense combat. The future of the world depends on Kameo, who must capture, grow, and unleash a wide assortment of incredible monsters to combat ever-present evil and rescue her three Elemental Ancestors from the DarkKameo: Elements of Power is an epic adventure, full of exploration and intense combat. The future of the world depends on Kameo, who must capture, grow, and unleash a wide assortment of incredible monsters to combat ever-present evil and rescue her three Elemental Ancestors from the Dark Troll King—who threatens the planet and its wildlife. [Microsoft]… Expand"
  },
  {
    "name": "FIFA Soccer",
    "details_link": "https://www.metacritic.com/game/playstation-vita/fifa-soccer",
    "publisher": "EA Sports",
    "release_date": "Feb 15 2012",
    "developers": [
      "Electronic Arts"
    ],
    "platforms": "PlayStation Vita",
    "num_players": "2 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 79,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/1/d6a0bf3034bac5ac64fdfed6870050de-98.jpg",
    "descriptions": "EA SPORTS FIFA Soccer on PS Vita gives you the same physics-based, data driven technology that powers FIFA gameplay on PlayStation 3. Take part in eight different game modes, including 11 vs. 11, Tournament Mode with over 50 real-world competitions, a full in-depth Career Mode, andEA SPORTS FIFA Soccer on PS Vita gives you the same physics-based, data driven technology that powers FIFA gameplay on PlayStation 3. Take part in eight different game modes, including 11 vs. 11, Tournament Mode with over 50 real-world competitions, a full in-depth Career Mode, and head-to-head online. Innovations that utilize a rear touch pad and touchscreen create an intelligent and unique gameplay experience. Rear touch pad shooting delivers pin-point accuracy and removes the element of \"hit and hope\" from shooting and touchscreen passing opens up the field of play for more creative and precision passing.… Expand"
  },
  {
    "name": "NBA Jam",
    "details_link": "https://www.metacritic.com/game/wii/nba-jam",
    "publisher": "EA Sports",
    "release_date": "Oct  5 2010",
    "developers": [
      "EA Canada"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "Wii"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Basketball",
      "Arcade",
      "Arcade"
    ],
    "meta_score": 79,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/4/a547d5f971ab8c2729f897fc5a9a1532-98.jpg",
    "descriptions": "Featuring gameplay that is true to the original, NBA JAM has players spinning with ankle breaking moves to the basket and on the way to high-flying, backboard-smashing dunks. In addition to the classic experience, EA SPORTS NBA JAM also introduces new game modes, characters and gameplayFeaturing gameplay that is true to the original, NBA JAM has players spinning with ankle breaking moves to the basket and on the way to high-flying, backboard-smashing dunks. In addition to the classic experience, EA SPORTS NBA JAM also introduces new game modes, characters and gameplay depth. [Electronic Arts]… Expand"
  },
  {
    "name": "Atelier Dusk Trilogy Deluxe Pack",
    "details_link": "https://www.metacritic.com/game/playstation-4/atelier-dusk-trilogy-deluxe-pack",
    "publisher": "Koei Tecmo Games",
    "release_date": "Jan 14 2020",
    "developers": [
      "Gust"
    ],
    "platforms": [
      "PC",
      "Switch",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 79,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/0/91fa3defdfd58e4ef8fbddf80361025d-98.jpg",
    "descriptions": "The DX versions of the titles from the Dusk series are now available as a specially priced 3-game set! Atelier Ayesha: The Alchemist of Dusk DX, Atelier Escha & Logy: Alchemists of the Dusk Sky DX, Atelier Shallie: Alchemists of the Dusk Sea DX."
  },
  {
    "name": "The Magic Circle",
    "details_link": "https://www.metacritic.com/game/pc/the-magic-circle",
    "publisher": "Questionary",
    "release_date": "Jul  9 2015",
    "developers": [
      "Questionary",
      "Question"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "First-Person"
    ],
    "meta_score": 79,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/1/c5f1611730e7f0220a7f2eeeb190e35f-98.jpg",
    "descriptions": "In this darkly comedic story, you are the hero of an unfinished fantasy game - and your designers have failed you. Trap their creations. Swap behaviors and body parts, crafting your own unique solutions to free-form puzzles. Steal the power of creation, to either ship the game from theIn this darkly comedic story, you are the hero of an unfinished fantasy game - and your designers have failed you. Trap their creations. Swap behaviors and body parts, crafting your own unique solutions to free-form puzzles. Steal the power of creation, to either ship the game from the inside ... or cancel it. … Expand"
  },
  {
    "name": "Firewall Zero Hour",
    "details_link": "https://www.metacritic.com/game/playstation-4/firewall-zero-hour",
    "publisher": "Sony Interactive Entertainment",
    "release_date": "Aug 28 2018",
    "developers": [
      "Sony Interactive Entertainment",
      "First Contact Entertainment"
    ],
    "platforms": "PlayStation 4",
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Tactical"
    ],
    "meta_score": 79,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/5/b76654ede6dc3f2b717def7980958aeb-98.jpg",
    "descriptions": "Choose from one of 12 contractors hired by anonymous contract handlers and work as a team to either protect or obtain valuable data, housed on a laptop and located in dangerous locations around the globe."
  },
  {
    "name": "DOOM Eternal: The Ancient Gods Part One",
    "details_link": "https://www.metacritic.com/game/pc/doom-eternal-the-ancient-gods-part-one",
    "publisher": "Bethesda Softworks",
    "release_date": "Oct 20 2020",
    "developers": [
      "id Software"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Stadia",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/1/21bdf1dd7d40b99a4cfdb19c4550b62e-98.jpg",
    "descriptions": "The fight's not over! Your victory over the hordes of Hell spared Earth from a perilous, demon-infested fate, but saving humanity has upset the delicate balance of power in the heavens. Become the DOOM Slayer once again and set things right in DOOM Eternal's first single-player expansion,The fight's not over! Your victory over the hordes of Hell spared Earth from a perilous, demon-infested fate, but saving humanity has upset the delicate balance of power in the heavens. Become the DOOM Slayer once again and set things right in DOOM Eternal's first single-player expansion, The Ancient Gods, Part One. Travel to previously uncharted realms of the DOOM universe and confront a new challenge head-on.… Expand"
  },
  {
    "name": "The King of Fighters XIII",
    "details_link": "https://www.metacritic.com/game/xbox-360/the-king-of-fighters-xiii",
    "publisher": "Atlus",
    "release_date": "Nov 22 2011",
    "developers": [
      "SNK Playmore"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "2 ",
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "2D",
      "2D"
    ],
    "meta_score": 79,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/0/1e686b38f6c40c048371d752164d4de4-98.jpg",
    "descriptions": "With a roster featuring over 30 hand-drawn fighters, a number of detailed stages bursting with life, over a half dozen play modes, a refined fighting engine built for speed and complete with new moves and supers, a vastly improved Online mode, and a host of other additions, tweaks, andWith a roster featuring over 30 hand-drawn fighters, a number of detailed stages bursting with life, over a half dozen play modes, a refined fighting engine built for speed and complete with new moves and supers, a vastly improved Online mode, and a host of other additions, tweaks, and enhancements, THE KING OF FIGHTERS XIII represents a rebirth for one of gaming's longest tenured franchises and one of the most popular fighting brands ever.… Expand"
  },
  {
    "name": "Star Wars Jedi: Fallen Order",
    "details_link": "https://www.metacritic.com/game/playstation-4/star-wars-jedi-fallen-order",
    "publisher": "Electronic Arts",
    "release_date": "Nov 15 2019",
    "developers": [
      "Respawn Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 5",
      "Stadia",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "General"
    ],
    "meta_score": 79,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/6/06e17e5d413d8bc80bcf89d6018909fc-98.jpg",
    "descriptions": "A third-person action-adventure Star Wars title from Respawn Entertainment. The Empire seeks to eradicate all Jedi after the execution of Order 66. You, a Jedi Padawan-turned-fugitive, must fight for your survival as you explore the mysteries of a long-extinct civilization in hopes ofA third-person action-adventure Star Wars title from Respawn Entertainment. The Empire seeks to eradicate all Jedi after the execution of Order 66. You, a Jedi Padawan-turned-fugitive, must fight for your survival as you explore the mysteries of a long-extinct civilization in hopes of rebuilding the Jedi Order. After narrowly escaping the Jedi purge, you’re on a quest to rebuild your fallen Order. Pick up the pieces of your shattered past and complete your Jedi training, all while staying one step ahead of the Empire and its deadly Inquisitors. Utilize your Jedi training to overcome your opponents and solve the mysteries that lay in your path. Use the Force to augment the way you explore, allowing you to traverse new paths and discover parts of locations you’ve been to before. Move quickly, though. The Empire is on your trail and won’t stop until every Jedi is exterminated. [Electronic Arts]… Expand"
  },
  {
    "name": "Rock Band Unplugged",
    "details_link": "https://www.metacritic.com/game/psp/rock-band-unplugged",
    "publisher": "Electronic Arts",
    "release_date": "Jun  9 2009",
    "developers": [
      "Harmonix Music Systems",
      "Backbone Entertainment"
    ],
    "platforms": "PSP",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 79,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/3/1af275770b8adf63be508345d5286fcb-98.jpg",
    "descriptions": "Rock Band Unplugged creates a full band experience in the palm of your hand by combining traditional beat match gameplay with key elements from both Rock Band and Rock Band 2, such as overdrive and chords. Your hands are the \"peripherals\" in Rock Band Unplugged allowing you to take directRock Band Unplugged creates a full band experience in the palm of your hand by combining traditional beat match gameplay with key elements from both Rock Band and Rock Band 2, such as overdrive and chords. Your hands are the \"peripherals\" in Rock Band Unplugged allowing you to take direct control of the lead/bass guitars, drums and vocals. In addition, players can expect a rich Rock Band experience with fully functional modes like World Tour, Band Survival and Warm Up and a robust character creator for full customization! Rock Band Unplugged features over 40 master-recordings including nine brand new, exclusive songs for the PSP system for a limited time! Plus, Rock Band Unplugged includes the first fully-featured in-game store for downloadable content on the PSP system in the North American and European markets, leveraging the PSP system's wireless capabilities. The in-game store is powered by PlayStation Network, and players can to use their existing PlayStation Network account to purchase tracks, similar to the Rock Band console experience. PSP system owners also have the option of purchasing tracks via PlayStation Store on the PC. [MTV Games]… Expand"
  },
  {
    "name": "The Path",
    "details_link": "https://www.metacritic.com/game/pc/the-path",
    "publisher": "Tale of Tales",
    "release_date": "Mar 18 2009",
    "developers": [
      "Tale of Tales"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "Fantasy",
      "Third-Person",
      "Fantasy"
    ],
    "meta_score": 79,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/3/4cc8f298390552c0e1a9f54b20bece07-98.jpg",
    "descriptions": "The Path is a short horror game inspired by older versions of Little Red Ridinghood, set in modern day. The Path offers an atmospheric experience of exploration, discovery and introspection through a unique form of gameplay, designed to immerse you deeply into its dark themes. EveryThe Path is a short horror game inspired by older versions of Little Red Ridinghood, set in modern day. The Path offers an atmospheric experience of exploration, discovery and introspection through a unique form of gameplay, designed to immerse you deeply into its dark themes. Every interaction in the game expresses an aspect of the narrative. The six protagonists each have their own age and personality and allow the player to live through the tale in different ways. Most of the story, however, relies on your active imagination. The Path is designed with accessibility in mind. There are no ticking clocks or monsters to defeat. No hard puzzles will ever halt your progress. Most activities in the game are entirely optional and voluntary. The player has all the freedom in the world to explore and experience. The Path is a Slow Game. Six sisters live in an apartment in the city. One by one their mother sends them on an errand to their grandmother, who is sick and bedridden. The teenagers are instructed to go to grandmother's house deep in the forest and, by all means, to stay on the path! Wolves are hiding in the woods, just waiting for little girls to stray. But young women are not exactly known for their obedience, are they? Will they be able to resist the tempations of the forest? Will they stay clear of danger? Can they prevent the ancient tale from being retold? [Tale of Tales]… Expand"
  },
  {
    "name": "Indivisible",
    "details_link": "https://www.metacritic.com/game/switch/indivisible",
    "publisher": "505 Games",
    "release_date": "Apr 28 2020",
    "developers": [
      "Lab Zero Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 79,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/5/c2225c7c900d43e1fbcf795ec47169ea-98.jpg",
    "descriptions": "INDIVISIBLE is inspired by classics like Valkyrie Profile and Metroid, and has the unique character, world, and gameplay depth Lab Zero is known for.\r Meet Ajna, Indivisible protagonist.\r\n\r\nAjna is a headstrong girl raised in a remote village. Her father, the town's guardian, has trainedINDIVISIBLE is inspired by classics like Valkyrie Profile and Metroid, and has the unique character, world, and gameplay depth Lab Zero is known for.\r Meet Ajna, Indivisible protagonist.\r Ajna is a headstrong girl raised in a remote village. Her father, the town's guardian, has trained her to be strong in mind and body to prepare her for things to come. Ajna discovers a mysterious power in herself, and sets off on a world-spanning journey. Along the way, a number of unique heroes will join her on her quest.… Expand"
  },
  {
    "name": "The Pinball of the Dead",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/the-pinball-of-the-dead",
    "publisher": "THQ",
    "release_date": "Jun 16 2002",
    "developers": [
      "Sega"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1 Player",
    "genres": [
      "Miscellaneous",
      "Parlor",
      "Pinball"
    ],
    "meta_score": 79,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/5/f5a17059feebf142b31c94c1eba94909-98.jpg",
    "descriptions": "You don't have to know or appreciate the source material to really enjoy The Pinball of the Dead."
  },
  {
    "name": "Metroid: Other M",
    "details_link": "https://www.metacritic.com/game/wii/metroid-other-m",
    "publisher": "Nintendo",
    "release_date": "Aug 31 2010",
    "developers": [
      "Team Ninja"
    ],
    "platforms": "Wii",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Action Adventure",
      "Shooter",
      "Sci-Fi",
      "Sci-Fi",
      "General",
      "Third-Person",
      "Sci-Fi"
    ],
    "meta_score": 79,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/0/563373f3bcf892b18174eeaab5fec900-98.jpg",
    "descriptions": "The game looks at the classic franchise from a new perspective: While much of the game is reminiscent of 2-D side-scrollers, players can switch the perspective into 3-D at any time as they explore the twisting passages of a derelict space station and delve deep into a cinematic,The game looks at the classic franchise from a new perspective: While much of the game is reminiscent of 2-D side-scrollers, players can switch the perspective into 3-D at any time as they explore the twisting passages of a derelict space station and delve deep into a cinematic, never-before-told story of bounty hunter Samus Aran's past. This new approach uses a new control scheme in which players use the Wii Remote  controller held sideways to battle enemies and navigate the expansive, gorgeous environments in classic Metroid  fashion, then aim at the screen with the Wii Remote pointer to blast foes in first-person and hunt the world for clues and hidden passages. [Nintendo]… Expand"
  },
  {
    "name": "Shantae and the Seven Sirens",
    "details_link": "https://www.metacritic.com/game/switch/shantae-and-the-seven-sirens",
    "publisher": "WayForward",
    "release_date": "May 28 2020",
    "developers": [
      "WayForward"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 79,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/5/916afa226a2e652df7ad3cf044b4b663-98.jpg",
    "descriptions": "New locations, abilities, and friends await in Shantae's biggest adventure yet!Shantae and the Seven Sirens sends the belly-dancing, hair-whipping, half-genie hero to a tropical island where Shantae and her friends encounter other Half-Genie allies, but they soon learn there's trouble inNew locations, abilities, and friends await in Shantae's biggest adventure yet!Shantae and the Seven Sirens sends the belly-dancing, hair-whipping, half-genie hero to a tropical island where Shantae and her friends encounter other Half-Genie allies, but they soon learn there's trouble in paradise. As Shantae gets caught up in the island's sinister secrets, she'll use all-new dance abilities and instant-transformation Fusion Magic to explore the nonlinear, interconnected world where she'll visit multiple towns, overcome treacherous labyrinths, and battle dastardly bosses. The game also features a new collectible card system that grants players the freedom to augment Shantae's powers to suit their own style of play. Key Features:* Explore an interconnected world using new Fusion Magic creature transformations, including a newt and other aquatic forms!* 4K-resolution hand-painted visuals (on 4K devices only)!* All-new characters and returning favorites like Rottytops, Sky, Bolo, and the nefarious Risky Boots!* Collect and power up with monster cards!* Enjoy minigames, acquire magic and items, and uncover secrets!* Gorgeously animated TV-style cutscenes!… Expand"
  },
  {
    "name": "Far Cry 6",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/far-cry-6",
    "publisher": "Ubisoft",
    "release_date": "Oct  7 2021",
    "developers": [
      "Ubisoft Toronto"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Stadia",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "2 ",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 79,
    "users_score": 5.4,
    "image": "https://static.metacritic.com/images/products/games/7/a162749fa1e429bef60d2f97c434555c-98.jpg",
    "descriptions": "Far Cry 6 reveals a Caribbean island simmering with revolutionary tension. The title features actor Giancarlo Esposito (“Better Call Saul,” “The Boys,” “The Mandalorian”) as President Anton Castillo, the violent leader who grips the island of Yara with an iron fist, promising a return to itsFar Cry 6 reveals a Caribbean island simmering with revolutionary tension. The title features actor Giancarlo Esposito (“Better Call Saul,” “The Boys,” “The Mandalorian”) as President Anton Castillo, the violent leader who grips the island of Yara with an iron fist, promising a return to its former glory. With an arsenal of weapons and allies at your back, you’ll take on Castillo’s regime and fight for the future of Yara. As Dani Rojas (playable as a female or male character), you will help stoke the fires of revolution through guerrilla warfare across the island of Yara, from verdant jungles to the urban streets of the capital city, Esperanza. You’ll use a powerful array of weapons and vehicles, and build a network of allies to fight alongside you, including Fangs for Hire like Chorizo, the dangerously distracting wiener dog. As President Castillo prepares his son Diego, played by Anthony Gonzalez (“Coco”), to succeed him, you will do all you can to ensure his plans don’t come to fruition. [Ubisoft]… Expand"
  },
  {
    "name": "Shin Megami Tensei: Devil Survivor 2",
    "details_link": "https://www.metacritic.com/game/ds/shin-megami-tensei-devil-survivor-2",
    "publisher": "Atlus",
    "release_date": "Feb 28 2012",
    "developers": [
      "Atlus"
    ],
    "platforms": "DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Strategy",
      "Turn-Based",
      "General",
      "General",
      "Tactics"
    ],
    "meta_score": 79,
    "users_score": 4.6,
    "image": "https://static.metacritic.com/images/products/games/0/9d14c80f3a49fd1237be411c71e0c5f9-98.jpg",
    "descriptions": "When a new website that shows the manner of people's deaths in advance makes the rounds amongst Japanese high schoolers, a trio of students is shocked to witness their own deaths in a terrible subway accident just minutes away. They narrowly escape the carnage, only to find themselves in aWhen a new website that shows the manner of people's deaths in advance makes the rounds amongst Japanese high schoolers, a trio of students is shocked to witness their own deaths in a terrible subway accident just minutes away. They narrowly escape the carnage, only to find themselves in a worse situation--facing otherworldly demons. Desperate to survive, they fend off the demons and flee, but the destruction at the station is only the beginning...… Expand"
  },
  {
    "name": "art of rally",
    "details_link": "https://www.metacritic.com/game/pc/art-of-rally",
    "publisher": "Funselektor Labs Inc.",
    "release_date": "Sep 23 2020",
    "developers": [
      "Funselektor Labs Inc."
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Racing",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 79,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/0/5090ed7ab7fe952b684c53bb12b3928a-98.jpg",
    "descriptions": "Race in the golden era of rally. Drive iconic cars from the 60s to Group B on challenging stages through stylized environments inspired by real worldwide locations. Will you master the art of rally?"
  },
  {
    "name": "Valfaris",
    "details_link": "https://www.metacritic.com/game/switch/valfaris",
    "publisher": "Big Sugar Films",
    "release_date": "Oct 10 2019",
    "developers": [
      "Steel Mantis"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 79,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/1/aa85d9df418635022cdbe580392ce63b-98.jpg",
    "descriptions": "Set in a far corner of space, Valfaris is a heavy metal infused 2D action-platformer and the next game from the team behind Unity Awards finalist, Slain: Back From Hell. Brutal combat. Deadly enemies. Stunning pixel art. Savage soundtrack. Get ready to rip the galaxy a new wormhole."
  },
  {
    "name": "Dungeon of the Endless",
    "details_link": "https://www.metacritic.com/game/pc/dungeon-of-the-endless",
    "publisher": "Amplitude Studios",
    "release_date": "Oct 27 2014",
    "developers": [
      "Amplitude Studios"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Strategy",
      "Real-Time",
      "General",
      "Fantasy"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/8/a10223b20f497691313b0d0ab944d218-98.jpg",
    "descriptions": "Dungeon of the Endless is a Rogue-Like Dungeon-Defense game, in which the player and their team of heroes must protect the generator of their crashed ship while exploring an ever-expanding dungeon, all while facing waves of monsters and special events as they try to find their way out... soDungeon of the Endless is a Rogue-Like Dungeon-Defense game, in which the player and their team of heroes must protect the generator of their crashed ship while exploring an ever-expanding dungeon, all while facing waves of monsters and special events as they try to find their way out... so what could go wrong... open the door! … Expand"
  },
  {
    "name": "Sesame Street: Once Upon a Monster",
    "details_link": "https://www.metacritic.com/game/xbox-360/sesame-street-once-upon-a-monster",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "Oct 11 2011",
    "developers": [
      "Double Fine Productions"
    ],
    "platforms": "Xbox 360",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Edutainment",
      "Adventure",
      "3D",
      "Fantasy",
      "Third-Person",
      "Fantasy"
    ],
    "meta_score": 79,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/7/9dce130b1178bb740cfa1ef7b5ac010e-98.jpg",
    "descriptions": "Sesame Street: Once Upon a Monster is an uplifting and funny, family adventure game playable on Kinect for Xbox 360. Players join favorite Sesame Street characters Elmo, Cookie Monster, Oscar, Grover and all new characters as they discover a long lost children's book titled Once Upon aSesame Street: Once Upon a Monster is an uplifting and funny, family adventure game playable on Kinect for Xbox 360. Players join favorite Sesame Street characters Elmo, Cookie Monster, Oscar, Grover and all new characters as they discover a long lost children's book titled Once Upon a Monster. As they read, they join the action to become part of a living storybook adventure, helping new monster friends with their problems by exploring the book chapter by chapter, page by page. It features active co-op gameplay that is specially designed for sibling and/or parent-child co-play; and teaches social, emotional, and other important life lessons through its colorful and whimsical gameplay. … Expand"
  },
  {
    "name": "Revenge of the Titans",
    "details_link": "https://www.metacritic.com/game/pc/revenge-of-the-titans",
    "publisher": "Puppy Games",
    "release_date": "May 24 2010",
    "developers": [
      "Puppy Games"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Real-Time",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 79,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/0/f5f4bb55ff389af722a7d0b77abe8854-98.jpg",
    "descriptions": "Construct and command your ground defences in a series of increasingly massive battles across the solar system, in our frenetic arcade mash-up of Real Time Strategy and Tower Defence!"
  },
  {
    "name": "Bookworm Adventures: Volume 2",
    "details_link": "https://www.metacritic.com/game/pc/bookworm-adventures-volume-2",
    "publisher": "PopCap",
    "release_date": "Jul 30 2009",
    "developers": [
      "PopCap"
    ],
    "platforms": "PC",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Puzzle",
      "Puzzle",
      "Logic",
      "Logic"
    ],
    "meta_score": 79,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/0/2778f98f4b27630c723c271512a59413-98.jpg",
    "descriptions": "The vocabularious sequel to the hit PopCap word game. Stop the presses! The walls of fiction are collapsing as characters run wild through the Great Library, and only Lex the Bookworm can save the world from certain doom! Build words and battle monsters to survive three storybooks with 10The vocabularious sequel to the hit PopCap word game. Stop the presses! The walls of fiction are collapsing as characters run wild through the Great Library, and only Lex the Bookworm can save the world from certain doom! Build words and battle monsters to survive three storybooks with 10 chapters each. Trade barbs, banter and body blows with over 130 foes, and earn help from fighting friends along the way! The better the word, the badder the damage - so power up with over 20 treasures, including all-new Rainbow Tiles. Work wordy wonders in all four game modes and flex your lexicon in six mini-games. It's a role-playing word game you can't set down! Survive three all-new books with 10 chapters each: Fractured Fairytales, The Monkey King and Astounding Planet! Wield 20+ powerful new treasures against over 130 ferocious new foes! Combine forces with six colorful companions including Mother Goose, the Cheshire Cat and the mischievous Monkey King! Play four game modes: Adventure, Mini-Games, Arena and the infinite Replay mode. [PopCap Games]… Expand"
  },
  {
    "name": "R-Type Final",
    "details_link": "https://www.metacritic.com/game/playstation-2/r-type-final",
    "publisher": "Eidos Interactive",
    "release_date": "Feb  3 2004",
    "developers": [
      "Irem"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "Scrolling"
    ],
    "meta_score": 79,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/1/6da18b5a2a2c2355ca90976efcc3268f-98.jpg",
    "descriptions": "It all began in 1987 with a revolutionary arcade shooter called R-Type. Now the classic shooter is back for a final appearance with new features and the same exciting, revolutionary gameplay that started it all. Use the unique Force System to power-up your ship as you choose and send it intoIt all began in 1987 with a revolutionary arcade shooter called R-Type. Now the classic shooter is back for a final appearance with new features and the same exciting, revolutionary gameplay that started it all. Use the unique Force System to power-up your ship as you choose and send it into battle against the evil Bydo. With over 100 ships to choose from and an almost unlimited amount of customization options, R-Type Final is the definitive shooter on the PlayStation2. [Eidos Interactive]… Expand"
  },
  {
    "name": "Hunter: The Reckoning",
    "details_link": "https://www.metacritic.com/game/xbox/hunter-the-reckoning",
    "publisher": "Interplay",
    "release_date": "May 21 2002",
    "developers": [
      "High Voltage Software"
    ],
    "platforms": [
      "Xbox 360",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 79,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/4/990bbf14cd0c45a1821141c5bd64a169-98.jpg",
    "descriptions": "Set in White Wolf's World of Darkness, Hunter: The Reckoning lets you take the role of one of four different hunters--Deuce, a biker ex-con; Father Cortez, a prison chaplain; Kassandra, a raver chick; and Samantha, a tough ex-cop. Armed with a variety of fearsome weaponry--ranging from axesSet in White Wolf's World of Darkness, Hunter: The Reckoning lets you take the role of one of four different hunters--Deuce, a biker ex-con; Father Cortez, a prison chaplain; Kassandra, a raver chick; and Samantha, a tough ex-cop. Armed with a variety of fearsome weaponry--ranging from axes to shotguns--you'll battle it out with hordes of supernatural enemies. Intense action combined with multiplayer support brings the true spirit of Hunter: The Reckoning to life.… Expand"
  },
  {
    "name": "F1 2001",
    "details_link": "https://www.metacritic.com/game/pc/f1-2001",
    "publisher": "EA Sports",
    "release_date": "Oct  2 2001",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "Formula One",
      "Formula One",
      "Automobile"
    ],
    "meta_score": 79,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/9/e26b61df4b81844d181cbba32ad81a50-98.jpg",
    "descriptions": "Engage in high stakes racing from Monaco to Monza and take on the most intelligent and daring racers to hit the Formula One circuit. Includes all the drivers, tracks and teams from the official FIA 2001 Formula OneWorld Championship. [EA Sports]"
  },
  {
    "name": "Tokyo Xtreme Racer 2",
    "details_link": "https://www.metacritic.com/game/dreamcast/tokyo-xtreme-racer-2",
    "publisher": "Crave",
    "release_date": "Sep  1 2000",
    "developers": [
      "Genki"
    ],
    "platforms": "Dreamcast",
    "genres": [
      "Driving",
      "Mission-based"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/0/7ee5d10f04dc677a2215648ed185c5d6-98.jpg",
    "descriptions": "Screaming around a blind turn, you cut your opponent off, driving him head-on into the divider. Toast. This is the world of Tokyo Xtreme Racer 2, a blistering battle to rule the streets of Tokyo. With an endless supply of bloodthirsty rivals, it's a high-adrenaline fight to become Emperor ofScreaming around a blind turn, you cut your opponent off, driving him head-on into the divider. Toast. This is the world of Tokyo Xtreme Racer 2, a blistering battle to rule the streets of Tokyo. With an endless supply of bloodthirsty rivals, it's a high-adrenaline fight to become Emperor of the Streets. Customize your car with hundreds of parts and features. Cruise over 100 miles of highly-detailed of Tokyo highway. Personalize your team logo and share or trade it. Hundreds of new opponents and teams push your skills to the max.… Expand"
  },
  {
    "name": "Star Wars: Squadrons",
    "details_link": "https://www.metacritic.com/game/pc/star-wars-squadrons",
    "publisher": "Electronic Arts",
    "release_date": "Oct  1 2020",
    "developers": [
      "Motive Studios"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Simulation",
      "Space",
      "Combat"
    ],
    "meta_score": 79,
    "users_score": 5.8,
    "image": "https://static.metacritic.com/images/products/games/9/40df25a9607f9f890d56dfb0e58dd8d2-98.jpg",
    "descriptions": "Master the art of starfighter combat in the authentic piloting experience Star Wars: Squadrons. Buckle up and feel the adrenaline of first-person multiplayer space dogfights alongside your squadron. Pilots who enlist will step into the cockpits of starfighters from both the New Republic andMaster the art of starfighter combat in the authentic piloting experience Star Wars: Squadrons. Buckle up and feel the adrenaline of first-person multiplayer space dogfights alongside your squadron. Pilots who enlist will step into the cockpits of starfighters from both the New Republic and Imperial fleets and fight in strategic 5 vs. 5 space battles. Modify your starfighter and adjust the composition of your squadron to suit varying playstyles and crush the opposition. Pilots will triumph as a team and complete tactical objectives across known and never-before-seen battlefields, including the gas giant of Yavin Prime and the shattered moon of Galitan.\r Take control of starfighters such as the X-wing and TIE fighter. Customize loadouts and cosmetics, divert power between weapons, shields, and engines, while immersing yourself in the cockpit. In addition, players will have the option to play the entirety of the game in virtual reality on PSVR and PC!\r Learn what it means to be a pilot in a thrilling Star Wars single-player story set after the events of Return of the Jedi. Seen from alternating perspectives between two factions, iconic and emerging leaders on both sides are battling for the galaxy. The New Republic fights for freedom. The Empire demands order. We need you to join the galaxy's finest.… Expand"
  },
  {
    "name": "Voice of Cards: The Forsaken Maiden",
    "details_link": "https://www.metacritic.com/game/switch/voice-of-cards-the-forsaken-maiden",
    "publisher": "Square Enix",
    "release_date": "Feb 17 2022",
    "developers": [
      "Square Enix",
      "A-lim"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch"
    ],
    "genres": [
      "Strategy",
      "Turn-Based",
      "Card Battle"
    ],
    "meta_score": 79,
    "users_score": 6.1,
    "image": "https://static.metacritic.com/images/products/games/2/fd7db6b42da67dff88b17cc21bd8e5ef-98.jpg",
    "descriptions": "Set sail on a voyage to change destiny itself. Voice of Cards: The Forsaken Maiden is set on a remote chain of islands that have been protected by the maidens for generations, but which now face destruction. The hero of the story vows to save the islanders and sets sail for the high seas,Set sail on a voyage to change destiny itself. Voice of Cards: The Forsaken Maiden is set on a remote chain of islands that have been protected by the maidens for generations, but which now face destruction. The hero of the story vows to save the islanders and sets sail for the high seas, together with Laty, a girl who failed to become a maiden.\r The second game in the unique Voice of Cards series, where all elements are presented entirely through the medium of cards, in the tradition of tabletop RPGs and gamebooks.\r A touching tale set in a world of melancholic beauty, brought to you by YOKO TARO (Creative Director), Keiichi Okabe (Music Director) and Kimihiko Fujisaka (Character Designer).\r *This game is not a direct sequel to Voice of Cards: The Isle Dragon Roars. Both stories can be enjoyed as standalone game experiences.\r*This product is also included in other bundles sold separately. Please take care not to re-purchase the same content.\r* Please be aware that parts of the game which require an internet connection may cease to be supported at any point.\r… Expand"
  },
  {
    "name": "Strong Bad's Cool Game for Attractive People Episode 3: Baddest of the Bands",
    "details_link": "https://www.metacritic.com/game/wii/strong-bads-cool-game-for-attractive-people-episode-3-baddest-of-the-bands",
    "publisher": "Telltale Games",
    "release_date": "Oct 27 2008",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "PC",
      "Wii"
    ],
    "genres": [
      "Miscellaneous",
      "Adventure",
      "General",
      "Compilation"
    ],
    "meta_score": 79,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/4/5efa8e1d20c379fe814ac24e3e0c5078-98.jpg",
    "descriptions": "[WiiWare]  Rock and roll! Hurting for cash, Strong Bad sets out to dominate the \"Battle Royale of the Bands.\" Can he rule the stage and win the big prize? Or will he be drowned out by the competition? Find out in this high-voltage episode! [TellTale Games]"
  },
  {
    "name": "Street Fighter X Tekken",
    "details_link": "https://www.metacritic.com/game/playstation-vita/street-fighter-x-tekken",
    "publisher": "Capcom",
    "release_date": "Oct 23 2012",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "PlayStation Vita"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "3D",
      "2D",
      "3D"
    ],
    "meta_score": 79,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/0/d85cc6c8d6546b1839bb8ebb6383a7e5-98.jpg",
    "descriptions": "\"Street Fighter\" is best known for its well-polished 2D game play, and \"Street Fighter IV\" is an exemplary addition to the series. And now, based on the \"Street Fighter IV\" engine, the \"TEKKEN\" characters will be stepping into the ring to fight.\"Street Fighter\" is best known for its well-polished 2D game play, and \"Street Fighter IV\" is an exemplary addition to the series. And now, based on the \"Street Fighter IV\" engine, the \"TEKKEN\" characters will be stepping into the ring to fight. Featuring two on two \"Tag Team Fighting\", and together with Battle and Training Modes, this title will push the series beyond its limits. … Expand"
  },
  {
    "name": "Gears of War 2: All Fronts Collection",
    "details_link": "https://www.metacritic.com/game/xbox-360/gears-of-war-2-all-fronts-collection",
    "publisher": "Microsoft Game Studios",
    "release_date": "Jul 28 2009",
    "developers": [
      "Epic Games"
    ],
    "platforms": "Xbox 360",
    "num_players": "10  Online",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/0/d7e9c4996135cd28e9c83c2997b7570e-98.jpg",
    "descriptions": "[Dowloadable Content]  This downloadable content pack features 7 new Gears 2 multiplayer maps and a bonus deleted single-player chapter, \"Road to Ruin,\" from the Gears of War 2 campaign. In \"Road to Ruin,\" Marcus and Dom navigate the treacherous Locust highway, choosing stealth or blazing[Dowloadable Content]  This downloadable content pack features 7 new Gears 2 multiplayer maps and a bonus deleted single-player chapter, \"Road to Ruin,\" from the Gears of War 2 campaign. In \"Road to Ruin,\" Marcus and Dom navigate the treacherous Locust highway, choosing stealth or blazing action to survive. For multiplayer fans, the 7 maps include a new War Machine, the much-requested Gears 1 map; Allfathers Garden, a heavy-weapons battle at a COG landmark; Highway, a fight deep in the Locust Hollow; Memorial, a battle at the Tomb of the Unknowns; Nowhere, a firefight in an old motel; Way Station, an unpredictable battlefield with parallel paths; and Sanctuary, a reimagined favorite from Gears for Windows. [Microsoft]… Expand"
  },
  {
    "name": "Brothers in Arms: Hell's Highway",
    "details_link": "https://www.metacritic.com/game/pc/brothers-in-arms-hells-highway",
    "publisher": "Ubisoft",
    "release_date": "Oct  7 2008",
    "developers": [
      "Gearbox Software"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Historic",
      "Historic",
      "Arcade"
    ],
    "meta_score": 79,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/1/1ce6e4ad57a7b105ba5cf5f98fce6701-98.jpg",
    "descriptions": "Brothers In Arms: Hell's Highway brings the critically acclaimed squad-based WWII shooter into the next generation of gaming with amazing graphics and sound, new cutting-edge gameplay features and a completely redesigned online component. Delivering on the franchise's compelling story,Brothers In Arms: Hell's Highway brings the critically acclaimed squad-based WWII shooter into the next generation of gaming with amazing graphics and sound, new cutting-edge gameplay features and a completely redesigned online component. Delivering on the franchise's compelling story, unrivaled authenticity and intense squad-based action, Brothers In Arms Hell's Highway drops you into Operation Market-Garden, the largest airborne operation of World War II. Lead Matt Baker, Joe Hartsock and the rest of the 101st Airborne Division as they fight to open \"Hell's Highway\" in a daring bid for a quick end to the war. [Ubisoft]… Expand"
  },
  {
    "name": "Banjo-Kazooie: Nuts & Bolts",
    "details_link": "https://www.metacritic.com/game/xbox-360/banjo-kazooie-nuts-bolts",
    "publisher": "Microsoft Game Studios",
    "release_date": "Nov 11 2008",
    "developers": [
      "Rare Ltd."
    ],
    "platforms": "Xbox 360",
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "3D",
      "3D"
    ],
    "meta_score": 79,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/0/7c19aea8f6d6c0beec0273c7d8cba90b-98.jpg",
    "descriptions": "Banjo-Kazooie: Nuts & Bolts embraces new and old fans alike, as the famous bear and bird duo return in high definition for a unique adventure of epic proportions. The Lord of the Games (aka LOG) is tired of the petty squabbling between Banjo and the evil witch Gruntilda (aka Grunty) over theBanjo-Kazooie: Nuts & Bolts embraces new and old fans alike, as the famous bear and bird duo return in high definition for a unique adventure of epic proportions. The Lord of the Games (aka LOG) is tired of the petty squabbling between Banjo and the evil witch Gruntilda (aka Grunty) over the years, and has arranged a showdown to decide the rightful owner of Spiral Mountain. Claiming to have created every video game ever made, LOG has built the game worlds in which the contest's challenges take place. Banjo must complete LOG's challenges to win, while Grunty tries to stop him using every method her devious mind can muster. Throughout their adventure, players create their own abilities by building vehicles for Banjo to pilot over land, water and air. Vehicle parts, which range from simple devices such as engines and wheels to more unusual equipment such as springs and egg guns, are earned and collected throughout the game. Players use their imagination to combine parts in any order to create whatever vehicle they choose. LOG's challenges have one goal, but players' choice of vehicle and tactics determine how they get there. By exploring worlds and solving puzzles, players both young and old are rewarded with more advanced and diverse vehicle parts in their quest to defeat Grunty once and for all. You can play through the adventure alone in the single-player campaign, or play with friends in competitive or cooperative challenges on your own or in teams. [Microsoft]… Expand"
  },
  {
    "name": "Sam & Max Save the World Remastered",
    "details_link": "https://www.metacritic.com/game/playstation-4/sam-max-save-the-world-remastered",
    "publisher": "Skunkape Games",
    "release_date": "Sep 29 2022",
    "developers": [
      "Skunkape Games"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Point-and-Click"
    ],
    "meta_score": 79,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/8/ba52224e173cfa40f507dbdc3b6c0ed4-98.jpg",
    "descriptions": "Sam is a six-foot canine detective with a love of justice. Max is a hyperkinetic rabbity-thing with a taste for mayhem.Together, they're the Freelance Police. And they're about to save the world.\n\nIt's just another day at the office for the self-proclaimed Freelance Police when theSam is a six-foot canine detective with a love of justice. Max is a hyperkinetic rabbity-thing with a taste for mayhem.Together, they're the Freelance Police. And they're about to save the world.It's just another day at the office for the self-proclaimed Freelance Police when the Commissioner calls in with a disturbing report: former child stars are running amok in the street! What starts as an open-and-shut case of idiotic vandalism balloons into an all-out conspiracy as Sam and Max encounter one miscreant after another who have been mysteriously hypnotized. (You can tell from the \"spinny thing\" they do with their eyes.)Return to the adventure game that was once called \"gaming's first sitcom\" and is today known as \"the remaster you didn't know you were waiting for.\" With enhanced graphics, an original jazz score with five new tracks, and the same brain-tickling puzzles and offbeat humor that won it IGN's Best Adventure GOTY award back in the day, Sam & Max Save the World Remastered is a modern classic that will be right at home in your library.… Expand"
  },
  {
    "name": "Tormented Souls",
    "details_link": "https://www.metacritic.com/game/switch/tormented-souls",
    "publisher": "PQube",
    "release_date": "Apr 14 2022",
    "developers": [
      "Dual Effect"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 79,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/5/48783c69f7e0753ca8b296617454b2d2-98.jpg",
    "descriptions": "While investigating the disappearance of twin girls at Winterlake - something terrible happens to Caroline Walker. Waking in the dead of night, naked in a bathtub - and hooked up to some decrepit medical equipment, Caroline must fight for her life as she explores the halls of an abandonedWhile investigating the disappearance of twin girls at Winterlake - something terrible happens to Caroline Walker. Waking in the dead of night, naked in a bathtub - and hooked up to some decrepit medical equipment, Caroline must fight for her life as she explores the halls of an abandoned Mansion turned hospital.\r Tormented Souls deliberately sets out to draw inspiration from classic survival horror. From Resident Evil and Silent Hill, to Alone in the Dark - Tormented Souls is a modern take on the fixed-perspective adventure, offering a modernised control scheme and a more dynamic camera, while retaining everything that made those games so beloved by fans.… Expand"
  },
  {
    "name": "Time Loader",
    "details_link": "https://www.metacritic.com/game/pc/time-loader",
    "publisher": "Flazm",
    "release_date": "Nov  3 2021",
    "developers": [
      "Flazm"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Puzzle",
      "Action",
      "General"
    ],
    "meta_score": 79,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/5/1d840ad75be5d5b4bb8f2b16634d2bbf-98.jpg",
    "descriptions": "Time Loader is a story-driven, physics-based puzzle platformer with a twist. At the helm of a small robot, you'll travel back to the 90s to prevent a tragic accident. Explore the house of your creator, solve brain-teasing puzzles, acquire unique and powerful upgrades, and see commonTime Loader is a story-driven, physics-based puzzle platformer with a twist. At the helm of a small robot, you'll travel back to the 90s to prevent a tragic accident. Explore the house of your creator, solve brain-teasing puzzles, acquire unique and powerful upgrades, and see common household items from an entirely new perspective!But remember: meddling with time has serious consequences. You may succeed in changing the past, but can you deal with the result of your actions?… Expand"
  },
  {
    "name": "Tangledeep",
    "details_link": "https://www.metacritic.com/game/switch/tangledeep",
    "publisher": "Impact Gameworks",
    "release_date": "Jan 31 2019",
    "developers": [
      "Impact Gameworks"
    ],
    "platforms": [
      "PC",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Roguelike"
    ],
    "meta_score": 79,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/0/08702dc6bb2a3cfe0a40d27d41760403-98.jpg",
    "descriptions": "Enter the magical world of Tangledeep, a beautifully polished dungeon crawler inspired by classic 16-bit RPGs! Colorful characters, a unique job system, tons of skills, items, and diverse environments with deep, turn-based roguelike gameplay. A different adventure every time you play."
  },
  {
    "name": "Slayaway Camp: Butcher's Cut",
    "details_link": "https://www.metacritic.com/game/switch/slayaway-camp-butchers-cut",
    "publisher": "Digerati Distribution",
    "release_date": "Mar 22 2018",
    "developers": [
      "Blue Wizard Digital"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation Vita",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Puzzle",
      "Action"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/6/44e009be783846cf749d3de5268bb36d-98.jpg",
    "descriptions": "A killer puzzle game where you control Skullface, a psychotic slasher hell-bent on revenge. Slide this adorably demented murderer around hundreds of isometric puzzle levels to squash, flay, and decapitate hapless victims in this darkly comic homage to 80s horror movies. [Nintendo]"
  },
  {
    "name": "Detention",
    "details_link": "https://www.metacritic.com/game/switch/detention",
    "publisher": "Coconut Island Games",
    "release_date": "Mar  1 2018",
    "developers": [
      "Red Candle Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 79,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/7/a4c9cf948a033ef0adb1f698230e9f48-98.jpg",
    "descriptions": "Detention is a unique atmospheric horror game heavily influenced by Taiwanese/East Asian culture, religious elements and mythology. Based on the 1960s Taiwan under martial law, in this 2D atmospheric horror side-scroller, the player control characters who venture into the school beset byDetention is a unique atmospheric horror game heavily influenced by Taiwanese/East Asian culture, religious elements and mythology. Based on the 1960s Taiwan under martial law, in this 2D atmospheric horror side-scroller, the player control characters who venture into the school beset by hostile supernatural events to uncover stories behind the haunted place. Incorporated the game provided players with unique graphics and gaming experience. [Nintendo]… Expand"
  },
  {
    "name": "Space Invaders Extreme",
    "details_link": "https://www.metacritic.com/game/pc/space-invaders-extreme",
    "publisher": "Degica",
    "release_date": "Feb 12 2018",
    "developers": [
      "Taito Corporation"
    ],
    "platforms": [
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shoot-'Em-Up",
      "Vertical"
    ],
    "meta_score": 79,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/8/a72a5cccb66f70f1891de357e251be86-98.jpg",
    "descriptions": "SPACE INVADERS EXTREME combines the captivating essence of the original game with a stunning alliance of futuristic graphic design and cutting-edge audio. The gameplay experience has been developed to maximise on the consoles' abilities, offering players a whole new range of amazing featuresSPACE INVADERS EXTREME combines the captivating essence of the original game with a stunning alliance of futuristic graphic design and cutting-edge audio. The gameplay experience has been developed to maximise on the consoles' abilities, offering players a whole new range of amazing features including a vast array of new power-ups.… Expand"
  },
  {
    "name": "The Metronomicon: Slay the Dance Floor",
    "details_link": "https://www.metacritic.com/game/playstation-4/the-metronomicon-slay-the-dance-floor",
    "publisher": "Akupara Games",
    "release_date": "Aug 29 2017",
    "developers": [
      "Puuba"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Rhythm",
      "Music"
    ],
    "meta_score": 79,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/2/c822a798abcfecb1d09c126aa5fc75d4-98.jpg",
    "descriptions": "Packing in a fully-fledged story mode with a colorful cast of musically-empowered heroes and villains, The Metronomicon sees you take control a party of eight newly graduated masters of the rhythmic combat arts to wage musical warfare against a multitude of dance-mongering fiends.\r ByPacking in a fully-fledged story mode with a colorful cast of musically-empowered heroes and villains, The Metronomicon sees you take control a party of eight newly graduated masters of the rhythmic combat arts to wage musical warfare against a multitude of dance-mongering fiends.\r By switching between four concurrent hero-controlled tracks on-the-fly, youll select and activate a wide array of abilities and spells, buffs and nukes, with your performance and timing all-important in ensuring the effectiveness of your moves. In the RPG spirit, youll need to improve your characters stats, hunt down powerful equipment, and combine a multitude of newly-learned abilities  switching between tanking, healing, buffing, and damage-dealing classes as required in real time.… Expand"
  },
  {
    "name": "SOMA",
    "details_link": "https://www.metacritic.com/game/playstation-4/soma",
    "publisher": "Frictional Games",
    "release_date": "Sep 22 2015",
    "developers": [
      "Frictional Games"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Horror",
      "Horror",
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 79,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/4/ce1ec2b7527419f09916162a1f1c6d65-98.jpg",
    "descriptions": "Strange occurrences are disrupting the routines of the PATHOS-2 research facility. The radio is silent. Behavioral anomalies of the machines are increasingly dangerous, if not... malevolent. The facility is devolving into chaos. No weapons, and the only escape is practically unthinkable.Strange occurrences are disrupting the routines of the PATHOS-2 research facility. The radio is silent. Behavioral anomalies of the machines are increasingly dangerous, if not... malevolent. The facility is devolving into chaos. No weapons, and the only escape is practically unthinkable. From Frictional Games, creators of the Amnesia and Penumbra series, SOMA is an aberrant tale of scientific inquiry and survival; an entropic exploration of synapse and circuit that wades through the delusions of human consciousness.\r… Expand"
  },
  {
    "name": "Star Wars: Empire at War",
    "details_link": "https://www.metacritic.com/game/pc/star-wars-empire-at-war",
    "publisher": "LucasArts",
    "release_date": "Feb 15 2006",
    "developers": [
      "Petroglyph"
    ],
    "platforms": "PC",
    "num_players": "8  Online",
    "genres": [
      "Strategy",
      "Real-Time",
      "Sci-Fi",
      "Sci-Fi",
      "General"
    ],
    "meta_score": 79,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/9/f381ca6ec4077133b7e5bf0ca60fcf04-98.jpg",
    "descriptions": "Set a few years before the events of \"Episode IV A New Hope,\" the game lets players rewrite history as well as experience the aftermath of \"Star Wars: Episode III Revenge of the Sith,\" the creation of the Rebel Alliance, and Darth Vader's rise to power. Using an entirely new game engineSet a few years before the events of \"Episode IV A New Hope,\" the game lets players rewrite history as well as experience the aftermath of \"Star Wars: Episode III Revenge of the Sith,\" the creation of the Rebel Alliance, and Darth Vader's rise to power. Using an entirely new game engine created by the Las Vegas-based developer Petroglyph, Star Wars: Empire at War features beautifully rendered land and space battles set on memorable planets such as Hoth, Tatooine and Dagobah as well as never-before-seen environments taken directly from the Star Wars films and expanded universe novels. In the game, players can choose to join either the Rebel Alliance or the Galactic Empire, building and setting up tactical forces that can be unleashed on the enemy in real-time 3D. All of the gameplay and action within Star Wars: Empire at War is a persistent, meaning that strategic and tactical elements from previous events will have a permanent effect on the galaxy. As players build, manage and progress their space and ground-based units, troops and vehicles, memorable Star Wars hero characters will begin playing a role in key situations. In addition to the single player campaign mode, the game includes a two-player Empire vs. Rebellion mode and up to eight player online skirmish modes. [LucasArts]… Expand"
  },
  {
    "name": "The Bigs",
    "details_link": "https://www.metacritic.com/game/xbox-360/the-bigs",
    "publisher": "2K Sports",
    "release_date": "Jun 25 2007",
    "developers": [
      "Blue Castle Games"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Baseball",
      "Arcade",
      "Arcade"
    ],
    "meta_score": 79,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/9/4887192b4f52918ab507e2146e863925-98.jpg",
    "descriptions": "This over-the-top baseball action title puts an entirely new spin on Major League Baseball as it blends outrageous visuals and intuitive gameplay mechanics to bring fans a brand new MLB video game experience. Fans redefine the baseball highlight reel by performing dramatic wall grabs,This over-the-top baseball action title puts an entirely new spin on Major League Baseball as it blends outrageous visuals and intuitive gameplay mechanics to bring fans a brand new MLB video game experience. Fans redefine the baseball highlight reel by performing dramatic wall grabs, spectacular diving plays, and epic homeruns. Unique and intuitive gameplay controls deliver a new baseball experience, while advanced power-up mechanics add exciting depth with each turn. Turbo gameplay raises the action bar, and culminates in the ultimate batter pitcher power-up duel, where either the pitcher's Big Heat will be the turning point, or the batter’s Power Blast will be the explosive end to the game. In The BIGS, every play is a big play. Each MLB player has been individualized to emphasize their extraordinary athletic attributes. The development team paid great attention to detail to portray a player's face and physical characteristics so baseball fans will easily recognize their favorite players. To deliver the authentic MLB atmosphere, stadium landmarks have been stylized to highlight the unique architecture of each MLB ballpark. Whether it's the glove at San Francisco's AT&T Park resized to mammoth proportions or the left field wall in Boston's Fenway Park made into a real \"Green Monster,\" gamers will be in awe at the grandeur of each stadium in The BIGS. [2K Sports]… Expand"
  },
  {
    "name": "EA Sports MMA",
    "details_link": "https://www.metacritic.com/game/xbox-360/ea-sports-mma",
    "publisher": "EA Sports",
    "release_date": "Oct 19 2010",
    "developers": [
      "EA Tiburon"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 10 ",
    "genres": [
      "Action",
      "Sports",
      "Fighting",
      "Fighting",
      "Individual",
      "Wrestling",
      "Wrestling",
      "Combat",
      "Boxing / Martial Arts"
    ],
    "meta_score": 79,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/1/6a1d80689d3962f1562cde6079efc3e8-98.jpg",
    "descriptions": "EA SPORTS MMA promises to feature the most authentic, intense and broad mixed martial arts experience to date - complete with a vast array of top fighters and fighting styles from around the world. [Electronic Arts]"
  },
  {
    "name": "Knights and Bikes",
    "details_link": "https://www.metacritic.com/game/playstation-4/knights-and-bikes",
    "publisher": "Double Fine Productions",
    "release_date": "Aug 27 2019",
    "developers": [
      "Foam Sword"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "2 ",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 79,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/6/bf2ec755589c9da1e42604e4f3a25d29-98.jpg",
    "descriptions": "KNIGHTS AND BIKES is a hand-painted action-adventure for 1 or 2 players, set on a British island in the 1980s. It's a coming-of-age story starring Nessa & Demelza, exploring the coasts of Penfurzy on their trusty bikes, looking for a legendary lost treasure in a Goonies-inspired tale ofKNIGHTS AND BIKES is a hand-painted action-adventure for 1 or 2 players, set on a British island in the 1980s. It's a coming-of-age story starring Nessa & Demelza, exploring the coasts of Penfurzy on their trusty bikes, looking for a legendary lost treasure in a Goonies-inspired tale of excitement, danger, fun and friendship.… Expand"
  },
  {
    "name": "Moonglow Bay",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/moonglow-bay",
    "publisher": "Coatsink Software",
    "release_date": "Oct  7 2021",
    "developers": [
      "Bunnyhug"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "General",
      "Management",
      "Business / Tycoon"
    ],
    "meta_score": 79,
    "users_score": 4.8,
    "image": "https://static.metacritic.com/images/products/games/9/e5a4a5c74a8cab4e94c6f7e075138514-98.jpg",
    "descriptions": "In Moonglow Bay, you play as a rookie angler, working together with friends, family, and neighbours to hone your fishing skills, nourish relationships, and restore a remote town’s fractured community."
  },
  {
    "name": "Little Nightmares II",
    "details_link": "https://www.metacritic.com/game/xbox-one/little-nightmares-ii",
    "publisher": "Bandai Namco Games",
    "release_date": "Feb 11 2021",
    "developers": [
      "Tarsier Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Stadia",
      "Switch",
      "Xbox Series X",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Linear"
    ],
    "meta_score": 79,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/5/c6741f79ed5c8f548665b8d02b4058f3-98.jpg",
    "descriptions": "Little Nightmares II is a suspense-adventure game in which you play as Mono, a young boy trapped in a world that has been distorted by a mysterious transmission from a distant signal tower. With Six, the girl in a yellow raincoat, Mono sets out to discover the dark secrets of The SignalLittle Nightmares II is a suspense-adventure game in which you play as Mono, a young boy trapped in a world that has been distorted by a mysterious transmission from a distant signal tower. With Six, the girl in a yellow raincoat, Mono sets out to discover the dark secrets of The Signal Tower and save Six from her terrible fate; but their journey will not be easy as Mono and Six will face an array of new threats from the terrible residents of this world. Will you dare face this collection of new, little nightmares? PLAY A DARK, THRILLING, SUSPENSE ADVENTURE: A host of brand-new residents lie in wait to haunt your steps and disturb your sleep. Outsmart the sadistic teacher, survive the bloodthirsty hunter and flee from many more terrifying characters, as Mono and Six journey through this world together. DISCOVER A FANTASTICAL WORLD CORRUPTED BY THE SIGNAL TOWER: Escape a world that’s rotten from the inside. Your journey will take you from creepy woodlands to sinister schools on your way to the dreadful Signal Tower. Find the source of the evil that spreads through the TV screens of the world. AWAKEN YOUR INNER CHILD TO SAVE SIX FROM THE DARKNESS: Six is fading from this world, and her only hope is to journey with Mono to find what has afflicted her from the Signal Tower. In this world of unknown terrors, you are her only beacon of hope. Can you gather up the courage to fend off your tormenters, and work with Six to make sense of The Signal Tower? … Expand"
  },
  {
    "name": "Hotshot Racing",
    "details_link": "https://www.metacritic.com/game/xbox-one/hotshot-racing",
    "publisher": "Sumo Digital",
    "release_date": "Sep 10 2020",
    "developers": [
      "Lucky Mountain Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Racing",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 79,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/7/a206729bf50b487a47e8d7f11a0715ed-98.jpg",
    "descriptions": "Hotshot Racing is a blisteringly fast arcade-style racing game fusing drift handling, razor-sharp retro visuals and an incredible sense of speed to create an exhilarating driving experience."
  },
  {
    "name": "A Way Out",
    "details_link": "https://www.metacritic.com/game/xbox-one/a-way-out",
    "publisher": "Electronic Arts",
    "release_date": "Mar 23 2018",
    "developers": [
      "Hazelight"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "2 ",
    "genres": [
      "Action Adventure",
      "General",
      "Linear"
    ],
    "meta_score": 79,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/4/1d05b01a42828162e5529ae3b1cbb29f-98.jpg",
    "descriptions": "The story of A Way Out begins in prison with two separate inmates, Leo and Vincent, who don’t know each other. While their individual stories progress, players have to build a relationship based on trust as they break both men out of prison into the world beyond. This co-op only experienceThe story of A Way Out begins in prison with two separate inmates, Leo and Vincent, who don’t know each other. While their individual stories progress, players have to build a relationship based on trust as they break both men out of prison into the world beyond. This co-op only experience is meant to be played together with a friend on a couch or online. A Way Out is a game uniquely tailored for two players to work together no matter the situation. Through a compelling narrative, Leo and Vincent will embark on an emotional adventure, where they live some memorable action moments that they face together including car chases, stealth passages, melee fights, shootouts and many more. [Electronic Arts]… Expand"
  },
  {
    "name": "A Hat in Time",
    "details_link": "https://www.metacritic.com/game/playstation-4/a-hat-in-time",
    "publisher": "Gears for Breakfast",
    "release_date": "Dec  5 2017",
    "developers": [
      "Gears for Breakfast"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 79,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/8/d921e49b94b890eb8f37146c4c603e80-98.jpg",
    "descriptions": "A Hat in Time is a 3D collect-a-thon platformer featuring a little girl with a lot of heart. Travel the universe with Hat Kid as you rival the evil Mustache Girl in order to save the world. Unlock new platforming abilities, more combat moves and spice up your attacks with badges attached toA Hat in Time is a 3D collect-a-thon platformer featuring a little girl with a lot of heart. Travel the universe with Hat Kid as you rival the evil Mustache Girl in order to save the world. Unlock new platforming abilities, more combat moves and spice up your attacks with badges attached to your hat.… Expand"
  },
  {
    "name": "Scribblenauts",
    "details_link": "https://www.metacritic.com/game/ds/scribblenauts",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "Sep 15 2009",
    "developers": [
      "5TH Cell"
    ],
    "platforms": "DS",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Puzzle",
      "General",
      "Puzzle",
      "General"
    ],
    "meta_score": 79,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/1/f1bf0d234a98e441e2d29b759de05c1c-98.jpg",
    "descriptions": "The goal is simple - help our Maxwell reach the Starite by solving each challenge - but the mission before you can range from straightforward to downright tricky! To catch the Starite, write any object you can think of and watch as it comes to life. [Warner]"
  },
  {
    "name": "Europa Universalis: Rome - Vae Victis",
    "details_link": "https://www.metacritic.com/game/pc/europa-universalis-rome---vae-victis",
    "publisher": "Paradox Interactive",
    "release_date": "Nov 19 2008",
    "developers": [
      "Paradox Development Studio"
    ],
    "platforms": "PC",
    "num_players": "32  Online",
    "genres": [
      "Strategy",
      "General",
      "General"
    ],
    "meta_score": 79,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/3/861a92d3193a43bee25b37b3c36062ac-98.jpg",
    "descriptions": "The dynamics of the characters that live in the Republic will come to life as the men and women have their own personal goals and agendas, which are often in conflict with each other. Will you be able to manage these willful personalities? As a Republic you will now need to take the SenateThe dynamics of the characters that live in the Republic will come to life as the men and women have their own personal goals and agendas, which are often in conflict with each other. Will you be able to manage these willful personalities? As a Republic you will now need to take the Senate into the account. Characters will belong to various parties depending on their goals, values and ambition. The Senate will pass laws, which will allow or disallow certain country actions. Making sure that the party in power backs your own goals, adds another strategic element to gameplay. Monarchies and Tribes will have their own courts, beware of bootlickers and sycophants who will stop at nothing to replace your divinely appointed ruler with themselves. \"Carthago Delenda Est\". Senators will cry out and charge players to perform their duties. Now the Senate or a religious power can give players missions to fulfill, guiding the player through ambitions to experience a rich and rewarding history. Mobilize the Senate to back important laws such as 'Lex Gabinia' to fight piracy or the 'Lex Acilia Repetundarum' to reduce corruption.Players can also enact decisions at various levels, working with regional governors to grant citizenships to a region or a province. Completely revised military AI, particularly in the area of military campaigns. Will benefit experienced players in particular. An overhauled interface making the information more easily accessible for both new and advanced players. [Paradox Interactive]… Expand"
  },
  {
    "name": "NHL 07",
    "details_link": "https://www.metacritic.com/game/xbox-360/nhl-07",
    "publisher": "EA Sports",
    "release_date": "Sep 12 2006",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox 360"
    ],
    "num_players": "4  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Ice Hockey",
      "Sim",
      "Sim"
    ],
    "meta_score": 79,
    "users_score": 5.3,
    "image": "https://static.metacritic.com/images/products/games/6/580f94b90075204b15494477df0d1d53-98.jpg",
    "descriptions": "The golden age of console hockey returns with NHL 07, featuring gameplay innovations that make players feel like they are actually on the ice. Featuring an unmatched level of freedom and control, NHL 07 allows hockey purists and casual fans alike to feel like they can play like a pro.The golden age of console hockey returns with NHL 07, featuring gameplay innovations that make players feel like they are actually on the ice. Featuring an unmatched level of freedom and control, NHL 07 allows hockey purists and casual fans alike to feel like they can play like a pro. [Electronic Arts]… Expand"
  },
  {
    "name": "The Walking Dead: Episode 1 - A New Day",
    "details_link": "https://www.metacritic.com/game/xbox-360/the-walking-dead-episode-1---a-new-day",
    "publisher": "Telltale Games",
    "release_date": "Apr 27 2012",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "1 Player",
    "genres": [
      "Miscellaneous",
      "Adventure",
      "General",
      "Compilation",
      "Point-and-Click"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/5/bdae6b72b2e0981ecb4290cae014c2c3-98.jpg",
    "descriptions": "Episode one of a five-part game series set in the same universe as Robert Kirkman’s award-winning series. Play as Lee Everett, the convicted criminal who has been given a second chance at life in a world devastated by the undead. Experience events, meet people and visit locations thatEpisode one of a five-part game series set in the same universe as Robert Kirkman’s award-winning series. Play as Lee Everett, the convicted criminal who has been given a second chance at life in a world devastated by the undead. Experience events, meet people and visit locations that foreshadow the story of Deputy Sheriff Rick Grimes. A honed game experience in which actions, choices and decisions you make will affect how your story plays out across the entire series.… Expand"
  },
  {
    "name": "GoNNER",
    "details_link": "https://www.metacritic.com/game/switch/gonner",
    "publisher": "Raw Fury",
    "release_date": "Jun 29 2017",
    "developers": [
      "Art in Heart"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 79,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/9/aa3fcba0ba73efa0947393723aed6664-98.jpg",
    "descriptions": "GoNNER is a tough as hell procedurally-generated 2D platformer with roguelike elements, following the largely misunderstood and altruistic Ikk on a journey to cheer up his only friend in this world—a giant landbound whale named Sally—by searching for just the right trinket in the deep andGoNNER is a tough as hell procedurally-generated 2D platformer with roguelike elements, following the largely misunderstood and altruistic Ikk on a journey to cheer up his only friend in this world—a giant landbound whale named Sally—by searching for just the right trinket in the deep and dark places nearby.… Expand"
  },
  {
    "name": "Naruto Shippuden: Ultimate Ninja Storm 4 - Road to Boruto",
    "details_link": "https://www.metacritic.com/game/switch/naruto-shippuden-ultimate-ninja-storm-4---road-to-boruto",
    "publisher": "Bandai Namco Games",
    "release_date": "Apr 24 2020",
    "developers": [
      "CyberConnect2"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 79,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/0/ee262769a6f5d37f2c359d32580c7cdd-98.jpg",
    "descriptions": "The latest game in the Ultimate Ninja Storm series is finally here for Nintendo Switch. It features all DLC, including the latest \"NEXT GENERATIONS\" DLC Update Pack. Relive the Fourth Great Ninja War that unfolded in Naruto Shippuden, and experience the story of Boruto: Naruto the MovieThe latest game in the Ultimate Ninja Storm series is finally here for Nintendo Switch. It features all DLC, including the latest \"NEXT GENERATIONS\" DLC Update Pack. Relive the Fourth Great Ninja War that unfolded in Naruto Shippuden, and experience the story of Boruto: Naruto the Movie featuring Naruto's son, Boruto Uzumaki. Plus, choose from 124 ninja—the most in the series! Join in action-packed battles, whenever and wherever you want.… Expand"
  },
  {
    "name": "Life is Strange: Before the Storm - Episode 2: Brave New World",
    "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-before-the-storm---episode-2-brave-new-world",
    "publisher": "Square Enix",
    "release_date": "Oct 19 2017",
    "developers": [
      "Deck Nine Games"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 79,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/2/2fd9ac25b349740a9b3d636afd9fcc68-98.jpg",
    "descriptions": null
  },
  {
    "name": "Yoshi's Crafted World",
    "details_link": "https://www.metacritic.com/game/switch/yoshis-crafted-world",
    "publisher": "Nintendo",
    "release_date": "Mar 28 2019",
    "developers": [
      "Good-Feel"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/4/77fef7f680ba10ecaeab6b93557a3be2-98.jpg",
    "descriptions": "Discover the flip side of Yoshis world. Lead Yoshi on a brand new adventure that will turn everything youve come to expect from side-scrolling games upside down! Explore a great, big world decorated like a miniature diorama in a new art style for the franchise, where each side-scrollingDiscover the flip side of Yoshis world. Lead Yoshi on a brand new adventure that will turn everything youve come to expect from side-scrolling games upside down! Explore a great, big world decorated like a miniature diorama in a new art style for the franchise, where each side-scrolling stage has the traditional front side as well as a flip side with different views and surprises. Look for items throughout the stage as Yoshi makes his way to the goal. You can even join up with a friend.\r Features:\r *    Join Yoshi in this new action platforming game \r*    Each course offers both a main path and a hidden path that offers different views and surprises\r*    The lively art style looks like a minature diorama \r*    Enjoy simultaneous 2-player action… Expand"
  },
  {
    "name": "Sonic Colors",
    "details_link": "https://www.metacritic.com/game/ds/sonic-colors",
    "publisher": "Sega",
    "release_date": "Nov 16 2010",
    "developers": [
      "Dimps Corporation"
    ],
    "platforms": "DS",
    "num_players": "2 ",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D",
      "3D"
    ],
    "meta_score": 79,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/3/26f38d711da171754e60a97eb5c9e011-98.jpg",
    "descriptions": "An extraordinary amusement park has been seen orbiting around the home planet of Sonic the Hedgehog, and rumors are spreading that an alien race of Wisps, who have a unique colorful energy, are being held captive there by the evil Dr. Eggman.  Soon after arriving at the amusement park, SonicAn extraordinary amusement park has been seen orbiting around the home planet of Sonic the Hedgehog, and rumors are spreading that an alien race of Wisps, who have a unique colorful energy, are being held captive there by the evil Dr. Eggman.  Soon after arriving at the amusement park, Sonic discovers he is able to use these mysterious alien forces to help the Wisps escape!  … Expand"
  },
  {
    "name": "Silent Hunter: Wolves of the Pacific",
    "details_link": "https://www.metacritic.com/game/pc/silent-hunter-wolves-of-the-pacific",
    "publisher": "Ubisoft",
    "release_date": "Mar 20 2007",
    "developers": [
      "Ubisoft Romania"
    ],
    "platforms": "PC",
    "num_players": "8  Online",
    "genres": [
      "Simulation",
      "Submarine",
      "Submarine",
      "Marine",
      "Combat"
    ],
    "meta_score": 79,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/0/e0967cdbaf3e0e9be61d477327677dbc-98.jpg",
    "descriptions": "Silent Hunter 4: Wolves of the Pacific takes players to the depths of the Pacific Ocean as the skipper of an American submarine. Immersed in this intense environment with the help of amazing graphics and sound, players will engage in massive battles with enemy units, manage and evolve anSilent Hunter 4: Wolves of the Pacific takes players to the depths of the Pacific Ocean as the skipper of an American submarine. Immersed in this intense environment with the help of amazing graphics and sound, players will engage in massive battles with enemy units, manage and evolve an entire submarine crew, and earn promotions and commendations to ensure victory in the Pacific. Hollywood Blockbuster Experience: Lifelike graphics and spectacular audio/visual effects offer an incredibly immersive gaming experience. Innovative Crew Evolution: Earn upgrades and experience to help create the most effective naval force in the Pacific Theater. Immersive Single-Player Gameplay: Diverse mission objectives and events on more than 15 maps combined with unique rewards make each campaign a unique experience. Addictive New Online Adversarial Mode: Join forces with up to eight friends via LAN or four via Internet in either cooperative or adversarial gameplay modes. Scripted and generated mission types allow for epic online battles and unlimited replayability. [Ubisoft]… Expand"
  },
  {
    "name": "Dead or Alive Dimensions",
    "details_link": "https://www.metacritic.com/game/3ds/dead-or-alive-dimensions",
    "publisher": "Koei",
    "release_date": "May 24 2011",
    "developers": [
      "Team Ninja"
    ],
    "platforms": "3DS",
    "num_players": "2  Online",
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "3D",
      "3D"
    ],
    "meta_score": 79,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/7/65aba2cbbae117a6daf9db61ca4a575e-98.jpg",
    "descriptions": "DEAD OR ALIVE Dimensions takes the vivacious characters and locales that have made the DOA franchise a hit with gamers everywhere and presents them in eye-popping 3D. All of the punches, kicks, counters and holds that have defined the series as a top-tier fighter are present for the firstDEAD OR ALIVE Dimensions takes the vivacious characters and locales that have made the DOA franchise a hit with gamers everywhere and presents them in eye-popping 3D. All of the punches, kicks, counters and holds that have defined the series as a top-tier fighter are present for the first time on a portable gaming system - the Nintendo 3DS®. DEAD OR ALIVE Dimensions features some of the best content from the series spanning all of the titles from the original DOA up to DOA 4.… Expand"
  },
  {
    "name": "Variable Barricade",
    "details_link": "https://www.metacritic.com/game/switch/variable-barricade",
    "publisher": "Idea Factory",
    "release_date": "Feb 24 2022",
    "developers": [
      "Otomate"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Visual Novel"
    ],
    "meta_score": 79,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/1/cd2eb6d382fb9ded62dca93a25795a68-98.jpg",
    "descriptions": "A proposal within five seconds of meeting!? The mysterious handsome men who appeared in front of Hibari, the only daughter of distinguished Toujou family, were the groom candidates who had been sent by her natural enemy, her grandfather. Alerted by her intuition Hibari realized that thereA proposal within five seconds of meeting!? The mysterious handsome men who appeared in front of Hibari, the only daughter of distinguished Toujou family, were the groom candidates who had been sent by her natural enemy, her grandfather. Alerted by her intuition Hibari realized that there must be something more behind this. Why now? And anyway, who are these guys in the first place? Though she showed a firmly defiant stance toward this obviously suspicious situation, her grandfathers decision was absolute. While still surprised they were given a villa, and on the premise of a marriage proposal they started living together.\r The four men try to pursue her in many ways, aiming for the groom position. Within the dazzling days of seduction, Hibari resolutely makes her decision.\r “There’s absolutely no way I’ll fall for you!”… Expand"
  },
  {
    "name": "LEGO Builder's Journey",
    "details_link": "https://www.metacritic.com/game/pc/lego-builders-journey",
    "publisher": "LEGO Games",
    "release_date": "Jun 22 2021",
    "developers": [
      "Light Brick"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Puzzle",
      "General"
    ],
    "meta_score": 79,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/2/19cae97d994f3c9c88150788ae8f3a69-98.jpg",
    "descriptions": "LEGO Builder’s Journey is an atmospheric, geometric puzzle game that asks us to sometimes follow the instructions… and sometimes to break the rules. Take your time to experiment with free-form puzzle solving while immersing yourself in a poetic world of LEGO® bricks. Throughout theLEGO Builder’s Journey is an atmospheric, geometric puzzle game that asks us to sometimes follow the instructions… and sometimes to break the rules. Take your time to experiment with free-form puzzle solving while immersing yourself in a poetic world of LEGO® bricks. Throughout the narrative, there will be ups and downs, challenges, and celebrations. Figuring out who we are and what we become is the Builder’s Journey. The LEGO brick world is brought to life with the most accurately rendered LEGO elements yet to feature on screens, including stunning ray tracing elements. … Expand"
  },
  {
    "name": "Wreckfest",
    "details_link": "https://www.metacritic.com/game/playstation-5/wreckfest",
    "publisher": "THQ Nordic",
    "release_date": "May  4 2021",
    "developers": [
      "Bugbear"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Stadia",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "Up to 24 ",
    "genres": [
      "Racing",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 79,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/4/18eee05602ff87b744eb9b0651b621a6-98.jpg",
    "descriptions": "Break the rules and take full-contact racing to the limit with Wreckfest! Expect epic crashes, neck-to-neck fights over the finish line and brand-new ways for metal to bend -- These are the once-in-a-lifetime moments that can only be achieved in Wreckfest, with its true-to-life physicsBreak the rules and take full-contact racing to the limit with Wreckfest! Expect epic crashes, neck-to-neck fights over the finish line and brand-new ways for metal to bend -- These are the once-in-a-lifetime moments that can only be achieved in Wreckfest, with its true-to-life physics simulation crafted by legendary developer Bugbear, who also brought you FlatOut 1 & 2! Burn rubber and shred metal in the ultimate driving playground! Wreckfest is jam-packed with upgrade and customization options. Whether you are preparing for your next demolition derby with reinforced bumpers, roll cages, side protectors and much more, or setting your car up for a banger race with engine performance parts like air filters, camshafts, fuel systems, etc., Wreckfest is shaping up to be the best combative motorsport game out there.\r Features:\r * Awesome Cars -- Old, banged-up, patched-together cars that simply ooze style! From old American heavy-hitters to agile Europeans and fun Asians, you won't find anything like this in other games.\r * Meaningful Customization -- Change not only the look of your cars but also upgrade their body armor!\r * Multiplayer -- Wreck your friends online and take racing to the limit while chasing for demolition dominance!\r * Challenge modes -- Have hilarious fun with crop harvesters, lawn mowers, school buses, three-wheelers and more!… Expand"
  },
  {
    "name": "Planet Coaster: Console Edition",
    "details_link": "https://www.metacritic.com/game/playstation-4/planet-coaster-console-edition",
    "publisher": "Frontier Developments",
    "release_date": "Nov 10 2020",
    "developers": [
      "Frontier Developments"
    ],
    "platforms": [
      "PC",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Management",
      "Business / Tycoon"
    ],
    "meta_score": 79,
    "users_score": 5.7,
    "image": "https://static.metacritic.com/images/products/games/4/9d2e821df607e4c032f5c33f17da3365-98.jpg",
    "descriptions": "The celebrated coaster park simulation game comes to your living room. This is Planet Coaster: Console Edition. Unleash your vision using simple yet powerful creation tools, control every aspect of your park with fun management features, and share any design imaginable online."
  },
  {
    "name": "Cafe Enchante",
    "details_link": "https://www.metacritic.com/game/switch/cafe-enchante",
    "publisher": "Aksys Games",
    "release_date": "Nov  5 2020",
    "developers": [
      "Otomate"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Visual Novel"
    ],
    "meta_score": 79,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/9/783d988935437bf23ba1704cec599aa9-98.jpg",
    "descriptions": "When Kotone inherits her grandfather’s Tokyo café, she discovers the shop holds more secrets than anyone could imagine. The café is a meeting spot for beings from multiple, mystical worlds. You’ll meet the king of demons, a humanoid beast, a fallen angel, and more. And when government agentsWhen Kotone inherits her grandfather’s Tokyo café, she discovers the shop holds more secrets than anyone could imagine. The café is a meeting spot for beings from multiple, mystical worlds. You’ll meet the king of demons, a humanoid beast, a fallen angel, and more. And when government agents monitoring non-human activities show up at your door, your new café is about to become a lot more colorful. … Expand"
  },
  {
    "name": "For the King",
    "details_link": "https://www.metacritic.com/game/pc/for-the-king",
    "publisher": "IronOak Games",
    "release_date": "Apr 19 2018",
    "developers": [
      "IronOak Games"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Roguelike"
    ],
    "meta_score": 79,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/6/c085c5813424f9481a49aba5d6e65095-98.jpg",
    "descriptions": "Weave your own unique tales in a challenging single player or cooperative RPG adventure that spans across the realms. Trek across the perilous badlands, trudge through poisonous swamps, and brave the high seas in uniquely generated maps."
  },
  {
    "name": "Rock Band 4",
    "details_link": "https://www.metacritic.com/game/xbox-one/rock-band-4",
    "publisher": "Harmonix Music Systems",
    "release_date": "Oct  6 2015",
    "developers": [
      "Harmonix Music Systems"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Rhythm",
      "Music"
    ],
    "meta_score": 79,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/9/5d56f2acee15875384e422816b8f45cf-98.jpg",
    "descriptions": "Rock Band 4 offers the unique social play of a full band experience—featuring a next-gen microphone, wireless drums and guitar, and a revamped world tour campaign mode.  Add your personal signature to every performance. With Freestyle Guitar Solo, you can string together blistering licks andRock Band 4 offers the unique social play of a full band experience—featuring a next-gen microphone, wireless drums and guitar, and a revamped world tour campaign mode.  Add your personal signature to every performance. With Freestyle Guitar Solo, you can string together blistering licks and wow the crowd with your own incendiary solos.  With a soundtrack featuring some of the world's biggest acts, plus an ever-expanding catalog of over 1,500 playable songs, it’s easy to put together a keen set list.… Expand"
  },
  {
    "name": "Dishonored: The Knife of Dunwall",
    "details_link": "https://www.metacritic.com/game/xbox-360/dishonored-the-knife-of-dunwall",
    "publisher": "Bethesda Softworks",
    "release_date": "Apr 16 2013",
    "developers": [
      "Arkane Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Action Adventure",
      "Modern",
      "General",
      "Modern"
    ],
    "meta_score": 79,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/7/b20baefc846fb6dbb8e610b60563ee69-98.jpg",
    "descriptions": "In The Knife of Dunwall, assume the role of Daud, the assassin who killed the Empress, and access his weapons, gadgets, allies and supernatural abilities. After assassinating the Empress, and forever changing the fate of Dunwall, you begin a search for redemption. The Outsider reveals theIn The Knife of Dunwall, assume the role of Daud, the assassin who killed the Empress, and access his weapons, gadgets, allies and supernatural abilities. After assassinating the Empress, and forever changing the fate of Dunwall, you begin a search for redemption. The Outsider reveals the key to your atonement, but who-or what-is Delilah? Accompanied by the Whalers, your loyal band of mercenary assassins, your search will take you through never-before-seen districts of Dunwall as you face off against new and terrible foes. Employ a unique arsenal of new weapons and powers that enhance Dishonored's dynamic combat, mobility and stealth systems. In the struggle to hang onto the last shred of your humanity, the choices you make will ultimately determine your fate.… Expand"
  },
  {
    "name": "Need for Speed: Most Wanted",
    "details_link": "https://www.metacritic.com/game/playstation-vita/need-for-speed-most-wanted",
    "publisher": "Electronic Arts",
    "release_date": "Oct 30 2012",
    "developers": [
      "Criterion Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Wii U",
      "Xbox 360",
      "PlayStation Vita"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "GT / Street",
      "GT / Street",
      "Automobile"
    ],
    "meta_score": 79,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/5/e00ff97886f00ba1437359aa27b33b76-98.jpg",
    "descriptions": "Need for Speed: Most Wanted is an open world Racing game. The game is the 19th release in the long-running Need for Speed franchise, and the first for the PlayStation Vita. It hearkens back to the earliest games in the series as players compete in races with police unified against them.Need for Speed: Most Wanted is an open world Racing game. The game is the 19th release in the long-running Need for Speed franchise, and the first for the PlayStation Vita. It hearkens back to the earliest games in the series as players compete in races with police unified against them. Races have a set beginning and end point, with the open world game design allowing players to complete each using whatever path they can find. Additional features of performance include a unique blend of Simulation and Arcade gameplay, social play options through the Autolog 2 feature, exciting multiplayer support, and a large selection of vehicles.… Expand"
  },
  {
    "name": "Battlefield 3: Armored Kill",
    "details_link": "https://www.metacritic.com/game/playstation-3/battlefield-3-armored-kill",
    "publisher": "Electronic Arts",
    "release_date": "Sep  4 2012",
    "developers": [
      "EA DICE"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Tactical",
      "Modern",
      "Arcade"
    ],
    "meta_score": 79,
    "users_score": 4.3,
    "image": "https://static.metacritic.com/images/products/games/7/b0d70373cdded5f2fc4c071743f334e4-98.jpg",
    "descriptions": "Battlefield 3: Armored Kill ups the ante for vehicular mayhem as only Battlefield can do. Featuring new drivable tanks, ATVs, mobile artillery and more, this expansion pack also delivers huge battlefields for an all-out vehicle assault. Armored Kill also includes the biggest map inBattlefield 3: Armored Kill ups the ante for vehicular mayhem as only Battlefield can do. Featuring new drivable tanks, ATVs, mobile artillery and more, this expansion pack also delivers huge battlefields for an all-out vehicle assault. Armored Kill also includes the biggest map in Battlefield history.\r KEY FEATURES:\r * All-out vehicle warfare on four new maps\r* Includes the biggest map in Battlefield history\r* Drive five new vehicles, including tank destroyers, mobile artillery and an ATV or spawn on the gunship and man the cannons\r* Earn 20+ unlocks for the new vehicles\r* New Tank Superiority game mode\r* Earn five new Assignments… Expand"
  },
  {
    "name": "Lost Planet: Extreme Condition",
    "details_link": "https://www.metacritic.com/game/xbox-360/lost-planet-extreme-condition",
    "publisher": "Capcom",
    "release_date": "Jan 12 2007",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 16 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 79,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/8/00b53861e2446e222387d3398831984b-98.jpg",
    "descriptions": "In Lost Planet, human snow pirates navigate VS (Vital Suits) through hostile ice-covered environments, fighting against the indigenous Akrid creatures for the precious thermal energy they need to survive. For one such pilot named Wayne, death almost seemed imminent until he was fortunatelyIn Lost Planet, human snow pirates navigate VS (Vital Suits) through hostile ice-covered environments, fighting against the indigenous Akrid creatures for the precious thermal energy they need to survive. For one such pilot named Wayne, death almost seemed imminent until he was fortunately rescued. However, he can only remember a few fragments of his past including the slaying of his father by the monstrous beings. Yet under the veil of ice, a devious plan has been set into motion for the termination of all Akrid and snow pirates alike. What really happened to Wayne? Who is plotting the destructive scheme? Encounter valuable allies and dangerous enemies on Wayne's search for the truth. [Capcom]… Expand"
  },
  {
    "name": "1701 A.D.",
    "details_link": "https://www.metacritic.com/game/pc/1701-ad",
    "publisher": "Aspyr",
    "release_date": "Nov  6 2006",
    "developers": [
      "Related Designs"
    ],
    "platforms": "PC",
    "num_players": "4  Online",
    "genres": [
      "Strategy",
      "Real-Time",
      "Historic",
      "General",
      "Historic"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/1/9fd94fcfd727bf7f4307c4d683db0e9e-98.jpg",
    "descriptions": "(Known as \"Anno 1701\" in the UK/EU)  1701 A.D. is a unique empire building simulation set in the 17th century. In this third episode of the incredibly successful series, players are immersed in the golden age of exploration and trade, where they set out to discover and inhabit new islands –(Known as \"Anno 1701\" in the UK/EU)  1701 A.D. is a unique empire building simulation set in the 17th century. In this third episode of the incredibly successful series, players are immersed in the golden age of exploration and trade, where they set out to discover and inhabit new islands – islands that will soon be home to huge cities. Players are tasked with establishing, expanding and maintaining a flourishing medieval metropolis while interacting with other players through trade, diplomacy or military conflicts. 1701 A.D. presents players with a 3D gaming world bursting with life from the vibrant citizens, to the incredibly varied flora and fauna to detailed animated animals. [Aspyr]… Expand"
  },
  {
    "name": "STASIS",
    "details_link": "https://www.metacritic.com/game/pc/stasis",
    "publisher": "THE BROTHERHOOD",
    "release_date": "Aug 31 2015",
    "developers": [
      "THE BROTHERHOOD"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "General",
      "Miscellaneous",
      "Adventure",
      "General",
      "Point-and-Click"
    ],
    "meta_score": 79,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/7/a573d491450418e791555cf7edfe3633-98.jpg",
    "descriptions": "Disoriented, drowsy and in pain, John Maracheck opens his eyes. There is nothing to greet him but the static of a nearby monitor and a cold steel floor. Thick, green liquid covers the floor and then his body, leading to trail to a nearby, steaming stasis-pod. He slowly gets to his feet,Disoriented, drowsy and in pain, John Maracheck opens his eyes. There is nothing to greet him but the static of a nearby monitor and a cold steel floor. Thick, green liquid covers the floor and then his body, leading to trail to a nearby, steaming stasis-pod. He slowly gets to his feet, trying to take in his surroundings. Where is his wife? His daughter? What the hell is going on...?\rStasis is an adventure game that puts you in control of John Maracheck, a man searching for his family in a seemingly abandoned research facility. Going back to classic adventure game mechanics, you are required to solve puzzles and use objects around you to progress and to find Maracheck's family.… Expand"
  },
  {
    "name": "Otogi 2: Immortal Warriors",
    "details_link": "https://www.metacritic.com/game/xbox/otogi-2-immortal-warriors",
    "publisher": "Sega",
    "release_date": "Oct 21 2004",
    "developers": [
      "From Software"
    ],
    "platforms": "Xbox",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 79,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/1/463c25ee78d2b323ae996ab44b8c1bd0-98.jpg",
    "descriptions": "Otogi 2 takes place directly after the events chronicled in the original Otogi: Myth of Demons. Raikoh, the famed undead warrior from the original game, rises again to save Japan from an onslaught of demons. This time, he is joined by six other selfless warriors who have taken their ownOtogi 2 takes place directly after the events chronicled in the original Otogi: Myth of Demons. Raikoh, the famed undead warrior from the original game, rises again to save Japan from an onslaught of demons. This time, he is joined by six other selfless warriors who have taken their own lives to resurrect Raikoh. As you acquire more special items, you can increase each character's strengths and abilities. Fulfill your destiny in Story mode, or destroy everything in the new Havoc mode.… Expand"
  },
  {
    "name": "Chime",
    "details_link": "https://www.metacritic.com/game/xbox-360/chime",
    "publisher": "Valcon Games",
    "release_date": "Feb  3 2010",
    "developers": [
      "Zoe Mode"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/5/91c669d8aba8d870f62656a53919860a-98.jpg",
    "descriptions": "[Xbox Live Arcade]  An exclusive Zoë Mode production for OneBigGame, the video game industry-wide charity initiative, Chime pits gamers against the melody in this all-new puzzle experience. Place blocks against the clock and remix famous artists’ music tracks in this challenging and[Xbox Live Arcade]  An exclusive Zoë Mode production for OneBigGame, the video game industry-wide charity initiative, Chime pits gamers against the melody in this all-new puzzle experience. Place blocks against the clock and remix famous artists’ music tracks in this challenging and addictive puzzle game. More than 60 percent of the purchase price of Chime will be donated to children's charities around the world, helping those who need it the most. [Zoe Mode]… Expand"
  },
  {
    "name": "Brothers: A Tale of Two Sons",
    "details_link": "https://www.metacritic.com/game/switch/brothers-a-tale-of-two-sons",
    "publisher": "505 Games",
    "release_date": "May 28 2019",
    "developers": [
      "Turn Me Up Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Linear"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/6/e81d0ac4efdaaf4f97bf4fb953cbc583-98.jpg",
    "descriptions": "Guide two brothers on an epic fairy tale journey from visionary Swedish film director, Josef Fares and top-tier developer Starbreeze Studios. Control both brothers at once as you experience co-op play in single player mode, like never before. Solve puzzles, explore the varied locations andGuide two brothers on an epic fairy tale journey from visionary Swedish film director, Josef Fares and top-tier developer Starbreeze Studios. Control both brothers at once as you experience co-op play in single player mode, like never before. Solve puzzles, explore the varied locations and fight boss battles, controlling one brother with each thumb stick. This is one journey you will never forget.… Expand"
  },
  {
    "name": "Pro Evolution Soccer 2009",
    "details_link": "https://www.metacritic.com/game/pc/pro-evolution-soccer-2009",
    "publisher": "Konami",
    "release_date": "Nov 12 2008",
    "developers": [
      "Konami"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 79,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/5/7ff0c3ebe0186420b88c005f0aae8123-98.jpg",
    "descriptions": "Known by fans for its superior gameplay and incredible realism, PES 2009 further bridges the gap between PES and the real thing. The game has undergone a graphical update to ensure its players look more like their real-life counterparts. Similarly, all-new options allow users to tailor theKnown by fans for its superior gameplay and incredible realism, PES 2009 further bridges the gap between PES and the real thing. The game has undergone a graphical update to ensure its players look more like their real-life counterparts. Similarly, all-new options allow users to tailor the game to their own tastes, while new stylish moves, innovative control schemes and key online elements further the realism. [Konami]… Expand"
  },
  {
    "name": "Return to Mysterious Island",
    "details_link": "https://www.metacritic.com/game/pc/return-to-mysterious-island",
    "publisher": "DreamCatcher Interactive",
    "release_date": "Nov  2 2004",
    "developers": [
      "Kheops Studio"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "First-Person",
      "Point-and-Click",
      "Modern",
      "Modern"
    ],
    "meta_score": 79,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/4/a005737e59b9003211d960abe63709ec-98.jpg",
    "descriptions": "Return to Mysterious Island follows Mina, a strong young woman alone on a round-the-world sailing expedition. Caught in a tremendous storm, she becomes stranded on the shores of a wild and apparently uninhabited island. As she explores her new surroundings, she uncovers artifacts, livingReturn to Mysterious Island follows Mina, a strong young woman alone on a round-the-world sailing expedition. Caught in a tremendous storm, she becomes stranded on the shores of a wild and apparently uninhabited island. As she explores her new surroundings, she uncovers artifacts, living spaces and technologies left behind by the people who came before her to this uncharted island. Creating a new life, Mina builds a home from the remains of Granite Rock and uses her survival skills against the wilds of the jungle. She soon becomes aware of a figure in the shadows who, seemingly aware of her troubles, offers her assistance. She eventually identifies this figure as the unsettled ghost of Captain Nemo, whose body is located in the Nautilus deep below the island shore. Piecing together the hints and clues he provides, Mina must travel to the Nautilus, retrieve his body and give him a proper burial in order to free his tortured soul. Players will solve a variety of clever puzzles and use the various technologies found on the Nautilus to help on their return to civilization. [Adventure Company]… Expand"
  },
  {
    "name": "Rubik's Puzzle Galaxy: RUSH",
    "details_link": "https://www.metacritic.com/game/wii/rubiks-puzzle-galaxy-rush",
    "publisher": "The Game Factory",
    "release_date": "Dec 14 2009",
    "developers": [
      "Two Tribes"
    ],
    "platforms": "Wii",
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Puzzle",
      "General",
      "General"
    ],
    "meta_score": 79,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/0/8f8b56515ae71f3db639116e9c1409a1-98.jpg",
    "descriptions": "[WiiWare]  Rubik's Puzzle Galaxy: RUSH is a 3-D puzzle game with more than 70 challenging levels. Players need to guide Cubes to color-coded exit points. Using the Wii Remote controller's intuitive controls, players herd the colored cubes along by using Conveyer Belts, Warps, Stop Signs,[WiiWare]  Rubik's Puzzle Galaxy: RUSH is a 3-D puzzle game with more than 70 challenging levels. Players need to guide Cubes to color-coded exit points. Using the Wii Remote controller's intuitive controls, players herd the colored cubes along by using Conveyer Belts, Warps, Stop Signs, Directional Signs and Splits. RUSH also includes the original Rubik's Cube as a bonus. Players can attempt to solve one of the four different-sized Cubes alone, compete against a second player or learn how to solve the classic Rubik's Cube. [Nintendo]… Expand"
  },
  {
    "name": "Euro Truck Simulator 2",
    "details_link": "https://www.metacritic.com/game/pc/euro-truck-simulator-2",
    "publisher": "SCS Software",
    "release_date": "Jan 16 2013",
    "developers": [
      "SCS Software"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "General",
      "General",
      "Vehicle",
      "Civilian"
    ],
    "meta_score": 79,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/7/f7d4bbce54ec657086ff349f01c14065-98.jpg",
    "descriptions": "Travel across Europe as king of the road, a trucker who delivers important cargo across impressive distances! With dozens of cities to explore from the UK, Belgium, Germany, Italy, the Netherlands, Poland, and many more, your endurance, skill and speed will all be pushed to their limits. IfTravel across Europe as king of the road, a trucker who delivers important cargo across impressive distances! With dozens of cities to explore from the UK, Belgium, Germany, Italy, the Netherlands, Poland, and many more, your endurance, skill and speed will all be pushed to their limits. If you've got what it takes to be part of an elite trucking force, get behind the wheel and prove it!… Expand"
  },
  {
    "name": "Smuggler's Run",
    "details_link": "https://www.metacritic.com/game/playstation-2/smugglers-run",
    "publisher": "Rockstar Games",
    "release_date": "Oct 25 2000",
    "developers": [
      "Rockstar San Diego"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Driving",
      "Mission-based"
    ],
    "meta_score": 79,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/6/2e246b330d401886bec9b2a1dc4785a1-98.jpg",
    "descriptions": "As a member of a gang of international smugglers, it's your job to evade the U.S. Border Patrol, CIA and cutthroat rivals to deliver illegal cargo. It'll take complete mastery of your off-road vehicle to make it across unforgiving terrain and stay one step ahead...and make the drop."
  },
  {
    "name": "Puzzle Dimension",
    "details_link": "https://www.metacritic.com/game/playstation-3/puzzle-dimension",
    "publisher": "Doctor Entertainment",
    "release_date": "Jun 28 2011",
    "developers": [
      "Doctor Entertainment"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3"
    ],
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "General",
      "Puzzle",
      "General"
    ],
    "meta_score": 79,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/3/1ed084171a23a4cade1adc6b4d99955c-98.jpg",
    "descriptions": "Puzzle Dimension is a 3D puzzle game."
  },
  {
    "name": "Eternal Sonata",
    "details_link": "https://www.metacritic.com/game/xbox-360/eternal-sonata",
    "publisher": "Namco Bandai Games America",
    "release_date": "Sep 17 2007",
    "developers": [
      "Tri-Crescendo"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG",
      "Console-style RPG",
      "Japanese-Style"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/2/7b9f7861b1c6bcc88d1db76b6a469949-98.jpg",
    "descriptions": "(Also known as \"Trusty Bell: Chopin's Dream\")  The story of Eternal Sonata begins as a famous composer, on his deathbed, drifts between this life and the next. In his reverie, a happenstance encounter of a young girl who accepts her terrible destiny and a young boy fighting to save her,(Also known as \"Trusty Bell: Chopin's Dream\")  The story of Eternal Sonata begins as a famous composer, on his deathbed, drifts between this life and the next. In his reverie, a happenstance encounter of a young girl who accepts her terrible destiny and a young boy fighting to save her, changes the destiny of the world. Uncover the light that shines in each of us in this enduring tale of good and evil. Features a host of next generation features such as a unique monster morphing system, a hybrid of a turn-based and action battle system with a special attack feature dependent on light and shadow. [Namco Bandai Games]… Expand"
  },
  {
    "name": "Among Us",
    "details_link": "https://www.metacritic.com/game/switch/among-us",
    "publisher": "Innersloth",
    "release_date": "Dec 15 2020",
    "developers": [
      "Innersloth"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "Up to 15 ",
    "genres": [
      "Action Adventure",
      "General",
      "Survival"
    ],
    "meta_score": 79,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/0/d28f8e87edbe2e14cfc374e04930c943-98.jpg",
    "descriptions": "An online and local party game of teamwork and betrayal for 4-10 players...IN SPACE! Play with 4-10 player online or via local WiFi as you attempt to prepare your spaceship for departure, but beware as one or more random players among the Crew are Impostors bent on killing everyone!An online and local party game of teamwork and betrayal for 4-10 players...IN SPACE! Play with 4-10 player online or via local WiFi as you attempt to prepare your spaceship for departure, but beware as one or more random players among the Crew are Impostors bent on killing everyone!Originally created as a party game, we recommend playing with friends at a LAN party or online using voice chat. Enjoy cross-platform play between Android, iOS and PC. THE CREWObjective: Fill Group Task Bar or Discover the Imposter! * Win by completing tasks to prepare the ship or ejecting all Impostors.* React quickly to undo the Impostor's sabotages.* Check the Admin map and Security cameras to keep tabs on other Crewmates.* Report any dead bodies immediately to start discussion of who the suspected Impostor is.* Call emergency meetings to discuss suspicious behavior.* Vote to eject suspected Impostors. THE IMPOSTERObjective: Kill Off the Crew! * Kill crewmates and frame bystanders.* Pretend to run tasks to blend in with the crewmates.* Sneak through the vents to quickly move about the ship.* Use sabotages to cause chaos and divide the crew.* Close doors to trap victims and kill in private. Features: * Customization: Pick your color and hat.* Lots of game options: Add more impostors, more tasks, and so much more!* Quickly find a game online from the host list.* In-game text chat.* Rich discord integration.* Cross-platform play between PC, Android, and iOS!… Expand"
  },
  {
    "name": "The Ninja Saviors: Return of the Warriors",
    "details_link": "https://www.metacritic.com/game/switch/the-ninja-saviors-return-of-the-warriors",
    "publisher": "Taito Corporation",
    "release_date": "Oct 15 2019",
    "developers": [
      "NATSUME ATARI Inc."
    ],
    "platforms": [
      "PlayStation 4",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Beat-'Em-Up",
      "2D"
    ],
    "meta_score": 79,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/7/0e2d89e3156d4e5bd43de093ca31e88a-98.jpg",
    "descriptions": "In TAITO’s latest arcade action title you’ll slip into the role of one of five android ninjas and brawl your way through waves of enemy hordes in a dystopian future. Over a total of eight levels, you’ll take on the tyrant Banglar and his henchmen either alone or - for the first time in theIn TAITO’s latest arcade action title you’ll slip into the role of one of five android ninjas and brawl your way through waves of enemy hordes in a dystopian future. Over a total of eight levels, you’ll take on the tyrant Banglar and his henchmen either alone or - for the first time in the history of the series - with a friend. So settle into a night on the couch with your friends, and reminisce about the golden era of 90s co-op game evenings you know and love.… Expand"
  },
  {
    "name": "Mega Man Legacy Collection + Mega Man Legacy Collection 2",
    "details_link": "https://www.metacritic.com/game/switch/mega-man-legacy-collection-+-mega-man-legacy-collection-2",
    "publisher": "Capcom",
    "release_date": "May 22 2018",
    "developers": [
      "Digital Eclipse"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 79,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/6/55a735912b3ac9ae21076fe5ef8c6296-98.jpg",
    "descriptions": "Mega Man Legacy Collection is a celebration of the 8-bit history of Capcoms iconic Blue Bomber. Featuring faithful reproductions of the series origins with the original six Mega Man games, the Legacy Collection will remind long-time fans and introduce newcomers to what made Mega Man such aMega Man Legacy Collection is a celebration of the 8-bit history of Capcoms iconic Blue Bomber. Featuring faithful reproductions of the series origins with the original six Mega Man games, the Legacy Collection will remind long-time fans and introduce newcomers to what made Mega Man such a popular and iconic character. Mega Man Legacy Collection will feature all six games and more!\r In addition to the six Mega Man games, Mega Man Legacy Collection features new ways to experience the classic games with the Museum Mode and new Challenge Mode. Challenge Mode remixes gameplay segments from all six games, with plenty of scaling difficulty objectives for experienced players to conquer yet serving as a good starting point for new players, too. Museum Mode contains a comprehensive collection of history, high-res art and original concept pieces  a mega treat for any fan of Mega Man and video game history.\r FEATURES\r * Six classic games in one  Play a piece of video game history with the original six Mega Man games and experience the origins of the classic series.\r * 8-bit style with HD flair  The games retain their retro 8-bit style with an added HD finish, giving a crisp, clean look to the charming, classic sprites.\r * Challenge remix mode for new and veteran players  The robust new Challenge Mode remixes gameplay from all six games for a new type of challenge. It provides both increasingly difficult trials for experienced players and also teaches newcomers to become familiar with the style of the games and tackle some of the trickier areas.\r * Museum of the era  The Museum Mode features a massive repository of history and art collected from the era of the games in this collection. Take a look back at the history of Mega Man with loads of information, high-res art, concept pieces, sketches and more in the Museum.\r * Developed with an all-new engine  Using the newly developed Eclipse Engine, Capcom and Digital Eclipse are able to archive these six pieces of video game history with faithful reproductions of the originals for a new generation of gamers.\r * Leaderboards and video replays  Fans will be able to watch video replays of the top players on the leaderboards, showcasing a whole new generation of Mega Man talent!… Expand"
  },
  {
    "name": "NCAA Football 07",
    "details_link": "https://www.metacritic.com/game/xbox-360/ncaa-football-07",
    "publisher": "EA Sports",
    "release_date": "Jul 18 2006",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox 360"
    ],
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Football",
      "Sim",
      "Sim"
    ],
    "meta_score": 79,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/0/dd17c55dc9c09574f4e49003bc2b3947-98.jpg",
    "descriptions": "Momentum changes everything - now college football's most celebrated videogame turns the tide with NCAA Football 07. Whether battling your biggest rival or playing for the first-ever BCS National Championship Game in Dynasty Mode, success on the field depends on your ability to maintainMomentum changes everything - now college football's most celebrated videogame turns the tide with NCAA Football 07. Whether battling your biggest rival or playing for the first-ever BCS National Championship Game in Dynasty Mode, success on the field depends on your ability to maintain momentum. Featuring unprecedented graphics that capture every moment in complete detail—from the authenticity of the stadiums, mascots, and marching bands, to the true-to-life look and feel of the players on the field. [Electronic Arts]… Expand"
  },
  {
    "name": "Red Faction II",
    "details_link": "https://www.metacritic.com/game/gamecube/red-faction-ii",
    "publisher": "THQ",
    "release_date": "Mar 31 2003",
    "developers": [
      "Cranky Pants Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "PlayStation 4",
      "GameCube"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/8/44a435f3654e198e7252e7e362c83aeb-98.jpg",
    "descriptions": "The sequel to Red Faction keeps the same exciting features from the original and introduces a new cast of characters and storyline. In Red Faction II's futuristic setting, humankind is under the rule of an evil dictatorship, and only a group of freedom fighters called Red Faction stands inThe sequel to Red Faction keeps the same exciting features from the original and introduces a new cast of characters and storyline. In Red Faction II's futuristic setting, humankind is under the rule of an evil dictatorship, and only a group of freedom fighters called Red Faction stands in its way. As a super-soldier alias, you join their cause with an arsenal of high-powered weapons and heavy vehicles. You can even use this firepower on your environment, which can be strategically altered and destroyed.… Expand"
  },
  {
    "name": "Baldur's Gate: Dark Alliance",
    "details_link": "https://www.metacritic.com/game/gamecube/baldurs-gate-dark-alliance",
    "publisher": "Interplay",
    "release_date": "Nov 18 2002",
    "developers": [
      "High Voltage Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "GameCube"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 79,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/7/9f11f4f53bb1f2351a026676ee5aded9-98.jpg",
    "descriptions": "Baldur's Gate: Dark Alliance is an action RPG with an epic tale of intrigue, explosive spell effects, and highly detailed creatures and environments.  You play a one of three customizable characters, who returns to Baldur's Gate and joins the fight against the darkness that threatens itsBaldur's Gate: Dark Alliance is an action RPG with an epic tale of intrigue, explosive spell effects, and highly detailed creatures and environments.  You play a one of three customizable characters, who returns to Baldur's Gate and joins the fight against the darkness that threatens its peace.  Take on the monsters solo or with a friend in co-op mode.  Baldur's Gate: Dark Alliance is the first game to feature the real time application of the Dungeons & Dragons 3rd Edition rules.… Expand"
  },
  {
    "name": "NHL 2003",
    "details_link": "https://www.metacritic.com/game/gamecube/nhl-2003",
    "publisher": "EA Sports",
    "release_date": "Sep 30 2002",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Ice Hockey",
      "Sim"
    ],
    "meta_score": 79,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/5/e87abc1e138cdb5f439c8cfd9acfeff9-98.jpg",
    "descriptions": "In order to become a superstar in the NHL, you'll need a combination of speed, power, and moves. NHL 2003 gives you the abilities of all the stars and teams of pro hockey, but it's up to you to master them. This time, you have full control of the puck with Dynamic Deke Control and accurateIn order to become a superstar in the NHL, you'll need a combination of speed, power, and moves. NHL 2003 gives you the abilities of all the stars and teams of pro hockey, but it's up to you to master them. This time, you have full control of the puck with Dynamic Deke Control and accurate puck physics. The game also features four game modes, including Create-a-Player, enhanced sounds and animations, and dynamic camera work to bring you closer to the NHL action.… Expand"
  },
  {
    "name": "NFL Fever 2002",
    "details_link": "https://www.metacritic.com/game/xbox/nfl-fever-2002",
    "publisher": "Microsoft Game Studios",
    "release_date": "Nov 14 2001",
    "developers": [
      "Microsoft Game Studios"
    ],
    "platforms": "Xbox",
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 79,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/1/a5dd87888537a1c9de1aa8caa9f3ded1-98.jpg",
    "descriptions": "NFL Fever 2002 combines fast and hard-hitting action with deep season and career modes. Designed exclusively for Xbox, NFL Fever 2002 features stadiums from all 31 NFL teams and enables gamers to participate in up to 25 seasons. Players can amass both individual and team trophies and buildNFL Fever 2002 combines fast and hard-hitting action with deep season and career modes. Designed exclusively for Xbox, NFL Fever 2002 features stadiums from all 31 NFL teams and enables gamers to participate in up to 25 seasons. Players can amass both individual and team trophies and build their own dynasties, season after season. The fast-playing NFL tempo lets gamers explode through the holes and break loose, just like real NFL players.… Expand"
  },
  {
    "name": "Kohan: Ahriman's Gift",
    "details_link": "https://www.metacritic.com/game/pc/kohan-ahrimans-gift",
    "publisher": "Strategy First",
    "release_date": "Nov  5 2001",
    "developers": [
      "TimeGate Studios"
    ],
    "platforms": "PC",
    "num_players": "Up to 8 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "General",
      "General",
      "Command"
    ],
    "meta_score": 79,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/5/568d97258e0c8a2c6d360c96a91d4199-98.jpg",
    "descriptions": "A stand-alone prequel to \"Immortal Sovereigns,\" this RTS features you as one of the Kohan, an ancient race devastated by a cycle of world-breaking cataclysms. Now, as your strength grows and your destiny unfolds, you have to seize the reins of power and take your place in the war between theA stand-alone prequel to \"Immortal Sovereigns,\" this RTS features you as one of the Kohan, an ancient race devastated by a cycle of world-breaking cataclysms. Now, as your strength grows and your destiny unfolds, you have to seize the reins of power and take your place in the war between the Creator and the Shadow. [TimeGate Studios]… Expand"
  },
  {
    "name": "Pac-Man Collection",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/pac-man-collection",
    "publisher": "Namco",
    "release_date": "Jul 12 2001",
    "developers": [
      "Mass Media"
    ],
    "platforms": "Game Boy Advance",
    "genres": [
      "Action",
      "General"
    ],
    "meta_score": 79,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/9/624525deece614004418d7f53ee03416-98.jpg",
    "descriptions": "From 2D to 3D, Pac-Man has been through it all.  Now, you can relive four of his greatest adventures in Pac-Man Collection, which includes the original Pac-Man, the fast Pac-Attack, and the challenging Pac-Mania.  A special Pac-Man Arrangement mode offers more power-ups and items forFrom 2D to 3D, Pac-Man has been through it all.  Now, you can relive four of his greatest adventures in Pac-Man Collection, which includes the original Pac-Man, the fast Pac-Attack, and the challenging Pac-Mania.  A special Pac-Man Arrangement mode offers more power-ups and items for you--and the ghosts--to use.  Over the years, the pellet-mucher has learned how to dodge, eat, and jump over ghosts, but the chase continues.… Expand"
  }
]