[{"name": "Grotesque Tactics 2: Dungeons & Donuts", "details_link": "https://www.metacritic.com/game/pc/grotesque-tactics-2-dungeons-donuts", "publisher": "Meridian4", "release_date": "Nov 21 2011", "developers": ["Silent Dreams"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Modern", "General", "Tactics"], "meta_score": 48, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/36ed3a79c86bc8a6f8234238bc966021-98.jpg", "descriptions": "The story of Grotesque Tactics 2: Dungeons & Donuts begins as the citizens of the Kingdom of Glory celebrate their victory in the catacombs of their former enemies.  The revelry is disturbed by a sudden all-encompassing fog.  Those that the fog engulfed vanished screaming into the void.The story of Grotesque Tactics 2: Dungeons & Donuts begins as the citizens of the Kingdom of Glory celebrate their victory in the catacombs of their former enemies.  The revelry is disturbed by a sudden all-encompassing fog.  Those that the fog engulfed vanished screaming into the void.  Full of despair, the remaining survivors barricade themselves in the depths. Not much time passes before food becomes short – and moods grim.  The Knights of Glory, shady mercenaries and the arrogant high elves band into guilds and begin a struggle for food, survival and escape. Too bad the guilds can’t stand each other, and noone notices the awakening of dark forces in the dungeons below…… Expand"}, {"name": "I Saw Black Clouds", "details_link": "https://www.metacritic.com/game/playstation-4/i-saw-black-clouds", "publisher": "Wales Interactive", "release_date": "Mar 30 2021", "developers": ["Ghost Dog Films"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 48, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/5/1842d67d09244f63141d419648d2362d-98.jpg", "descriptions": "After the unexpected death of a close friend, Kristina returns to her hometown looking for answers, only to unearth a string of dark secrets. I Saw Black Clouds is an interactive psychological thriller with supernatural elements and branching storylines."}, {"name": "Vaccine", "details_link": "https://www.metacritic.com/game/xbox-one/vaccine", "publisher": "Rainy Night Creations", "release_date": "Feb 21 2017", "developers": ["Rainy Night Creations", "RNC"], "platforms": ["PC", "PlayStation 4", "Switch", "Wii U", "Xbox One"], "genres": ["Action Adventure", "Survival"], "meta_score": 48, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/025faffa1d83dd8abeed370aa018a366-98.jpg", "descriptions": "Find a vaccine for your infected friend before time runs out, but be aware your friend will relapse sooner or later and you’ll have to find a new vaccine in a new randomly rebuilt house. Will you be able uncover the mystery to save your friend once and for all!?"}, {"name": "Special Forces: Team X", "details_link": "https://www.metacritic.com/game/pc/special-forces-team-x", "publisher": "Atari", "release_date": "Feb  6 2013", "developers": ["Zombie Studios"], "platforms": ["Xbox 360", "PC"], "genres": ["Action", "Shooter", "General", "Shooter", "Third-Person", "Modern", "Arcade"], "meta_score": 48, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/b2141930879beb653190b0ecb9b47ba9-98.jpg", "descriptions": "Special Forces: Team X is a stylized, team centric 3rd Person Shooter, featuring brutal firefights between elite squads of Special Forces operatives. Special Forces: Team X introduces a brand new take on multiplayer map creation, giving the players the chance to create their own battleSpecial Forces: Team X is a stylized, team centric 3rd Person Shooter, featuring brutal firefights between elite squads of Special Forces operatives. Special Forces: Team X introduces a brand new take on multiplayer map creation, giving the players the chance to create their own battle arenas. The game supports two, three, and four teams during matches, so staying with your team has never been more important as players that stick together will be richly awarded in the game. Special Forces: Team X will be available for download this fall.… Expand"}, {"name": "Teenage Mutant Ninja Turtles 2: Battle Nexus", "details_link": "https://www.metacritic.com/game/xbox/teenage-mutant-ninja-turtles-2-battle-nexus", "publisher": "Konami", "release_date": "Oct 19 2004", "developers": ["Konami"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 48, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/565afc8ddf3e6bc72b340fda29b9a2a9-98.jpg", "descriptions": "The Teenage Mutant Ninja Turtles return--this time featuring simultaneous play for up to four players. In both cooperative and head-to-head modes, you and your friends can play as your favorite green heroes: Leonardo, Michelangelo, Donatello, and Raphael. Punch, kick, and duck your wayThe Teenage Mutant Ninja Turtles return--this time featuring simultaneous play for up to four players. In both cooperative and head-to-head modes, you and your friends can play as your favorite green heroes: Leonardo, Michelangelo, Donatello, and Raphael. Punch, kick, and duck your way through battles against The Shredder and his evil pack of Foot Ninjas. Each Turtle has distinct characteristics and abilities, and you can combine moves to perform more than 30 different types of attacks. … Expand"}, {"name": "Strike Force Bowling", "details_link": "https://www.metacritic.com/game/playstation-2/strike-force-bowling", "publisher": "Crave", "release_date": "May 10 2004", "developers": ["Lab Rats Games"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Bowling"], "meta_score": 48, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/8f0ed828398f86b2133a82e1f8017bfb-98.jpg", "descriptions": "You no longer have to wait for league night to enjoy the fun of competitive bowling! Taking the game to a whole new level, Strike Force Bowling features authentic real time physics in an easy-to-use arcade style control. Pins never quite fall the same way twice, bowling balls react accordingYou no longer have to wait for league night to enjoy the fun of competitive bowling! Taking the game to a whole new level, Strike Force Bowling features authentic real time physics in an easy-to-use arcade style control. Pins never quite fall the same way twice, bowling balls react according to a combination of spin, material and lane friction. Noise of the alley getting on your nerves? Take your game on the road! Knock over skull-tipped pins on the pitching deck of a pirate ship. Play under the watchful eyes of the Sphinx in ancient Egypt. Bowl over tiki heads at the end of a pier on a tropical island. These and other exotic locations await! Six unique play modes keep things interesting, including Skins, Golf, Challenge and Practice modes, as well as Open and Tournament play. Choose from eight high-polygon players, complete with their own animated reactions to gameplay. Bowling styles can be customized according to strength, accuracy and curve. [Crave Entertainment]… Expand"}, {"name": "Pearl Harbor: Defend the Fleet", "details_link": "https://www.metacritic.com/game/pc/pearl-harbor-defend-the-fleet", "publisher": "WizardWorks", "release_date": "May 15 2001", "developers": ["Running Dog"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "General", "General"], "meta_score": 48, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/7/e3c2c4a4610cca4563b59ee315fe5313-98.jpg", "descriptions": "If you LOVED the movie and feel the need to get some of your own trigger time, try this simple arcade shooter which finds you as a deck gunner defending the Pacific Fleet against waves of incoming Japanese fighters, bombers, and kamikazees."}, {"name": "Power Spike Pro Beach Volleyball", "details_link": "https://www.metacritic.com/game/playstation/power-spike-pro-beach-volleyball", "publisher": "Infogrames", "release_date": "Nov 13 2000", "developers": ["Carapace"], "platforms": ["PC", "PlayStation"], "genres": ["Sports", "Traditional", "Volleyball"], "meta_score": 48, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/94fcd152416216d74dc112dafad30d24-98.jpg", "descriptions": "Power Spike Pro Beach Volleyball makes a good attempt, but its inconsistencies and shoddy control detract from the overall experience."}, {"name": "Call of Juarez: The Cartel", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-juarez-the-cartel", "publisher": "Ubisoft", "release_date": "Jul 19 2011", "developers": ["Techland"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Modern", "Modern", "Arcade"], "meta_score": 47, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/6/8038870003d4fe1857f1cd9a266562e3-98.jpg", "descriptions": "Call of Juarez: The Cartel is the third game from the Call of Juarez series."}, {"name": "Indianapolis 500 Legends", "details_link": "https://www.metacritic.com/game/wii/indianapolis-500-legends", "publisher": "Destineer", "release_date": "Dec 14 2007", "developers": ["Torus Games"], "platforms": "Wii", "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 47, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/1210bb56bb847bd3afa5b5966c423d5b-98.jpg", "descriptions": "In Indianapolis 500 Legends, players assume the roles of 30 of the sport’s most daring real-life legends like Al Unser, A.J. Foyt and Parnelli Jones as they draft, dodge and slingshot through a virtual minefield on a track where speeds of up to 180 miles per hour defined racing’s frontierIn Indianapolis 500 Legends, players assume the roles of 30 of the sport’s most daring real-life legends like Al Unser, A.J. Foyt and Parnelli Jones as they draft, dodge and slingshot through a virtual minefield on a track where speeds of up to 180 miles per hour defined racing’s frontier mentality. Experience crashes, upsets and thrills with mission-based racing that puts you in the middle of some of the Indy 500’s most famous and infamous moments. Drive the last of the front-engine roadsters; experiment with the first turbine cars or strap on the earliest sets of bolt-on wings. But buckle up - back then the rules were few, protection was a luxury and making it to the finish line was never guaranteed. [Destineer]… Expand"}, {"name": "Deep Black: Episode 1", "details_link": "https://www.metacritic.com/game/xbox-360/deep-black-episode-1", "publisher": "505 Games", "release_date": "Apr 25 2012", "developers": ["Biart"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "General", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 47, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/52320a4d7d2d69626366e465f57b0b94-98.jpg", "descriptions": "With the majority of the gameplay taking place below the water's surface, action-adventure fans will need to master new skills to fight hostile enemies and infiltrate enemy bases. Players will take to the murky depths armed with equipment ranging from specialized underwater jet packs withWith the majority of the gameplay taking place below the water's surface, action-adventure fans will need to master new skills to fight hostile enemies and infiltrate enemy bases. Players will take to the murky depths armed with equipment ranging from specialized underwater jet packs with integrated harpoons, mini submersibles and other high-tech equipment to battle their submerged enemies.… Expand"}, {"name": "Frogger: Ancient Shadow", "details_link": "https://www.metacritic.com/game/xbox/frogger-ancient-shadow", "publisher": "Konami", "release_date": "Sep 28 2005", "developers": ["Hudson Soft"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/23fc09e1053a680f9a14dfa9bc899084-98.jpg", "descriptions": "Frogger is Back to His Classic Beginnings. His home of Firefly Swamp is being overrun by Dr. Wani and his evil plans. Join Frogger in his latest adventure as he explores seven different worlds and tries to restore order to his beloved swamp. Features classic, addictive \"hop andFrogger is Back to His Classic Beginnings. His home of Firefly Swamp is being overrun by Dr. Wani and his evil plans. Join Frogger in his latest adventure as he explores seven different worlds and tries to restore order to his beloved swamp. Features classic, addictive \"hop and dodge\" gameplay. Mini games with up to 4 players on all platforms. Over 30 levels of play. Wide range of character moves, such as the double jump, tongue grab, and more. Special bonus - orignial 1981 Frogger arcade game included on all platforms.… Expand"}, {"name": "PDC World Championship Darts 2008", "details_link": "https://www.metacritic.com/game/playstation-2/pdc-world-championship-darts-2008", "publisher": "O-Games", "release_date": "Jun 16 2009", "developers": ["Oxygen Interactive"], "platforms": "PlayStation 2", "genres": ["Sports", "Alternative", "Other"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/e0ff456a2b9a503467e4c5cfb15974ee-98.jpg", "descriptions": "(Currently available in the UK/EU only)  Go head-to-head with the greatest PDC Champions and be part of the year’s most fierce console Championship with PDC World Championship Darts 2008. Starring even more Champions, the full line up of electrifying tournaments, exceptional graphic(Currently available in the UK/EU only)  Go head-to-head with the greatest PDC Champions and be part of the year’s most fierce console Championship with PDC World Championship Darts 2008. Starring even more Champions, the full line up of electrifying tournaments, exceptional graphic enhancements, even more play modes and additional formats - PDC World Championship Darts is back for 2008. The first ten to be announced include Phil ‘The Power’ Taylor, the greatest player ever to throw a dart, winning his 13th World Championship title in 2006. Raymond ‘The Man’ van Barneveld, the current World Champion who defeated Taylor in the greatest ever final in January 2007. Also starring in the game are Colin ‘Jaws’ Lloyd, the number one player in the world in 2004 and 2005, winning two major titles along the way, Peter ‘One Dart’ Manley, double World Champion John ‘Darth Maple’ Part from Canada and the ever-popular Wayne “Hawaii 501” Mardle. [Oxygen Games]… Expand"}, {"name": "Fantastic Four: Rise of the Silver Surfer", "details_link": "https://www.metacritic.com/game/playstation-3/fantastic-four-rise-of-the-silver-surfer", "publisher": "Take-Two Interactive", "release_date": "Jun 15 2007", "developers": ["Visual Concepts"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 47, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/4/268b5abda6ded6097b06b4388e8187ac-98.jpg", "descriptions": "Marvel’s first family of Super Heroes face its greatest challenge yet as the enigmatic, intergalactic herald, The Silver Surfer, comes to Earth to prepare it for destruction. Transform into any member of the Fantastic Four to fight enemies from the Fantastic Four Universe including SilverMarvel’s first family of Super Heroes face its greatest challenge yet as the enigmatic, intergalactic herald, The Silver Surfer, comes to Earth to prepare it for destruction. Transform into any member of the Fantastic Four to fight enemies from the Fantastic Four Universe including Silver Surfer, Super Skrull and more. Battle in 4-player co-op with easy pick up and play ability. Combine super powers for devastating team attacks with the new Fusion Attack System. Truly destructible environments: smash, wreck, wreak havoc. Loads of unlockables including alternate Fantastic Four costumes, historical comic covers, and more. Enhance your super powers: use the Sixaxis controller for mega boost attacks. [2K Games]… Expand"}, {"name": "Devil's Hunt", "details_link": "https://www.metacritic.com/game/pc/devils-hunt", "publisher": "1C Entertainment", "release_date": "Sep 17 2019", "developers": ["Layopi Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 47, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/1ab7cf2c8afcb1e2619e778016a94e00-98.jpg", "descriptions": "The war between Demons and Angels takes you to hell and back in Devil’s Hunt. Play as Desmond in this third-person action adventure game, as he discovers his demonic powers with the fate of the world hanging in the balance of the greatest conflict known to humankind."}, {"name": "Hexodius", "details_link": "https://www.metacritic.com/game/pc/hexodius", "publisher": "Brain Slap Studio", "release_date": "Jun 21 2013", "developers": ["Brain Slap Studio"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 47, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/38042b6ea076dd035232f5380bef70a9-98.jpg", "descriptions": "Hexodius is a twin stick shooter mixted with some dungeon crawler mechanics."}, {"name": "G.I. Joe: The Rise of Cobra", "details_link": "https://www.metacritic.com/game/ds/gi-joe-the-rise-of-cobra", "publisher": "Electronic Arts", "release_date": "Aug  4 2009", "developers": ["Backbone Entertainment"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "num_players": "1-2 ", "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 47, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/84082c78c3f4548856e3665a4b40cbe1-98.jpg", "descriptions": "As COBRA unleashes its deadliest plot yet, the G.I. JOE Team is counting on you and your hand-picked team of heroes to lead the counterattack. Every mission is critical and so is every G.I. JOE character. Picking up where the Paramount Pictures live action film leaves off, G.I. JOE The RiseAs COBRA unleashes its deadliest plot yet, the G.I. JOE Team is counting on you and your hand-picked team of heroes to lead the counterattack. Every mission is critical and so is every G.I. JOE character. Picking up where the Paramount Pictures live action film leaves off, G.I. JOE The Rise of Cobra is an accessible third person action-arcade shooter that allows players to recreate and relive the greatest moments from the film, cartoon series and action toy line.  Unique top-down arcade shooter, built from the ground up specifically for the Nintendo DS. Choose from six G.I. JOE characters and five COBRA characters. More than 20 missions across four environments, plus playable vehicles. Create your own G.I. JOE vs. COBRA battles with up to 4 players (via wireless play). [Electronic Arts]… Expand"}, {"name": "Mahjong Tales: Ancient Wisdom", "details_link": "https://www.metacritic.com/game/playstation-3/mahjong-tales-ancient-wisdom", "publisher": "Creat Studios", "release_date": "Jan  8 2009", "developers": ["Creat Studios"], "platforms": ["PC", "PlayStation 3"], "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Board / Card Game", "General"], "meta_score": 47, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/d0fde7166a03d8601f7d32e4f7c3d2a5-98.jpg", "descriptions": "[Playstation Network]  The classic game comes to the PlayStation Network, combining the hottest features of Mahjong into a single game featuring a narrated story mode that whisks players away into a storybook adventure, revealing hand-illustrated ancient Chinese tales. Mahjong Tales delivers[Playstation Network]  The classic game comes to the PlayStation Network, combining the hottest features of Mahjong into a single game featuring a narrated story mode that whisks players away into a storybook adventure, revealing hand-illustrated ancient Chinese tales. Mahjong Tales delivers multiple game modes and features trophy support. [SCEA]… Expand"}, {"name": "Cocoro: Line Defender", "details_link": "https://www.metacritic.com/game/3ds/cocoro-line-defender", "publisher": "Moving Player", "release_date": "Jun 26 2014", "developers": ["Moving Player"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "Defense"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/62bdc7672f4ad119b20fa898ecff570d-98.jpg", "descriptions": "Strategy line defender game. Japanese Universe.\r A legend handed down through the ages says that the Cocoro Islands were created by the god Perfect. He breathed his spirit into them and, through his will alone, each one received a founding entity. These founding entities had extraordinaryStrategy line defender game. Japanese Universe.\r A legend handed down through the ages says that the Cocoro Islands were created by the god Perfect. He breathed his spirit into them and, through his will alone, each one received a founding entity. These founding entities had extraordinary powers that were to be used for the good of Cocoro; the Yoko were their protectors. And that is the incredible story were going to tell you...\r Cocoro is a strategy game where you control the \"Yoko\" of each of the four elements. In this typically Asiatic game world, you must unlock heroes with different characteristics and an array of weapons you can upgrade throughout the battles.… Expand"}, {"name": "Dreamkiller", "details_link": "https://www.metacritic.com/game/pc/dreamkiller", "publisher": "Aspyr", "release_date": "Oct 12 2009", "developers": ["Mindware Studios"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 47, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/5cd3a80638036ec8d5bd3d6ded21e064-98.jpg", "descriptions": "Dreamkiller takes gamers inside the world of dark and twisted nightmares. Gamers take on the role of Alice Drake, a psychologist with the extraordinary ability to enter the minds of her patients and combat the ravenous foes haunting their dreams. Utilizing a host of fantastic weapons and herDreamkiller takes gamers inside the world of dark and twisted nightmares. Gamers take on the role of Alice Drake, a psychologist with the extraordinary ability to enter the minds of her patients and combat the ravenous foes haunting their dreams. Utilizing a host of fantastic weapons and her own special abilities, Alice confronts our common demons only to discover an even deeper menace reigns within. The ultimate showdown becomes inevitable between that which would torment and she who will protect, and only one force will prevail amidst a variety of dreamscapes as varied and bizarre as the human mind itself. The world of dreams and nightmares allows for each level to be a completely different environment with different sets of enemies. In each dream world players can enter a secondary level of the subconscious - a world within a world - and encounter new enemies, weapons and power-ups. Players can use Alice’s teleportation powers to quickly zoom around rooms to dodge enemies and achieve a tactical advantage over enemies. Alice's weapons are massive and fierce, each featuring two unique attacks and outlandish ammunition including lightning bolts, lasers, sticky grenades and even \"Happy Thoughts.\" [Aspyr]… Expand"}, {"name": "My Pokemon Ranch", "details_link": "https://www.metacritic.com/game/wii/my-pokemon-ranch", "publisher": "Nintendo", "release_date": "Jun  9 2008", "developers": ["Ambrella"], "platforms": "Wii", "num_players": "Friend System Only", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 47, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/388ca2ca15bbfce581d64c863501532c-98.jpg", "descriptions": "[WiiWare]  Gather your Pokémon and Miis and watch them interact on your ranch. Take pictures to send to friends! The Pokémon phenomenon debuts on WiiWare with My Pokémon Ranch, a game that lets you watch as Pokémon and Miis interact with each other for the first time. Enjoy the relaxing[WiiWare]  Gather your Pokémon and Miis and watch them interact on your ranch. Take pictures to send to friends! The Pokémon phenomenon debuts on WiiWare with My Pokémon Ranch, a game that lets you watch as Pokémon and Miis interact with each other for the first time. Enjoy the relaxing Ranch life by viewing your Ranch and its Pokémon, taking pictures, and sending those pictures to your friends. The more Pokémon and Miis that you bring to your Ranch, the more fun it becomes. My Pokémon Ranch can be linked with the Nintendo DS Pokémon Diamond version and Pokémon Pearl version Game Cards to deposit the Pokémon you've caught in these games to your Ranch. You can deposit a maximum of 1,000 Pokémon from up to eight different Game Cards. Make your Ranch more lively by playing with your friends and family. [Nintendo]… Expand"}, {"name": "The Guy Game", "details_link": "https://www.metacritic.com/game/xbox/the-guy-game", "publisher": "Gathering", "release_date": "Aug 30 2004", "developers": ["Top Heavy Studios"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Trivia / Game Show"], "meta_score": 47, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/c03e7851e794539f1d3ef204a2718238-98.jpg", "descriptions": "The Guy Game, which was shot live on South Padre Island during spring break, challenges you and your friends to match wits with more than 60 female coeds. Each episode features these attractive college students in a variety of stunts, interviews, and challenges. With a personal cheerleaderThe Guy Game, which was shot live on South Padre Island during spring break, challenges you and your friends to match wits with more than 60 female coeds. Each episode features these attractive college students in a variety of stunts, interviews, and challenges. With a personal cheerleader by your side, you can take on three of your friends in answering more than 1,000 trivia questions from the worlds of sports, movies, TV, and more. The game also includes minigames and a Hottie Challenge.… Expand"}, {"name": "Smashing Drive", "details_link": "https://www.metacritic.com/game/gamecube/smashing-drive", "publisher": "Namco", "release_date": "Feb 18 2002", "developers": ["Point of View"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 47, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/9/7e35dd8512dcd31540cc9d8b9c2f6480-98.jpg", "descriptions": "The shortest distance between two points isn't always a straight line... and in Smashing Drive, it's a way of life! Good driving isn't enough!!! When lookin' for a little extra green, a cabbie relies on his knowledge of every neighborhood, street, and alley shortcut. Navigating a serpentineThe shortest distance between two points isn't always a straight line... and in Smashing Drive, it's a way of life! Good driving isn't enough!!! When lookin' for a little extra green, a cabbie relies on his knowledge of every neighborhood, street, and alley shortcut. Navigating a serpentine course of oncoming traffic, cart vendors, newsstands, and pedestrians in order to beat the competing hack to the fare's final destination is the challenge. But we've got you covered. Get into the habit of collecting power-ups and finding shortcuts or your only tip will be advice to invest in driving lessons.… Expand"}, {"name": "MTV Sports: T.J. Lavin's Ultimate BMX", "details_link": "https://www.metacritic.com/game/playstation/mtv-sports-tj-lavins-ultimate-bmx", "publisher": "THQ", "release_date": "Mar 27 2001", "developers": ["Blue Shift"], "platforms": "PlayStation", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/aaa711d97c782d749d4c2b1896a93d25-98.jpg", "descriptions": "Landing vert tricks and pulling off long grinds can be a chore, because the game has a seemingly random system of determining whether or not your bike is straight enough to land. A coin toss would be more predictable."}, {"name": "Alone in the Dark", "details_link": "https://www.metacritic.com/game/playstation-2/alone-in-the-dark", "publisher": "Atari", "release_date": "Jun 23 2008", "developers": ["Hydravision"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 47, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/ee28acefd2e0f8054a421c7a7c8f3639-98.jpg", "descriptions": "Taking inspiration from the presentation style and structure of a number of acclaimed and globally popular TV action dramas, Alone in the Dark is split into a number of distinct episodes in a season-style format. With approximately 30-40 minutes of gameplay comprising each episode, theTaking inspiration from the presentation style and structure of a number of acclaimed and globally popular TV action dramas, Alone in the Dark is split into a number of distinct episodes in a season-style format. With approximately 30-40 minutes of gameplay comprising each episode, the structure of Alone in the Dark is adapted for an audience familiar with the hard-hitting bite-size delivery of contemporary TV dramas, offering easy accessibility whether the player has hours to devote or only wants a quick TV-style fix. Each time the player launches a saved game, the episode begins with a video summary of the previous episode to quickly re-immerse the player in the story, removing the need to remember where they were or what they were doing. Every episode closes with a nail-biting cliff-hanger ending to rattle players' nerves, and if the player is leaving the game a video teaser of the next episode plays to leave them wanting more. Alone in the Dark returns with a heart-stopping survival experience realized through the use of state-of-the-art real-time physics and unprecedented environmental interaction. Delivering an action-orientated experience within a highly detailed, open environment, Alone in the Dark once again strives innovation and excellence within the genre. [Atari]… Expand"}, {"name": "Legendary", "details_link": "https://www.metacritic.com/game/xbox-360/legendary", "publisher": "Gamecock Media Group", "release_date": "Nov  4 2008", "developers": ["Spark Unlimited"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "8  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 47, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/88e343d22ca256e2ee20091afdce8b02-98.jpg", "descriptions": "(Also known as \"Legendary: The Box\")  Legendary tells the story of Charles Deckard, an art thief who is duped into stealing Pandora’s Box. When he inadvertently opens it, he releases hordes of beasts thought to be fictional – such as werewolves and gryphons – into an unprepared modern world.(Also known as \"Legendary: The Box\")  Legendary tells the story of Charles Deckard, an art thief who is duped into stealing Pandora’s Box. When he inadvertently opens it, he releases hordes of beasts thought to be fictional – such as werewolves and gryphons – into an unprepared modern world. A full scale war between man and myth begins, and it is quickly complicated by the actions of powerful secret societies. As the person responsible for releasing this terror, Deckard’s unwittingly become the only person capable of containing it once more and saving civilization from being destroyed by the terrifying creatures. [Gamecock Media]… Expand"}, {"name": "Tom Clancy's HAWX 2", "details_link": "https://www.metacritic.com/game/wii/tom-clancys-hawx-2", "publisher": "Ubisoft", "release_date": "Nov  9 2010", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 47, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/f72611f3d4249e323c50f1237e244160-98.jpg", "descriptions": "Tom Clancy’s H.A.W.X. 2 plunges fans into an explosive environment where they can become elite aerial soldiers in control of the world's most technologically advanced aircraft. The game will appeal to a wide array of gamers as players will have the chance to control exceptional pilotsTom Clancy’s H.A.W.X. 2 plunges fans into an explosive environment where they can become elite aerial soldiers in control of the world's most technologically advanced aircraft. The game will appeal to a wide array of gamers as players will have the chance to control exceptional pilots trained to use cutting edge technology in amazing aerial warfare missions. … Expand"}, {"name": "Solarix", "details_link": "https://www.metacritic.com/game/pc/solarix", "publisher": "KISS Ltd.", "release_date": "Apr 30 2015", "developers": ["Pulsetense Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 47, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/2/517cf2a05a0be6f50e3b58c24e81c963-98.jpg", "descriptions": "Solarix is a sci-fi horror game featuring open-ended levels for both combative and stealth-focused play styles."}, {"name": "Saw II: Flesh & Blood", "details_link": "https://www.metacritic.com/game/xbox-360/saw-ii-flesh-blood", "publisher": "Konami", "release_date": "Oct 19 2010", "developers": ["Zombie Studios"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 47, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/5/7599efa27763280454918bbba4105e94-98.jpg", "descriptions": "Step into the dark and tormented world of Saw 2 and experience the gruesome traps that Jigsaw has created to test your will to survive.  With new traps, puzzles, and combat system players will need to think fast and act quick to pass the rigors of the tests Jigsaw has engineered. Set betweenStep into the dark and tormented world of Saw 2 and experience the gruesome traps that Jigsaw has created to test your will to survive.  With new traps, puzzles, and combat system players will need to think fast and act quick to pass the rigors of the tests Jigsaw has engineered. Set between the Saw and  Saw II movies, the game follows Detective Tapp's estranged son Michael, who become Jigsaw's next subject while he is investigating father's recent death.   … Expand"}, {"name": "The Ant Bully", "details_link": "https://www.metacritic.com/game/pc/the-ant-bully", "publisher": "Midway", "release_date": "Jul 24 2006", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 47, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/6/0f33ac1e6c88a7682f1a5df79af0b68a-98.jpg", "descriptions": "Go pick on someone your own size! After bullying an innocent ant colony, a young boy named Lucas is magically shrunk down to ant size and embarks on a remarkable adventure. Play as Lucas, experiencing the dangerous and thrilling life of an ant as you battle, explore and forge new friendshipsGo pick on someone your own size! After bullying an innocent ant colony, a young boy named Lucas is magically shrunk down to ant size and embarks on a remarkable adventure. Play as Lucas, experiencing the dangerous and thrilling life of an ant as you battle, explore and forge new friendships with natives and other species in his new ant world. Based on exciting moments from the upcoming digitally animated family adventure The Ant Bully, and featuring all-new challenges created especially for the game, help Lucas evolve from recluse to hero in his quest to save the colony from extermination. [Midway]… Expand"}, {"name": "Catwoman", "details_link": "https://www.metacritic.com/game/gamecube/catwoman", "publisher": "EA Games", "release_date": "Jul 20 2004", "developers": ["Argonaut Games"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 47, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/f7b5164a7f6f865173f68218ea2f91fb-98.jpg", "descriptions": "A classic story of betrayal and revenge unravels in Catwoman, which is based on the film from Warner Bros. Pictures. You'll control Catwoman, a woman brought back to life by a rare Egyptian cat, as she sets out to discover the truth about herself and her murderer. With Catwoman's catlikeA classic story of betrayal and revenge unravels in Catwoman, which is based on the film from Warner Bros. Pictures. You'll control Catwoman, a woman brought back to life by a rare Egyptian cat, as she sets out to discover the truth about herself and her murderer. With Catwoman's catlike skills, you can leap across roofs, run up walls, pounce on prey, and avoid enemy bullets. In addition, your can use her whip to swing through the air and use the interactive environments to knock your foes unconscious. … Expand"}, {"name": "Pac-Man Fever", "details_link": "https://www.metacritic.com/game/playstation-2/pac-man-fever", "publisher": "Namco", "release_date": "Sep  2 2002", "developers": ["Mass Media"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party"], "meta_score": 47, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/fb63bb15509b373176f1eddb3cec2312-98.jpg", "descriptions": "The outrageously fun party game stars Pac-Man, Ms. Pac-Man and many other Namco favorites from popular franchises such as Tekken, Ridge Racer and Soul Calibur. Up to four players partake in more than 30 mini-games and three differently themed game boards. Try to recover all of the mini-gamesThe outrageously fun party game stars Pac-Man, Ms. Pac-Man and many other Namco favorites from popular franchises such as Tekken, Ridge Racer and Soul Calibur. Up to four players partake in more than 30 mini-games and three differently themed game boards. Try to recover all of the mini-games stolen by those pesky, party-crashing Ghosts and determine who the real party animal is! [Namco]… Expand"}, {"name": "Monster Jam: Maximum Destruction", "details_link": "https://www.metacritic.com/game/playstation-2/monster-jam-maximum-destruction", "publisher": "Ubisoft", "release_date": "Jun 13 2002", "developers": ["Ubisoft"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Truck"], "meta_score": 47, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/1f9e8a1b512517de0e519cdcf2c967cb-98.jpg", "descriptions": "Get behind the wheel of the world's most famous monster trucks with a brutal arsenal of weapons and go head-to-head in savage vehicular combat. Jump in, hold on, and grind it out through interactive arenas with multiple sub-levels, tricks, traps, and surprises. Play for total carnage as youGet behind the wheel of the world's most famous monster trucks with a brutal arsenal of weapons and go head-to-head in savage vehicular combat. Jump in, hold on, and grind it out through interactive arenas with multiple sub-levels, tricks, traps, and surprises. Play for total carnage as you master your tricks in six modes of play including a Freestyle session and the no-holds-barred Championship mode where your rewards pay off in the ultimate in monster truck destruction. [Ubi Soft]… Expand"}, {"name": "The Weakest Link", "details_link": "https://www.metacritic.com/game/pc/the-weakest-link", "publisher": "Activision", "release_date": "Oct  2 2001", "developers": ["Activision", "Traveller's Tales"], "platforms": "PC", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/468c8621faf72a80c5dd8f883b44379a-98.jpg", "descriptions": "Join up to 6 other players as Anne Robinson slings over 100,000 questions (along with a few insults) at you in the home version of the popular T.V. game show."}, {"name": "Hellboy: The Science of Evil", "details_link": "https://www.metacritic.com/game/playstation-3/hellboy-the-science-of-evil", "publisher": "Konami", "release_date": "Jun 24 2008", "developers": ["Krome Studios"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Action Adventure", "Beat-'Em-Up", "Beat-'Em-Up", "Linear"], "meta_score": 47, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/4/c036526e08cc9018d21335058c32b12c-98.jpg", "descriptions": "Hellboy provides players with fresh adventures featuring the acclaimed comic book's unmistakable fusion of action, atmosphere and humor. On the trail of a crazed witch, Hellboy uncovers a Nazi plot for world domination and must rush to defeat the crazed Hermann Von Klempt before he can exertHellboy provides players with fresh adventures featuring the acclaimed comic book's unmistakable fusion of action, atmosphere and humor. On the trail of a crazed witch, Hellboy uncovers a Nazi plot for world domination and must rush to defeat the crazed Hermann Von Klempt before he can exert his evil will upon a hapless world. As a visceral brawler, the game lets players unleash Hellboy's superhuman abilities as they smash their way through hordes of enemies with contextual use of the environment for added destructive power and strategy. An original storyline set in the Hellboy universe, filled with classic characters from the comic book. Explosive battle system with contextual grappling commands lets players experience Hellboy's supernatural might as he unleashes the Right Hand of Doom on his enemies. Use strategy to take down hordes of enemies - toss a straggler into the crowd or manipulate the environment to create more manageable groups of enemies. Play as series favorites Abe Sapein and Liz Sherman in cooperative multiplayer modes. [Konami]… Expand"}, {"name": "MLB Front Office Manager", "details_link": "https://www.metacritic.com/game/xbox-360/mlb-front-office-manager", "publisher": "2K Sports", "release_date": "Jan 26 2009", "developers": ["Blue Castle Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 30 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Management", "Management", "Sim"], "meta_score": 47, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/3/dfe377d5a764625e558a4b189aca73bb-98.jpg", "descriptions": "MLB Front Office Manager lets gamers do everything a real-life baseball GM can do to develop a team from Spring Training through a full MLB season, into the playoffs and the World Series. Using Major League teams and players, gamers create their own fictional baseball universe and buildMLB Front Office Manager lets gamers do everything a real-life baseball GM can do to develop a team from Spring Training through a full MLB season, into the playoffs and the World Series. Using Major League teams and players, gamers create their own fictional baseball universe and build their reputation into elite status. Gamers can replace aging veterans with rookies, scout the Minor Leagues, make blockbuster trades, and even participate in bidding wars for posted players from Japan as they make their way to the Hall of Fame. A true baseball general manager also acts as a mentor in MLB Front Office Manager. Legendary Oakland Athletics' GM Billy Beane offers advice, encouragement and guidance as gamers steer a team through the intense competition that is Major League Baseball. Billy Beane is considered one of the most talented GM’s in baseball today and has turned the Athletics into a consistent postseason contender since being named GM in 1997. Now, in MLB Front Office Manager, he passes that knowledge on to gamers. MLB Front Office Manager offers two distinct game modes. Become the GM in Career Mode, and manage a team through a 30 year career that hopefully leads to the Hall of Fame. As the gamer’s knowledge and skill progresses over time, gamers gain points to improve various areas and help the team win games as a result. With Online Fantasy Mode, create an online head-to-head management experience. With up to 30 Managers in the league, gamers can compete against friends to see who has what it takes to be the best. [2K Sports]… Expand"}, {"name": "World Racing 2", "details_link": "https://www.metacritic.com/game/xbox/world-racing-2", "publisher": "Evolved Games", "release_date": "Aug 15 2006", "developers": ["Synetic"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/c69151ac1252968a752f07cbc24036a1-98.jpg", "descriptions": "World Racing 2 is the sequel to World Racing - Mercedes Benz. It puts the fun of driving at centre stage and presents a challenging racing experience featuring a revolutionary 3D landscape engine, adjustable driving characteristics, improved technology and an exciting selection of differentWorld Racing 2 is the sequel to World Racing - Mercedes Benz. It puts the fun of driving at centre stage and presents a challenging racing experience featuring a revolutionary 3D landscape engine, adjustable driving characteristics, improved technology and an exciting selection of different cars from various manufacturers. World Racing 2 is all about fun racing. Players will enjoy better physics, simplified menus, speed-optimized track layouts and livelier 3D environments.… Expand"}, {"name": "What's Cooking with Jamie Oliver", "details_link": "https://www.metacritic.com/game/ds/whats-cooking-with-jamie-oliver", "publisher": "Atari", "release_date": "Oct 21 2008", "developers": ["Keen Games"], "platforms": "DS", "genres": ["Simulation", "General", "General", "Virtual", "Career"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/414d6839b5eaa662d865407f90b16fc1-98.jpg", "descriptions": "What's Cooking? Jamie Oliver is a fun and interactive cooking game featuring a whole book's worth of Jamie's fantastic recipes, each accompanied by David Loftus' beautiful photography. Follow the recipes in one of the virtual kitchens, or with real ingredients in your own home. AWhat's Cooking? Jamie Oliver is a fun and interactive cooking game featuring a whole book's worth of Jamie's fantastic recipes, each accompanied by David Loftus' beautiful photography. Follow the recipes in one of the virtual kitchens, or with real ingredients in your own home. A voice-recognition feature means your hands are free to concentrate on the cooking. [Atari]… Expand"}, {"name": "Jake Hunter: Detective Chronicles", "details_link": "https://www.metacritic.com/game/ds/jake-hunter-detective-chronicles", "publisher": "Aksys Games", "release_date": "Jun 11 2008", "developers": ["WorkJam"], "platforms": "DS", "genres": ["Adventure", "General", "General"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/08565ac3185f11d9d2a03a0facaf7584-98.jpg", "descriptions": "Hone your detective skills by interviewing witnesses, uncovering clues, and following leads, all helping to bring you closer to the truth! Experience three unique murder mysteries as Detective Jake Hunter. [Aksys Games]"}, {"name": "Tony Hawk Ride", "details_link": "https://www.metacritic.com/game/wii/tony-hawk-ride", "publisher": "Activision", "release_date": "Nov 17 2009", "developers": ["Buzz Monkey"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 47, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/0/4c7630797b12acff40d81defe41b037e-98.jpg", "descriptions": "Players can experience skateboarding like never before in Tony Hawk: RIDE. For the first time, players have the ability to physically play the game using an innovative motion sensing skateboard controller, allowing for unprecedented freedom and movement. Tony Hawk: RIDE focuses on innovationPlayers can experience skateboarding like never before in Tony Hawk: RIDE. For the first time, players have the ability to physically play the game using an innovative motion sensing skateboard controller, allowing for unprecedented freedom and movement. Tony Hawk: RIDE focuses on innovation and fun, bringing the #1 best-selling action-sports franchise to the forefront with cutting-edge technology for the hardcore fans and accessibility for the mass audience. Tony Hawk: RIDE features a wireless skateboard controller designed in conjunction with the game to offer a dynamic gaming experience built from the ground up. Using a combination of accelerometers and motion sensors, the intuitive controller allows players to physically control the action by performing various movements and gestures on the board that directly translate into amazing tricks in the game.  Without complex button combinations or analog sticks, gamers of all skill levels can literally step on the board and play! [Activision]… Expand"}, {"name": "Submerged", "details_link": "https://www.metacritic.com/game/pc/submerged", "publisher": "Uppercut Games", "release_date": "Aug  3 2015", "developers": ["Uppercut Games", "Uppercut Games Pty Ltd"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "General"], "meta_score": 47, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/66783d4f013cf3501e184874c854151c-98.jpg", "descriptions": "Submerged is a 3rd-person, combat-free game in which the gamer explores a mysterious, flooded city and discovers the beauty of desolation in vast outdoor environments. She takes on the role of Miku, a young girl who has brought her wounded brother to the city in their small fishing boat.Submerged is a 3rd-person, combat-free game in which the gamer explores a mysterious, flooded city and discovers the beauty of desolation in vast outdoor environments. She takes on the role of Miku, a young girl who has brought her wounded brother to the city in their small fishing boat. [Uppercut Games]… Expand"}, {"name": "Venetica", "details_link": "https://www.metacritic.com/game/playstation-3/venetica", "publisher": "Atari", "release_date": "Jan 10 2011", "developers": ["Deck 13"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Third-Person", "Third-Person", "General"], "meta_score": 47, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/bd346749175b5cad59bce3fd717a3f79-98.jpg", "descriptions": "Set in the fantastic world of long ago Venice, the young Scarlett falls victim to a terrible mystery, which begins with the murder of her companion by a secretive alliance of mighty necromancers. Thus fate takes its inevitable course and threatens to throw the world out of order. ScarlettSet in the fantastic world of long ago Venice, the young Scarlett falls victim to a terrible mystery, which begins with the murder of her companion by a secretive alliance of mighty necromancers. Thus fate takes its inevitable course and threatens to throw the world out of order. Scarlett finds out that she is the daughter of death incarnate and is blessed with his ultimate powers. She is the only one who can stop the gruesome powers that threaten to destroy the entire living world. Now it's your chance to reverse fate! Get ready for a fast-paced adventure set in an epic world filled with dark dangers and merciless adversaries. Arm yourself with mighty weapons, rally together powerful allies and master the dark powers of death. Can you conquer the powers that threaten to inescapably destroy the world of the living? Follow your path down into the deepest abyss to death itself - and back again, if you are worthy. [DTP]… Expand"}, {"name": "Rebels: Prison Escape", "details_link": "https://www.metacritic.com/game/pc/rebels-prison-escape", "publisher": "Hip Games", "release_date": "Aug 26 2003", "developers": ["Philoslabs"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Modern", "Modern"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/4debc31f12e171544685af7ecdbca5b3-98.jpg", "descriptions": "In a world dominated by political instability, corruption and treachery reign supreme. There are rumblings of rebellion, and voices rise up against this unsteady situation. But, democractic changes don't have time to occur: Friedrich, a meglomaniac dictator takes advantage and comes toIn a world dominated by political instability, corruption and treachery reign supreme. There are rumblings of rebellion, and voices rise up against this unsteady situation. But, democractic changes don't have time to occur: Friedrich, a meglomaniac dictator takes advantage and comes to power, arresting and jailing those who oppose him. Escape from these Maximum Security prisons and defeat the infamous regime in this immersive tactical game.… Expand"}, {"name": "Loons - The Fight for Fame", "details_link": "https://www.metacritic.com/game/xbox/loons---the-fight-for-fame", "publisher": "Atari", "release_date": "Sep 15 2002", "developers": ["Warthog"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 47, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/9/d9479592555dc98ce474039101379f0e-98.jpg", "descriptions": "Battle rivals and destroy careers in an epic fight to win the starring role in Hollywood's next big blockbuster. In Loons, there's more to being a big-shot movie star than just memorizing lines--there's backstabbing, sabotage, and showing off. See what puts the tarnish in Tinseltown as fourBattle rivals and destroy careers in an epic fight to win the starring role in Hollywood's next big blockbuster. In Loons, there's more to being a big-shot movie star than just memorizing lines--there's backstabbing, sabotage, and showing off. See what puts the tarnish in Tinseltown as four Looney Tunes characters turn screen tests into big-budget melees. You must ruin the competition with props, gags, and gizmos throughout 15 movie sets and seven minigames. … Expand"}, {"name": "The Scorpion King: Rise of the Akkadian", "details_link": "https://www.metacritic.com/game/playstation-2/the-scorpion-king-rise-of-the-akkadian", "publisher": "VU Games", "release_date": "Sep 10 2002", "developers": ["VU Games"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 47, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/16b0266faee7c082595c12c749e9fde6-98.jpg", "descriptions": "An action/adventure game that brings you to the time before the events of The Scorpion King film. In this exciting new story, the hero, Mathayus undergoes new journeys to exotic locations and experiences dangerous quests. The player gets to live it all as Mathayus. [Universal Interactive]"}, {"name": "Ice Age", "details_link": "https://www.metacritic.com/game/game-boy-advance/ice-age", "publisher": "Ubisoft", "release_date": "Mar 18 2002", "developers": ["Artificial Mind and Movement"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 47, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/4b189f8a56a6877fad7ee14b82c5a0e8-98.jpg", "descriptions": "Ice Age is a straightforward platform game with a host of problems that ultimately make it a completely joyless experience."}, {"name": "Decay of Logos", "details_link": "https://www.metacritic.com/game/playstation-4/decay-of-logos", "publisher": "Rising Star Games", "release_date": "Aug 27 2019", "developers": ["Amplify Creations"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 47, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/6/6fdb5fba0fb951ca535121f1bad0d272-98.jpg", "descriptions": "Immerse yourself in the world of Decay Of Logos and unravel its mysteries. Explore old dungeons, battle unforgiving foes and journey through a vibrant interconnected fantasy realm with your mystical elk companion."}, {"name": "Mage Knight: Apocalypse", "details_link": "https://www.metacritic.com/game/pc/mage-knight-apocalypse", "publisher": "Namco Bandai Games", "release_date": "Sep 26 2006", "developers": ["InterServ International"], "platforms": "PC", "num_players": "5  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 47, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/4f0c8554402169a085d7c7ae4eb6b76c-98.jpg", "descriptions": "A mysterious power has issued an ominous portent and the call has gone out for stalwart heroes from all reaches of the Land to battle against an army of pure evil. Leading this army is The Apocalypse Dragon, a seemingly unstoppable five headed juggernaut of destruction that has been rebornA mysterious power has issued an ominous portent and the call has gone out for stalwart heroes from all reaches of the Land to battle against an army of pure evil. Leading this army is The Apocalypse Dragon, a seemingly unstoppable five headed juggernaut of destruction that has been reborn and set loose on an unprepared populace.  Taking the role of one of 5 characters, the player must band together with other legendary heroes to face this Dragon and defeat the forces of Chaos in the \"Mage Knight\" universe. Team dynamics are vital in Mage Knight Apocalypse, and players need to select their party carefully, combining melee, ranged and magical strikes in conjunction with overwhelming group combo attacks to triumph in battle. Players can quest alone or with friends in five-player cooperative and competitive play modes, working together or going head-to-head in the ultimate clash for battlefield supremacy.  Players can choose from five distinct character classes and customize them with hundreds of weapons, armor and items, equipping the right gear for each intense encounter.  Unlike other action RPGs, in Mage Knight Apocalypse, players have no need to worry about ability points or discreet levels to gain.  Instead, character development depends on what type of playing style the player enjoys.  Swinging a heavy sword makes you stronger, casting spells makes your magic more powerful, and shooting bows improve dexterity.  The skills players use and the way they use them determines how the character develops. [Namco]… Expand"}, {"name": "Iron Man", "details_link": "https://www.metacritic.com/game/playstation-2/iron-man", "publisher": "Sega", "release_date": "May  2 2008", "developers": ["Artificial Mind and Movement"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 47, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/7/513209eaa9fb2da9c99082ba26200c23-98.jpg", "descriptions": "Iron Man, an explosive third-person action shooter game that pits one of the world's most renowned Super Heroes against unspeakable odds, draws its story from the upcoming movie while also incorporating story elements from original Iron Man comic books. Using the advanced technology in IronIron Man, an explosive third-person action shooter game that pits one of the world's most renowned Super Heroes against unspeakable odds, draws its story from the upcoming movie while also incorporating story elements from original Iron Man comic books. Using the advanced technology in Iron Man's suits of armour, gamers can take advantage of the wide array of high-impact weapons to strategically annihilate any enemy force standing in their way. Before tackling stunning and immense open battlefields, players can customise their armour suit as they encounter progressively more vicious enemies, and fight in epic battles that could challenge even the toughest Super Heroes. [Sega]… Expand"}, {"name": "Herbie: Fully Loaded", "details_link": "https://www.metacritic.com/game/game-boy-advance/herbie-fully-loaded", "publisher": "Buena Vista Interactive", "release_date": "Jul 12 2005", "developers": ["Buena Vista Interactive"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Driving", "Racing", "Formula One"], "meta_score": 47, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/ec2d8259a0790312ed001b06378c8360-98.jpg", "descriptions": "Based on the movie of the same name, Herbie: Fully Loaded follows the adventures of the Volkswagen Bug that has a mind of its own. Now you can jump behind the wheel of Herbie the Love Bug to join the competitive world of stock car racing. During each race, you can pick up power-ups andBased on the movie of the same name, Herbie: Fully Loaded follows the adventures of the Volkswagen Bug that has a mind of its own. Now you can jump behind the wheel of Herbie the Love Bug to join the competitive world of stock car racing. During each race, you can pick up power-ups and perform special moves to gain advantages over the competition.… Expand"}, {"name": "Extinction", "details_link": "https://www.metacritic.com/game/playstation-4/extinction", "publisher": "Modus Games", "release_date": "Apr 10 2018", "developers": ["Iron Galaxy Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 47, "users_score": 1.4, "image": "https://static.metacritic.com/images/products/games/2/950d14fd293e779444863fa504421f5b-98.jpg", "descriptions": "Assume the role of one of the world’s last Sentinels, a soldier dubbed Avil equipped with the skills to battle and endless wave of Ravenii. Fight massive brutes and their minions across a sprawling countryside, defending cities and rescuing refugees torn from their homes."}, {"name": "Stronghold 3", "details_link": "https://www.metacritic.com/game/pc/stronghold-3", "publisher": "SouthPeak Games", "release_date": "Oct 24 2011", "developers": ["FireFly Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 47, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/1/fd34c3d60effa12fead6bb2daced27bc-98.jpg", "descriptions": "Stronghold 3 is the third installment in the award winning castle-building series."}, {"name": "Risen 2: Dark Waters", "details_link": "https://www.metacritic.com/game/playstation-3/risen-2-dark-waters", "publisher": "Deep Silver", "release_date": "Jul 31 2012", "developers": ["Piranha Bytes"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Action RPG"], "meta_score": 47, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/3/7b91d1bbf36be3184a1d8a9ebb46c2e5-98.jpg", "descriptions": "Set several years after the end of Risen, raging titans have devastated the world and pushed humanity to the brink of existence. Subsequently, monstrous creatures have risen from the watery depths of the sea and their attacks have brought all seafaring to a grinding halt. The hero, now aSet several years after the end of Risen, raging titans have devastated the world and pushed humanity to the brink of existence. Subsequently, monstrous creatures have risen from the watery depths of the sea and their attacks have brought all seafaring to a grinding halt. The hero, now a member of the Inquisition, is sent out to find out how to stop the chaos caused by these creatures from the deep.  His quest begins with rumors that the pirates who frequent the southern islands are the only ones who know a way to get rid of the creatures once and for all and end their reign of terror.… Expand"}, {"name": "Rush'N Attack Ex-Patriot", "details_link": "https://www.metacritic.com/game/playstation-3/rushn-attack-ex-patriot", "publisher": "Konami", "release_date": "Mar 29 2011", "developers": ["Vatra"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 47, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/9cd25a8cc46bfbe0d7641982e40617df-98.jpg", "descriptions": "In Rush'N Attack Ex-Patriot, a clandestine struggle exists between Russia and the United States for military intelligence during the shadows of the Cold War. Through three massive environments of a Siberian prison complex, a bio-weapons laboratory, and a nuclear weapons base players willIn Rush'N Attack Ex-Patriot, a clandestine struggle exists between Russia and the United States for military intelligence during the shadows of the Cold War. Through three massive environments of a Siberian prison complex, a bio-weapons laboratory, and a nuclear weapons base players will need to complete a variety of missions and survive encounters with elite Russian soldiers.… Expand"}, {"name": "Supremacy MMA", "details_link": "https://www.metacritic.com/game/playstation-3/supremacy-mma", "publisher": "505 Games", "release_date": "Sep 20 2011", "developers": ["Kung Fu Factory"], "platforms": ["PlayStation Vita", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "3D", "3D", "Combat", "Boxing / Martial Arts"], "meta_score": 47, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/4/0a651d5a206e0591c2bc0035f285ec0a-98.jpg", "descriptions": "Supremacy MMA takes the sport back to its founding roots with M-Rated combat that's not for the faint of heart."}, {"name": "Naughty Bear: Panic in Paradise", "details_link": "https://www.metacritic.com/game/xbox-360/naughty-bear-panic-in-paradise", "publisher": "505 Games", "release_date": "Oct  9 2012", "developers": ["Behaviour Interactive"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "General", "General"], "meta_score": 47, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/ec5d635346d3c67f9c136a56959ed922-98.jpg", "descriptions": "Naughty Bear 2 is a follow-up to 2010's surreal action game."}, {"name": "Predator: Concrete Jungle", "details_link": "https://www.metacritic.com/game/playstation-2/predator-concrete-jungle", "publisher": "VU Games", "release_date": "Apr 26 2005", "developers": ["Eurocom Entertainment Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 47, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/abd0aa2f72f960b1912e10426e151db0-98.jpg", "descriptions": "Gamers hunt down their prey in an urban killing zone as they take on the legendary role of the Predator. In Predator: Concrete Jungle, the gripping tale of the fearsome alien's history on Earth unfolds between two separate time periods, first the 1930s and then in the 2030s, as the PredatorGamers hunt down their prey in an urban killing zone as they take on the legendary role of the Predator. In Predator: Concrete Jungle, the gripping tale of the fearsome alien's history on Earth unfolds between two separate time periods, first the 1930s and then in the 2030s, as the Predator embarks on a mission of revenge upon a organized crime empire and its leader who seeks to conquer all Predators. Taking inspiration from the popular film franchise, the game allows players to roam the city landscape, stalking human prey while armed to the teeth with hunt-adapted vision modes, cloaking technology and extraterrestrial weapons of annihilation. Experience the hunt from the perspective of the Predator - kill at will or hunt with honor. Original story ties into established Predator mythology, including back story about the origins of the Weyland-Yutani empire. Arsenal of quintessential Predator weapons such as: wristblades, plasmacaster, combistick, speargun and smart disk. Highly responsive combat system that enables the Predator to stylize its attack moves for different prey. Four different vision modes to enhance the hunting experience: Thermal Scan, Neuro Scan, Prey Scan, and Tech Scan. City environments of the \"concrete jungle\" are the perfect hunting grounds for the Predator. [Vivendi Universal]… Expand"}, {"name": "Terminator: Resistance", "details_link": "https://www.metacritic.com/game/playstation-4/terminator-resistance", "publisher": "Reef Entertainment", "release_date": "Dec 10 2019", "developers": ["Teyon"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 47, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/62dbcea5b2644bb8c2f3fa94e1203487-98.jpg", "descriptions": "This story takes place in a post-apocalyptic Los Angeles, nearly 30 years after Judgement Day, and stars a brand new hero in the Terminator universe, Jacob Rivers, a soldier in the Resistance led by John Connor. Despite the fact that Jacob is just a lowly private, he'll soon discover thatThis story takes place in a post-apocalyptic Los Angeles, nearly 30 years after Judgement Day, and stars a brand new hero in the Terminator universe, Jacob Rivers, a soldier in the Resistance led by John Connor. Despite the fact that Jacob is just a lowly private, he'll soon discover that he's been specifically targeted by the latest threat from Skynet and marked for termination! Skynet may be destined to lose the war, but at what cost to Jacob? Experience the events leading up to the decisive final battle for the fate of mankind in the war against the machines!Features:* Choose what kind of action hero you want to be! Equip an epic arsenal of weaponry to run and gun or sneak and snipe through sprawling environments! The world isn't as forgiving as it used to be, so you'll need to find resources to help you out. If you can't find what you're looking for, then you better make it yourself.* Change the fate of mankind! Protect a motley crew of survivors, each with their own motivations and backstories. The actions you take throughout the game will impact their survival and change the ending you get.* Resist against the machines! Fight against a selection of iconic enemies from the films, including the T-800, as well as a host of enemies that are brand new to the Terminator universe!… Expand"}, {"name": "Wing Island", "details_link": "https://www.metacritic.com/game/wii/wing-island", "publisher": "Konami", "release_date": "Mar 20 2007", "developers": ["CAProduction"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "General"], "meta_score": 47, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/1/8d5e4c8da074237df78a230abf35dbd3-98.jpg", "descriptions": "Take to the skies with Wing Island, the first flight action game for the Wii. As Junior, a wide-eyed teenager with the skill to fly, soar around Shell Island taking on jobs to keep your family aviation business running. From dusting crops to more daring missions like aerial fire fighting,Take to the skies with Wing Island, the first flight action game for the Wii. As Junior, a wide-eyed teenager with the skill to fly, soar around Shell Island taking on jobs to keep your family aviation business running. From dusting crops to more daring missions like aerial fire fighting, you'll use the Wii Remote to perform aerial acrobatics and learn to fly in formation, controlling a group of five planes at once. Engage in over 20 missions from racing and crop dusting, to fire fighting and stopping thieves from stealing treasure. Earn money to unlock and upgrade a variety of new planes. Compete against a friend in a collection of 2-player mini games. [Konami]… Expand"}, {"name": "Monster Jam Steel Titans", "details_link": "https://www.metacritic.com/game/xbox-one/monster-jam-steel-titans", "publisher": "THQ Nordic", "release_date": "Jun 25 2019", "developers": ["Rainbow Studios"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 47, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/7/a4423d0f8cac57101d02013f3ff74fd4-98.jpg", "descriptions": "Real Trucks. Real Action. Monster Jam! Monster Jam Steel Titans delivers the complete Monster Jam experience for everybody to enjoy. All the trucks, stunts, stadiums, racing and massive air in one game. Play in various game modes including Stadium and outdoor Racing, various Stunt ChallengesReal Trucks. Real Action. Monster Jam! Monster Jam Steel Titans delivers the complete Monster Jam experience for everybody to enjoy. All the trucks, stunts, stadiums, racing and massive air in one game. Play in various game modes including Stadium and outdoor Racing, various Stunt Challenges and Destruction modes.… Expand"}, {"name": "Soul Axiom", "details_link": "https://www.metacritic.com/game/playstation-4/soul-axiom", "publisher": "Wales Interactive", "release_date": "Jun  7 2016", "developers": ["Wales Interactive"], "platforms": ["PC", "Wii U", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 47, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/051203ffc9d11784f3ac46c961e6d1cd-98.jpg", "descriptions": "From the studio that brought you Master Reboot comes a first-person story-driven adventure puzzle game, set in the beautiful, haunting cyber-world of Elysia. Collect unique hand powers, discover multiple endings and choose your own destiny as you unravel the mystery of your digital afterlife."}, {"name": "Hole in the Wall", "details_link": "https://www.metacritic.com/game/xbox-360/hole-in-the-wall", "publisher": "Microsoft Game Studios", "release_date": "Aug 24 2011", "developers": ["Virtuos"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Trivia / Game Show", "Party", "Party / Minigame"], "meta_score": 47, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/5/7be7b222053ecb9dd9192b82d1e0e545-98.jpg", "descriptions": "Whether you play solo or with friends, \"Hole in the Wall\" challenges  you to become a human puzzle piece as you contort to fit through wacky shapes that are cut out into themed walls hurtling towards you. Try to pass your body through the wall to boost your score, or you’ll beWhether you play solo or with friends, \"Hole in the Wall\" challenges  you to become a human puzzle piece as you contort to fit through wacky shapes that are cut out into themed walls hurtling towards you. Try to pass your body through the wall to boost your score, or you’ll be pushed straight into the water below! Play through different “show” levels in single or multi player modes (up to 4 competitors), or see if you can handle the challenge of “survival” mode as you attack wall after wall until you drop! Unlock special customization elements for your avatar like a silver spandex suit, helmets, t-shirt and other zany gear as a reward for progress in the game.… Expand"}, {"name": "DreamWorks Monsters vs. Aliens", "details_link": "https://www.metacritic.com/game/ds/dreamworks-monsters-vs-aliens", "publisher": "Activision", "release_date": "Mar 24 2009", "developers": ["Griptonite Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/95d8c18d0bd73751c34bcf53f5ce8d9d-98.jpg", "descriptions": "Based on the DreamWorks 3D feature film, Monsters vs. Aliens puts the fate of the planet in players' hands, to save the world as only a monster can. Bash, skate, and ooze as the macho half-ape, half-fish The Missing Link, the 49’11\" tall woman, Ginormica, and the gelatinous, indestructible,Based on the DreamWorks 3D feature film, Monsters vs. Aliens puts the fate of the planet in players' hands, to save the world as only a monster can. Bash, skate, and ooze as the macho half-ape, half-fish The Missing Link, the 49’11\" tall woman, Ginormica, and the gelatinous, indestructible, and brainless B.O.B, with the help of the monstrous 350’ tall grub Insectosaurus. Plus, team up with the brilliant but insect-headed Dr. Cockroach, Ph.D. in co-op mode, to save the earth from the megalomaniacal alien Gallaxhar. Unleash unique powers as all your favorite monsters from the film - The Missing Link: Bash, bounce, swing, tail whip, and climb as this prehistoric brawler! B.O.B: Ooze through cracks, stick to ceilings, and absorb and spit out enemies as this gooey blob! Ginormica: Tower over the landscape, test your strength, and use cars as roller-skates as this battling behemoth. Battle through locations from the movie and beyond - Adventure across 20 distinct levels set in locations from the film and beyond, including the streets of San Francisco, Gallaxhar’s gargantuan spaceship, and the government’s super-secret monster containment facility. Play as a team in co-op mode - A second player can pick up a controller and drop in at anytime as Dr. Cockroach Ph.D. As the most brilliant scientist in the world, players can blast apart robots, toss away enemies, plus grab hard-to-reach upgrades and other rewards.… Expand"}, {"name": "Death Jr. and the Science Fair of Doom", "details_link": "https://www.metacritic.com/game/ds/death-jr-and-the-science-fair-of-doom", "publisher": "Konami", "release_date": "May 22 2007", "developers": ["Foundation 9 Entertainment"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 47, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/d911a3adfc5c0a11d8d43746846ab090-98.jpg", "descriptions": "It's the worst science fair ever as Death Jr. and his pals make their way through a crazy world of science projects gone wrong! Use the touch pad to execute cool scythe combos, switch between DJ and Pandora and play seriously twisted mini-games in a warped and twisted platforming adventure.It's the worst science fair ever as Death Jr. and his pals make their way through a crazy world of science projects gone wrong! Use the touch pad to execute cool scythe combos, switch between DJ and Pandora and play seriously twisted mini-games in a warped and twisted platforming adventure. Play as DJ and Pandora, each with their own unique moves and style of play. Use the DS touch screen to unleash vicious melee attacks and crazy combos. Take control of Pandora's spirit to help guide DJ through tough spots. Collect money to upgrade weapons and attacks as DJ and Pandora make their way through crazy science fair exhibits. Three twisted mini-games playable with friends through local wireless connection. [Konami]… Expand"}, {"name": "Warhammer 40,000: Fire Warrior", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-fire-warrior", "publisher": "THQ", "release_date": "Nov 17 2003", "developers": ["Kuju Entertainment"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 47, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/861bc7065b9660132f6c7b8bf988aa70-98.jpg", "descriptions": "Welcome to the dark nightmare future of the 41st Millennium, the grim era of the Imperium. War is spread across a thousand different worlds. Powerful armies of Space Marines, Imperial Guardsmen and Tau warriors are in constant conflict, unleashing carnage via deadly war machines, crushingWelcome to the dark nightmare future of the 41st Millennium, the grim era of the Imperium. War is spread across a thousand different worlds. Powerful armies of Space Marines, Imperial Guardsmen and Tau warriors are in constant conflict, unleashing carnage via deadly war machines, crushing artillery, and vast starships. Warhammer 40,000: Fire Warrior follows one day in the tumultuous life of Kais, a young Tau warrior who must battle alone against a force that shows no mercy: The Imperium. Kais will soon learn there is a darker foe at hand and becomes entangled in a frightening story that leads him the darkest battle yet of the ongoing war. [THQ]… Expand"}, {"name": "Monster 4X4: World Circuit", "details_link": "https://www.metacritic.com/game/xbox/monster-4x4-world-circuit", "publisher": "Ubisoft", "release_date": "Mar 23 2006", "developers": ["Ubisoft"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/ddf2e353939b9fe7a89965b3ea4f2806-98.jpg", "descriptions": "Monster 4x4 World Circuit lets players control the world's most powerful trucks and go head-to-head in pulse-pounding off-road competitions all over the world. Whether you're grinding through the desert of Egypt, crunching up snowy mountains in Russia, or smashing up trees in California toMonster 4x4 World Circuit lets players control the world's most powerful trucks and go head-to-head in pulse-pounding off-road competitions all over the world. Whether you're grinding through the desert of Egypt, crunching up snowy mountains in Russia, or smashing up trees in California to make the ride a little bumpier for the guy behind you, keep your eyes on the prize: The cash you earn on the circuit goes to customize your trucks and build up your ultimate Monster machine. Personalize your truck's appearance with sweet paint jobs and decals and soup up its performance by maxing out its speed, jumping and destruction capabilities. Win races, unleash spectacular stunts and jumps, and demolish everything in sight to win cash and upgrade your Monster truck to the ultimate stomping machine. Tear through 40 Monster events in the hairiest off-road circuits your tires have ever seen. Smoke the competition as you blaze through exciting new locations all over the world, such as Egypt, Moscow, Barcelona, San Francisco, South Dakota and more. Master your tricks in Quick Race mode as you taste all of the thrills, spills, twists and rolls of Monster Truck racing. Then turn up the heat in Single Race or Monster League Championship mode and leave your opponents choking. Demolish friends in four-player split-screen races or crush their hopes of domination in four intense new mini-games.… Expand"}, {"name": "Red Ninja: End of Honor", "details_link": "https://www.metacritic.com/game/playstation-2/red-ninja-end-of-honor", "publisher": "VU Games", "release_date": "Mar 30 2005", "developers": ["Opus"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Historic"], "meta_score": 47, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/8/30748e0d360e5bc1e7648e856bdd38c3-98.jpg", "descriptions": "Japan in the 1500's, the power of the samurai class is fading and the use of the Ninja has become necessary to hold any political power in this chaotic time. Kurenai a young girl who?s world is destroyed when she and her father are attacked by the deadly Black Lizard Clan, who captures herJapan in the 1500's, the power of the samurai class is fading and the use of the Ninja has become necessary to hold any political power in this chaotic time. Kurenai a young girl who?s world is destroyed when she and her father are attacked by the deadly Black Lizard Clan, who captures her and brutally hangs her by a wire and left to die. Miraculously, she survives and is rescued and adopted into a clan where she obtains complete mastery of her unique weapon, the wire. Kurenai has pledged her undying loyalty to her new family. She now lives to avenge her father?s death and will go to any means necessary to destroy the Black Lizard Clan. [Vivendi Universal]… Expand"}, {"name": "Tactical Intervention", "details_link": "https://www.metacritic.com/game/pc/tactical-intervention", "publisher": "OGPlanet", "release_date": "Mar 28 2013", "developers": ["FIX Korea", "Co. LTD"], "platforms": "PC", "genres": ["Third-Person", "Tactical", "Modern", "Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 47, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/29e25af157ccec241bcaa67650ebfd6d-98.jpg", "descriptions": "Tactical Intervention is the latest creation from Counter Strike co-creator, Minh ‘Gooseman’ Le. A first-person tactical shooter, Tactical Intervention revisits the classic battle of Terrorists vs. Counter Terrorists and expands it to include fast-paced driving combat, intelligent AITactical Intervention is the latest creation from Counter Strike co-creator, Minh ‘Gooseman’ Le. A first-person tactical shooter, Tactical Intervention revisits the classic battle of Terrorists vs. Counter Terrorists and expands it to include fast-paced driving combat, intelligent AI hostages, controllable K9 units, dead drop rappelling and a wide variety of high powered modern weapons and authentic combat gear including breaching charges and riot shields. Combat takes place in a series of real world locations allowing players to fight atop a skyscraper and inside a subway train, or to ransack a shopping mall and race down a highway.… Expand"}, {"name": "Bee Simulator", "details_link": "https://www.metacritic.com/game/playstation-4/bee-simulator", "publisher": "Bigben Interactive", "release_date": "Nov 12 2019", "developers": ["Varsav Game Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Action Adventure", "General", "Open-World"], "meta_score": 47, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/640d1661c6855b186355607497fdb1a9-98.jpg", "descriptions": "See the world through the eyes of a bee! Explore a world inspired by Central Park where you can take part in bee races, collect pollen from rare flowers and defy dangerous wasps. Play with friends or family in three game modes, including co-op and PvP on split screen."}, {"name": "Teenage Mutant Ninja Turtles 2: Battle Nexus", "details_link": "https://www.metacritic.com/game/playstation-2/teenage-mutant-ninja-turtles-2-battle-nexus", "publisher": "Konami", "release_date": "Oct 19 2004", "developers": ["KCE Studios"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 47, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/710fee803013eeaf37610240a1cf0300-98.jpg", "descriptions": "The action is packed into another exciting series of adventures with Teenage Mutant Ninja Turtles 2: Battle Nexus. Run with the Turtle dudes as they show off their new Ninja abilities against all new opponents. Only the best can turn chaos into control with simultaneous play for up to fourThe action is packed into another exciting series of adventures with Teenage Mutant Ninja Turtles 2: Battle Nexus. Run with the Turtle dudes as they show off their new Ninja abilities against all new opponents. Only the best can turn chaos into control with simultaneous play for up to four players in both cooperative and head-to-head modes. Combination moves allow for over 30 different types of attacks. Distinct characteristics and abilities for each Turtle abound in the game. Voiceovers from the TMNT animated series are also employed. [Konami]… Expand"}, {"name": "Championship Surfer", "details_link": "https://www.metacritic.com/game/pc/championship-surfer", "publisher": "Mattel", "release_date": "Nov 19 2000", "developers": ["Krome Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Sports", "Alternative", "Individual", "Surfing", "Surfing", "Surf / Wakeboard"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/e5ba2540d734f0a6d9eee95b687f2293-98.jpg", "descriptions": "Each of the surfers is modeled and textured in seamless 3-D with a full set of animations that accurately reflects their individual style and moves.  [Mattel Interactive]"}, {"name": "Thunderbirds", "details_link": "https://www.metacritic.com/game/game-boy-advance/thunderbirds", "publisher": "VU Games", "release_date": "Aug 10 2004", "developers": ["Saffire"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/7f842b920a304f5863ff4e6f726fe81d-98.jpg", "descriptions": "Join Alan Tracy, an aspiring top-secret agent, and his friends on a quest to capture a master criminal. You'll control the Thunderbirds' fleet of highly advanced vehicles to travel across the globe and into outer space. In your missions, you'll visit International Rescue's secret islandJoin Alan Tracy, an aspiring top-secret agent, and his friends on a quest to capture a master criminal. You'll control the Thunderbirds' fleet of highly advanced vehicles to travel across the globe and into outer space. In your missions, you'll visit International Rescue's secret island base, battle an oil well fire in Alaska, blast off to the Thunderbirds' space station, explore the bottom of the sea, and more. Race through dangerous terrain in Flight mode, and complete missions and solve puzzles in Adventure mode.… Expand"}, {"name": "The Punisher: No Mercy", "details_link": "https://www.metacritic.com/game/playstation-3/the-punisher-no-mercy", "publisher": "Zen Studios", "release_date": "Jul  2 2009", "developers": ["Zen Studios"], "platforms": "PlayStation 3", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 47, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/cb298f6c7a8f3a3401c3d527d87b703d-98.jpg", "descriptions": "[Playstation Network]  The Punisher: No Mercy was inspired by Marvel Comics' rich Punisher comic book history. With awesome characters, a customizable system, and fast-paced multiplayer action, No Mercy is breaking ground in the digital space. Powered by Unreal Engine 3, The Punisher: No[Playstation Network]  The Punisher: No Mercy was inspired by Marvel Comics' rich Punisher comic book history. With awesome characters, a customizable system, and fast-paced multiplayer action, No Mercy is breaking ground in the digital space. Powered by Unreal Engine 3, The Punisher: No Mercy was designed with fast-paced online multiplayer FPS action in mind. The game allows players to choose from an eclectic mix of Punisher allies and villains.  Battle arenas span from shipyards rife with contraband to the \"birthplace\" of the Punisher’s archenemy, Jigsaw, and up to eight players can blast away at each other in a variety of solo and team-based missions. In addition to exceptional online play, The Punisher: No Mercy also offers a single-player story mode featuring exclusive artwork from acclaimed Marvel artist Mike Deodato. [ZEN Studios]… Expand"}, {"name": "One Piece: Pirates' Carnival", "details_link": "https://www.metacritic.com/game/playstation-2/one-piece-pirates-carnival", "publisher": "Namco Bandai Games America", "release_date": "Sep 12 2006", "developers": ["h.a.n.d. Inc."], "platforms": "PlayStation 2", "num_players": "24  Online", "genres": ["Action", "Fighting", "3D"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/fa1c92cca0936b1392f2e52ea4f031a3-98.jpg", "descriptions": "Different from the previous One Piece games, Pirates Carnival is a party game featuring over forty mini games. The mini games feature simple controls and promise to recreate well-known scenes from the original One Piece body of work. The game features support for four players, with someDifferent from the previous One Piece games, Pirates Carnival is a party game featuring over forty mini games. The mini games feature simple controls and promise to recreate well-known scenes from the original One Piece body of work. The game features support for four players, with some games featuring split screen play and others placing all four players in the same area.… Expand"}, {"name": "50 Cent: Bulletproof", "details_link": "https://www.metacritic.com/game/playstation-2/50-cent-bulletproof", "publisher": "VU Games", "release_date": "Nov 17 2005", "developers": ["Genuine Games"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 47, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/ef4aa1e33aa5d92ff6b940fae1419202-98.jpg", "descriptions": "In 50 Cent's video game, 50 gets caught in a web of corruption, double-crosses and shady deals that lead him on a bloody path through New York's drug underworld. Working with the unlikeliest of allies, the streets heat up as 50 Cent takes on the most dangerous crime families in the city,In 50 Cent's video game, 50 gets caught in a web of corruption, double-crosses and shady deals that lead him on a bloody path through New York's drug underworld. Working with the unlikeliest of allies, the streets heat up as 50 Cent takes on the most dangerous crime families in the city, uncovering an international conspiracy with devastating implications. The streets are watching as 50 Cent blasts his way to the truth. [Vivendi Universal]… Expand"}, {"name": "HomeTown Story", "details_link": "https://www.metacritic.com/game/3ds/hometown-story", "publisher": "Natsume", "release_date": "Oct 17 2013", "developers": ["TOYBOX"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "General"], "meta_score": 47, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/45acd301941805b8dca5034ed319c943-98.jpg", "descriptions": "A Tale of Life, Love, and Friendship. Hometown Story takes you to a lush, green village tucked away in the countryside. The shop you inherited has brought you back to your hometown. However, the shop has become run down, and no one wants to even window shop there anymore. Can you turn theA Tale of Life, Love, and Friendship. Hometown Story takes you to a lush, green village tucked away in the countryside. The shop you inherited has brought you back to your hometown. However, the shop has become run down, and no one wants to even window shop there anymore. Can you turn the shop around and even expand it, or is it destined to stay in the red forever? You won't have to go it alone, though. You'll get help from a magical sprite named Pochica, who will help you get the store back up and running, and introduce you to all of the unique characters who reside in the town. The villagers will all change and grow throughout the game, and that person who you thought might be up to no good when you first met them just might have a heart of gold! Your experiences will be completely different from anyone else's. You'll never know what to expect in Hometown Story. [Nintendo]\r… Expand"}, {"name": "Thief of Thieves: Season One", "details_link": "https://www.metacritic.com/game/switch/thief-of-thieves-season-one", "publisher": "Skybound Games", "release_date": "Nov 12 2019", "developers": ["Rival Games Ltd"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/01529989327574ceecf249418eba692c-98.jpg", "descriptions": "Based on the best-selling comic by Robert Kirkman, Thief of Thieves: Season One is a story of heists and the people behind them. It’s time for Celia, protege of master thief Redmond, to make the leap from apprentice to master. A botched job takes Celia to Europe, where she joins a new teamBased on the best-selling comic by Robert Kirkman, Thief of Thieves: Season One is a story of heists and the people behind them. It’s time for Celia, protege of master thief Redmond, to make the leap from apprentice to master. A botched job takes Celia to Europe, where she joins a new team of criminals for a crime spree. Get to know your team, choose your approach on the field, but be careful – the choices you make may have drastic consequences. … Expand"}, {"name": "Sonic Free Riders", "details_link": "https://www.metacritic.com/game/xbox-360/sonic-free-riders", "publisher": "Sega", "release_date": "Nov  4 2010", "developers": ["Sega", "Sonic Team"], "platforms": "Xbox 360", "num_players": "Up to 8 ", "genres": ["Sports", "Racing", "Alternative", "Arcade", "Individual", "Other", "Other", "Automobile"], "meta_score": 47, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/0/4625e53d1dd0f9c7ae3e8437bfdd8765-98.jpg", "descriptions": "For the first time ever in a SEGA game, full-motion body control will allow you to twist and turn your way through a range of visually stunning courses in an action-packed Sonic experience unlike any other! Kinect's unique motion sensor means Sonic Free Riders will see family and friendsFor the first time ever in a SEGA game, full-motion body control will allow you to twist and turn your way through a range of visually stunning courses in an action-packed Sonic experience unlike any other! Kinect's unique motion sensor means Sonic Free Riders will see family and friends controlling their fully customizable hover board or bike by twisting, turning and jumping in an exhilarating race to be the first to cross the finish line! Choosing from one of your favorite Sonic characters, or your own Avatar, you can reach out and grab a variety of pickups along the course. By throwing, shaking, or swinging your arms to launch your items, you can gain the competitive edge over your rivals in high octane single or multiplayer races.… Expand"}, {"name": "Looney Tunes: Back in Action", "details_link": "https://www.metacritic.com/game/game-boy-advance/looney-tunes-back-in-action", "publisher": "Warner Bros.", "release_date": "Nov 11 2003", "developers": ["Warthog"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 47, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/9836a24c559b2ef3b5ec8f96c7b4159f-98.jpg", "descriptions": "This third-person adventure game is inspired by the upcoming movie of the same name and will allow players to play as both Bugs Bunny and Daffy Duck."}, {"name": "Conflict Zone", "details_link": "https://www.metacritic.com/game/playstation-2/conflict-zone", "publisher": "Ubisoft", "release_date": "Oct 19 2002", "developers": ["MASA Group"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Military"], "meta_score": 47, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/7a32242dd6139d72c1b3d7bb3ca03078-98.jpg", "descriptions": "It's early 21st century and the majority of the world's countries have created the International Corps for Peace, an organisation dedicated to  bringing about world peace. However, not all countries are keen to be  involved and these persist in generating conflicts through the  organisationIt's early 21st century and the majority of the world's countries have created the International Corps for Peace, an organisation dedicated to  bringing about world peace. However, not all countries are keen to be  involved and these persist in generating conflicts through the  organisation GHOST. A secret organisation, which warrants only the  economic interests of its members without any attachment to morals,  GHOST, does not hesitate to create crisis situations with the goal of  destabilising the world-wide equilibrium and endanger any chance of  peace. [Ubi Soft]… Expand"}, {"name": "Spectral Souls: Resurrection of the Ethereal Empires", "details_link": "https://www.metacritic.com/game/psp/spectral-souls-resurrection-of-the-ethereal-empires", "publisher": "NIS America", "release_date": "Sep 26 2006", "developers": ["Neverland", "Idea Factory"], "platforms": ["iPhone/iPad", "PSP"], "num_players": "1 Player", "genres": ["Role-Playing", "Strategy", "Turn-Based", "Console-style RPG", "General", "Fantasy"], "meta_score": 47, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/099c565afbaf548dc5cbcc5f9ab10f8a-98.jpg", "descriptions": "Known as Shinki Gensou: SSII Unlimited Side in Japan, Spectral Souls immerses you in a great battle between good and evil. During this role-playing game, you can switch between characters from three opposing kingdoms."}, {"name": "Blood Drive", "details_link": "https://www.metacritic.com/game/playstation-3/blood-drive", "publisher": "Activision", "release_date": "Nov  2 2010", "developers": ["Sidhe Interactive"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Simulation", "Driving", "Racing", "General", "General", "Vehicle", "Combat"], "meta_score": 47, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/6b878e677cf9120b3f313bf502bedea2-98.jpg", "descriptions": "In Blood Drive, contestants must use their motorized death steeds of steel in a televised game show where drivers battle each other and hordes of revolting flesh eaters in an all-out fight to the death. Face undead frat boys, cops, strippers and bachelorette partiers, each with their ownIn Blood Drive, contestants must use their motorized death steeds of steel in a televised game show where drivers battle each other and hordes of revolting flesh eaters in an all-out fight to the death. Face undead frat boys, cops, strippers and bachelorette partiers, each with their own special brand of death and devastation - and ways to die! While these rotting monsters wander the streets of a desert sin city craving sweet, succulent brains, your enemies have come equipped battle hardened armed vehicles, including heavily weaponized muscle cars, hot rods, and more. Amidst this gore-drenched mayhem contestants must use their head or lose it!… Expand"}, {"name": "Agony", "details_link": "https://www.metacritic.com/game/pc/agony", "publisher": "PlayWay", "release_date": "May 29 2018", "developers": ["Madmind Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Action Adventure", "Survival"], "meta_score": 47, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/8/c9dd523f1a9720f7a16860bcbbd630d2-98.jpg", "descriptions": "Agony is a first-person, survival horror set in hell. You will begin your journey as a tormented soul within the depths of hell without any memories about your past. The special ability to control people on your path, and possess demons, gives you the measures to survive."}, {"name": "Transformers: Rise of the Dark Spark", "details_link": "https://www.metacritic.com/game/xbox-one/transformers-rise-of-the-dark-spark", "publisher": "Activision", "release_date": "Jun 24 2014", "developers": ["Edge of Reality"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Sci-Fi", "General"], "meta_score": 47, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/5/2c4c2ecf440f79f987348e73e0cf4f4b-98.jpg", "descriptions": "For the first time ever, fight your way through both Earth and Cybertron universes in an unforgettable battle to secure the Dark Spark. Play the expanded four-player co-op online escalation mode with new upgradeable defenses and challenging Power Foes. The new leveling system spans campaignFor the first time ever, fight your way through both Earth and Cybertron universes in an unforgettable battle to secure the Dark Spark. Play the expanded four-player co-op online escalation mode with new upgradeable defenses and challenging Power Foes. The new leveling system spans campaign and escalation, allowing players to unlock rewards that will aid progression in both modes.… Expand"}, {"name": "Paranoia: Happiness is Mandatory", "details_link": "https://www.metacritic.com/game/pc/paranoia-happiness-is-mandatory", "publisher": "Bigben Interactive", "release_date": "Oct  3 2019", "developers": ["Black Shamrock"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 47, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/36d750a471776d714fb146e56c489b83-98.jpg", "descriptions": "Lead a team of four Troubleshooters of dubious loyalty, who (mostly) obey orders from Friend Computer, a paranoid and irrational artificial intelligence. Inspired by the classic games of the CRPG genre, experience the first official adaptation of the cult role-playing game."}, {"name": "Adventure Time: Explore the Dungeon Because I DON'T KNOW!", "details_link": "https://www.metacritic.com/game/xbox-360/adventure-time-explore-the-dungeon-because-i-dont-know!", "publisher": "D3Publisher", "release_date": "Nov 19 2013", "developers": ["WayForward"], "platforms": ["3DS", "PC", "PlayStation 3", "Wii U", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 47, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/9/439f91818a1284a97836a31acafe3427-98.jpg", "descriptions": "Adventure Time: Explore the Dungeon Because I DON'T KNOW has you save the Candy Kingdom by exploring the mysteries surrounding a massive Secret Royal Dungeon deep below the Land of Ooo."}, {"name": "Prison Break: The Conspiracy", "details_link": "https://www.metacritic.com/game/pc/prison-break-the-conspiracy", "publisher": "Deep Silver", "release_date": "Mar 30 2010", "developers": ["ZootFly"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Adventure", "General", "General"], "meta_score": 47, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/19a3274ce9550761b3bd95d28526e2fc-98.jpg", "descriptions": "Prison Break - The Conspiracy takes you inside the Prison Break world like never before. You are Tom Paxton, a Company agent sent inside Fox River Penitentiary to observe and report on a prisoner named Michael Scofield... What you will find will change your Prison Break experience forever.Prison Break - The Conspiracy takes you inside the Prison Break world like never before. You are Tom Paxton, a Company agent sent inside Fox River Penitentiary to observe and report on a prisoner named Michael Scofield... What you will find will change your Prison Break experience forever. [Deep Silver]… Expand"}, {"name": "Flip's Twisted World", "details_link": "https://www.metacritic.com/game/wii/flips-twisted-world", "publisher": "Majesco Games", "release_date": "Oct 25 2010", "developers": ["Majesco Games", "Majesco", "Frozen North Productions"], "platforms": "Wii", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/479530388b65c22a7d62b93a42472346-98.jpg", "descriptions": "This unique puzzle platformer places the world literally in the palm of players' hands as they navigate topsy-turvy worlds where up and down, and left and right are only a matter of perspective. In Flip's Twisted World, Master Fulcrum's curious apprentice Flip messes with the wrong magicThis unique puzzle platformer places the world literally in the palm of players' hands as they navigate topsy-turvy worlds where up and down, and left and right are only a matter of perspective. In Flip's Twisted World, Master Fulcrum's curious apprentice Flip messes with the wrong magic artifact and gets sucked into a crazy cubed universe. To escape his cube prison, Flip must turn the entire world to reveal new paths and endless possibilities. Adventuring through five bizarre puzzle worlds, Flip must stop the destruction of the universe and restore The Master's home to normal before he returns! Players help Flip navigate his world by rotating the environment 90 degrees in any direction with a simple twist of the Wii Remote. Pits become passages and obstacles transform into openings once players change their point of view. As Flip progresses through the game he'll meet many unique characters - some helpful, others hurtful - and collect five magic tools to aid his journey home. Optional side quests let players unlock bonus goodies and alternate costumes, while finding pieces of the Master's lost journal reveals secrets of the magic universe's past. Flip's Twisted World features original music from prolific video game composer Tommy Tallarico, who has scored over 250 games and won numerous international awards for his work. [Majesco]… Expand"}, {"name": "Scribblenauts Showdown", "details_link": "https://www.metacritic.com/game/switch/scribblenauts-showdown", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Mar  6 2018", "developers": ["Warner Bros. Interactive Entertainment", "Shiver Games"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 47, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/2/31f1b6a874dcaf2c8eedc75ed30d266c-98.jpg", "descriptions": "The game is designed primarily to be played with friends: up to four players can partake in \"more than\" 25 mini-games, which are served up in different forms depending on which mode you select. Showdown is a competitive mode in which finding the best word the quickest is the key, whileThe game is designed primarily to be played with friends: up to four players can partake in \"more than\" 25 mini-games, which are served up in different forms depending on which mode you select. Showdown is a competitive mode in which finding the best word the quickest is the key, while Versus supplies various mini-games for you and one other friend to battle in, one-vs-one. Sandbox is a more traditional Scribblenauts mode that will be familiar to fans of the series. Here you can summon a variety of objects--publisher Warner Bros. says over 35,000 items are available in-game--to solve objectives either by yourself or with a friend. Eight new levels are included, as are hidden collectibles and achievements.… Expand"}, {"name": "PONG Quest", "details_link": "https://www.metacritic.com/game/switch/pong-quest", "publisher": "Atari SA", "release_date": "May  7 2020", "developers": ["Chequered Ink Ltd."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Arcade"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/5f6bed85ad3cc8be7a69a3b387c4a821-98.jpg", "descriptions": "Embark upon an epic adventure in PONG Quest as you take on the challenge for King and country in a journey across numerous themed dungeons populated with all manner of paddles, puzzles and balls.Customize your hero and take up the challenge in new PONG battle gameplay featuring over 50Embark upon an epic adventure in PONG Quest as you take on the challenge for King and country in a journey across numerous themed dungeons populated with all manner of paddles, puzzles and balls.Customize your hero and take up the challenge in new PONG battle gameplay featuring over 50 different types of balls each with their unique abilities. Solve puzzles and gather precious loot as you uncover the secrets of the Orbs on a journey to unlock the mystery of the Spooky Door.Play with up to 4 other players in multiplayer mayhem battles, select your balls and perfect your own loadout as you clash with other paddles for supremacy within the PONG universe.No balls, no problem! Play with classic rules and show the world who is the best paddle on the planet.… Expand"}, {"name": "Lego Star Wars II: The Original Trilogy", "details_link": "https://www.metacritic.com/game/ds/lego-star-wars-ii-the-original-trilogy", "publisher": "LucasArts", "release_date": "Sep 12 2006", "developers": ["Amaze Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 47, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/9/3957b6d251c9bbd9e73887bd4067e02a-98.jpg", "descriptions": "LEGO Star Wars II takes the fun and customization ability of the LEGO play pattern and combines it with the epic story, characters and action from the revolutionary Star Wars: Episodes IV, V and VI. With a unique tongue-in-cheek take on the Original Trilogy, LEGO Star Wars II lets you buildLEGO Star Wars II takes the fun and customization ability of the LEGO play pattern and combines it with the epic story, characters and action from the revolutionary Star Wars: Episodes IV, V and VI. With a unique tongue-in-cheek take on the Original Trilogy, LEGO Star Wars II lets you build and battle your way through your favorite film moments. From Darth Vader's pursuit of Princess Leia aboard her Blockade Runner to Luke's final confrontation with Emperor Palpatine. For the first time ever, characters can get in and out of vehicles, as well as ride creatures. Because it's LEGO style, you can also mix and match the body parts of more than 50 playable characters to create one of millions of possible LEGO Star Wars heroes. [LucasArts]… Expand"}, {"name": "X-Men: Destiny", "details_link": "https://www.metacritic.com/game/xbox-360/x-men-destiny", "publisher": "Activision", "release_date": "Sep 27 2011", "developers": ["Silicon Knights"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 47, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/4/27bf32cef7bab74615002ca9f7a9301b-98.jpg", "descriptions": "X-Men: Destiny has you playing a new recruit amongst comic's motley mutant band, and promises a branching storyline that features a deep element of choice."}, {"name": "Cities XXL", "details_link": "https://www.metacritic.com/game/pc/cities-xxl", "publisher": "Focus Home Interactive", "release_date": "Feb  5 2015", "developers": ["Focus Home Interactive"], "platforms": "PC", "genres": ["Strategy", "City Building", "Management", "Modern", "Government"], "meta_score": 47, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/0/eb710359caae9d426f2e35e3c3c9601e-98.jpg", "descriptions": "Design, build, and manage the world’s largest and most diverse cities in CitiesXXL. Bigger and better than ever before with a more powerful game engine and new interface, become the mayor of your very own sprawling metropolis. From town-planning including home locations, retail plots,Design, build, and manage the world’s largest and most diverse cities in CitiesXXL. Bigger and better than ever before with a more powerful game engine and new interface, become the mayor of your very own sprawling metropolis. From town-planning including home locations, retail plots, offices, industry and infrastructure across 47 architectural styles and 1000+ buildings, manage the happiness of your city’s denizens, with leisure activities, landmarks, and ecology and pollution management. With new structures, but also all-new ecological buildings and upgrades, such as the park-and-ride, electric car dealership, and bike hire, CitiesXXL offers a greener approach!… Expand"}, {"name": "Scramble", "details_link": "https://www.metacritic.com/game/xbox-360/scramble", "publisher": "Konami", "release_date": "Sep 13 2006", "developers": ["Digital Eclipse"], "platforms": ["PlayStation 4", "Switch", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Shooter", "General", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Horizontal"], "meta_score": 47, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/baed35fa1179d0ad085b56ef0d58ebeb-98.jpg", "descriptions": "[Xbox Live Arcade]  Control a spaceship that must infiltrate the enemy Scramble system in a classic side-scrolling shooter. Armed with guns and bombs, players must navigate swarms of enemies, meteors, missiles through six fiendish levels. Shoot fuel canisters to replenish your reserves in[Xbox Live Arcade]  Control a spaceship that must infiltrate the enemy Scramble system in a classic side-scrolling shooter. Armed with guns and bombs, players must navigate swarms of enemies, meteors, missiles through six fiendish levels. Shoot fuel canisters to replenish your reserves in order to make it to the enemy base at the end of the system. [Konami]… Expand"}, {"name": "Tetris Worlds", "details_link": "https://www.metacritic.com/game/gamecube/tetris-worlds", "publisher": "THQ", "release_date": "Jun 23 2002", "developers": ["Radical Entertainment"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "Stacking"], "meta_score": 47, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/6/957bff5deeecae79ff3d0769c5c2a50b-98.jpg", "descriptions": "For over a decade, the Tetris series has made an appearance on every game system.  Tetris Worlds continues that streak, bringing their distinct brand of simple, yet addictive gameplay to the current generation of systems.  Small shapes called Tetraminoes fall from the top of the screen toFor over a decade, the Tetris series has made an appearance on every game system.  Tetris Worlds continues that streak, bringing their distinct brand of simple, yet addictive gameplay to the current generation of systems.  Small shapes called Tetraminoes fall from the top of the screen to the bottom and you must rotate them and fit them together to complete lines.  The game features six different variations of the classic Tetris, multiplayer mode for up to four players, and six different worlds.  Sound easy? Once you start, you can't stop.… Expand"}, {"name": "Coast Guard", "details_link": "https://www.metacritic.com/game/pc/coast-guard", "publisher": "astragon", "release_date": "Oct 21 2015", "developers": ["Reality Twist GmbH", "Reality Twist"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "3D", "Virtual", "First-Person", "Career"], "meta_score": 47, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/3/5859cff15bd748d3564eed125cc54858-98.jpg", "descriptions": "Experience the lives of coast guard officer Finn Asdair and his crew in COAST GUARD. Take on responsibility under the motto \"Honor - Respect - Duty\" and pursue dangerous criminals on the wide open sea."}, {"name": "Balan Wonderworld", "details_link": "https://www.metacritic.com/game/xbox-series-x/balan-wonderworld", "publisher": "Square Enix", "release_date": "Mar 26 2021", "developers": ["Square Enix", "Arzest", "Balan Company"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 47, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/33a752c05fdea79bc761186bcf5e480f-98.jpg", "descriptions": "BALAN WONDERWORLD is an action platformer game themed around the Balan Theatre. Led by the enigmatic maestro named Balan, the stars of the show Emma and Leo will use special abilities from a multitude of characterful costumes as they adventure in the bizarre and imaginary land ofBALAN WONDERWORLD is an action platformer game themed around the Balan Theatre. Led by the enigmatic maestro named Balan, the stars of the show Emma and Leo will use special abilities from a multitude of characterful costumes as they adventure in the bizarre and imaginary land of Wonderworld. Here memories and vistas from the real world mix with the things that people hold dear. Twelve different tales await our stars in the Wonderworld, each with their own unique quirks. They will explore all corners of these labyrinthine stages, filled with a myriad of tricks and traps, to get to the heart of each story.… Expand"}, {"name": "Sonic Boom: Shattered Crystal", "details_link": "https://www.metacritic.com/game/3ds/sonic-boom-shattered-crystal", "publisher": "Sega", "release_date": "Nov 11 2014", "developers": ["Sanzaru Games"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 47, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/3e9c130ffaa7088095ec22656b08eadd-98.jpg", "descriptions": "Sonic Boom: Shattered Crystal is a standalone adventure that shares key characters, events and lore of the Sonic Boom universe with exclusive environments and characters, as well as an emphasis on platforming and puzzles.In addition to Sonic, Tails and Knuckles, gamers will also be able toSonic Boom: Shattered Crystal is a standalone adventure that shares key characters, events and lore of the Sonic Boom universe with exclusive environments and characters, as well as an emphasis on platforming and puzzles.In addition to Sonic, Tails and Knuckles, gamers will also be able to take on the role of Sticks, the newest member of the team. She will play an integral role in the story after her best friend Amy gets kidnapped by the ancient villain Lyric.… Expand"}, {"name": "Bellator: MMA Onslaught", "details_link": "https://www.metacritic.com/game/xbox-360/bellator-mma-onslaught", "publisher": "345 Games", "release_date": "Jul  4 2012", "developers": ["Kung Fu Factory"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 47, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/da3a667a853ed74b0fce07353214c43c-98.jpg", "descriptions": "MMA Onslaught is an arcade-style fighting game based on the Bellator mixed martial arts tournament organization."}, {"name": "Rainbow Islands Evolution", "details_link": "https://www.metacritic.com/game/psp/rainbow-islands-evolution", "publisher": "Ignition Entertainment", "release_date": "Jan 24 2008", "developers": ["Marvelous Entertainment", "Digital Whip"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 47, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/77b6226a9317bd40cc995012272b5d6d-98.jpg", "descriptions": "Set in the Rainbow Islands, Bub and Bob are now under the shadow of an evil record company who is polluting the ecosystem with a constant, mass-produced musical dirge. With this cacophony causing the flora to wilt and the fauna to mutate into aggressive enemies, only Bub and Bob have theSet in the Rainbow Islands, Bub and Bob are now under the shadow of an evil record company who is polluting the ecosystem with a constant, mass-produced musical dirge. With this cacophony causing the flora to wilt and the fauna to mutate into aggressive enemies, only Bub and Bob have the experience to take on the record company and its seven bosses, setting the stage for an entirely new adventure. The game environment has received a major overhaul. The strict vertical ascents of the original have been expanded and extrapolated into three dimensions, with each level's building-block platforms now following perspective and disappearing into the distance. As Bub and Bob negotiate the levels, these platforms will scroll to the forefront as they become accessible. This literally opens up a new dimension for the classic Rainbow Islands gameplay. [Amazon UK]… Expand"}]