[{"name": "TimeSplitters 2", "details_link": "https://www.metacritic.com/game/gamecube/timesplitters-2", "publisher": "Eidos Interactive", "release_date": "Oct 16 2002", "developers": ["Free Radical Design"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 88, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/9f415d031bfa1031c72fa02ef0d68f50-98.jpg", "descriptions": "The evil race of TimeSplitters is traveling back into human history authoring events that are leading to the enslavement of mankind. In control of a motley crew of renegade characters, you must hunt down the TimeSplitters in historical eras like the gangster-ridden 1920s, the lush jungles ofThe evil race of TimeSplitters is traveling back into human history authoring events that are leading to the enslavement of mankind. In control of a motley crew of renegade characters, you must hunt down the TimeSplitters in historical eras like the gangster-ridden 1920s, the lush jungles of Aztec temples, soviet military installations of the Cold War, and futuristic robot factories in space. To end their evil plot, seek and recover the crystals required to seal the rift in time. … Expand"}, {"name": "JSRF: Jet Set Radio Future", "details_link": "https://www.metacritic.com/game/xbox/jsrf-jet-set-radio-future", "publisher": "Sega", "release_date": "Feb 25 2002", "developers": ["Smilebit"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 88, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/e0c18fcf773bf826fd343cc6f86f9b6e-98.jpg", "descriptions": "The setting is Tokyo, in the year 2024. Featuring unique anime-style graphics and tons of tricks, JSRF: Jet Set Radio Future brings the hippest game ever into a futuristic world. Choose a character, strap on your rocket-powered skates, and immerse yourself in the vast environments. TheThe setting is Tokyo, in the year 2024. Featuring unique anime-style graphics and tons of tricks, JSRF: Jet Set Radio Future brings the hippest game ever into a futuristic world. Choose a character, strap on your rocket-powered skates, and immerse yourself in the vast environments. The multiplayer aspects let you work together to reach seemingly unattainable places, create new attacks, and perform astounding stunts. Wherever your adventure takes you, it's all about extreme skating, extreme action, and of course extreme style.… Expand"}, {"name": "Red Faction", "details_link": "https://www.metacritic.com/game/playstation-2/red-faction", "publisher": "THQ", "release_date": "May 21 2001", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 4", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 88, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/a46fd74063518bb329cd0db163f035f8-98.jpg", "descriptions": "\"Half-Life\" meets \"Total Recall\" in THQ's innovative first-person shooter which employs Geo-Mod technology (see a bunch of stuff blow up in real time!) and a heavy Martian mining colony storyline."}, {"name": "Myth II: Soulblighter", "details_link": "https://www.metacritic.com/game/pc/myth-ii-soulblighter", "publisher": "Bungie Software", "release_date": "Nov 30 1998", "developers": ["Bungie Software", "Bungie"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General"], "meta_score": 88, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/a7fdd2280ff0f1fe1533cca6baacfe33-98.jpg", "descriptions": "Building on the excellent plot and gameplay featured in Myth: The Fallen Lords, Myth II: Soulblighter also upped the ante by incorporating destructible environments as well as new game modes. The near-infinite gameplay permutations that ensued, ensured that Myth fans had lots of new toys toBuilding on the excellent plot and gameplay featured in Myth: The Fallen Lords, Myth II: Soulblighter also upped the ante by incorporating destructible environments as well as new game modes. The near-infinite gameplay permutations that ensued, ensured that Myth fans had lots of new toys to play with in the game world. Myth II also enjoyed a comprehensive update in the shape of the the Myth II expansion pack: Chimera. [Bungie Studios]… Expand"}, {"name": "Ninja Gaiden Sigma", "details_link": "https://www.metacritic.com/game/playstation-3/ninja-gaiden-sigma", "publisher": "Tecmo", "release_date": "Jul  3 2007", "developers": ["Team Ninja"], "platforms": ["PC", "PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 88, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/5a7d8fcbdcc2846285ca0265c42f707f-98.jpg", "descriptions": "As Ryu Hayabusa you are out to seek revenge after your clan is massacred by the Vigor Empire. Realistic battle actions and acrobatic ninja moves are at your finger-tips. You play with only your wits, your ninja skills, and your deadly sword. Slice down opponents in the Vigor Empire as youAs Ryu Hayabusa you are out to seek revenge after your clan is massacred by the Vigor Empire. Realistic battle actions and acrobatic ninja moves are at your finger-tips. You play with only your wits, your ninja skills, and your deadly sword. Slice down opponents in the Vigor Empire as you attempt to beat the Holy Emperor and reclaim the magic sword \"Ryuken\". Bringing the classic to the PlayStation 3, Ninja Gaiden Sigma is a more \"complete version\" of the Xbox Team Ninja title, with new moves, actions, and weapons for Hayabusa. Also added is a new playable character -- Racheal, one of the series' heroines, will be playable, and when using her, you'll get to experience the storyline from her perspective (with new cutscenes, attack moves and more.) [Tecmo]… Expand"}, {"name": "Fire Emblem Fates: Special Edition", "details_link": "https://www.metacritic.com/game/3ds/fire-emblem-fates-special-edition", "publisher": "Nintendo", "release_date": "Feb 19 2016", "developers": ["Intelligent Systems"], "platforms": "3DS", "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 88, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/c1f59b12b6a1ad289a2b78b7060c5bc7-98.jpg", "descriptions": "Fire Emblem Fates Special Edition Includes: All 3 Versions of Fire Emblem: Fates (Birthright, Conquest, Revelation*) on a Single Cartrige. *Allows purchasers to play Revelations three weeks prior to launch on eshop. It's the only way to get all Three Versions on a Single Cartridge. AlsoFire Emblem Fates Special Edition Includes: All 3 Versions of Fire Emblem: Fates (Birthright, Conquest, Revelation*) on a Single Cartrige. *Allows purchasers to play Revelations three weeks prior to launch on eshop. It's the only way to get all Three Versions on a Single Cartridge. Also includes a Hardcover Art Book and Nintendo 3DS XL Carrying Pouch featuring Game Art. Two kingdoms are on the brink of war. Whose side will you choose? Torn between two families, you’re an heir of Hoshido, raised by Nohrian royals. If you walk the path of Conquest, you must fight to change your misguided kingdom from within. Command warriors with expert precision and forge deep relationships to master this turn-based strategy game. … Expand"}, {"name": "Pinball FX 2", "details_link": "https://www.metacritic.com/game/xbox-360/pinball-fx-2", "publisher": "Microsoft Game Studios", "release_date": "Oct 27 2010", "developers": ["Zen Studios"], "platforms": ["PC", "Xbox One", "Xbox 360"], "num_players": "1-4 ", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 88, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/69727c3ce664324196e7711f7856f9fc-98.jpg", "descriptions": "Pinball FX is back, and it’s better than ever! Pinball FX 2 offers improved graphics and a host of new features for novices and experts alike: a new state-of-the-art physics model that surpasses anything available so far, Operators Menu with custom settings and advanced play info, automaticPinball FX is back, and it’s better than ever! Pinball FX 2 offers improved graphics and a host of new features for novices and experts alike: a new state-of-the-art physics model that surpasses anything available so far, Operators Menu with custom settings and advanced play info, automatic in-game challenges against your friends, and split-screen local multiplayer mode-a first in video pinball history! Pinball FX 2 also offers full backward compatibility for Pinball FX owners-download Pinball FX 2 free and play all your Pinball FX tables within Pinball FX 2!… Expand"}, {"name": "Final Fantasy Tactics: The War of the Lions", "details_link": "https://www.metacritic.com/game/psp/final-fantasy-tactics-the-war-of-the-lions", "publisher": "Square Enix", "release_date": "Oct  9 2007", "developers": ["TOSE"], "platforms": ["iPhone/iPad", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 88, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/7/d15047af9cac2f5bf57f32afa4819df8-98.jpg", "descriptions": "[Metacritic's 2007 PSP Game of the Year]  Originally released in 1997, Final Fantasy Tactics: The War of the Lions is a portable update on the classic turn-based strategy game that gave birth to the world of Ivalice. In development exclusively for the PSP system, FINAL FANTASY TACTICS: The[Metacritic's 2007 PSP Game of the Year]  Originally released in 1997, Final Fantasy Tactics: The War of the Lions is a portable update on the classic turn-based strategy game that gave birth to the world of Ivalice. In development exclusively for the PSP system, FINAL FANTASY TACTICS: The Lion War features PSP system exclusive content not found on the original classic including all-new CG sequences, all-new jobs, new 16:9 widescreen presentation, new head-to-head multiplayer and new storyline elements that refine the genesis of the IVALICE ALLIANCE. [Square Enix]… Expand"}, {"name": "NHL 11", "details_link": "https://www.metacritic.com/game/xbox-360/nhl-11", "publisher": "Electronic Arts", "release_date": "Sep  7 2010", "developers": ["Electronic Arts"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 88, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/25b236ca75161ce33693d64b6365e236-98.jpg", "descriptions": "Celebrating its 20th year, the franchise that captured 22 ‘Sports Game of the Year’ awards has raised the bar yet again with NHL® 11. Powered by an all-new Real-Time Physics Engine, NHL 11 lets you create highlight reel moments as you experience adrenaline-pumping NHL action with biggerCelebrating its 20th year, the franchise that captured 22 ‘Sports Game of the Year’ awards has raised the bar yet again with NHL® 11. Powered by an all-new Real-Time Physics Engine, NHL 11 lets you create highlight reel moments as you experience adrenaline-pumping NHL action with bigger hits, broken sticks, and faster dangles. Whether you’re beginning your career in the Canadian Hockey League, dominating rivals in the EA SPORTS Hockey League, or assembling Hockey’s Ultimate Team, any moment can be a ‘WOW’ moment with NHL 11.… Expand"}, {"name": "Wario Land 4", "details_link": "https://www.metacritic.com/game/game-boy-advance/wario-land-4", "publisher": "Nintendo", "release_date": "Nov 18 2001", "developers": ["Nintendo"], "platforms": "Game Boy Advance", "genres": ["Action", "Platformer", "2D"], "meta_score": 88, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/8c8e2dc75bf0327029522b1e5d96aebf-98.jpg", "descriptions": "Hey! You! Yeah, you! Listen up when Wario's talking to you! I just read about this legendary Pyramid of Gold, and you're gonna help me go explore it. There's lots of treasure in there for the taking, and I want it all. I'm sure there are gonna be all kinds of weird enemies and big, badHey! You! Yeah, you! Listen up when Wario's talking to you! I just read about this legendary Pyramid of Gold, and you're gonna help me go explore it. There's lots of treasure in there for the taking, and I want it all. I'm sure there are gonna be all kinds of weird enemies and big, bad bosses in there, so if you don't think you can hack it, put the game down now. I don't want any losers making me jump into bottomless pits, you hear me?… Expand"}, {"name": "The Elder Scrolls III: Morrowind Game of the Year Edition", "details_link": "https://www.metacritic.com/game/xbox/the-elder-scrolls-iii-morrowind-game-of-the-year-edition", "publisher": "Bethesda Softworks", "release_date": "Oct 31 2003", "developers": ["Bethesda Softworks"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Role-Playing", "First-Person"], "meta_score": 88, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/f6378bfdb9b95bcdf958a75fb760f5d7-98.jpg", "descriptions": "The Elder Scrolls III: Morrowind Game of the Year Edition includes the original game of Morrowind, plus the Tribunal and Bloodmoon expansions.  In Morrowind, you can explore exotic locations, including epic dungeons, detailed cities, and vast landscapes.  Each area in Tribunal comes completeThe Elder Scrolls III: Morrowind Game of the Year Edition includes the original game of Morrowind, plus the Tribunal and Bloodmoon expansions.  In Morrowind, you can explore exotic locations, including epic dungeons, detailed cities, and vast landscapes.  Each area in Tribunal comes complete with new creatures, quests, armor, and weapons.  Bloodmoon takes you into the frozen island of Solstheim, where you can become a werewolf and indulge your thirst for the hunt.  Morrowind and its expansions feature enhanced graphics, in-depth gameplay, and innovative character development.  … Expand"}, {"name": "WarioWare: Twisted!", "details_link": "https://www.metacritic.com/game/game-boy-advance/warioware-twisted!", "publisher": "Nintendo", "release_date": "May 23 2005", "developers": ["Nintendo"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 88, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/a61db746c9e35dfec8cb6b702eb537ce-98.jpg", "descriptions": "After accidentally discovering spin technology, Wario reassembles the developers at WarioWare, Inc. to make a new set of wild minigames. WarioWare: Twisted! maintains the fast-paced style of gameplay from the original WarioWare and introduces a new gyro sensor that lets you control theAfter accidentally discovering spin technology, Wario reassembles the developers at WarioWare, Inc. to make a new set of wild minigames. WarioWare: Twisted! maintains the fast-paced style of gameplay from the original WarioWare and introduces a new gyro sensor that lets you control the gameplay by rotating the Game Boy Advance SP left and right. The new controls play into more than 200 minigames. Play through them all to unlock souvenirs, such as bonus games, figurines, and instruments. … Expand"}, {"name": "Fez", "details_link": "https://www.metacritic.com/game/switch/fez", "publisher": "Polytron Corp.", "release_date": "Apr 14 2021", "developers": ["Polytron Corp."], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox 360", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 88, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/1bcf237fce9ba906eee7fbd1e9555394-98.jpg", "descriptions": "Gomez is a 2D man on a voyage of discovery into the mysterious 3rd dimension. Change your perspective and look at the world in a different way."}, {"name": "It Takes Two", "details_link": "https://www.metacritic.com/game/playstation-5/it-takes-two", "publisher": "Electronic Arts", "release_date": "Mar 26 2021", "developers": ["Hazelight"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "2 ", "genres": ["Action Adventure", "Linear"], "meta_score": 88, "users_score": 9.1, "image": "https://static.metacritic.com/images/products/games/4/04a369bc682d4082251ea52cadc58dd9-98.jpg", "descriptions": "From Hazelight comes It Takes Two an innovative co-op adventure where uniquely varied gameplay and emotional storytelling intertwine in a fantastical journey. Founded to push the creative boundaries of what's possible in games, Hazelight is the award-winning studio behind the criticallyFrom Hazelight comes It Takes Two an innovative co-op adventure where uniquely varied gameplay and emotional storytelling intertwine in a fantastical journey. Founded to push the creative boundaries of what's possible in games, Hazelight is the award-winning studio behind the critically acclaimed A Way Out and Brothers: A Tale of Two Sons.\r Something out of the ordinary\rBring your favorite co-op partner and together step into the shoes of May and Cody. As the couple is going through a divorce, through unknown means their minds are transported into two dolls which their daughter, Rose, made to represent them. Now they must reluctantly find a way to get back into their bodies, a quest which takes them through the most wild, unexpected and fantastical journey imaginable.… Expand"}, {"name": "Halo: The Master Chief Collection - Halo 3", "details_link": "https://www.metacritic.com/game/pc/halo-the-master-chief-collection---halo-3", "publisher": "Xbox Game Studios", "release_date": "Jul 14 2020", "developers": ["343 Industries"], "platforms": ["Xbox 360", "PC"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 88, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/6b6c498f4f4676e38eaf0843988717fa-98.jpg", "descriptions": "Halo 3 is the third game in the Halo Trilogy and provides the thrilling conclusion to the events begun in \"Halo: Combat Evolved.\" Halo 3 will pick up where \"Halo 2\" left off. The Master Chief is returning to Earth to finish the fight. The Covenant occupation of Earth hasHalo 3 is the third game in the Halo Trilogy and provides the thrilling conclusion to the events begun in \"Halo: Combat Evolved.\" Halo 3 will pick up where \"Halo 2\" left off. The Master Chief is returning to Earth to finish the fight. The Covenant occupation of Earth has uncovered a massive and ancient object beneath the African sands - an object who's secrets have yet to be revealed. Earth's forces are battered and beaten. The Master Chief's AI companion Cortana is still trapped in the clutches of the Gravemind - a horrifying Flood intelligence, and a civil war is raging in the heart of the Covenant. This is how the world ends...… Expand"}, {"name": "Pokemon Y", "details_link": "https://www.metacritic.com/game/3ds/pokemon-y", "publisher": "Nintendo", "release_date": "Oct 12 2013", "developers": ["Game Freak"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Trainer"], "meta_score": 88, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/09df48f196a70d2eba6ce90ade1505ff-98.jpg", "descriptions": "Pokemon X and Y are the first mainline Pokemon games made for the 3DS and feature a mix of Pokemon old and new as well as a trio of new starting Pokemon - a watery toad Froakie, a fiery deer Fennekin, and a grass monster Chespin."}, {"name": "Call of Duty: Black Ops", "details_link": "https://www.metacritic.com/game/playstation-3/call-of-duty-black-ops", "publisher": "Activision", "release_date": "Nov  9 2010", "developers": ["Treyarch"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Tactical", "Historic", "Arcade"], "meta_score": 88, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/b0999dbd678792acaf240808e85bc67b-98.jpg", "descriptions": "Treyarch is developing the next installment in the Call of Duty franchise, rumored to be set during the Cold War."}, {"name": "Deathloop", "details_link": "https://www.metacritic.com/game/playstation-5/deathloop", "publisher": "Bethesda Softworks", "release_date": "Sep 14 2021", "developers": ["Arkane Studios"], "platforms": ["PC", "Xbox Series X", "PlayStation 5"], "num_players": "2 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 88, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/ed8d74c28c9f35ac37b809219c697848-98.jpg", "descriptions": "If at first you don't succeed Die, Die Again. From the team at Arkane Lyon comes an innovative take on first-person action. \"DEATHLOOP\" transports players to the lawless island of Blackreef in an eternal struggle between two extraordinary assassins. Explore stunning environments andIf at first you don't succeed Die, Die Again. From the team at Arkane Lyon comes an innovative take on first-person action. \"DEATHLOOP\" transports players to the lawless island of Blackreef in an eternal struggle between two extraordinary assassins. Explore stunning environments and meticulously designed levels in an immersive gameplay experience that lets you approach every situation any way you like. Hunt down targets all over the island in an effort to put an end to the cycle once and for all, and remember, if at first you don't succeed die, die again.… Expand"}, {"name": "Return to Castle Wolfenstein", "details_link": "https://www.metacritic.com/game/pc/return-to-castle-wolfenstein", "publisher": "Activision", "release_date": "Nov 19 2001", "developers": ["Gray Matter"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 88, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/008f2557d94b572afb29ab168dc5cb23-98.jpg", "descriptions": "As B.J. Blazkowicz, a highly decorated Army Ranger recruited into the Office of Secret Actions, you are tasked with escaping and then returning to Castle Wolfenstein in an attempt to thwart Heinrich Himmler's occult and genetic experiments. Through genetic engineering and the harnessing ofAs B.J. Blazkowicz, a highly decorated Army Ranger recruited into the Office of Secret Actions, you are tasked with escaping and then returning to Castle Wolfenstein in an attempt to thwart Heinrich Himmler's occult and genetic experiments. Through genetic engineering and the harnessing of occult powers, Himmler hopes to raise an unstoppable army to level the Allies once and for all. You must first escape from imprisonment in the castle to report the strange creatures and happenings in and around Wolfenstein to the OSA. Your mission takes a drastic turn as you learn the depth of Himmler's plans and what you must do to defeat the evil he has unleashed. [Activision]… Expand"}, {"name": "Ori and the Blind Forest", "details_link": "https://www.metacritic.com/game/xbox-one/ori-and-the-blind-forest", "publisher": "Microsoft Game Studios", "release_date": "Mar 11 2015", "developers": ["Moon Studios"], "platforms": ["PC", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 88, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/350b56823429739e914c1e0da9f8f59c-98.jpg", "descriptions": "Ori and the Blind Forest is a bit of a genremix – It’s a ‘Metroidvania‘, but with a stronger platforming focus and light RPG elements, all set within an atmospheric world."}, {"name": "Ori and the Blind Forest: Definitive Edition", "details_link": "https://www.metacritic.com/game/pc/ori-and-the-blind-forest-definitive-edition", "publisher": "Microsoft Game Studios", "release_date": "Apr 27 2016", "developers": ["Moon Studios"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 88, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/22f6c41074dd2ce4c9fff7c4f3b42122-98.jpg", "descriptions": "Ori and the Blind Forest: Definitive Edition delivers a multitude of new areas, difficulty options, and gameplay upgrades that should appeal to both new and seasoned Ori players."}, {"name": "NCAA Football 07", "details_link": "https://www.metacritic.com/game/xbox/ncaa-football-07", "publisher": "EA Sports", "release_date": "Jul 18 2006", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "Xbox 360", "Xbox"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 88, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/3b0242c8c47404ed3d89ea964e3c4aa5-98.jpg", "descriptions": "Momentum changes everything - now college football's most celebrated videogame turns the tide with NCAA Football 07. Whether battling your biggest rival or playing for the first-ever BCS National Championship Game in Dynasty Mode, success on the field depends on your ability to maintainMomentum changes everything - now college football's most celebrated videogame turns the tide with NCAA Football 07. Whether battling your biggest rival or playing for the first-ever BCS National Championship Game in Dynasty Mode, success on the field depends on your ability to maintain momentum. Featuring unprecedented graphics that capture every moment in complete detail--from the authenticity of the stadiums, mascots, and marching bands, to the true-to-life look and feel of the players on the field.… Expand"}, {"name": "NBA Street", "details_link": "https://www.metacritic.com/game/gamecube/nba-street", "publisher": "EA Sports", "release_date": "Feb 17 2002", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Basketball", "Arcade"], "meta_score": 88, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/2/9085398b2213dc211057e84fe4a19645-98.jpg", "descriptions": "NBA stars take their skills to the streets--but out here, style and attitude win ball games. NBA Street lets you play in three-on-three basketball games that encourage flashy dunks, blocks, passes, and dribbles. The more you showboat, the greater your momentum meter becomes, thus boostingNBA stars take their skills to the streets--but out here, style and attitude win ball games. NBA Street lets you play in three-on-three basketball games that encourage flashy dunks, blocks, passes, and dribbles. The more you showboat, the greater your momentum meter becomes, thus boosting your team with a special game-breaking move. From East to West Coast, you'll compete against NBA stars, NBA legends, and street hoopsters while gaining points to unlock even more players.… Expand"}, {"name": "Madden NFL 2002", "details_link": "https://www.metacritic.com/game/playstation/madden-nfl-2002", "publisher": "EA Sports", "release_date": "Aug 13 2001", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "PlayStation"], "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 88, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/5c9348e8b4c8de50c9f83142b69000ce-98.jpg", "descriptions": "While Madden 2002 isn't reinventing football on the PlayStation, it is really the best you're going to get on the system."}, {"name": "Shogo: Mobile Armor Division", "details_link": "https://www.metacritic.com/game/pc/shogo-mobile-armor-division", "publisher": "Monolith Productions", "release_date": "Sep 30 1998", "developers": ["Monolith Productions"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 88, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/6f5e47003bb4b20d0c5954b4fbaddb11-98.jpg", "descriptions": "Choose from four ultra powerful transforming Mobile Combat Armor suits, each with its own advantages and strengths. Find tons of powerups and enhancements to improve your MCA's performance. In addition to piloting your MCA through deadly outdoor, underground, and city missions, you will beChoose from four ultra powerful transforming Mobile Combat Armor suits, each with its own advantages and strengths. Find tons of powerups and enhancements to improve your MCA's performance. In addition to piloting your MCA through deadly outdoor, underground, and city missions, you will be able to dock in certain areas and strike out on foot to complete objectives. There may even be a surprise or two in store... Shogo: Mobile Armor Division uses Monolith?s LithTech - one of the most advanced next-generation 3D engines in gaming. [Monolilth]… Expand"}, {"name": "Thirty Flights of Loving", "details_link": "https://www.metacritic.com/game/pc/thirty-flights-of-loving", "publisher": "Blendo Games", "release_date": "Aug 20 2012", "developers": ["Blendo Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "First-Person"], "meta_score": 88, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/ca0c08eda0e484c0bd73ac89575f1ff1-98.jpg", "descriptions": "Explore the world of Thirty Flights of Loving through a first-person short story. In this sequel to Gravity Bone, take a deep dive with high-flying schemers, lovelorn criminals, and more stray kittens than you can shake a stick at. Saddle up, gunslinger."}, {"name": "Marvel's Spider-Man: Miles Morales", "details_link": "https://www.metacritic.com/game/pc/marvels-spider-man-miles-morales", "publisher": "PlayStation Studios", "release_date": "Nov 18 2022", "developers": ["Nixxes Software"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 88, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/4547a36c26cf638c588867664a06c9b8-98.jpg", "descriptions": "The latest adventure in the Spider-Man universe will build on and expand 'Marvel's Spider-Man' through an all-new story. Players will experience the rise of Miles Morales as he masters new powers to become his own Spider-Man."}, {"name": "The Witcher 2: Assassins of Kings", "details_link": "https://www.metacritic.com/game/xbox-360/the-witcher-2-assassins-of-kings", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr 17 2012", "developers": ["CD Projekt Red Studio"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 88, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/43b97c9f78a356914df224e9ea04327b-98.jpg", "descriptions": "The second installment in the RPG saga about the Witcher, Geralt of Rivia, features a thoroughly engrossing, mature storyline defining new standards for thought-provoking, non-linear game narration.  In addition to an epic story, the game features an original, brutal combat system thatThe second installment in the RPG saga about the Witcher, Geralt of Rivia, features a thoroughly engrossing, mature storyline defining new standards for thought-provoking, non-linear game narration.  In addition to an epic story, the game features an original, brutal combat system that uniquely combines tactical elements with dynamic action.  A new, modern game engine, responsible for beautiful visuals and sophisticated game mechanics puts players in the most lively and believable world ever created in an RPG game.  A captivating story, dynamic combat system, beautiful graphics, and everything else that made the original Witcher such a great game are now executed in a much more advanced and sophisticated way.… Expand"}, {"name": "Hearthstone: Heroes of Warcraft", "details_link": "https://www.metacritic.com/game/pc/hearthstone-heroes-of-warcraft", "publisher": "Blizzard Entertainment", "release_date": "Mar 11 2014", "developers": ["Blizzard Entertainment"], "platforms": ["iPhone/iPad", "PC"], "num_players": "2 ", "genres": ["Card Battle", "Strategy", "Miscellaneous", "Turn-Based", "Card Battle"], "meta_score": 88, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/ad340607c7d5802161e053536ec796dd-98.jpg", "descriptions": "Hearthstone is a free-to-play digital strategy card game that anyone can enjoy. Players choose one of nine epic Warcraft heroes to play as, and then take turns playing cards from their customizable decks to cast potent spells, use heroic weapons or abilities, or summon powerful characters toHearthstone is a free-to-play digital strategy card game that anyone can enjoy. Players choose one of nine epic Warcraft heroes to play as, and then take turns playing cards from their customizable decks to cast potent spells, use heroic weapons or abilities, or summon powerful characters to crush their opponent.… Expand"}, {"name": "Unity of Command II", "details_link": "https://www.metacritic.com/game/pc/unity-of-command-ii", "publisher": "2x2 Games", "release_date": "Nov 12 2019", "developers": ["2x2 Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 88, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/54a7d28b8aa6a8edb00773920d790519-98.jpg", "descriptions": "Unity of Command II is the sequel to one of the most critically acclaimed strategy games of all time; a game critics called 'the perfect gateway' into computer war games."}, {"name": "Grand Theft Auto: Liberty City Stories", "details_link": "https://www.metacritic.com/game/psp/grand-theft-auto-liberty-city-stories", "publisher": "Rockstar Games", "release_date": "Oct 24 2005", "developers": ["Rockstar North", "Rockstar Leeds"], "platforms": ["iPhone/iPad", "PlayStation 2", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 88, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/e4b1a1df27d212a20dd305bb4bb9d669-98.jpg", "descriptions": "Grand Theft Auto: Liberty City Stories is an entirely new game in the Grand Theft Auto series and brings a mobile dimension to this epic experience. The original storyline and all new missions take place in Liberty City, featuring the interactive, open environment, voice talent and diverseGrand Theft Auto: Liberty City Stories is an entirely new game in the Grand Theft Auto series and brings a mobile dimension to this epic experience. The original storyline and all new missions take place in Liberty City, featuring the interactive, open environment, voice talent and diverse music that have become pioneering trademarks of the series. [Rockstar]… Expand"}, {"name": "Horizon Forbidden West", "details_link": "https://www.metacritic.com/game/playstation-5/horizon-forbidden-west", "publisher": "PlayStation Studios", "release_date": "Feb 18 2022", "developers": ["Guerrilla"], "platforms": ["PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action Adventure", "Open-World"], "meta_score": 88, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/4b2f5ab7b2de8a156a4fde6b39884ae2-98.jpg", "descriptions": "Join Aloy as she braves the Forbidden West – a majestic but dangerous frontier that conceals mysterious new threats. Explore distant lands, fight bigger and more awe-inspiring machines, and encounter astonishing new tribes as you return to the far-future, post-apocalyptic world of Horizon.Join Aloy as she braves the Forbidden West – a majestic but dangerous frontier that conceals mysterious new threats. Explore distant lands, fight bigger and more awe-inspiring machines, and encounter astonishing new tribes as you return to the far-future, post-apocalyptic world of Horizon. The land is dying. Vicious storms and an unstoppable blight ravage the scattered remnants of humanity, while fearsome new machines prowl their borders. Life on Earth is hurtling towards another extinction, and no one knows why. It's up to Aloy to uncover the secrets behind these threats and restore order and balance to the world. Along the way, she must reunite with old friends, forge alliances with warring new factions and unravel the legacy of the ancient past – all the while trying to stay one step ahead of a seemingly undefeatable new enemy.… Expand"}, {"name": "Metroid Dread", "details_link": "https://www.metacritic.com/game/switch/metroid-dread", "publisher": "Nintendo", "release_date": "Oct  8 2021", "developers": ["Mercury Steam", "Nintendo"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "", "Metroidvania"], "meta_score": 88, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/33ebb325c3be6cf63c66ef82c2e66574-98.jpg", "descriptions": "Join intergalactic bounty hunter Samus Aran in her first new 2D Metroid™ story in 19 years. Samus’ story continues after the events of the Metroid™ Fusion game when she descends upon planet ZDR to investigate a mysterious transmission sent to the Galactic Federation. The remote planet hasJoin intergalactic bounty hunter Samus Aran in her first new 2D Metroid™ story in 19 years. Samus’ story continues after the events of the Metroid™ Fusion game when she descends upon planet ZDR to investigate a mysterious transmission sent to the Galactic Federation. The remote planet has become overrun by vicious alien lifeforms and chilling mechanical menaces. Samus is more agile and capable than ever, but can she overcome the inhuman threat stalking the depths of ZDR?\r Face off against unrelenting E.M.M.I. robots\r Once DNA-extracting research machines, the imposing E.M.M.I. are now hunting Samus down. Tensions are high as you evade these E.M.M.I. to avoid a cruel death while finding a way to take them down. Find out what turned these robotic wonders into the scourge of ZDR and escape with your life.\r Feel Samus’ power grow as you gain maneuvers and abilities\r Acquire new and familiar abilities as you traverse the many environments of this dangerous world. Parkour over obstacles, slide through tight spaces, counter enemies, and battle your way through the planet. Return to areas and use your new abilities to find upgrades, alternate paths, and a way forward. Explore the sprawling map, evade and destroy E.M.M.I. robots, and overcome the dread plaguing ZDR.\r… Expand"}, {"name": "The Walking Dead: Episode 3 - Long Road Ahead", "details_link": "https://www.metacritic.com/game/xbox-360/the-walking-dead-episode-3---long-road-ahead", "publisher": "Telltale Games", "release_date": "Aug 29 2012", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "Adventure", "General", "Compilation", "Point-and-Click"], "meta_score": 88, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/43b69a0c0d83d474d7181be9e5b8a6a3-98.jpg", "descriptions": "Episode 3 of a 5-part game series set in Robert Kirkman’s universe. Treachery within the group leads to a devastating series of events. Will the tough choices you made in episodes one and two come back to haunt you or prove to be worthwhile decisions?"}, {"name": "Medieval II: Total War", "details_link": "https://www.metacritic.com/game/pc/medieval-ii-total-war", "publisher": "Sega", "release_date": "Nov 13 2006", "developers": ["Creative Assembly"], "platforms": ["iPhone/iPad", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "General"], "meta_score": 88, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/2/af41891c1d5f33102c788d7eb9b6da97-98.jpg", "descriptions": "Medieval 2: Total War boasts an impressive array of new graphical and gameplay enhancements, including the capability for a massive 10,000 dynamic characters to be taken into battle at any one time. On top of this, The Creative Assembly have implemented a fully redesigned multiplayer modeMedieval 2: Total War boasts an impressive array of new graphical and gameplay enhancements, including the capability for a massive 10,000 dynamic characters to be taken into battle at any one time. On top of this, The Creative Assembly have implemented a fully redesigned multiplayer mode that offers a dynamic multi-battle campaign bolstered by an unprecedented level of visceral combat choreography that reflects the brutality of medieval warfare. Set in the most turbulent and bloody era in European history, Medieval 2: Total War allows gamers to lead their armies across the battlefields of Europe and the Holy Land before discovering the Americas and doing battle with the fearsome Aztecs. Medieval 2: Total War offers a vastly enhanced terrain model to create new graphically rich environments portraying breathtaking cliff top castles and enhanced settlement features that are unique to each civilisation. [Sega]… Expand"}, {"name": "Super Mario Maker 2", "details_link": "https://www.metacritic.com/game/switch/super-mario-maker-2", "publisher": "Nintendo", "release_date": "Jun 28 2019", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 88, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/461d7b4c6a8f569582758078f4b6637f-98.jpg", "descriptions": "Mario fans of the world, unite! Now you can play, create, and share the side-scrolling Super Mario courses of your dreams in the Super Mario Maker 2 game, available exclusively on the Nintendo Switch™ system! Dive into the single-player Story Mode and play built-in courses to rebuildMario fans of the world, unite! Now you can play, create, and share the side-scrolling Super Mario courses of your dreams in the Super Mario Maker 2 game, available exclusively on the Nintendo Switch™ system! Dive into the single-player Story Mode and play built-in courses to rebuild Princess Peach’s castle. Make your own courses, alone or together. And with a Nintendo Switch Online membership*, share your courses, access a near-endless supply made by others, enjoy online multiplayer, and more. A new side-scrolling Mario adventure that unleashes the creative potential of Super Mario Maker 2 awaits in Story Mode, which contains over 100 built-in courses. And in Course Maker, a wide range of parts, tools, and more are available so you can construct your own courses. Want coin-shooting cannons? Bowser riding on a giant Goomba? Cat Mario sliding down slopes to take out an army of baddies? Go for it! You call the shots. Pass a Joy-Con controller to a partner to build cooperatively on a single system.… Expand"}, {"name": "Apex Legends", "details_link": "https://www.metacritic.com/game/pc/apex-legends", "publisher": "Electronic Arts", "release_date": "Feb  4 2019", "developers": ["Respawn Entertainment"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 88, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/c65c20c38632297e1f803e95bd7a9c06-98.jpg", "descriptions": "Conquer with character in Apex Legends, a free-to-play Battle Royale shooter where legendary characters with powerful abilities team up to battle for fame and fortune on the fringes of the Frontier. Master an ever-growing roster of diverse legends, deep tactical squad play, and bold newConquer with character in Apex Legends, a free-to-play Battle Royale shooter where legendary characters with powerful abilities team up to battle for fame and fortune on the fringes of the Frontier. Master an ever-growing roster of diverse legends, deep tactical squad play, and bold new innovations that level-up the Battle Royale experience—all within a rugged world where anything goes. Welcome to the next evolution of Battle Royale.… Expand"}, {"name": "Sly 2: Band of Thieves", "details_link": "https://www.metacritic.com/game/playstation-2/sly-2-band-of-thieves", "publisher": "SCEA", "release_date": "Sep 14 2004", "developers": ["Sucker Punch"], "platforms": ["PlayStation 3", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 88, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/3/111b9ae13ce7783c54bd061e57f92194-98.jpg", "descriptions": "Incorporating a creative new approach to team play, Sly and his crew work together to plan and pull off a series of big heists. With an enhanced move set, including pick-pocketing, vent crawls, rooftop chases, and stealth attacks, and a team of unique playable characters, Sly 2: Band ofIncorporating a creative new approach to team play, Sly and his crew work together to plan and pull off a series of big heists. With an enhanced move set, including pick-pocketing, vent crawls, rooftop chases, and stealth attacks, and a team of unique playable characters, Sly 2: Band of Thieves delivers a true thieving experience as players explore the open environments and must think on their feet to survive. Sly 2: Band of Thieves breaks the rules of convention and truly immerses players into a world with no laws or boundaries. Sly and his crew are back! Say goodbye to the Brat Pack as you know it because there's a new Raccoon Pack in town that is raring to go. Word is out that Interpol has excavated the robotic remains of Clockwerk -- Sly's nemesis and sworn enemy of the Cooper clan. Sly and his gang discover the parts of Clockwerk are missing, and embark on a quest to ensure Clockwerk is never reassembled. The journey takes Sly and his crew to the far reaches of the globe, and along the way experience a plot full of deceit, surprising twists, and an exciting romantic triangle that will leave you wanting more. [SCEA]… Expand"}, {"name": "Devil May Cry 5", "details_link": "https://www.metacritic.com/game/playstation-4/devil-may-cry-5", "publisher": "Capcom", "release_date": "Mar  8 2019", "developers": ["Capcom"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 3 ", "genres": ["Action Adventure", "General"], "meta_score": 88, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/59e75f5dbf2ac27a96391eed0e125bde-98.jpg", "descriptions": "The story is set several years after Devil May Cry 4.Legendary DMC action returns, made all the more stylish by the power modern gaming has to offer.\nBehold stunning visuals built upon the technology that brought you Resident Evil 7 biohazard. High framerate graphics and flexible designThe story is set several years after Devil May Cry 4.Legendary DMC action returns, made all the more stylish by the power modern gaming has to offer.Behold stunning visuals built upon the technology that brought you Resident Evil 7 biohazard. High framerate graphics and flexible design give our creators what they need to offer fans the latest and greatest DMC experience.… Expand"}, {"name": "Doom 3", "details_link": "https://www.metacritic.com/game/xbox/doom-3", "publisher": "Activision", "release_date": "Apr  3 2005", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox"], "num_players": "4  Online", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 88, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/301fda28ed500d5576f9c51d7f51de98-98.jpg", "descriptions": "A massive demonic invasion has overwhelmed the Union Aerospace Corporation's (UAC) Mars Research Facility, leaving only chaos and horror in its wake. As one of only a few survivors, you must fight your way to hell and back against a horde of evil monsters. The path is dark and dangerous, butA massive demonic invasion has overwhelmed the Union Aerospace Corporation's (UAC) Mars Research Facility, leaving only chaos and horror in its wake. As one of only a few survivors, you must fight your way to hell and back against a horde of evil monsters. The path is dark and dangerous, but you'll have an array of weapons--including a pistol, a chainsaw, grenades, and more--to use for protection. … Expand"}, {"name": "NCAA Football 2005", "details_link": "https://www.metacritic.com/game/gamecube/ncaa-football-2005", "publisher": "EA Sports", "release_date": "Jul 15 2004", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 88, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/7129b7ba4cca2ba060a41dc2c1344b58-98.jpg", "descriptions": "Kick off the football season with NCAA Football 2005, a game that brings you closer to the players, stadiums, and atmosphere of college football. For the first time in the series, the game-day atmosphere directly affects players' on-field performance. Create mismatches with the new Match-UpKick off the football season with NCAA Football 2005, a game that brings you closer to the players, stadiums, and atmosphere of college football. For the first time in the series, the game-day atmosphere directly affects players' on-field performance. Create mismatches with the new Match-Up Stick, and then celebrate big plays with new fan celebrations, like the Gator Chomp and the Texas Hook 'Em Horns. NCAA Football 2005 also features online tournaments, a deeper Dynasty mode, and a host of other gameplay enhancements.… Expand"}, {"name": "FIFA Soccer 2003", "details_link": "https://www.metacritic.com/game/playstation-2/fifa-soccer-2003", "publisher": "EA Sports", "release_date": "Nov 14 2002", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 88, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/84a6f1e233ac5f916e4b46df1c4904e5-98.jpg", "descriptions": "The World of Soccer: Play with all the best clubs, players and national teams. Powerhouse Detail: The Club Championship highlights the top 18 club teams with intense detail, including team-specific stadiums and chants. Total Ball Control: Use your feet and head to control the ball like neverThe World of Soccer: Play with all the best clubs, players and national teams. Powerhouse Detail: The Club Championship highlights the top 18 club teams with intense detail, including team-specific stadiums and chants. Total Ball Control: Use your feet and head to control the ball like never before. New Set Pieces: Use free kicks and corner kicks to set up a shot or even score directly. Game-changing AI: Computer opponents will adopt tactics based on the real game situations. [EA Games]… Expand"}, {"name": "Aggressive Inline", "details_link": "https://www.metacritic.com/game/gamecube/aggressive-inline", "publisher": "Acclaim", "release_date": "Jul 31 2002", "developers": ["Z-Axis", "Ltd."], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skating"], "meta_score": 88, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/cd076ca7eebc1f23383538e985e9bd7f-98.jpg", "descriptions": "Aggressive Inline pushes your inline skating skills to the limit with a new Juice Meter, challenging objectives, and expansive levels. You can choose from an array of professional inline skaters--including Jaren Grob, Chris Edwards, and Shane Yost--and showcase your talent in variousAggressive Inline pushes your inline skating skills to the limit with a new Juice Meter, challenging objectives, and expansive levels. You can choose from an array of professional inline skaters--including Jaren Grob, Chris Edwards, and Shane Yost--and showcase your talent in various interactive skate parks. Perform a variety of manuals, grinds, big-air tricks, wall flips, hand plants, and more, to build up your Juice Meter and avoid elimination. Aggressive Inline also includes a Park Editor that lets you design your own skate park, complete with rails, ramps, and pipes.… Expand"}, {"name": "F1 2002", "details_link": "https://www.metacritic.com/game/pc/f1-2002", "publisher": "EA Sports", "release_date": "Jun 11 2002", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-8 ", "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 88, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/c2eccec02cc0b541623b777c3e70bb7f-98.jpg", "descriptions": "In-depth telemetry -- Optimize vehicle setup, driving style and general performance using detailed Telemetry data; State of the art technology -- Cutting edge graphics technology, dynamic weather effects, real word lighting, character animation for pit crews, and engine and brake temperatureIn-depth telemetry -- Optimize vehicle setup, driving style and general performance using detailed Telemetry data; State of the art technology -- Cutting edge graphics technology, dynamic weather effects, real word lighting, character animation for pit crews, and engine and brake temperature modelling; Authentic 2002 driver controls -- Experience the same technological wizardry available to Formula One drivers, including Launch Control, Traction Control and variable level automated shifting; Greater Accessibility -- An all-new team themed user interface, enhanced game controller support and Force Feedback. [EA Sports]… Expand"}, {"name": "Tekken: Dark Resurrection", "details_link": "https://www.metacritic.com/game/psp/tekken-dark-resurrection", "publisher": "Namco Bandai Games America", "release_date": "Jul 25 2006", "developers": ["Namco Bandai Games"], "platforms": ["PlayStation 3", "PSP"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 88, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/2999b135a8a97f0a47ec94dbad58ed58-98.jpg", "descriptions": "TEKKEN: Dark Resurrection arrives on the PSP. New characters Lili and Dragunov join the classic cast such as Jin, Heihachi, Paul and Law in the battle to be crowned King of the Iron Fist Tournament. An all-new intro movie lets you dive into the midst of the world of TEKKEN, this time withTEKKEN: Dark Resurrection arrives on the PSP. New characters Lili and Dragunov join the classic cast such as Jin, Heihachi, Paul and Law in the battle to be crowned King of the Iron Fist Tournament. An all-new intro movie lets you dive into the midst of the world of TEKKEN, this time with ad-hoc multiplayer mode to fight against friends as well as more items to customize your favorite characters. The beauty of TEKKEN is re-created on the handheld console, delivering one of the most realistic graphics on a handheld platform. A variety of destructible objects pump up the action on 19 stages. Play as one of over 30 characters, including classics Jin, Heihachi, Paul, Law and more. New characters Lili and Dragunov join the classic cast with all-new fight styles and moves. Collecting victories to lead your character to become king rewards you with ending movies for each character. Use your fight money to customize your characters – with more than double the items seen in TEKKEN 5. Using Wi-Fi connectivity of the PSP platform, you can battle against your friends – take your customized, original character against theirs and let the battle unfold. Mini-games provide a little breather from heart-pumping fighting action for more fun against friends. [Namco]… Expand"}, {"name": "The Stanley Parable", "details_link": "https://www.metacritic.com/game/pc/the-stanley-parable", "publisher": "Galactic Cafe", "release_date": "Oct 17 2013", "developers": ["Davey Wreden"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "General", "3D", "First-Person", "Modern"], "meta_score": 88, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/f817874769625568a41f65245a381fbf-98.jpg", "descriptions": "The Stanley Parable HD Remix is an updated version of the Half-Life 2 mod The Stanley Parable. It is a first person exploration game. You will play as Stanley, and you will not play as Stanley. You will follow a story, you will not follow a story. You will have a choice, you will have noThe Stanley Parable HD Remix is an updated version of the Half-Life 2 mod The Stanley Parable. It is a first person exploration game. You will play as Stanley, and you will not play as Stanley. You will follow a story, you will not follow a story. You will have a choice, you will have no choice. The game will end, the game will never end. [Steam]… Expand"}, {"name": "Slay the Spire", "details_link": "https://www.metacritic.com/game/playstation-4/slay-the-spire", "publisher": "Humble Bundle", "release_date": "May 21 2019", "developers": ["Mega Crit Games"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 88, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/ba921ee3e83012699ce7ee639c12677a-98.jpg", "descriptions": "Slay the Spire is an energetic fusion of card games and roguelikes. Choose your cards wisely. Craft a unique deck, encounter bizarre creatures, discover relics of immense power, and make your way up the ever-changing Spire."}, {"name": "Guacamelee! Gold Edition", "details_link": "https://www.metacritic.com/game/pc/guacamelee!-gold-edition", "publisher": "DrinkBox Studios", "release_date": "Aug  8 2013", "developers": ["DrinkBox Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D", "", "Metroidvania"], "meta_score": 88, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/cc39d0836c12e17ade9afd870654ff65-98.jpg", "descriptions": "Guacamelee! is a Metroid-vania style action-platformer set in a magical Mexican inspired world.\r The game draws its inspiration from traditional Mexican culture and folklore, and features many interesting and unique characters. Guacamelee builds upon the classic open-world Metroid-vaniaGuacamelee! is a Metroid-vania style action-platformer set in a magical Mexican inspired world.\r The game draws its inspiration from traditional Mexican culture and folklore, and features many interesting and unique characters. Guacamelee builds upon the classic open-world Metroid-vania style of games, by adding a strong melee combat component, a new dimension switching mechanic, and cooperative same-screen multiplayer for the entire story. The game also blurs the boundaries between combat and platforming by making many of the moves useful and necessary for both of these.… Expand"}, {"name": "BioShock 2", "details_link": "https://www.metacritic.com/game/playstation-3/bioshock-2", "publisher": "2K Games", "release_date": "Feb  9 2010", "developers": ["2K Marin"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 88, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/401b07c9552af06cfb45948cda4f82c4-98.jpg", "descriptions": "Set approximately 10 years after the events of the original BioShock, the halls of Rapture once again echo with sins of the past. Along the Atlantic coastline, a monster has been snatching little girls and bringing them back to the undersea city of Rapture. You are the very first Big DaddySet approximately 10 years after the events of the original BioShock, the halls of Rapture once again echo with sins of the past. Along the Atlantic coastline, a monster has been snatching little girls and bringing them back to the undersea city of Rapture. You are the very first Big Daddy as you travel through the decrepit and beautiful fallen city, chasing an unseen foe in search of answers and your own survival. Multiplayer in BioShock 2 provides a rich prequel experience that expands the BioShock gameplay. Set during the fall of Rapture, players assume the role of Plasmid test subject in the underwater city that was first explored in the original BioShock. Players will need to use all the elements of the game's toolset to survive as the full depth of the BioShock experience is refined and transformed into a unique multiplayer experience that can only be found in Rapture. [2K Games]… Expand"}, {"name": "Uncharted: Legacy of Thieves Collection", "details_link": "https://www.metacritic.com/game/pc/uncharted-legacy-of-thieves-collection", "publisher": "PlayStation Studios", "release_date": "Oct 19 2022", "developers": ["Naughty Dog", "Iron Galaxy Studios"], "platforms": ["PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 88, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/8/3e140ec2af738627011f2c32b40cbe2a-98.jpg", "descriptions": "Are You Ready To Seek Your Fortune? Seek your fortune and leave your mark on the map in the UNCHARTED: Legacy of Thieves Collection. Uncover the thrilling cinematic storytelling and the largest blockbuster action set pieces in the UNCHARTED franchise, packed with all the wit, cunning, andAre You Ready To Seek Your Fortune? Seek your fortune and leave your mark on the map in the UNCHARTED: Legacy of Thieves Collection. Uncover the thrilling cinematic storytelling and the largest blockbuster action set pieces in the UNCHARTED franchise, packed with all the wit, cunning, and over the top moments of the beloved thieves – Nathan Drake and Chloe Frazer. In an experience delivered by award winning developer Naughty Dog can, the UNCHARTED: Legacy of Thieves Collection includes the two critically-acclaimed, globe-trotting single player adventures from UNCHARTED™ 4: A Thief’s End and UNCHARTED™: The Lost Legacy. Each story is filled with laughs, drama, high octane combat, and a sense of wonder – remastered to be even more immersive. … Expand"}, {"name": "Monster Hunter Rise", "details_link": "https://www.metacritic.com/game/switch/monster-hunter-rise", "publisher": "Capcom", "release_date": "Mar 26 2021", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 88, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/5c5eb413b2412414b8efb2aad557779c-98.jpg", "descriptions": "Rise to the challenge and join the hunt. The action-RPG series returns to the Nintendo Switch! Set in the ninja-inspired land of Kamura Village, explore lush ecosystems and battle fearsome monsters to become the ultimate hunter. It's been half a century since the last calamity struck, but aRise to the challenge and join the hunt. The action-RPG series returns to the Nintendo Switch! Set in the ninja-inspired land of Kamura Village, explore lush ecosystems and battle fearsome monsters to become the ultimate hunter. It's been half a century since the last calamity struck, but a terrifying new monster has reared its head and threatens to plunge the land into chaos once again.\r Hunt solo or in a party with friends to earn rewards that you can use to craft a huge variety of weapons and armor. Brand new gameplay systems such as the high-flying 'Wire Action' and your canine companion 'Palamute' will add exciting new layers to the already robust combat that Monster Hunter is known for.\r Whether it's at home, on the go, online or offline - you'll always be ready for your next hunt on the Nintendo Switch!… Expand"}, {"name": "ESPN NHL 2K5", "details_link": "https://www.metacritic.com/game/xbox/espn-nhl-2k5", "publisher": "Sega", "release_date": "Aug 30 2004", "developers": ["Kush Games"], "platforms": "Xbox", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 88, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/6de9f8ac65af1bb708c30d27ee7a99f2-98.jpg", "descriptions": "ESPN NHL 2K5 continues the ESPN NHL series by introducing a bevy of new features. The gameplay, presentation, and graphics from last year's installment have been enhanced in the sequel. This time, you can use improved checks and defensive maneuvers to get even more physical with your hockeyESPN NHL 2K5 continues the ESPN NHL series by introducing a bevy of new features. The gameplay, presentation, and graphics from last year's installment have been enhanced in the sequel. This time, you can use improved checks and defensive maneuvers to get even more physical with your hockey players. An enhanced ESPN presentation introduces cutscenes from the locker room and includes statistic-laden overlays, crowd chants, and more. You can also take on your friends in the all-new Party mode, and you can compete in online tournaments.… Expand"}, {"name": "BioShock 2", "details_link": "https://www.metacritic.com/game/pc/bioshock-2", "publisher": "2K Games", "release_date": "Feb  9 2010", "developers": ["2K Marin"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 88, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/6ab2ab8de374c0ee816e4033cf2d83ee-98.jpg", "descriptions": "Set approximately 10 years after the events of the original BioShock, the halls of Rapture once again echo with sins of the past. Along the Atlantic coastline, a monster has been snatching little girls and bringing them back to the undersea city of Rapture. You are the very first Big DaddySet approximately 10 years after the events of the original BioShock, the halls of Rapture once again echo with sins of the past. Along the Atlantic coastline, a monster has been snatching little girls and bringing them back to the undersea city of Rapture. You are the very first Big Daddy as you travel through the decrepit and beautiful fallen city, chasing an unseen foe in search of answers and your own survival. Multiplayer in BioShock 2 provides a rich prequel experience that expands the BioShock gameplay. Set during the fall of Rapture, players assume the role of Plasmid test subject in the underwater city that was first explored in the original BioShock. Players will need to use all the elements of the game's toolset to survive as the full depth of the BioShock experience is refined and transformed into a unique multiplayer experience that can only be found in Rapture. [2K Games]… Expand"}, {"name": "Counter-Strike: Source", "details_link": "https://www.metacritic.com/game/pc/counter-strike-source", "publisher": "Valve Software", "release_date": "Oct  7 2004", "developers": ["Valve Software"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 88, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/9/0be051eb5be6fb2f1a36a26591de2e3f-98.jpg", "descriptions": "Valve has taken a large selection of the maps from Counter-Strike 1.6 - Office, Havana, Italy, Aztec, Chateau, Cobble, Piranesi and of course eternal favourites Dust and Dust 2, and recreated them for the source engine. This means all new textures and major aesthetic changes with moreValve has taken a large selection of the maps from Counter-Strike 1.6 - Office, Havana, Italy, Aztec, Chateau, Cobble, Piranesi and of course eternal favourites Dust and Dust 2, and recreated them for the source engine. This means all new textures and major aesthetic changes with more complex buildings and scenery. In addition, the levels are scattered with objects that react realistically with the Source engine's physics engine. [GamersEurope.com] The game is available through Valve's Steam downloading service and is distributed with \"Half-Life 2.\"… Expand"}, {"name": "Fire Emblem", "details_link": "https://www.metacritic.com/game/game-boy-advance/fire-emblem", "publisher": "Nintendo", "release_date": "Nov  3 2003", "developers": ["Intelligent Systems"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 88, "users_score": 9.1, "image": "https://static.metacritic.com/images/products/games/8/ffe3439eed8d03d020f71e9b9700c300-98.jpg", "descriptions": "Marshall your forces and draw your steel--Fire Emblem has arrived.  Fire Emblem combines strategy and role-playing in a story heavy on royal intrigue and backstabbing.  As a military strategist, you must choose the best method of attack whether it is swooping from the sky with your PegasusMarshall your forces and draw your steel--Fire Emblem has arrived.  Fire Emblem combines strategy and role-playing in a story heavy on royal intrigue and backstabbing.  As a military strategist, you must choose the best method of attack whether it is swooping from the sky with your Pegasus Knights or striking with a phalanx of armored juggernauts to crush the opposition.  With dozens of soldiers, weapons, and magic spells at your service, Fire Emblem equips you with everything you need to dominate the battlefield.… Expand"}, {"name": "Fire Emblem Fates: Revelation", "details_link": "https://www.metacritic.com/game/3ds/fire-emblem-fates-revelation", "publisher": "Nintendo", "release_date": "Mar 10 2016", "developers": ["Intelligent Systems"], "platforms": "3DS", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 88, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/37a7e0f1ecc9df3478500bf4ca86f4bb-98.jpg", "descriptions": "Requires full version of Fire Emblem Fates: Conquest or Fire Emblem Fates: Birthright."}, {"name": "Sid Meier's Civilization VI", "details_link": "https://www.metacritic.com/game/pc/sid-meiers-civilization-vi", "publisher": "2K Games", "release_date": "Oct 20 2016", "developers": ["Firaxis Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 88, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/fd75cc6885671757a42059e68c851ed6-98.jpg", "descriptions": "Civilization VI offers new ways to interact with your world, expand your empire across the map, advance your culture, and compete against history’s greatest leaders to build a civilization that will stand the test of time."}, {"name": "Battlefield 1", "details_link": "https://www.metacritic.com/game/pc/battlefield-1", "publisher": "EA Games", "release_date": "Oct 21 2016", "developers": ["EA DICE"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["General", "Action", "Shooter", "First-Person", "Tactical"], "meta_score": 88, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/640d0efa4eef93171ffaf0aab6813c2c-98.jpg", "descriptions": "Intuitive destruction and dynamic weather ensure that no battle is ever the same. For even more gameplay possibilities, carve a path through walls and buildings, take down your enemies in creative ways, and leave your mark on the terrain around you through intuitive destruction. Through yourIntuitive destruction and dynamic weather ensure that no battle is ever the same. For even more gameplay possibilities, carve a path through walls and buildings, take down your enemies in creative ways, and leave your mark on the terrain around you through intuitive destruction. Through your actions, the pristine world around you change into a battle-scarred landscape, changing the world forever. With dynamic weather you will need to adapt your tactics to weather changes as the elements play a part in the battle. Playing the same map on a bright day, in heavy fog, or rain will impact what you see and hear, forcing you to adapt your play style on an ever-changing battlefield. Operations introduces a new way to play multiplayer. In Battlefield 1 you play a series of interconnected battles across multiple fronts. Play a sequence of battles where your actions have consequences beyond a single match, as you try to conquer territory or push back your attackers. At those times when you feel all is lost, call in the Behemoths - the largest fully player-controlled vehicles ever seen in Battlefield. Roam the battlefield and rain fire on your enemy to break their defenses. All-out war never felt so epic. Take control of the Armored Train, Air Ship, or the Battleship to dominate the battlefield across land, air, and sea. [Electronic Arts]… Expand"}, {"name": "Starcraft II: Legacy of the Void", "details_link": "https://www.metacritic.com/game/pc/starcraft-ii-legacy-of-the-void", "publisher": "Blizzard Entertainment", "release_date": "Nov 10 2015", "developers": ["Blizzard Entertainment"], "platforms": "PC", "genres": ["Sci-Fi", "Sci-Fi", "Strategy", "Real-Time", "General", "Command"], "meta_score": 88, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/6a7c216796de3103b9e230b5c8247c84-98.jpg", "descriptions": "StarCraft II continues the epic saga of the Protoss, Terran, and Zerg. These three distinct and powerful races clash once again in the fast-paced real-time strategy sequel to the legendary original, StarCraft. Legions of veteran, upgraded, and brand-new unit types do battle across theStarCraft II continues the epic saga of the Protoss, Terran, and Zerg. These three distinct and powerful races clash once again in the fast-paced real-time strategy sequel to the legendary original, StarCraft. Legions of veteran, upgraded, and brand-new unit types do battle across the galaxy, as each faction struggles for survival. Featuring a unique single-player campaign that picks up where StarCraft: Brood War left off, StarCraft II presents a cast of new heroes and familiar faces in an edgy sci-fi story filled with adventure and intrigue. In addition, Blizzard again offers unparalleled online play through Battle.net, the company's world-renowned gaming service, with several enhancements and new features to make StarCraft II the ultimate competitive real-time strategy game. Features fast-paced, hard-hitting, tightly balanced competitive real-time strategy gameplay that recaptures and improves on the magic of the original game. New units and gameplay mechanics further distinguish each race. Vibrant new 3D-graphics engine with support for dazzling visual effects and massive unit and army sizes. Full map-making and scripting tools to give players incredible freedom in customizing and personalizing their gameplay experience. [Blizzard]… Expand"}, {"name": "Pentiment", "details_link": "https://www.metacritic.com/game/pc/pentiment", "publisher": "Xbox Game Studios", "release_date": "Nov 14 2022", "developers": ["Obsidian Entertainment"], "platforms": ["Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 88, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/0960d85d78a15017abb14a2cc09c61ef-98.jpg", "descriptions": "Step into a living illustrated world inspired by illuminated manuscripts and printed woodcuts in a time when Europe is at a crossroads of great religious and political change. Walk in the footsteps of Andreas Maler, a master artist who finds himself in the middle of murders, scandals, andStep into a living illustrated world inspired by illuminated manuscripts and printed woodcuts in a time when Europe is at a crossroads of great religious and political change. Walk in the footsteps of Andreas Maler, a master artist who finds himself in the middle of murders, scandals, and intrigue in the Bavarian Alps. Choose your backgrounds, impact a changing world, and see the consequences of your decisions in this narrative adventure.… Expand"}, {"name": "Diablo III", "details_link": "https://www.metacritic.com/game/pc/diablo-iii", "publisher": "Blizzard Entertainment", "release_date": "May 15 2012", "developers": ["Blizzard Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 88, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/2/ee7a9ea1f4ec1470f5d97d2f418ab7f8-98.jpg", "descriptions": "Diablo III picks up the story twenty years after the events of Diablo II. Mephisto, Diablo, and Baal have been defeated, but the Worldstone, which once shielded the inhabitants of the world of Sanctuary from the forces of both the High Heavens and the Burning Hells, has been destroyed, andDiablo III picks up the story twenty years after the events of Diablo II. Mephisto, Diablo, and Baal have been defeated, but the Worldstone, which once shielded the inhabitants of the world of Sanctuary from the forces of both the High Heavens and the Burning Hells, has been destroyed, and evil once again stirs in Tristram. Playing as a hero from one of five distinct character classes, players acquire powerful items, spells, and abilities as they explore new and familiar areas of Sanctuary and battle hordes of demons to safeguard the world from the horrors that have arisen. Diablo III features a custom 3D-graphics engine to render lush indoor and outdoor areas of Sanctuary with a high level of detail and vivid special effects. The game's physics-enhanced environments are interactive and destructible, offering traps and obstacles that create added danger for players and monsters alike. These elements, along with a new quest system and random scripted events, have been integrated into the game’s random-level generator, giving Diablo III the ultimate combination of dynamic gameplay and replayability. Cooperative and competitive play are available online through an upgraded version of Blizzard Entertainment’s renowned online gaming service, Battle.net. [Blizzard Entertainment]… Expand"}, {"name": "F1 2020", "details_link": "https://www.metacritic.com/game/pc/f1-2020", "publisher": "Codemasters", "release_date": "Jul  9 2020", "developers": ["Codemasters"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 88, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/59d09549297ae575f9672f5b3f478f00-98.jpg", "descriptions": "For the first time, players can create their own F1® team by creating a driver, then choosing a sponsor, an engine supplier, hiring a teammate and competing as the 11th team on the grid. Build facilities, develop the team over time and drive to the top. Customise your 10-year career mode,For the first time, players can create their own F1® team by creating a driver, then choosing a sponsor, an engine supplier, hiring a teammate and competing as the 11th team on the grid. Build facilities, develop the team over time and drive to the top. Customise your 10-year career mode, with a choice of F2™ Championship introduction options and season lengths to allow for a more exciting, multiple season, career. The addition of split-screen racing, a new steering assist and a more accessible race experience means that you can enjoy the game with friends, no matter what your skill level. F1® 2020 features all the official teams, drivers and 22 circuits, including two new races: Hanoi Circuit and Circuit Zandvoort. Online connection required to download the final teams’ 2020 cars (as applicable) and F2™ 2020 season content.… Expand"}, {"name": "Downwell", "details_link": "https://www.metacritic.com/game/switch/downwell", "publisher": "Devolver Digital", "release_date": "Jan 31 2019", "developers": ["Moppin"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 88, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/7d3d32a57d8c28ef5bdcffcba9c34a97-98.jpg", "descriptions": "Downwell is a curious game about a young person venturing down a well in search of untold treasures with only his Gunboots for protection. Make your way further and further down into the darkness filled with nasty creatures and mysterious secrets to collect the spectacular red gems scatteredDownwell is a curious game about a young person venturing down a well in search of untold treasures with only his Gunboots for protection. Make your way further and further down into the darkness filled with nasty creatures and mysterious secrets to collect the spectacular red gems scattered about the rocks. Step into precariously placed shops and buy some helpful items or level up between levels to battle well-dwelling monsters and uncover hidden caves filled with riches and relics. No two trips down the well are ever the same.… Expand"}, {"name": "Owlboy", "details_link": "https://www.metacritic.com/game/playstation-4/owlboy", "publisher": "Soedesco", "release_date": "Apr 10 2018", "developers": ["BlitWorks"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 88, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/c96975f91f3a34ae3358c800598a9b22-98.jpg", "descriptions": "Owlboy is a vertical platform adventure set in the sky, where the islands of the world have been spread apart after a great calamity. You play as Otus, among the last of the Owls, a renowned race that has produced many of the world's great wonders"}, {"name": "Monster Hunter: World", "details_link": "https://www.metacritic.com/game/pc/monster-hunter-world", "publisher": "Capcom", "release_date": "Aug  9 2018", "developers": ["Capcom"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 88, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/27d469acae256afad2d87206cb41d460-98.jpg", "descriptions": "In Monster Hunter: World you assume the role of a hunter venturing to a new continent where you track down and slay ferocious beasts in heart-pounding battles. This new land and its diverse inhabitants play a critical role in each quest as you strategically use the surrounding environmentIn Monster Hunter: World you assume the role of a hunter venturing to a new continent where you track down and slay ferocious beasts in heart-pounding battles. This new land and its diverse inhabitants play a critical role in each quest as you strategically use the surrounding environment including terrain, vegetation and wildlife to your advantage in battle or become hindered by the hazards they present. As a hunter, you must use your cunning and expertise to track and maneuver your targets throughout the intense, evolving battles. [Capcom]… Expand"}, {"name": "Fight Night Round 4", "details_link": "https://www.metacritic.com/game/playstation-3/fight-night-round-4", "publisher": "EA Sports", "release_date": "Jun 23 2009", "developers": ["EA Canada"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 88, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/73132b436186172037d7538ef29d80f4-98.jpg", "descriptions": "Featuring a re-written gameplay engine, EA Sports Fight Night Round 4 adds a variety of fighting styles and boxer differentiation to authentically emulate the greatest fighters of all time. Pressure your opponent with the brawling inside style of young Mike Tyson, bobbing and weaving to setFeaturing a re-written gameplay engine, EA Sports Fight Night Round 4 adds a variety of fighting styles and boxer differentiation to authentically emulate the greatest fighters of all time. Pressure your opponent with the brawling inside style of young Mike Tyson, bobbing and weaving to set up powerful hooks and uppercuts. Capitalize on Muhammad Ali's reach, hand speed and fleetness of foot to bewilder your opponent with lightning fast jabs and straights from the outside. For the first time, EA Sports Fight Night Round 4 gives you the opportunity to pit these legendary heavyweights against one another and name a true champ. No fight will be the same with an all-new physics-based animation system that recreates the full spectrum of true-to-life punch impacts, giving boxers a devastating arsenal of punches, blocks and ring movement. The new physics system allows for missed punches, glancing punches, knockout blows and for the first time ever, rough and tumble inside fighting. Fatigue, adrenaline, footwork and timing all come into play as you hammer away at your opponents. [Electronic Arts]… Expand"}, {"name": "Diablo III: Eternal Collection", "details_link": "https://www.metacritic.com/game/switch/diablo-iii-eternal-collection", "publisher": "Blizzard Entertainment", "release_date": "Nov  2 2018", "developers": ["Blizzard Entertainment", "Iron Galaxy Studios"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 88, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/55055962d900a7b763ea9f7f85fc23c9-98.jpg", "descriptions": "Generations of gamers have battled the demonic hordes of Diablo, and now it's your turn to take part in the action-RPG legacy. This Eternal Collection features Diablo III, the Reaper of Souls expansion set and the Rise of the Necromancer packall together in one definitive volume. PrepareGenerations of gamers have battled the demonic hordes of Diablo, and now it's your turn to take part in the action-RPG legacy. This Eternal Collection features Diablo III, the Reaper of Souls expansion set and the Rise of the Necromancer packall together in one definitive volume. Prepare yourself, mortal hero. The hellgates are opening.… Expand"}, {"name": "Oddworld: Stranger's Wrath", "details_link": "https://www.metacritic.com/game/xbox/oddworld-strangers-wrath", "publisher": "EA Games", "release_date": "Jan 25 2005", "developers": ["Oddworld Inhabitants"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 88, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/807a84c1a9d32cfc8cbba7a53f047c26-98.jpg", "descriptions": "In Oddworld Stranger's Wrath, the new chapter the Oddworld series, you'll step into the role of the Stranger--a mysterious bounty hunter who tracks down outlaws for money. Equipped a variety of strange weapons that use small creatures as bullets, you'll explore expansive environments rangingIn Oddworld Stranger's Wrath, the new chapter the Oddworld series, you'll step into the role of the Stranger--a mysterious bounty hunter who tracks down outlaws for money. Equipped a variety of strange weapons that use small creatures as bullets, you'll explore expansive environments ranging from Old West towns and thick forests to industrial complexes. The game combines first- and third-person action gameplay with familiar Oddworld elements.… Expand"}, {"name": "Rise of Nations: Thrones & Patriots", "details_link": "https://www.metacritic.com/game/pc/rise-of-nations-thrones-patriots", "publisher": "Microsoft Game Studios", "release_date": "Apr 27 2004", "developers": ["Big Huge Games"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 88, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/f3d958dfe2376c71dc6cda34ecc1f194-98.jpg", "descriptions": "Developed by Brian Reynolds and Big Huge Games, Throne and Patriots, the expansion pack to the critically acclaimed, best-selling real-time strategy (RTS) game Rise of Nations, adds a multitude of new features to Rise of Nations including; six new nations, a wide variety of new single playerDeveloped by Brian Reynolds and Big Huge Games, Throne and Patriots, the expansion pack to the critically acclaimed, best-selling real-time strategy (RTS) game Rise of Nations, adds a multitude of new features to Rise of Nations including; six new nations, a wide variety of new single player campaigns, more than 20 new units, new wonders and an innovative new Government feature. With the new Government feature, any nation, old or new, can choose exactly how to be governed, which has far-reaching effects on how units perform in various situations. All-new single player campaigns will allow gamers to control the course of history during historical events that changed the world. [Microsoft]… Expand"}, {"name": "Sid Meier's Pirates!", "details_link": "https://www.metacritic.com/game/pc/sid-meiers-pirates!", "publisher": "Atari", "release_date": "Nov 22 2004", "developers": ["Firaxis Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "General"], "meta_score": 88, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/b19c2a2fa41d2df51abf741664f9ef08-98.jpg", "descriptions": "An entirely new game engine delivers updated gameplay, stunning new features, spectacular 3D graphics and enhanced surround sound, so players can fully experience the intrigue, adventure and danger of life as a pirate on the Spanish Main. In Pirates! you take the leading role of a PirateAn entirely new game engine delivers updated gameplay, stunning new features, spectacular 3D graphics and enhanced surround sound, so players can fully experience the intrigue, adventure and danger of life as a pirate on the Spanish Main. In Pirates! you take the leading role of a Pirate Captain in the 17th century Caribbean amassing fortune and fame in an attempt to seize your rightful place as one of the most revered (and feared!) pirates in history.  Test your skills as a sea captain exploring the high seas and exotic ports in a richly detailed 3D world. Overtake the enemy and seize valuable booty. Exchange plank-shattering broadsides in fierce naval battles, and engage in duels with worthy opposing captains. As your reputation and skills grow, so will the size and quality of your crew, and your ability to take on larger enemy ships, raid and plunder heavily fortified ports, and locate ancient treasure. There?s a whole cast of interesting and dangerous characters to meet, mysteries to solve, exotic island destinations to discover, and powerful alliances to forge! [Firaxis]… Expand"}, {"name": "Final Fantasy VI Pixel Remaster", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-vi-pixel-remaster", "publisher": "Square Enix", "release_date": "Feb 23 2022", "developers": ["Square Enix", "TOSE"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 88, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/8b0c2fda6a2316997a55e374eb1f9459-98.jpg", "descriptions": "FINAL FANTASY VI is a game that's beloved by fans and critics alike. That's partly thanks to its incredible setting and story. It's set in a land where magic has disappeared, and humanity has instead turned to iron, gunpowder, steam and other technology. Actually, it would be more accurateFINAL FANTASY VI is a game that's beloved by fans and critics alike. That's partly thanks to its incredible setting and story. It's set in a land where magic has disappeared, and humanity has instead turned to iron, gunpowder, steam and other technology. Actually, it would be more accurate to say that magic is mostly gone - a young woman enslaved by the evil Empire still has the power. When she encounters a powerful ancient being called an Esper, she sets off a chain of events that will have epic and terrible consequences.… Expand"}, {"name": "Battlefield: Bad Company 2 Vietnam", "details_link": "https://www.metacritic.com/game/playstation-3/battlefield-bad-company-2-vietnam", "publisher": "EA Games", "release_date": "Dec 21 2010", "developers": ["EA DICE"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 88, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/a3f21b0d8737320d352b8911f2ce7e3c-98.jpg", "descriptions": "Set in the 1960s, this DLC adds 4 new multiplayer maps, 15 new weapons, and six vehicles."}, {"name": "EVE Online: Special Edition", "details_link": "https://www.metacritic.com/game/pc/eve-online-special-edition", "publisher": "Atari", "release_date": "Mar 10 2009", "developers": ["CCP"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Miscellaneous", "Massively Multiplayer Online", "Compilation", "Sci-Fi"], "meta_score": 88, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/10cc8492cdde86833b758e34e08989a2-98.jpg", "descriptions": "The EVE Online: Apocrypha expansion coincides with the release of EVE Online as a boxed product through a partnership with Atari. The fabric of space itself is transformed as vast, unpredictable wormholes open to connect previously unexplored regions of the universe to the stars of New Eden.The EVE Online: Apocrypha expansion coincides with the release of EVE Online as a boxed product through a partnership with Atari. The fabric of space itself is transformed as vast, unpredictable wormholes open to connect previously unexplored regions of the universe to the stars of New Eden. The seeds of advanced new technology await inside of these cosmic anomalies for those brave enough to explore them. This infusion of technology enables production of the most dynamic vessels ever – Tech 3 modular ships with an astounding amount of customizability that can fill any role from skirmish muscle to industrial support. Furthermore, NPC agents in EVE Online: Apocrypha are authorized to assign Epic Mission Arcs to the pilots of New Eden. These branching, far-reaching mission strings are full of meaningful stories and more intelligent and deadly adversaries.… Expand"}, {"name": "SteamWorld Dig 2", "details_link": "https://www.metacritic.com/game/switch/steamworld-dig-2", "publisher": "Image & Form", "release_date": "Sep 21 2017", "developers": ["Image & Form"], "platforms": ["3DS", "PC", "PlayStation 4", "PlayStation Vita", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "2D", ""], "meta_score": 88, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/e523dd194bc3c7a9b97e4ab240b144d5-98.jpg", "descriptions": "Grab your pickaxe and dig into the sequel to SteamWorld Dig. A platform mining adventure forged in Metroidvania flames. In search of her lost friend, a lone steambot and her unlikely companion must dig deep, gain riches and explore an underworld riddled with danger. But time is runningGrab your pickaxe and dig into the sequel to SteamWorld Dig. A platform mining adventure forged in Metroidvania flames. In search of her lost friend, a lone steambot and her unlikely companion must dig deep, gain riches and explore an underworld riddled with danger. But time is running short... [Nintendo]… Expand"}, {"name": "Call of Duty: Modern Warfare 3", "details_link": "https://www.metacritic.com/game/playstation-3/call-of-duty-modern-warfare-3", "publisher": "Activision", "release_date": "Nov  8 2011", "developers": ["Infinity Ward", "Sledgehammer Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 88, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/2/f467a2d56053b4d06b0ef679e33e2e2e-98.jpg", "descriptions": "Call of Duty: Modern Warfare 3 is a direct sequel to the previous game in the series, Call of Duty: Modern Warfare 2, with a campaign storyline continuing the struggle of U.S. forces against an invasion by the Russian Federation following the framing of an undercover U.S. agent in aCall of Duty: Modern Warfare 3 is a direct sequel to the previous game in the series, Call of Duty: Modern Warfare 2, with a campaign storyline continuing the struggle of U.S. forces against an invasion by the Russian Federation following the framing of an undercover U.S. agent in a terrorist attack on Moscow. Together with classic Call of Duty multi-character control, Modern Warfare 3 contains deep multiplayer support, including two-player Co-op Survival mode. The game also contains all-new Kill Streak categories and customizable strike packages that offer more options for player combat styles and strategies. … Expand"}, {"name": "FIFA Soccer 11", "details_link": "https://www.metacritic.com/game/xbox-360/fifa-soccer-11", "publisher": "Electronic Arts", "release_date": "Sep 28 2010", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 22 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 88, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/294e1af47bd0bfb36fd8e8a413a9b60f-98.jpg", "descriptions": "EA returns to the field with another installment in its long-running soccer series."}, {"name": "Apex Legends", "details_link": "https://www.metacritic.com/game/xbox-one/apex-legends", "publisher": "Electronic Arts", "release_date": "Feb  4 2019", "developers": ["Respawn Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 88, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/68650e329d74f0d2074148ccc07b1163-98.jpg", "descriptions": "Conquer with character in Apex Legends, a free-to-play Battle Royale shooter where legendary characters with powerful abilities team up to battle for fame and fortune on the fringes of the Frontier. Master an ever-growing roster of diverse legends, deep tactical squad play, and bold newConquer with character in Apex Legends, a free-to-play Battle Royale shooter where legendary characters with powerful abilities team up to battle for fame and fortune on the fringes of the Frontier. Master an ever-growing roster of diverse legends, deep tactical squad play, and bold new innovations that level-up the Battle Royale experience—all within a rugged world where anything goes. Welcome to the next evolution of Battle Royale.… Expand"}, {"name": "Wolfenstein II: The New Colossus", "details_link": "https://www.metacritic.com/game/xbox-one/wolfenstein-ii-the-new-colossus", "publisher": "Bethesda Softworks", "release_date": "Oct 27 2017", "developers": ["MachineGames"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 88, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/18964bda038a02f7b758781fcfee2326-98.jpg", "descriptions": "Wolfenstein II: The New Colossus is the highly anticipated sequel to the critically acclaimed, Wolfenstein: The New Order developed by the award-winning studio MachineGames. An exhilarating adventure brought to life by the industry-leading id Tech 6, Wolfenstein II sends players toWolfenstein II: The New Colossus is the highly anticipated sequel to the critically acclaimed, Wolfenstein: The New Order developed by the award-winning studio MachineGames. An exhilarating adventure brought to life by the industry-leading id Tech 6, Wolfenstein II sends players to Nazi-controlled America on a mission to recruit the boldest resistance leaders left. Fight the Nazis in iconic American locations, equip an arsenal of badass guns, and unleash new abilities to blast your way through legions of Nazi soldiers in this definitive first-person shooter. America, 1961. The Nazis maintain their stranglehold on the world. You are BJ Blazkowicz, aka Terror-Billy, member of the Resistance, scourge of the Nazi empire, and humanitys last hope for liberty. Only you have the guts, guns, and gumption to return stateside, kill every Nazi in sight, and spark the second American Revolution.… Expand"}, {"name": "LittleBigPlanet PS Vita", "details_link": "https://www.metacritic.com/game/playstation-vita/littlebigplanet-ps-vita", "publisher": "SCEA", "release_date": "Sep 18 2012", "developers": ["Tarsier Studios", "Double Eleven"], "platforms": "PlayStation Vita", "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 88, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/2731ede90ec48bdbafce75c3f42ae7e4-98.jpg", "descriptions": "LittleBigPlanet lets you play, create, and share on the PlayStation Vita. The PS Vita's front and back touch controls let you play freely. Fully customize Sackboy and his world with the specialized CREATE tools, and discover endless levels SHARED by fans online. Includes all features fromLittleBigPlanet lets you play, create, and share on the PlayStation Vita. The PS Vita's front and back touch controls let you play freely. Fully customize Sackboy and his world with the specialized CREATE tools, and discover endless levels SHARED by fans online. Includes all features from the first and second games together with new PS VIta exclusive elements.… Expand"}, {"name": "Armadillo Run", "details_link": "https://www.metacritic.com/game/pc/armadillo-run", "publisher": "Peter Stock", "release_date": "Apr 22 2006", "developers": ["Peter Stock"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "General"], "meta_score": 88, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/96abffa2c8554400cf5492fdb3293da5-98.jpg", "descriptions": "Armadillo Run is a physics-based puzzle game. You have to build structures with the purpose of getting an armadillo to a certain point in space. There is a selection of building materials, each with different properties, which can be combined to form almost anything. The realistic physicsArmadillo Run is a physics-based puzzle game. You have to build structures with the purpose of getting an armadillo to a certain point in space. There is a selection of building materials, each with different properties, which can be combined to form almost anything. The realistic physics simulation gives you the freedom to solve each level in many different ways.… Expand"}, {"name": "FIFA Soccer 13", "details_link": "https://www.metacritic.com/game/playstation-3/fifa-soccer-13", "publisher": "EA Sports", "release_date": "Sep 25 2012", "developers": ["Electronic Arts"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 2", "PlayStation Vita", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "Up to 22 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 88, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/c4dcc2e455deb533d92784a7d71f2c18-98.jpg", "descriptions": "Inspired by Lionel Messi, experience the freedom and control to be more creative in attack. Face an opponent to threaten attack while moving with the ball in any direction utilizing precise dribble touches to dodge tackles, or turn and shield the ball, holding off defenders for longerInspired by Lionel Messi, experience the freedom and control to be more creative in attack. Face an opponent to threaten attack while moving with the ball in any direction utilizing precise dribble touches to dodge tackles, or turn and shield the ball, holding off defenders for longer stretches. With Complete Dribbling it’s easier to be more dangerous in 1v1 opportunities.… Expand"}, {"name": "Ikaruga", "details_link": "https://www.metacritic.com/game/switch/ikaruga", "publisher": "Nicalis", "release_date": "May 29 2018", "developers": ["Treasure", "Zereo"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 88, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/37cccee2d512feb81d85f47f79c22339-98.jpg", "descriptions": "A rebel pilot named Shinra must battle an enemy nation using a specially-designed fighter called the Ikaruga, which can switch between two energy polarities (black or white) at the touch of a button. Bullets that are the same color as Shinra's ship can be absorbed, while the opposite colorA rebel pilot named Shinra must battle an enemy nation using a specially-designed fighter called the Ikaruga, which can switch between two energy polarities (black or white) at the touch of a button. Bullets that are the same color as Shinra's ship can be absorbed, while the opposite color will do damage - this polarity-switching mechanic is the game's core feature and the foundation for its stage and enemy design. It's now up to Shinra makes his final stand, as the Ikaruga might be the rebel federation's last chance to defeat the oppressive Horai regime.… Expand"}, {"name": "World of Warcraft: Legion", "details_link": "https://www.metacritic.com/game/pc/world-of-warcraft-legion", "publisher": "Blizzard Entertainment", "release_date": "Aug 30 2016", "developers": ["Blizzard Entertainment"], "platforms": "PC", "genres": ["Role-Playing", "Miscellaneous", "Massively Multiplayer", "Board / Card Game"], "meta_score": 88, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/2bd15301d62e75b854b5592a45db18e1-98.jpg", "descriptions": "The Tomb of Sargeras has been reopened, and the demons of the Burning Legion pour into our world. Their full, terrifying might is fixed on summoning the Dark Titan to Azeroth—and they’ve already located the key to his return. With the Alliance and Horde devastated, only you can take upThe Tomb of Sargeras has been reopened, and the demons of the Burning Legion pour into our world. Their full, terrifying might is fixed on summoning the Dark Titan to Azeroth—and they’ve already located the key to his return. With the Alliance and Horde devastated, only you can take up Warcraft’s most legendary artifacts, scour the ancient Broken Isles for relics of the Titans, and challenge the Legion before Azeroth’s last hope dies. Steel yourself, champion. Extinction is imminent.… Expand"}, {"name": "Pillars of Eternity II: Deadfire", "details_link": "https://www.metacritic.com/game/pc/pillars-of-eternity-ii-deadfire", "publisher": "Obsidian Entertainment", "release_date": "May  8 2018", "developers": ["Obsidian Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 88, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/101e05a716cfe7479e3419f23b838c38-98.jpg", "descriptions": "Pursue a rogue god over land and sea in the sequel to the multi-award-winning RPG Pillars of eternity. Captain your ship on a dangerous voyage of discovery across the vast unexplored archipelago region of the dead Fire. Bend the world to your will, as you explore the depths of InfinitePursue a rogue god over land and sea in the sequel to the multi-award-winning RPG Pillars of eternity. Captain your ship on a dangerous voyage of discovery across the vast unexplored archipelago region of the dead Fire. Bend the world to your will, as you explore the depths of Infinite possibilities, including detailed character customization, total freedom of exploration, and more meaningful choices at every turn. … Expand"}, {"name": "DOOM Eternal", "details_link": "https://www.metacritic.com/game/pc/doom-eternal", "publisher": "Bethesda Softworks", "release_date": "Mar 20 2020", "developers": ["id Software"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 88, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/69971550f3485629bc00981fd50465ca-98.jpg", "descriptions": "DOOM Eternal is the direct sequel to 2016's DOOM. Developed by id Software, DOOM Eternal delivers the ultimate combination of speed and power, along with the next leap in push-forward, first-person combat. As the DOOM Slayer, you’ll return to take your vengeance against the forces of Hell.DOOM Eternal is the direct sequel to 2016's DOOM. Developed by id Software, DOOM Eternal delivers the ultimate combination of speed and power, along with the next leap in push-forward, first-person combat. As the DOOM Slayer, you’ll return to take your vengeance against the forces of Hell. Set to an all-new pulse-pounding soundtrack composed by Mick Gordon, you fight across dimensions as you slay new and classic demons with powerful new weapons and abilities. [Bethesda]… Expand"}, {"name": "Art of Balance", "details_link": "https://www.metacritic.com/game/wii/art-of-balance", "publisher": "Shin'en", "release_date": "Feb 15 2010", "developers": ["Shin'en"], "platforms": ["3DS", "PlayStation 4", "Switch", "Wii U", "Wii"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 88, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/cceff0ad906cc5cda0bd5ff21c342ba8-98.jpg", "descriptions": "[WiiWare]  Grab your Wii Remote controller and build a balanced stack in this physics-based puzzler, featuring 100 levels that challenge not only your skills but also your imagination. The game is easy to pick up and hard to put away. Play alone or invite a friend to grab a second Wii Remote[WiiWare]  Grab your Wii Remote controller and build a balanced stack in this physics-based puzzler, featuring 100 levels that challenge not only your skills but also your imagination. The game is easy to pick up and hard to put away. Play alone or invite a friend to grab a second Wii Remote controller and drop in at any point for co-op play. There's even a dedicated two-player split-screen \"versus\" mode for extra fun. [Nintendo]… Expand"}, {"name": "MVP Baseball 2005", "details_link": "https://www.metacritic.com/game/gamecube/mvp-baseball-2005", "publisher": "EA Sports", "release_date": "Feb 22 2005", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 88, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/df54944a054927346daa9d498922f352-98.jpg", "descriptions": "MVP Baseball 2005 offers more features that let you take control of your favorite major league baseball team both on and off the field. The game highlights its new Hitter's Eye controls, which give you more control of your swing, movement in the batter's box, and the ability to read theMVP Baseball 2005 offers more features that let you take control of your favorite major league baseball team both on and off the field. The game highlights its new Hitter's Eye controls, which give you more control of your swing, movement in the batter's box, and the ability to read the pitch. In addition to enhanced offensive tools, this year's installment in the MVP Baseball series includes an improved dynasty mode, a spring training mode, and an all-new owner mode. Play through a challenging single-player season to unlock legendary players and new gear, or challenge your friend to an online game.… Expand"}, {"name": "Keep Talking and Nobody Explodes", "details_link": "https://www.metacritic.com/game/playstation-4/keep-talking-and-nobody-explodes", "publisher": "Steel Crate Games", "release_date": "Oct 13 2016", "developers": ["Steel Crate Games"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 88, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/7a03c378e598d2b6cbe01b7e007f0a4f-98.jpg", "descriptions": "One player is trapped in a virtual room with a ticking time bomb they must defuse. The other players are the “Experts” who must give the instructions to defuse the bomb by deciphering the information found in the bomb defusal manual. But there’s a catch: the experts can’t see the bomb, soOne player is trapped in a virtual room with a ticking time bomb they must defuse. The other players are the “Experts” who must give the instructions to defuse the bomb by deciphering the information found in the bomb defusal manual. But there’s a catch: the experts can’t see the bomb, so everyone will need to talk it out – fast.… Expand"}, {"name": "Joe Danger: Special Edition", "details_link": "https://www.metacritic.com/game/xbox-360/joe-danger-special-edition", "publisher": "Microsoft Game Studios", "release_date": "Dec 14 2011", "developers": ["Hello Games"], "platforms": "Xbox 360", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 88, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/7ebf8ef8f1875aed9a966b5be6f7c0d8-98.jpg", "descriptions": "You are Joe Danger, the world's most determined motorbike stuntman. You live to thrill the crowd and break World Records. A call back to retro classics like Excitebike, this 3D side-scrolling stunt-em-up is a burst of sugar-rush fun for today's jaded gamers"}, {"name": "Cave Story +", "details_link": "https://www.metacritic.com/game/switch/cave-story-+", "publisher": "Nicalis", "release_date": "Jun 20 2017", "developers": ["Nicalis"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 88, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/7d7e067d8806cff5c9d10c1938fd725f-98.jpg", "descriptions": "Cave Story takes you into a rare world where a curious race of innocent, rabbit-like creatures called Mimiga run free. You wake up in a dark cave with no memory of who you are, where you came from or why you're in such a place. Uncovering Mimiga Village, you discover that the once-carefreeCave Story takes you into a rare world where a curious race of innocent, rabbit-like creatures called Mimiga run free. You wake up in a dark cave with no memory of who you are, where you came from or why you're in such a place. Uncovering Mimiga Village, you discover that the once-carefree Mimiga are in danger at the hands of a maniacal scientist. Their only hope rests squarely on the shoulders of a quiet, amnesiac boy who can't remember his own name. Take control, learn the origins of this world's power, stop the delusional villain and save the Mimiga.… Expand"}, {"name": "Crimson Skies: High Road to Revenge", "details_link": "https://www.metacritic.com/game/xbox/crimson-skies-high-road-to-revenge", "publisher": "Microsoft Game Studios", "release_date": "Oct 21 2003", "developers": ["FASA Studio"], "platforms": "Xbox", "num_players": "1-16 ", "genres": ["Simulation", "Flight", "WWII"], "meta_score": 88, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/8/283d187be12cd77b0175c36df746acda-98.jpg", "descriptions": "Crimson Skies: High Road to Revenge combines thrilling aerial combat with the swashbuckling style of a Hollywood action-adventure movie.  Set in an alternate 1930s world of gunship diplomacy and sinister intrigue, the game lets you pilot powerful aircraft--armed with detonator cannons, teslaCrimson Skies: High Road to Revenge combines thrilling aerial combat with the swashbuckling style of a Hollywood action-adventure movie.  Set in an alternate 1930s world of gunship diplomacy and sinister intrigue, the game lets you pilot powerful aircraft--armed with detonator cannons, tesla guns, or remote-controlled rockets--against nefarious air pirates and behemoth war zeppelins.  As the daring air pirate Nathan Zachary, leader of the infamous Fortune Hunters, you take off on a high-flying adventure, filled with daring escapes and damsels in distress.… Expand"}, {"name": "NASCAR Thunder 2004", "details_link": "https://www.metacritic.com/game/playstation-2/nascar-thunder-2004", "publisher": "Electronic Arts", "release_date": "Sep 16 2003", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 88, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/e467bd0d50d7a2d376e8dd3f3d3a1661-98.jpg", "descriptions": "From 200 MPH super-speedways to hairpin turns on 11 fantasy tracks, tuning your car and finding the line is no longer enough. Now you?re running to the edge against 42 other unique NASCAR® personalities every race, drivers who remember your every move and won?t think twice about paying youFrom 200 MPH super-speedways to hairpin turns on 11 fantasy tracks, tuning your car and finding the line is no longer enough. Now you?re running to the edge against 42 other unique NASCAR® personalities every race, drivers who remember your every move and won?t think twice about paying you back. Out-smart and out-drive them as you battle three-wide from green to checkers. Online or on your own, racing just became a contact sport. Grudges & Alliances: Emotion comes to a racing game for the first time as CPU drivers remember your every move and aren't afraid to pay you back. Pick up & Play controls help new fans navigate over 60 events including all real world NASCAR races, plus 12 winding road courses. NASCAR Thunder 2004 goes online with peer-to-peer racing on the PlayStation®2 and 16 player races on PC. The most extensive Career Mode in a NASCAR video game just got deeper and easier to navigate! The deepest NASCAR game ever created with over 70 drivers and 175 authentic cars and the first game with a full pack of 43 Cup Series cars. [Electronic Arts]… Expand"}, {"name": "Burnout 2: Point of Impact", "details_link": "https://www.metacritic.com/game/xbox/burnout-2-point-of-impact", "publisher": "Acclaim", "release_date": "May  1 2003", "developers": ["Criterion Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 88, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/60f77200786a86db638649629ef66fe8-98.jpg", "descriptions": "Burnout 2: Point of Impact is the follow-up to the original smash hit with improved graphics, faster gameplay, and bigger, more spectacular crashes.  While the first Burnout was inspired by European movies and locations, its sequel is inspired by American films such as The Fast and theBurnout 2: Point of Impact is the follow-up to the original smash hit with improved graphics, faster gameplay, and bigger, more spectacular crashes.  While the first Burnout was inspired by European movies and locations, its sequel is inspired by American films such as The Fast and the Furious.  Set in US locations, the game gives you an all-new set of vehicles: modified Japanese cars, pickups, SUVs - plus some bonus rides such as police cruisers, and classic 50's hotrods.  Also, expect tighter handling, better crash deformations, new music, new game structure, enhanced physics, new lighting, improved car models, a new replay system, and fast-paced fun.… Expand"}, {"name": "TimeSplitters 2", "details_link": "https://www.metacritic.com/game/xbox/timesplitters-2", "publisher": "Eidos Interactive", "release_date": "Oct 17 2002", "developers": ["Free Radical Design"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 88, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/eeee87b12130dfec700afc33d2a225f1-98.jpg", "descriptions": "The evil race of TimeSplitters is traveling back into human history authoring events that are leading to the enslavement of mankind. In control of a motley crew of renegade characters, you must hunt down the TimeSplitters in historical eras like the gangster-ridden 1920s, the lush jungles ofThe evil race of TimeSplitters is traveling back into human history authoring events that are leading to the enslavement of mankind. In control of a motley crew of renegade characters, you must hunt down the TimeSplitters in historical eras like the gangster-ridden 1920s, the lush jungles of Aztec temples, soviet military installations of the Cold War, and futuristic robot factories in space. To end their evil plot, seek and recover the crystals required to seal the rift in time. … Expand"}, {"name": "Dark Age of Camelot", "details_link": "https://www.metacritic.com/game/pc/dark-age-of-camelot", "publisher": "Mythic Entertainment", "release_date": "Oct  9 2001", "developers": ["Mythic Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 88, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/bb28632e4f4d698dc690a7cf9d72b16c-98.jpg", "descriptions": "Set in the Kingdom of Albion in the years immediately following the death of King Arthur, players of this MMORPG enter a world in chaos, where Arthur's peace has been shattered and dark forces threaten the Kingdom. In Camelot, players must choose to be members of one of the three Realms thatSet in the Kingdom of Albion in the years immediately following the death of King Arthur, players of this MMORPG enter a world in chaos, where Arthur's peace has been shattered and dark forces threaten the Kingdom. In Camelot, players must choose to be members of one of the three Realms that are striving for mastery in this chaotic world. [Mythic Entertainment]… Expand"}, {"name": "Baldur's Gate II: Throne of Bhaal", "details_link": "https://www.metacritic.com/game/pc/baldurs-gate-ii-throne-of-bhaal", "publisher": "Interplay", "release_date": "Jun 21 2001", "developers": ["BioWare"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 88, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/152f14c7d54090f65ab9fdc6d070323f-98.jpg", "descriptions": "The final chapter of the wildly popular Baldur's Gate series, technically and add-on pack to \"Shadows of Amn\" but which plays like a true sequel, opens after the conclusion of \"Shadows\" at the outbreak of a major Bhaalspawn war and throws you into a new adventure called the Watcher's Keep."}, {"name": "Counter-Strike", "details_link": "https://www.metacritic.com/game/pc/counter-strike", "publisher": "Sierra Entertainment", "release_date": "Nov  8 2000", "developers": ["The Counter-Strike Team"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern"], "meta_score": 88, "users_score": 9.2, "image": "https://static.metacritic.com/images/products/games/6/531ec4e073f01d64f1f3754e767d8963-98.jpg", "descriptions": "Counter-Strike modifies the multiplayer aspects of \"Half-Life\" to bring to it a more team-oriented gameplay. Counter-Strike provides the player with an experience that a trained counter-terrorist unit or terrorist unit experiences."}, {"name": "Owlboy", "details_link": "https://www.metacritic.com/game/pc/owlboy", "publisher": "D-Pad Studio", "release_date": "Nov  1 2016", "developers": ["D-Pad Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "General"], "meta_score": 88, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/be3e47427561609c1e1503f02efb2ebb-98.jpg", "descriptions": "Owlboy is a 'hi-bit' adventure game, where you can fly and explore a brand new world in the clouds. Pick up your friends, and bring them with you as you explore the open skies. Overcome obstacles and greater enemies in this detailed adventure."}, {"name": "The Talos Principle: Deluxe Edition", "details_link": "https://www.metacritic.com/game/playstation-4/the-talos-principle-deluxe-edition", "publisher": "Devolver Digital", "release_date": "Oct 13 2015", "developers": ["Croteam"], "platforms": ["Switch", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person", "Sci-Fi"], "meta_score": 88, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/7e3dfc375aae43fd21e0a1a684e4eb90-98.jpg", "descriptions": "In The Talos Principle, players assume the role of a sentient artificial intelligence placed within a simulation of humanity?s greatest ruins and linked together through an arcane cathedral. Players are tasked with solving a series of increasingly complex puzzles woven into a metaphysicalIn The Talos Principle, players assume the role of a sentient artificial intelligence placed within a simulation of humanity?s greatest ruins and linked together through an arcane cathedral. Players are tasked with solving a series of increasingly complex puzzles woven into a metaphysical parable about intelligence and meaning in an inevitably doomed world.… Expand"}, {"name": "Battlefield: Bad Company 2 Vietnam", "details_link": "https://www.metacritic.com/game/xbox-360/battlefield-bad-company-2-vietnam", "publisher": "EA Games", "release_date": "Dec 21 2010", "developers": ["EA DICE"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 88, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/a3f21b0d8737320d352b8911f2ce7e3c-98.jpg", "descriptions": "Set in the 1960s, this DLC adds 4 new multiplayer maps, 15 new weapons, and six vehicles."}]