[{"name": "Game of Thrones: Episode Six - The Ice Dragon", "details_link": "https://www.metacritic.com/game/xbox-one/game-of-thrones-episode-six---the-ice-dragon", "publisher": "Telltale Games", "release_date": "Nov 17 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action", "General", "Adventure", "Point-and-Click"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/513c29c4ba34f0b877b80d2cd9746f56-98.jpg", "descriptions": "Your chronicle is about to come to a conclusion. With House Whitehill tightening its grip on Ironrath at the behest of Ramsay Bolton, the remaining Forresters need to give their all to save the family, whether through diplomacy, subterfuge, or violent force. In the frozen wilds beyond TheYour chronicle is about to come to a conclusion. With House Whitehill tightening its grip on Ironrath at the behest of Ramsay Bolton, the remaining Forresters need to give their all to save the family, whether through diplomacy, subterfuge, or violent force. In the frozen wilds beyond The Wall, Gared learns the secrets of the mysterious North Grove, and Mira discovers that political games in a King's Landing controlled by Cersei Lannister often involve the highest stakes of all. What is the fate of House Forrester? When you play the Game of Thrones, you win or you die. Your choices, your story: you decide. [Telltale Games]… Expand"}, {"name": "The Walking Dead: Season Two Episode 3 - In Harm's Way", "details_link": "https://www.metacritic.com/game/playstation-3/the-walking-dead-season-two-episode-3---in-harms-way", "publisher": "Telltale Games", "release_date": "May 13 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "genres": ["General", "Action", "Adventure", "General", "Point-and-Click"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/1da795d6d343604daaa57ffa0bab3d73-98.jpg", "descriptions": "Consequences."}, {"name": "The Sims 3: Into the Future", "details_link": "https://www.metacritic.com/game/pc/the-sims-3-into-the-future", "publisher": "Electronic Arts", "release_date": "Oct 22 2013", "developers": ["Maxis"], "platforms": "PC", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 80, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/76b14eabb529e9dc2dd622185b185019-98.jpg", "descriptions": "Fire up the Time Portal and send your Sims to their most exciting destination yet: a whole new world that exists hundreds of years in the future! While they are there, your Sims can build their Advanced Technology Skill in order to get the most out of future technology. Whether your Sims areFire up the Time Portal and send your Sims to their most exciting destination yet: a whole new world that exists hundreds of years in the future! While they are there, your Sims can build their Advanced Technology Skill in order to get the most out of future technology. Whether your Sims are cruising around on their hoverboard or jetpack, traveling via monorail or tube elevator, or trying out attractive futuristic hairstyles and clothing, there's a whole new world to experiment with and explore. Create and customize Plumbots with Create A Bot, add them to the household, and program them with a wide variety of trait chips that will alter their behaviors! Jump between present and future worlds at will, and experiment with how your Sims' actions in the present can have surprising effects on their own legacy, their descendants, and even the way of life for future Sims!… Expand"}, {"name": "Borderlands 2: Captain Scarlett and Her Pirate's Booty", "details_link": "https://www.metacritic.com/game/pc/borderlands-2-captain-scarlett-and-her-pirates-booty", "publisher": "2K Games", "release_date": "Oct 16 2012", "developers": ["Gearbox Software"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/f0d4acdfbbd85750dd6f6640f114fcb3-98.jpg", "descriptions": "In Captain Scarlett and her Pirate's Booty, up to four players cooperatively enter the hostile sand dunes and wastelands of Pirate Bay in search of ancient treasures. The add-on content campaign features new characters, including the eccentric and eager Shade; locations such as the town ofIn Captain Scarlett and her Pirate's Booty, up to four players cooperatively enter the hostile sand dunes and wastelands of Pirate Bay in search of ancient treasures. The add-on content campaign features new characters, including the eccentric and eager Shade; locations such as the town of Oasis; enemies including the Sand Pirates and Anchormen; and special weapons and loot that make it a must-play experience. No trip to Pandora is complete without a stop in Pirate Bay.… Expand"}, {"name": "Wii Fit Plus", "details_link": "https://www.metacritic.com/game/wii/wii-fit-plus", "publisher": "Nintendo", "release_date": "Oct  4 2009", "developers": ["Nintendo"], "platforms": "Wii", "genres": ["Sports", "Miscellaneous", "Alternative", "General", "Exercise / Fitness", "Other"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/9bf205677426f9cac855ce37cbbeed3e-98.jpg", "descriptions": "Wii Fit Plus is the new, enhanced version of the original Wii Fit software, packed with every feature and exercise from the original Wii Fit in addition to new exercises, balance games and tools to personalize your exercise routine. Workouts combine the original Wii Fit activities andWii Fit Plus is the new, enhanced version of the original Wii Fit software, packed with every feature and exercise from the original Wii Fit in addition to new exercises, balance games and tools to personalize your exercise routine. Workouts combine the original Wii Fit activities and selections from 15 new balance games and six new Strength Training and Yoga activities. Customize your workout! For the first time, you can mix and match which Strength Training and Yoga activities you prefer on a given day, or choose any one of 12 recommended workouts based on your fitness goals. 15 new activities will have you running obstacle courses across platforms, channeling your martial arts groove with Rhythm Kung Fu, or flapping your arms to help chicken-suited characters aim for targets in Bird's-eye Bull's-eye. Have fun with up to eight friends or family members, and take turns using one Wii Balance Board accessory to play nine different games in the new multiplayer mode. [Nintendo]… Expand"}, {"name": "LEGO Star Wars: The Complete Saga", "details_link": "https://www.metacritic.com/game/xbox-360/lego-star-wars-the-complete-saga", "publisher": "LucasArts", "release_date": "Nov  6 2007", "developers": ["Traveller's Tales"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "General", "General", "Compilation"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/b2b660b525b6fc4d418ac6dd9ff1bf55-98.jpg", "descriptions": "From the Trade Federation's \"negotiations\" with Obi-Wan Kenobi and Qui-Gon Jinn in The Phantom Menace to the space battle above Endor in Return of the Jedi, The Complete Saga allows players to kick some brick through 36 Story Mode levels, including Episode II's newly added high-speed pursuitFrom the Trade Federation's \"negotiations\" with Obi-Wan Kenobi and Qui-Gon Jinn in The Phantom Menace to the space battle above Endor in Return of the Jedi, The Complete Saga allows players to kick some brick through 36 Story Mode levels, including Episode II's newly added high-speed pursuit of bounty hunter Zam Wessell. Traveller’s Tales has revamped levels from the original LEGO Star Wars to match the gameplay evolutions found in LEGO Star Wars II, and Prequel Trilogy characters can now be mixed and matched with those from the Original Trilogy – more than 160 in all. [LucasArts]… Expand"}, {"name": "FATE", "details_link": "https://www.metacritic.com/game/pc/fate", "publisher": "Encore Software, Inc.", "release_date": "May 18 2005", "developers": ["WildTangent"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Third-Person", "Action RPG"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/b4950c6ec0b417f97514d1b71528002c-98.jpg", "descriptions": "Travel to the outskirts where the Old Wood meets the Dungeon Gate in the fabled forest town of Grove. Beyond this mystic gate,you'll acquire power with unique weaponry and magic spells. Battle creatures that lurk within the dungeon's corridors. Venture beyond the gate to steal glimpses ofTravel to the outskirts where the Old Wood meets the Dungeon Gate in the fabled forest town of Grove. Beyond this mystic gate,you'll acquire power with unique weaponry and magic spells. Battle creatures that lurk within the dungeon's corridors. Venture beyond the gate to steal glimpses of glory and fortune. Live to the next century, or look death in its fiery eyes and seek solace in the after-life. The time has come to take the dare. Rise and test your worth! Step forward and determine Your FATE! [WildTangent]… Expand"}, {"name": "Karaoke Revolution", "details_link": "https://www.metacritic.com/game/xbox/karaoke-revolution", "publisher": "Konami", "release_date": "Nov 10 2004", "developers": ["Secret Level"], "platforms": "Xbox", "num_players": "1-8 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 80, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/a9d481a567c764353ab06a5efd937ff8-98.jpg", "descriptions": "Turn your Xbox into a high-end, interactive karaoke machine with Karaoke Revolution, the latest in Konami's line of music video games.  Karaoke Revolution features a varied list of tunes from current hits to yesterday's classics.  With the Xbox Communicator, you'll not only sing song, butTurn your Xbox into a high-end, interactive karaoke machine with Karaoke Revolution, the latest in Konami's line of music video games.  Karaoke Revolution features a varied list of tunes from current hits to yesterday's classics.  With the Xbox Communicator, you'll not only sing song, but get judged on your performance--so make sure you're on key.  Take your voice to the ultimate concert venue in Showtime mode. This version of Karaoke Revolution also features more than 10 Motown classics and additional songs that you can download via Xbox Live.… Expand"}, {"name": "Ultimate Brain Games", "details_link": "https://www.metacritic.com/game/game-boy-advance/ultimate-brain-games", "publisher": "Telegames, Inc.", "release_date": "Mar 18 2003", "developers": ["Cosmigo"], "platforms": "Game Boy Advance", "genres": ["Miscellaneous", "Board Games"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/3aef2ee717683ebad80fe6b2cd01a690-98.jpg", "descriptions": "Welcome to the most comprehensive and feature-rich compilation of classic brain challenges ever available for portable gaming. Now you can enjoy Chess, Checkers, Backgammon, Mahjong, Dominoes, 4-in-a-Row, Sink the Ships, and Reversi... while on the go! Pre-set and adjustable computer AIWelcome to the most comprehensive and feature-rich compilation of classic brain challenges ever available for portable gaming. Now you can enjoy Chess, Checkers, Backgammon, Mahjong, Dominoes, 4-in-a-Row, Sink the Ships, and Reversi... while on the go! Pre-set and adjustable computer AI allows multiple challenge levels from beginner to highly advanced for one player modes.… Expand"}, {"name": "Disney's Lilo & Stitch", "details_link": "https://www.metacritic.com/game/game-boy-advance/disneys-lilo-stitch", "publisher": "Disney Interactive", "release_date": "Jun  7 2002", "developers": ["Digital Eclipse"], "platforms": "Game Boy Advance", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/9ab0ee5408c5ebc1f4e940dc69ffd6ac-98.jpg", "descriptions": "WARNING: Stitch is extremely dangerous. The result of an illegal genetic experiment by a mad scientist, Stitch appears to be harmless - small, furry, with six legs - but his very existence is an abomination to all that's decent in the galaxy. Last seen on the island of Hawaii in the companyWARNING: Stitch is extremely dangerous. The result of an illegal genetic experiment by a mad scientist, Stitch appears to be harmless - small, furry, with six legs - but his very existence is an abomination to all that's decent in the galaxy. Last seen on the island of Hawaii in the company of a little named Lilo. Fugitive may be disguised as a family pet.… Expand"}, {"name": "2002 FIFA World Cup", "details_link": "https://www.metacritic.com/game/pc/2002-fifa-world-cup", "publisher": "EA Sports", "release_date": "Apr 30 2002", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-16 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/8c7593f32f4c6c7be1084862c691eff2-98.jpg", "descriptions": "The official soccer game of the 2002 Korea/Japan World Cup features new \"Air Play\" gameplay with intuitive one-button headers, volleys, scissor kicks, juggling and showboating. New player-to-player animations allow for agressive jostling for the ball on the ground and in the air. TheThe official soccer game of the 2002 Korea/Japan World Cup features new \"Air Play\" gameplay with intuitive one-button headers, volleys, scissor kicks, juggling and showboating. New player-to-player animations allow for agressive jostling for the ball on the ground and in the air. The Tournament Mode features a seven game series beginning with round-robin play, followed by playoffs leading to the final match with a progressive story line and a rising intensity as you advance. [EA Sports]… Expand"}, {"name": "Asheron's Call Dark Majesty", "details_link": "https://www.metacritic.com/game/pc/asherons-call-dark-majesty", "publisher": "Microsoft Game Studios", "release_date": "Nov  4 2001", "developers": ["Turbine Inc."], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/b4c14bb6488830615c9aa862f6c24a93-98.jpg", "descriptions": "The land of Dereth, a massively multiplayer world brimming with constantly evolving stories, real life comrades, and strange and fearsome monsters. It is to this world that the great Empyrean mage Asheron has \"called\" you. Explore the rich history of Dereth, revel in its wonders, andThe land of Dereth, a massively multiplayer world brimming with constantly evolving stories, real life comrades, and strange and fearsome monsters. It is to this world that the great Empyrean mage Asheron has \"called\" you. Explore the rich history of Dereth, revel in its wonders, and discover your destiny! [Microsoft]… Expand"}, {"name": "Mat Hoffman's Pro BMX", "details_link": "https://www.metacritic.com/game/playstation/mat-hoffmans-pro-bmx", "publisher": "Activision", "release_date": "May 14 2001", "developers": ["Shaba Games"], "platforms": ["PC", "PlayStation"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/2e319de2132c70ec06a562bf89899aa5-98.jpg", "descriptions": "The soundtrack rivals Wipeout XL for the title of best licensed soundtrack ever."}, {"name": "Gran Turismo 5 Prologue", "details_link": "https://www.metacritic.com/game/playstation-3/gran-turismo-5-prologue", "publisher": "SCEA", "release_date": "Apr 15 2008", "developers": ["Polyphony Digital"], "platforms": "PlayStation 3", "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 80, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/01c2c8b84a0ed6d2b14191c4d102e76b-98.jpg", "descriptions": "The real driving simulator returns with the highly anticipated precursor to Gran Turismo 5, featuring 50 cars from worldwide auto manufacturers including Ferrari, Ford, and Audi. With all-new interior dash views, online racing, and more, Gran Turismo 5 Prologue unveils revolutionaryThe real driving simulator returns with the highly anticipated precursor to Gran Turismo 5, featuring 50 cars from worldwide auto manufacturers including Ferrari, Ford, and Audi. With all-new interior dash views, online racing, and more, Gran Turismo 5 Prologue unveils revolutionary advancements that blur the distinction between simulation and reality. Fifty cars and five race tracks, including Fuji Speedway, Suzuka Circuit, and for the first time ever, Daytona International Speedway. All-new interior dash view puts you in the driver’s seat like never before. Race online with up to 16 players to prove your skills. New online community features including Gran Turismo TV, featuring worldwide automotive and motorsport programming. Rendered in beautiful 1080p at 60fps with crisp, realistic lighting effects (replays rendered in 1080p 30fps). [Sony]… Expand"}, {"name": "NEO: The World Ends With You", "details_link": "https://www.metacritic.com/game/playstation-4/neo-the-world-ends-with-you", "publisher": "Square Enix", "release_date": "Jul 27 2021", "developers": ["Square Enix", "h.a.n.d. Inc."], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/245e67a835293f4391a3f24cd44ff159-98.jpg", "descriptions": "\"Only the possibility of you can change our fate\". A long-awaited new story in The World Ends with You series has arrived. Rindo comes to the grim realization that his life is on the line when he is forced to compete in the so-called \"Reapers' Game.\" There's no telling how this tale will\"Only the possibility of you can change our fate\". A long-awaited new story in The World Ends with You series has arrived. Rindo comes to the grim realization that his life is on the line when he is forced to compete in the so-called \"Reapers' Game.\" There's no telling how this tale will unfold—but it's up to you to find out! Put your psychic prowess to the test as you duke it out on the stylishly animated streets of Shibuya. Features:  Delve into a vividly illustrated Shibuya, animated with style, music and monsters. Collect and wield hundreds of Psych abilities to battle surreal threats. Investigate the world around you and beat the \"Reapers' Game\" to survive.… Expand"}, {"name": "Ni no Kuni II: Revenant Kingdom - Prince's Edition", "details_link": "https://www.metacritic.com/game/switch/ni-no-kuni-ii-revenant-kingdom---princes-edition", "publisher": "Bandai Namco Games", "release_date": "Sep 17 2021", "developers": ["Level 5"], "platforms": ["PC", "Xbox One", "Switch"], "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/aec76b7280b9a04ed4b7795257d4dcaf-98.jpg", "descriptions": "Ni No Kuni 2 kicks off with the President of a real-world Earth country transported to a magical kingdom in which every person is also sort of an animal as well."}, {"name": "MX vs. ATV Unleashed", "details_link": "https://www.metacritic.com/game/xbox/mx-vs-atv-unleashed", "publisher": "THQ", "release_date": "Mar 24 2005", "developers": ["Rainbow Studios"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "6  Online", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/3d2afac96763f5963917022ef4fdf6b8-98.jpg", "descriptions": "MX vs. ATV Unleashed lets you drive off-road in different vehicles, including ATVs, monster trucks, and sand rails, in an effort to conquer all-new racing challenges. You can compete in new racing events, minigames, or challenges, such as hill climbs, freestyle, gap jumps, and short-trackMX vs. ATV Unleashed lets you drive off-road in different vehicles, including ATVs, monster trucks, and sand rails, in an effort to conquer all-new racing challenges. You can compete in new racing events, minigames, or challenges, such as hill climbs, freestyle, gap jumps, and short-track races. Begin a career in single-player mode, or take on your friends in online multiplayer modes. A new \"rhythm racing\" mode lets you race through the game's nonlinear environments.… Expand"}, {"name": "NHL 14", "details_link": "https://www.metacritic.com/game/playstation-3/nhl-14", "publisher": "Electronic Arts", "release_date": "Sep 10 2013", "developers": ["Electronic Arts"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 80, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/409b857f2fd806b0a440030556d13c86-98.jpg", "descriptions": "Unlock the highest level of hockey aggression, speed and skill. Deliver hits with the NHL® Collision Physics, built from FIFA’s Player Impact Engine. Drop your gloves with the new Enforcer Engine, powered by EA SPORTS™ Fight Night technology. Dangle defenders with new One-Touch Dekes andUnlock the highest level of hockey aggression, speed and skill. Deliver hits with the NHL® Collision Physics, built from FIFA’s Player Impact Engine. Drop your gloves with the new Enforcer Engine, powered by EA SPORTS™ Fight Night technology. Dangle defenders with new One-Touch Dekes and experience enhanced speed and control with the second season of True Performance Skating.… Expand"}, {"name": "Fable III", "details_link": "https://www.metacritic.com/game/xbox-360/fable-iii", "publisher": "Microsoft Game Studios", "release_date": "Oct 26 2010", "developers": ["Lionhead Studios"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 80, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/56c559094f945f4be39250139b31375e-98.jpg", "descriptions": "Five decades have passed since the events of Fable II, and Albion has matured into an industrial revolution, but the fate of the kingdom is at peril. In Fable III” you are called upon to rally and fight alongside your people, ascend to the seat of power, and experience the true meaning ofFive decades have passed since the events of Fable II, and Albion has matured into an industrial revolution, but the fate of the kingdom is at peril. In Fable III” you are called upon to rally and fight alongside your people, ascend to the seat of power, and experience the true meaning of love and loss. The choices and sacrifices you make while fanning the flames of revolution, and then as you rule as King or Queen or Albion, will lead to an ever evolving world of consequences that will be felt across your entire land. This sets the stage for unparalleled action and adventure that offers even more ways to fight and engage than ever before. Throughout your journey, you encounter a colorful cast of characters that fans have come to expect from the off-beat style and humor in the Fable games. After determining whether these characters are your friends or foes, you either join them or fight against them in explosive combat, alone or with a friend on Xbox LIVE. In your quest to plant the seeds of revolution, seize power and rule over your kingdom, the choices you make change the world around you, for the greater good or your own personal gain. Who will you become? A rebel without a cause, the tyrant you rebelled against, or the greatest ruler to ever live? [Lionhead]… Expand"}, {"name": "Valorant", "details_link": "https://www.metacritic.com/game/pc/valorant", "publisher": "Riot Games", "release_date": "Jun  2 2020", "developers": ["Riot Games"], "platforms": "PC", "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 80, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/6/d63ed3eecb12789c02659ff0b5473a08-98.jpg", "descriptions": "A 5v5 character-based tactical shooter. Imagine this: tactical shooter meets hypernatural powers. Everyone’s got guns and a unique set of abilities, so how do you beat someone with the speed of wind? Use your own moves to outplay them and beat them to the shot. VALORANT is a game for boldA 5v5 character-based tactical shooter. Imagine this: tactical shooter meets hypernatural powers. Everyone’s got guns and a unique set of abilities, so how do you beat someone with the speed of wind? Use your own moves to outplay them and beat them to the shot. VALORANT is a game for bold strategists who dare to make the unexpected play, because if it wins, it works.… Expand"}, {"name": "Danganronpa: Trigger Happy Havoc", "details_link": "https://www.metacritic.com/game/playstation-vita/danganronpa-trigger-happy-havoc", "publisher": "NIS America", "release_date": "Feb 11 2014", "developers": ["Spike Chunsoft"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "Horror", "Survival", "Visual Novel"], "meta_score": 80, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/259ac798d8c7ec307229bb6dd0b5ba32-98.jpg", "descriptions": "Fifteen super-elite students have been locked in the school and they are forced to live in this isolated community. There is a special rule for the students: only murderers can graduate from the school, and this rule turns the prosperous school into the despairing place. The protagonist,Fifteen super-elite students have been locked in the school and they are forced to live in this isolated community. There is a special rule for the students: only murderers can graduate from the school, and this rule turns the prosperous school into the despairing place. The protagonist, however, does not follow this rule. He investigates murders instead of murdering somebody and tries to figure out a way to escape from the school.… Expand"}, {"name": "Skylanders Giants", "details_link": "https://www.metacritic.com/game/xbox-360/skylanders-giants", "publisher": "Activision", "release_date": "Oct 21 2012", "developers": ["Toys for Bob"], "platforms": ["3DS", "PlayStation 3", "Wii U", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 80, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/fe81706aabb0e8f04c8e4544f822df3d-98.jpg", "descriptions": "Skylanders Giants is an all-new adventure for existing Skylanders toys that also adds 20 new characters--including eight giant ones--to the existing roster."}, {"name": "Persona 4 Arena Ultimax", "details_link": "https://www.metacritic.com/game/playstation-4/persona-4-arena-ultimax", "publisher": "Atlus", "release_date": "Mar 17 2022", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360", "PlayStation 4"], "num_players": "Up to 32 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 80, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/b0b8eb665d7f7defbafc5763953bae1c-98.jpg", "descriptions": "In P4AU, the characters from Persona 4 and Persona 3 once again find themselves teaming up to face off in the P-1 Climax, a series of battles which must be won before the world ends. The original cast of characters from Persona 3 and 4 are back to discover the mastermind behind the wholeIn P4AU, the characters from Persona 4 and Persona 3 once again find themselves teaming up to face off in the P-1 Climax, a series of battles which must be won before the world ends. The original cast of characters from Persona 3 and 4 are back to discover the mastermind behind the whole tournament, while a few new faces join the fight, including Junpei Iori, Yukari Takeba, Rise Kujikawa, and more. But standing in their way is the dual katana-wielding Sho Minazuki, a huge threat to everyone involved in the P-1 Climax. Worse yet, there's a Sho lookalike who can wield a Persona...… Expand"}, {"name": "Tales From The Borderlands: Episode 1 - Zer0 Sum", "details_link": "https://www.metacritic.com/game/playstation-4/tales-from-the-borderlands-episode-1---zer0-sum", "publisher": "Telltale Games", "release_date": "Nov 25 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "Adventure", "General"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/d30c3cfc561707842b8d484b713ea6dd-98.jpg", "descriptions": "Set following the events seen in Borderlands 2, Tales from the Borderlands focuses on Rhys, a Hyperion company man who wants to become the next Handsome Jack, and it’s also about Fiona, a Pandoran con artist intending to score the biggest of all swindles. Baited into danger by a Vault keySet following the events seen in Borderlands 2, Tales from the Borderlands focuses on Rhys, a Hyperion company man who wants to become the next Handsome Jack, and it’s also about Fiona, a Pandoran con artist intending to score the biggest of all swindles. Baited into danger by a Vault key and all it promises, the unlikely pair are thrown together with a common purpose and a great amount of mistrust. Who is speaking the truth, and why is it important? That is for you to decide. It’s important to remember that there *are* two sides to every story, and you will tell this tale, or…tales, through the choices that you make. Your every decision as both Rhys and Fiona will affect the people and environment around you: this is a game where YOU are the final author in a brand new Borderlands story set on the unforgiving world of Pandora. [Telltale Games]… Expand"}, {"name": "Call of Duty: Black Ops", "details_link": "https://www.metacritic.com/game/wii/call-of-duty-black-ops", "publisher": "Activision", "release_date": "Nov  9 2010", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Tactical", "Historic", "Arcade"], "meta_score": 80, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/111a56ee9df9e72dedb752c27152fbad-98.jpg", "descriptions": "Treyarch is developing the next installment in the Call of Duty franchise set during various Cold War conflicts."}, {"name": "Mega Man Legacy Collection", "details_link": "https://www.metacritic.com/game/xbox-one/mega-man-legacy-collection", "publisher": "Capcom", "release_date": "Aug 25 2015", "developers": ["Digital Eclipse"], "platforms": ["3DS", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/44dc497f9870a55cec9f9bf9def83f0b-98.jpg", "descriptions": "Featuring reproductions of the series origins with the original six Mega Man games, the Legacy Collection should remind long-time fans and introduce newcomers to what made Mega Man such a popular and iconic character. Mega Man Legacy Collection will feature all six games and more. InFeaturing reproductions of the series origins with the original six Mega Man games, the Legacy Collection should remind long-time fans and introduce newcomers to what made Mega Man such a popular and iconic character. Mega Man Legacy Collection will feature all six games and more. In addition to the six Mega Man games, Mega Man Legacy Collection features new ways to experience the classic games with the Museum Mode and new Challenge Mode. Challenge Mode remixes gameplay segments from all six games, with plenty of scaling difficulty objectives for experienced players to conquer yet serving as a good starting point for new players, too. Museum Mode contains a comprehensive collection of history, high-res art and original concept pieces.… Expand"}, {"name": "Dungeons & Dragons: Dragonshard", "details_link": "https://www.metacritic.com/game/pc/dungeons-dragons-dragonshard", "publisher": "Atari", "release_date": "Oct  2 2005", "developers": ["Liquid Entertainment"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/d09163f5b1b2ea4da69bcc7c977d64e6-98.jpg", "descriptions": "Dragonshard is the first game to be set in the exciting new D&D campaign setting, Eberron, a cinematic and war-torn world of action, adventure and intrigue where fantasy meets magical technology. Eberron, which has been recently released by Wizards of the Coast, details a land composed of aDragonshard is the first game to be set in the exciting new D&D campaign setting, Eberron, a cinematic and war-torn world of action, adventure and intrigue where fantasy meets magical technology. Eberron, which has been recently released by Wizards of the Coast, details a land composed of a dark underworld ruled by monsters and demons, and a surface world home to the civilizations of humans, dwarves, halflings, gnomes and more. Surrounding the world is the Ring of Siberys, a multi-colored belt of crystal shards and a source of tremendous magical power. These \"dragonshards\" occasionally fall to earth and are the cornerstone of all magic on Eberron. The \"Dragonshard\" takes place at time when the world of Eberron is in chaos. Three forces are vying for control of a massive dragonshard, known as the Heart of Siberys. The ancient artifact has come to rest in a mystical part of Eberron known as Xen'drik, once home to ancient and powerful civilizations; it is now a place of mystery and monsters. Shielded by a circle of high mountains and blanketed by never-ending tempests and blizzards, this region has been shunned for millennia. [Atari]… Expand"}, {"name": "This War of Mine: Complete Edition", "details_link": "https://www.metacritic.com/game/switch/this-war-of-mine-complete-edition", "publisher": "11 bit studios", "release_date": "Nov 27 2018", "developers": ["11 bit studios"], "platforms": ["PlayStation 5", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Miscellaneous", "Action Adventure", "Real-Time", "Survival", "Board / Card Game", "General"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/01c8da414d9ca8f28407dd296bb4a6bc-98.jpg", "descriptions": "This War Of Mine provides an experience of war seen from an entirely new angle. For the very first time you do not play as an elite soldier, rather a group of civilians trying to survive in a besieged city. During the day snipers outside stop you from leaving your refuge, so you need toThis War Of Mine provides an experience of war seen from an entirely new angle. For the very first time you do not play as an elite soldier, rather a group of civilians trying to survive in a besieged city. During the day snipers outside stop you from leaving your refuge, so you need to focus on maintaining your hideout. At night you get a chance to scavenge nearby locations for items that will help you stay alive.\r Make life-and-death decisions driven by your conscience. Try to protect everybody from your shelter or sacrifice some of them to endure the hardships. During war, there are no good or bad decisions; there is only survival. The sooner you realize that, the better.… Expand"}, {"name": "Icewind Dale: Enhanced Edition", "details_link": "https://www.metacritic.com/game/pc/icewind-dale-enhanced-edition", "publisher": "Interplay", "release_date": "Oct 30 2014", "developers": ["Black Isle Studios", "Beamdog", "Overhaul Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "genres": ["Role-Playing", "PC-style RPG", "Western-Style"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/d28218e4eeb52f39cff5afdf5aa3dbf0-98.jpg", "descriptions": "Evil stirs beneath the Spine of the World. In the northernmost reaches of the Forgotten Realms lies the region of icy tundra known as Icewind Dale. Journey deep into the Spine of the World mountains, a harsh and unforgiving territory settled by only the hardiest folk."}, {"name": "Ruined King: A League of Legends Story", "details_link": "https://www.metacritic.com/game/pc/ruined-king-a-league-of-legends-story", "publisher": "Riot Forge", "release_date": "Nov 16 2021", "developers": ["Airship Syndicate Entertainment"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/76c097a164d0545a53a639027b5164dc-98.jpg", "descriptions": "Rise Against Ruin. Unite a party of League of Legends Champions, explore Bilgewater and set sail for the Shadow Isles to uncover the secrets of the deadly Black Mist. Developed by Airship Syndicate and featuring the art style of legendary comic book artist Joe Madureira, creators of BattleRise Against Ruin. Unite a party of League of Legends Champions, explore Bilgewater and set sail for the Shadow Isles to uncover the secrets of the deadly Black Mist. Developed by Airship Syndicate and featuring the art style of legendary comic book artist Joe Madureira, creators of Battle Chasers and Darksiders, Ruined King: A League of Legends Story is the first Riot Forge game that invites you to explore the League of Legends universe. In this immersive turn-based RPG, you will have the freedom to configure your party and control an unlikely group of League of Legends champions, explore the bustling city of Bilgewater and the mysterious Shadow Isles, and experience the Lane Initiative System. … Expand"}, {"name": "Puyo Puyo Tetris 2", "details_link": "https://www.metacritic.com/game/switch/puyo-puyo-tetris-2", "publisher": "Sega", "release_date": "Dec  8 2020", "developers": ["Sega"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 4 ", "genres": ["Puzzle", "Matching"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/88f35205c2a074a647fc2e5457846b0d-98.jpg", "descriptions": "Japan's beloved puzzle game series Puyo Puyo and the world renowned Tetris game franchise have teamed up again to deliver even more Puyo popping and Tetrimino clearing fun in Puyo Puyo Tetris 2. Playing is easy: match 4 or more same coloured Puyos or complete a line of blocks to clear themJapan's beloved puzzle game series Puyo Puyo and the world renowned Tetris game franchise have teamed up again to deliver even more Puyo popping and Tetrimino clearing fun in Puyo Puyo Tetris 2. Playing is easy: match 4 or more same coloured Puyos or complete a line of blocks to clear them from your board and dump Garbage into your opponent's game. But keep an eye on what's coming your way too.Play traditional Puyo Puyo and Tetris or mix them together to level up your game. Offline or online, you'll have loads of modes that let you play the way you want from single player Adventure to couch competition Versus to ranked Online matches, and more.… Expand"}, {"name": "Fall Guys", "details_link": "https://www.metacritic.com/game/pc/fall-guys", "publisher": "Devolver Digital", "release_date": "Aug  4 2020", "developers": ["Mediatonic"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 60 ", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/858780805f3a1e132687577ef34cf622-98.jpg", "descriptions": "Fall Guys is a massively multiplayer party game with up to 60 players online in a free-for-all struggle through round after round of escalating chaos until one victor remains."}, {"name": "Yo-kai Watch 3", "details_link": "https://www.metacritic.com/game/3ds/yo-kai-watch-3", "publisher": "Level 5", "release_date": "Feb  8 2019", "developers": ["Level 5"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/866c79d591d7f0fa1aabca5c09927e21-98.jpg", "descriptions": "Mischievous beings known as Yo-kai are everywhere, and it's up to Nate and Hailey Anne to befriend, battle, and solve problems with them.Follow two parallel stories and unravel the mysteries behind strange sightings while meeting over 600 Yo-kai and using the new 3x3 grid battle system toMischievous beings known as Yo-kai are everywhere, and it's up to Nate and Hailey Anne to befriend, battle, and solve problems with them.Follow two parallel stories and unravel the mysteries behind strange sightings while meeting over 600 Yo-kai and using the new 3x3 grid battle system to strategically dish out or dodge attacks.More Yo-kai, more mysteries! 'Merican Yo-kai have made their way to YO-KAI WATCH 3 and they're rootin' tootin' troublemakers. Speaking of troublemakers, in BBQ, zombies rise from their graves and Nate must free the town during Zombie Night. If you're too afraid of zombies, you can always find treasure by exploring randomly generated dungeons and discover the truth about the mysterious ruins hidden all across the continent with the Yo-kai Blasters T group.* Meet Hailey Anne and Usapyon as they solve cases as Yo-kai detectives in Springdale* Explore the American-inspired location, BBQ, where 'Merican Yo-kai run rampant* Battle all-new bosses, meet over 600 Yo-kai, and use a new 3x3 grid battle system to strategically dish out attacks* In BBQ, go on a rafting adventure, try out a new Crank-a-kai, and interact with new 'Merican Yo-kai* Train up your very own Nyan, a cat like Yo-kai, in Build-a-Nyan* Bonk zombies on the head, in an all-new mode, Zombie Nightit's an invasion!* Link with versions of YO-KAI WATCH 2 and YO-KAI WATCH BLASTERS to earn special Yo-kai* Discover treasure as part of the Yo-kai Blasters T group and make your way through randomly generated dungeons… Expand"}, {"name": "Hyper Light Drifter", "details_link": "https://www.metacritic.com/game/playstation-4/hyper-light-drifter", "publisher": "Heart Machine", "release_date": "Jul 26 2016", "developers": ["Heart Machine"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/e63ed908eb4f00aed87e7e1a228edbc5-98.jpg", "descriptions": "Explore a beautiful, vast and ruined world riddled with unknown dangers and lost technologies. Inspired by nightmares and dreams alike. Hyper Light Drifter is a 2D Action RPG in the vein of the best 8-bit and 16-bit classics, with modernized mechanics and designs on a much grander scale."}, {"name": "Gravity Rush 2", "details_link": "https://www.metacritic.com/game/playstation-4/gravity-rush-2", "publisher": "SCEA", "release_date": "Jan 20 2017", "developers": ["SCE Japan Studio"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "3D"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/df31e3c976c145ce18038042c97cb50b-98.jpg", "descriptions": "Prepare to fall through the skies as gravity kitten Kat masters a suite of new gravity-defying abilities and chases the mystery of her origin across a huge new open world. [SIEA]"}, {"name": "Rogue Aces", "details_link": "https://www.metacritic.com/game/switch/rogue-aces", "publisher": "Curve Digital", "release_date": "Apr 12 2018", "developers": ["Infinite State Games"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/6ff3f82d1585d5bf7c12c8c8f4adfc20-98.jpg", "descriptions": "Join the Rogue Aces and liberate the islands from The Baron and his dreaded pilots. Will you be able to face the fiercest of foes with only one life and three planes?"}, {"name": "Far Cry 4", "details_link": "https://www.metacritic.com/game/pc/far-cry-4", "publisher": "Ubisoft", "release_date": "Nov 17 2014", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action", "Shooter", "First-Person", "Modern", "Arcade"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/5c2cabf93854c49b27f5a5507e2580d5-98.jpg", "descriptions": "Concealed in the monstrous Himalayas lies a country ingrained in tradition and brutality. You become Ajay Ghale, returning to the country of his birth, the this forests and formidable snow capped summits of Kyrat, to fulfill your mother’s dying wish of spreading her ashes. This bitter andConcealed in the monstrous Himalayas lies a country ingrained in tradition and brutality. You become Ajay Ghale, returning to the country of his birth, the this forests and formidable snow capped summits of Kyrat, to fulfill your mother’s dying wish of spreading her ashes. This bitter and unpredictable country offers visitors opportunity and danger. You quickly find yourself ensnared in a rebellion to overthrow the thorny regime of Pagan Min, a statesman known as much for his sense of style and charisma as for his cruelty and naked brutality. Navigating the treacherous landscape, you find your fate increasingly linked to the choices you make because in Kyrat, and every second is a story. In Far Cry 4, you’ll conquer fortress outposts from the back of a 6-ton elephant and hit the skies as you rain down explosives from your moving perch in the gyrocopter. The vertical landscape of the Himalayas isn’t just a gorgeous backdrop, but a playground that encourages the player to fight, hunt and explore, grappling cliffs or launching into the air, plummeting to the valley underneath your feet in a controlled free fall with your wing suit. You’ll carry with you a unique arsenal of weaponry that lets you play as you will, whether it’s sniping, sneaking or all-out assault. When all else fails, animals can be your biggest allies or your greatest peril.… Expand"}, {"name": "Castlevania: The Dracula X Chronicles", "details_link": "https://www.metacritic.com/game/psp/castlevania-the-dracula-x-chronicles", "publisher": "Konami", "release_date": "Oct 23 2007", "developers": ["Konami"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Platformer", "Platformer", "Compilation", "2D", "2D"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/8e04b966c63ca17d7ff4e31f748736a2-98.jpg", "descriptions": "Castlevania: The Dracula X Chronicles is an entirely new take at the best Castlevania game to never be released in the US, \"Castlevania: Rondo of Blood\". The Dracula X Chronicles brings this action/adventure franchise to the PSP system for the first time, complete with 3D graphics, enhancedCastlevania: The Dracula X Chronicles is an entirely new take at the best Castlevania game to never be released in the US, \"Castlevania: Rondo of Blood\". The Dracula X Chronicles brings this action/adventure franchise to the PSP system for the first time, complete with 3D graphics, enhanced gameplay and new music. Completing the Dracula X storyline, this game also includes an unlockable version of Symphony of the Night and players will also be able to unlock the original Rondo of Blood from the NEC PC Engine. Includes unlockable versions of the original \"Rondo of Blood\" and \"Symphony of the Night\" games, optimized for the PSP. Timeless side scrolling action through more than 10 gothic stages and additional hidden areas. Return to previously completed levels to find additional secrets. [Konami]… Expand"}, {"name": "Blaster Master Zero III", "details_link": "https://www.metacritic.com/game/switch/blaster-master-zero-iii", "publisher": "Inti Creates", "release_date": "Jul 29 2021", "developers": ["Inti Creates"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/31bf2f6e05b896c1fe97277b93d0011e-98.jpg", "descriptions": "Series protagonist Jason travels to where the series all began, the planet Sophia, in order to save series heroine Eve in this final installment of the story."}, {"name": "NHL 19", "details_link": "https://www.metacritic.com/game/playstation-4/nhl-19", "publisher": "Electronic Arts", "release_date": "Sep 14 2018", "developers": ["EA Sports"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Sports", "Team", "Ice Hockey", "Sim"], "meta_score": 80, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/9/3fbca4d4539bc5d5186d541a231300f5-98.jpg", "descriptions": "Play on outdoor rinks and journey from the ponds to the pros in new game modes. Compete with and against 200 of the greatest hockey legends to ever hit the ice, highlighted by Wayne Gretzky. Powered by cutting-edge new gameplay technology, experience explosive-edge skating that delivers morePlay on outdoor rinks and journey from the ponds to the pros in new game modes. Compete with and against 200 of the greatest hockey legends to ever hit the ice, highlighted by Wayne Gretzky. Powered by cutting-edge new gameplay technology, experience explosive-edge skating that delivers more acceleration, speed and responsiveness.… Expand"}, {"name": "Super Time Force Ultra", "details_link": "https://www.metacritic.com/game/pc/super-time-force-ultra", "publisher": "Capy Games", "release_date": "Aug 25 2014", "developers": ["Capy Games"], "platforms": ["PlayStation 4", "PlayStation Vita", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Shooter", "2D", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 80, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/b2dafe2897718931bbb75503876890b0-98.jpg", "descriptions": "Super Time Force is an action-packed platformer with a time-travelling twist! Youre in control of time itself, bending and stretching it to your advantage on the battlefield. Rewind time and choose when to jump back into the action, teaming-up with your past selves in a unique single-playerSuper Time Force is an action-packed platformer with a time-travelling twist! Youre in control of time itself, bending and stretching it to your advantage on the battlefield. Rewind time and choose when to jump back into the action, teaming-up with your past selves in a unique single-player co-op experience! Take control of up to 16 unique characters, and battle across 6 different time periods, from the long-ago past to the far-away future.… Expand"}, {"name": "Day of Defeat: Source", "details_link": "https://www.metacritic.com/game/pc/day-of-defeat-source", "publisher": "Valve Software", "release_date": "Sep 26 2005", "developers": ["Valve Software"], "platforms": "PC", "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Tactical", "Historic", "Arcade"], "meta_score": 80, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/3/eed8bee0e64d8022c21034e6b568efea-98.jpg", "descriptions": "Day of Defeat: Source features multiplayer, team-based gameplay set in the WWII European theatre of operations. Players choose a role and tackle goal-oriented missions based on historical operations. Day of Defeat: Source takes the classic gameplay of the original Day of Defeat and improvesDay of Defeat: Source features multiplayer, team-based gameplay set in the WWII European theatre of operations. Players choose a role and tackle goal-oriented missions based on historical operations. Day of Defeat: Source takes the classic gameplay of the original Day of Defeat and improves the experience with Source, the advanced engine technology Valve created for \"Half-Life 2.\" With this technology, DoD: Source offers state of the art graphics (including support for HDR lighting) in optimized versions of popular maps, plus redesigned sound and all new player, weapon, and world models. New features include: Completely updated maps to take full advantage of the Source engine replaces, integrated physics simulation for ragdolls and physically simulated objects, higher resolution textures throughout, bump mapping, specular lighting, and other graphic effects, all powered by advanced Source engine technology, completely redesigned user interface, all new voice, weapon, and ambient sounds. [Valve]… Expand"}, {"name": "Pokemon Sword", "details_link": "https://www.metacritic.com/game/switch/pokemon-sword", "publisher": "Nintendo", "release_date": "Nov 15 2019", "developers": ["Game Freak"], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 80, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/82382d63d7100a85818f1c10504c478b-98.jpg", "descriptions": "Pokémon Sword and Pokémon Shield are set in Galar, an expansive region with many environments—idyllic countryside, contemporary cities, thick forests, and craggy, snow-covered mountains. The people and Pokémon live together in this region, and they’ve worked together to develop thePokémon Sword and Pokémon Shield are set in Galar, an expansive region with many environments—idyllic countryside, contemporary cities, thick forests, and craggy, snow-covered mountains. The people and Pokémon live together in this region, and they’ve worked together to develop the industries here. You’ll visit the various Gyms in the Galar region, aiming for the enviable and admirable title of Champion. [Nintendo]\r… Expand"}, {"name": "Battlefield 2142", "details_link": "https://www.metacritic.com/game/pc/battlefield-2142", "publisher": "EA Games", "release_date": "Oct 17 2006", "developers": ["EA DICE"], "platforms": "PC", "num_players": "64  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 80, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/60b60afbff544751d984c66a0895a13f-98.jpg", "descriptions": "The year is 2142, and the dawn of a new Ice age has thrown the world into a panic. The math is simple and brutal: The soil not covered by ice can only feed a fraction of the Earth's population. Some will live, most will die. In Battlefield 2142, players choose to fight for one of twoThe year is 2142, and the dawn of a new Ice age has thrown the world into a panic. The math is simple and brutal: The soil not covered by ice can only feed a fraction of the Earth's population. Some will live, most will die. In Battlefield 2142, players choose to fight for one of two military superpowers in an epic battle for survival, the European Union or the newly formed Pan Asian Coalition. Armed with a devastating arsenal of hi-tech assault rifles, cloaking devices and sentry guns, players also do battle using some of the most imposing vehicles known to man. Massive battle Mechs wage fierce combat on the ground, while futuristic aircraft rule the skies. When facing one of these new behemoths, players need to use their wits and an arsenal of new countermeasures like EMP grenades to level the playing field. [Electronic Arts]… Expand"}, {"name": "The Artful Escape", "details_link": "https://www.metacritic.com/game/pc/the-artful-escape", "publisher": "Beethoven & Dinosaur", "release_date": "Sep  9 2021", "developers": ["Beethoven & Dinosaur"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Action", "Adventure", "General", "Platformer", "2D"], "meta_score": 80, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/576827f06e961e268eda1fe9d0239091-98.jpg", "descriptions": "The Artful Escape of Francis Vendetti is a video game about great expectations, famous folk singers, lingering shadows, space Gods, hallucinogens, individuality, reptile shops, and wild imaginations. It's an action, adventure, exploration, narrative driven, musical-laser-light-battle kind of game."}, {"name": "Karaoke Revolution Party", "details_link": "https://www.metacritic.com/game/gamecube/karaoke-revolution-party", "publisher": "Konami", "release_date": "Nov  8 2005", "developers": ["Harmonix Music Systems"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-8 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/0c609196e83f01972f46cf74546bc74d-98.jpg", "descriptions": "Now you can showcase your vocal skills in the next installment in Konami's singing series. Karaoke Revolution Party features 50 songs, new multiplayer and party modes, and EyeToy support."}, {"name": "Fantasy General II: Invasion", "details_link": "https://www.metacritic.com/game/pc/fantasy-general-ii-invasion", "publisher": "Slitherine", "release_date": "Sep  5 2019", "developers": ["Owned by Gravity"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 80, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/ef0affe3fe06f7cc4b23dd0280597f37-98.jpg", "descriptions": "Armies once again draw battle-lines on the war-torn land of Keldonia, and a new generation of commanders will test their bravery and tactics against each other."}, {"name": "Super Mega Baseball: Extra Innings", "details_link": "https://www.metacritic.com/game/xbox-one/super-mega-baseball-extra-innings", "publisher": "Metalhead Software", "release_date": "Aug 14 2015", "developers": ["Metalhead Software"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox One"], "genres": ["Sports", "Team", "Baseball", "Arcade"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/acb74a790fcecae47368330d612e38d7-98.jpg", "descriptions": "Super Mega Baseball packs ultra-tight batting/pitching mechanics, a novel difficulty system dubbed “Ego”, and a baseball simulation with accurate physics and comprehensive statistics tracking."}, {"name": "Skylanders Giants", "details_link": "https://www.metacritic.com/game/wii-u/skylanders-giants", "publisher": "Activision", "release_date": "Nov 18 2012", "developers": ["Vicarious Visions"], "platforms": ["3DS", "PlayStation 3", "Xbox 360", "Wii U"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 80, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/e350bd48c933889e50c96ae068100733-98.jpg", "descriptions": "Skylanders Giants unveils 16 new characters including super-sized Giants with oversized powers to boot, as well as the new LightCore Skylanders that light-up in the game and in the real-world as players’ transport them to Skylands using the Portal of Power that builds on the magic of theSkylanders Giants unveils 16 new characters including super-sized Giants with oversized powers to boot, as well as the new LightCore Skylanders that light-up in the game and in the real-world as players’ transport them to Skylands using the Portal of Power that builds on the magic of the toys. What's more, the game features a Hero Challenges, more Battle Mode gameplay, and advanced integration across console, handheld, mobile and Skylanders Universes. … Expand"}, {"name": "EA Sports Active More Workouts", "details_link": "https://www.metacritic.com/game/wii/ea-sports-active-more-workouts", "publisher": "Electronic Arts", "release_date": "Nov 17 2009", "developers": ["Electronic Arts"], "platforms": "Wii", "genres": ["Sports", "Miscellaneous", "General", "Exercise / Fitness"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/fa0c34a37e0445e4f43fb182ccda73dc-98.jpg", "descriptions": "Visit a tropical resort and blast those abs in EA Sports Active: More Workouts."}, {"name": "LEGO Rock Band", "details_link": "https://www.metacritic.com/game/ds/lego-rock-band", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov  3 2009", "developers": ["Backbone Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "DS"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/3fca50686e2c47e8f4f919e7151e3b8e-98.jpg", "descriptions": "The game, which allows families, tweens and teens to experience a wild journey to rock stardom where they can \"Build a Band and Rock the Universe,\" combines the multiplayer music experience of Rock Band with the fun, customization and humor of the LEGO videogame franchise packed withThe game, which allows families, tweens and teens to experience a wild journey to rock stardom where they can \"Build a Band and Rock the Universe,\" combines the multiplayer music experience of Rock Band with the fun, customization and humor of the LEGO videogame franchise packed with brilliant chart-topping songs and classic favorites suitable for younger audiences, including: Blur's \"Song 2\", Carl Douglas's \"Kung Fu Fighting\", Europe's \"The Final Countdown\", Good Charlotte's \"Boys and Girls\", and Pink's \"So What.\" Players become rockers as they embark on a journey to stardom that the whole family can enjoy as they work their way through local venues, stadiums and fantasy locations on Earth and beyond that mimic the imaginative settings that the LEGO world offers. Also continuing the LEGO \"build-and-play\" gaming experience, players are able to create their own LEGO Rock Band style as they customize their minifigure avatars, band and entourage, including roadies, managers and crew. LEGO Rock Band supports Rock Band instruments, as well as other music game controllers. [Warner Bros.]… Expand"}, {"name": "A Boy and His Blob", "details_link": "https://www.metacritic.com/game/wii/a-boy-and-his-blob", "publisher": "Majesco Games", "release_date": "Oct 13 2009", "developers": ["WayForward"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Platformer", "Puzzle", "Puzzle", "Platformer", "2D", "General", "2D"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/db06fb6ebc2e5249437ab8a90f31b960-98.jpg", "descriptions": "In a boy and his blob, an evil emperor has seized the throne of Blobolonia, and the fate of its inhabitants lies in the hands of the blob and a young boy he encounters when he crash lands on Earth. Playing the part of the boy, gamers must work together with their new blob friend to solveIn a boy and his blob, an evil emperor has seized the throne of Blobolonia, and the fate of its inhabitants lies in the hands of the blob and a young boy he encounters when he crash lands on Earth. Playing the part of the boy, gamers must work together with their new blob friend to solve puzzles, defeat monsters, and escape danger on Earth and Blobolonia. By feeding the blob jelly beans, players can activate his special abilities to transform him into helpful tools - including a ladder, trampoline, parachute, cannon, shield and many more.  Every different blob form aids the boy as he navigates 40 side-scrolling levels filled with hidden treasures and unlockable bonus content on the way to the Emperor's Citadel. Classic beans such as Licorice Ladder, Apple Jack, and Tangerine Trampoline, are joined by all-new jellybeans, including Bubble Gum Bubble and Caramel Cannon to provide a brand new play experience that only Wii can provide! [Majesco]… Expand"}, {"name": "World of Tanks", "details_link": "https://www.metacritic.com/game/pc/world-of-tanks", "publisher": "Wargaming.net", "release_date": "Apr 12 2011", "developers": ["Wargaming.net"], "platforms": ["PlayStation 4", "Xbox 360", "Xbox 360", "Xbox One", "PC"], "genres": ["First-Person", "Modern", "Action", "Simulation", "Shooter", "Shooter", "Vehicle", "Third-Person", "Combat", "Tactical", "Historic", "Historic"], "meta_score": 80, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/7/4fb766b2094efaae5888deb4b51f98ea-98.jpg", "descriptions": "World of Tanks is the first and only team-based massively multiplayer online action game dedicated to armored warfare. Throw yourself into the epic tank battles of World War II with other steel cowboys all over the world. Your arsenal includes more than 150 armored vehicles from America,World of Tanks is the first and only team-based massively multiplayer online action game dedicated to armored warfare. Throw yourself into the epic tank battles of World War II with other steel cowboys all over the world. Your arsenal includes more than 150 armored vehicles from America, Germany, and the Soviet Union, carefully detailed with historical accuracy. A flexible system of authentic vehicle upgrade and development allows you to try any of the vehicles and weapons in the game. Whether you prefer to exhaust your foes with fast and maneuverable light tanks, make deep breaches in enemy lines with all-purpose medium tanks, use the force of giant tanks to eliminate opposing armored forces, or become a heavy sniper with long-range howitzers, each unit type has its own advantages and can be extremely effective when operated by a true tank ace. But being a great tank commander alone isn't enough to win! In World of Tanks, it's all about teamwork. Victory is achieved by combining your combat skills with those of the other members of your team, each playing their own role on the battlefield. Just add your favorite strategy to build your own iron empire and manifest the indisputable authority of the tank! Feel the tank power!… Expand"}, {"name": "Vampire: The Masquerade - Bloodlines", "details_link": "https://www.metacritic.com/game/pc/vampire-the-masquerade---bloodlines", "publisher": "Activision", "release_date": "Nov 16 2004", "developers": ["Troika Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "First-Person", "Western-Style"], "meta_score": 80, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/8/35d91c1d6ffb7e7411cbe5f2dd0fe41f-98.jpg", "descriptions": "Presenting Vampire: The Masquerade - Bloodlines, a visually stunning first-person role-playing adventure that combines intense first-person action with an open, non-linear world, rich character development and an immersive storyline. Built using Valve Source Technology - the same game enginePresenting Vampire: The Masquerade - Bloodlines, a visually stunning first-person role-playing adventure that combines intense first-person action with an open, non-linear world, rich character development and an immersive storyline. Built using Valve Source Technology - the same game engine technology used to power Half-Life 2, Vampire: The Masquerade - Bloodlines is based on White Wolf's pen-and-paper RPG series, and developed by renowned RPG developer - Troika Games. The game plunges players into the dark and gritty vampire underworld of modern day L.A. as a creature of the night, interacting with and battling mortals and other creatures of darkness with an incredible array of vampire powers, skills and traits. [Activision]… Expand"}, {"name": "The King of Fighters XV", "details_link": "https://www.metacritic.com/game/playstation-4/the-king-of-fighters-xv", "publisher": "Koch Media", "release_date": "Feb 17 2022", "developers": ["SNK Corporation"], "platforms": ["PC", "PlayStation 5", "Xbox Series X", "PlayStation 4"], "genres": ["Action", "Fighting", "2D"], "meta_score": 80, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/46fa332839b976230608773e4bb2e29e-98.jpg", "descriptions": "Since its debut in 1994, the KOF fighting game series has been driving the world to excitement with its appealing characters and unique game system. Six years have passed since the last title in the series, and now KOF XV surpasses all of its predecessors in terms of graphics, systems, andSince its debut in 1994, the KOF fighting game series has been driving the world to excitement with its appealing characters and unique game system. Six years have passed since the last title in the series, and now KOF XV surpasses all of its predecessors in terms of graphics, systems, and online experience! '- A total of 39 characters are participating! Classic popular characters, revived characters, new characters, and more! The most epic dream match in KOF history is about to begin!\r - KOF's story reaches its climax!\rThe latest KOF Saga continues from the previous title in Story Mode. This time, the story is coming to an explosive climax!\r - The culmination of the series' battle system\rInheriting the series' traditional 3-on-3 team battle, KOF XV also features a new system. Enjoy an unprecedented sense of speed and freshness!\r - Easy and versatile online play\rRollback netcode has been adopted to reduce lag in online matches. There are also a variety of battle options that allow you to choose how you want to play!\r - KOF is fully packed with content to enjoy\rIncludes a Gallery with movies and voices, and a new DJ STATION with over 300 popular songs from the KOF series and more.… Expand"}, {"name": "Puyo Puyo Tetris 2", "details_link": "https://www.metacritic.com/game/playstation-4/puyo-puyo-tetris-2", "publisher": "Sega", "release_date": "Dec  8 2020", "developers": ["Sega"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Puzzle", "Matching"], "meta_score": 80, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/da6d1a813dc929b27e65c62ee48c9df2-98.jpg", "descriptions": "Japan's beloved puzzle game series Puyo Puyo and the world renowned Tetris game franchise have teamed up again to deliver even more Puyo popping and Tetrimino clearing fun in Puyo Puyo Tetris 2. Playing is easy: match 4 or more same coloured Puyos or complete a line of blocks to clear themJapan's beloved puzzle game series Puyo Puyo and the world renowned Tetris game franchise have teamed up again to deliver even more Puyo popping and Tetrimino clearing fun in Puyo Puyo Tetris 2. Playing is easy: match 4 or more same coloured Puyos or complete a line of blocks to clear them from your board and dump Garbage into your opponent's game. But keep an eye on what's coming your way too.Play traditional Puyo Puyo and Tetris or mix them together to level up your game. Offline or online, you'll have loads of modes that let you play the way you want from single player Adventure to couch competition Versus to ranked Online matches, and more.… Expand"}, {"name": "OneShot", "details_link": "https://www.metacritic.com/game/pc/oneshot", "publisher": "Degica", "release_date": "Dec  8 2016", "developers": ["Team Oneshot"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Puzzle", "Action", "General"], "meta_score": 80, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/7/44ba2a3ccfb919c546a101d8c4b309d1-98.jpg", "descriptions": "OneShot is a surreal top down Puzzle/Adventure game with unique gameplay capabilities. You are to guide a child through a mysterious world on a mission to restore its long-dead sun. The world knows you exist."}, {"name": "Score Rush Extended", "details_link": "https://www.metacritic.com/game/playstation-4/score-rush-extended", "publisher": "Xona Games", "release_date": "May 31 2016", "developers": ["Xona Games"], "platforms": "PlayStation 4", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/a84204ec44e746996d80518083d1c498-98.jpg", "descriptions": "Score Rush Extended is a widescreen bullet-hell dual-stick shmup — a 4-player overhead-scrolling 2D shooter chock full of power-ups, enemies, and bosses. The Playstation 4 version features updated gameplay and new artwork and features Dual Play (control 2 fighters as once) and Boss RushScore Rush Extended is a widescreen bullet-hell dual-stick shmup — a 4-player overhead-scrolling 2D shooter chock full of power-ups, enemies, and bosses. The Playstation 4 version features updated gameplay and new artwork and features Dual Play (control 2 fighters as once) and Boss Rush modes. [Xona Games]… Expand"}, {"name": "Star Wars: Battlefront", "details_link": "https://www.metacritic.com/game/xbox/star-wars-battlefront", "publisher": "LucasArts", "release_date": "Sep 20 2004", "developers": ["Pandemic Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/45fdba02c28a7ea4d207df9e4be02265-98.jpg", "descriptions": "Star Wars Battlefront puts you in the heat of the action as you relive all of the intense battles from the classic and prequel eras of the Star Wars universe. You'll fight in more than 15 environments across 10 diverse planets, including Hoth, Geonosis, Yavin, Tatooine, and Naboo. You canStar Wars Battlefront puts you in the heat of the action as you relive all of the intense battles from the classic and prequel eras of the Star Wars universe. You'll fight in more than 15 environments across 10 diverse planets, including Hoth, Geonosis, Yavin, Tatooine, and Naboo. You can play as one of more than 20 different soldier types from four factions, as well as take control of 15 diverse ground and air vehicles, such as the AT-ST, X-Wing, and speeder bike.… Expand"}, {"name": "MX Unleashed", "details_link": "https://www.metacritic.com/game/playstation-2/mx-unleashed", "publisher": "THQ", "release_date": "Feb 17 2004", "developers": ["Rainbow Studios"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 80, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/35a36904e0ad8b94963c16b6ea692ac7-98.jpg", "descriptions": "Rainbow Studios, the masters of off road racing games, returns to their heritage to bring the definitive next generation MX game to life. Challenge yourself in the ultimate off-road playground, a never before seen freeworld mode filled with treacherous terrain, mini games, and machine races.Rainbow Studios, the masters of off road racing games, returns to their heritage to bring the definitive next generation MX game to life. Challenge yourself in the ultimate off-road playground, a never before seen freeworld mode filled with treacherous terrain, mini games, and machine races. Go bar to bar against the top champions in the world through the season long Supercross and Outdoor National series in an extensive career mode. Prepare yourself for mud, dirt, high speeds, and serious attitude. [THQ]… Expand"}, {"name": "Kelly Slater's Pro Surfer", "details_link": "https://www.metacritic.com/game/xbox/kelly-slaters-pro-surfer", "publisher": "Activision", "release_date": "Sep 16 2002", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Surfing"], "meta_score": 80, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/a0f15e9d8ac9051e7d8f708e53f127f9-98.jpg", "descriptions": "Experience the rush of big-wave surfing and the surfer lifestyle as you search the globe for the world's best breaks. In Kelly Slater's Pro Surfer, you'll play Kelly Slater, or one of eight other surfers, in exotic locations with more than 30 challenging levels to explore. Drop down hugeExperience the rush of big-wave surfing and the surfer lifestyle as you search the globe for the world's best breaks. In Kelly Slater's Pro Surfer, you'll play Kelly Slater, or one of eight other surfers, in exotic locations with more than 30 challenging levels to explore. Drop down huge waves, ride barreling tubes, and pull off exciting trick combinations and signature pro moves. The game features multiple gameplay modes, including a Surf Trip where you choose your own path in search of the perfect wave. … Expand"}, {"name": "NHL 2K2", "details_link": "https://www.metacritic.com/game/dreamcast/nhl-2k2", "publisher": "Sega", "release_date": "Feb 14 2002", "developers": ["Treyarch"], "platforms": "Dreamcast", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/d1786b5d81c7c9017dcb2b43c3d93cce-98.jpg", "descriptions": "NHL 2K2 is a great game of hockey that any hockey fan who owns a Dreamcast should really consider picking up."}, {"name": "Fire Pro Wrestling", "details_link": "https://www.metacritic.com/game/game-boy-advance/fire-pro-wrestling", "publisher": "Bam Entertainment", "release_date": "Jun 10 2001", "developers": ["Spike"], "platforms": "Game Boy Advance", "num_players": "1-3 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/f7a45e2fa43a81f0f3bcc18ab6b591b8-98.jpg", "descriptions": "Step into the Fire Pro Wrestling ring and experience blistering hot wrestling action that will blow you away! Extreme Wrestlers. Masked Luchadores. Martial Artists. Ultimate Fighters. They're all here and they all have one mission--win at any cost. Chose Slams. Flying Backbreakers. PileStep into the Fire Pro Wrestling ring and experience blistering hot wrestling action that will blow you away! Extreme Wrestlers. Masked Luchadores. Martial Artists. Ultimate Fighters. They're all here and they all have one mission--win at any cost. Chose Slams. Flying Backbreakers. Pile Drivers. Skull Crushers. No move is too extreme and nothing is illegal unless you get caught!… Expand"}, {"name": "Spider-Man", "details_link": "https://www.metacritic.com/game/dreamcast/spider-man", "publisher": "Activision", "release_date": "Apr 19 2001", "developers": ["Treyarch"], "platforms": "Dreamcast", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/97c35a3fa425efe916ed1a1b1953e30a-98.jpg", "descriptions": "He spins a web, swings across the sky and lands with a somersault onto the Daily Bugle building. Who is this masked hero? It's you! Fight, jump and web-sling as Spider-Man as you take on a legion of sinister villains. The city is depending on you. Start swinging..."}, {"name": "Pilotwings 64", "details_link": "https://www.metacritic.com/game/nintendo-64/pilotwings-64", "publisher": "Nintendo", "release_date": "Sep 29 1996", "developers": ["Paradigm Entertainment"], "platforms": "Nintendo 64", "num_players": "1 Player", "genres": ["Simulation", "General"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/49637cf29e3916219b65cb183f5df5e3-98.jpg", "descriptions": "Forget about those other flying games. This is the ultimate flight experience! Pilotwings 64 carries you off into a vast three-dimensional environment. Pilot several different vehicles and take in breathtaking sights! Successfully complete flight tests to earn your flight badge. Get a highForget about those other flying games. This is the ultimate flight experience! Pilotwings 64 carries you off into a vast three-dimensional environment. Pilot several different vehicles and take in breathtaking sights! Successfully complete flight tests to earn your flight badge. Get a high enough score and you'll get a chance at bonus games such as Cannonball and Sky Diving! Soar into the wild blue yonder with Pilotwings 64!… Expand"}, {"name": "Need for Speed: Rivals", "details_link": "https://www.metacritic.com/game/playstation-4/need-for-speed-rivals", "publisher": "Electronic Arts", "release_date": "Nov 15 2013", "developers": ["Ghost Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 80, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/57e58d371cfed26e00ff669a1c6f1496-98.jpg", "descriptions": "Need for Speed Rivals inserts gamers behind the wheel of both sides of the thin blue line, daring them to cross that line as either a cop or racer in order to gain any advantage in the street’s ultimate rivalry. Players decide between two distinct career experiences, each with its own set ofNeed for Speed Rivals inserts gamers behind the wheel of both sides of the thin blue line, daring them to cross that line as either a cop or racer in order to gain any advantage in the street’s ultimate rivalry. Players decide between two distinct career experiences, each with its own set of high-stakes challenges, rewards, pursuit tech and cars. The intensity of the action is enhanced as a result of AllDrive, a feature that destroys the line between single player, co-op and multiplayer. Through AllDrive, friends are connected to one racing world where their races and chases can collide at any time.… Expand"}, {"name": "Warhammer 40,000: Dawn of War II - Retribution", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-dawn-of-war-ii---retribution", "publisher": "THQ", "release_date": "Feb 28 2011", "developers": ["Relic", "Relic Entertainment"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/327ef7f80cda756f1a618718e3635897-98.jpg", "descriptions": "It is ten years since the events of Chaos Rising and Sub-Sector Aurelia has been in a constant state of warfare with the Imperium struggling to retain control. The apparent betrayal of the chapter by Gabriel Angelos and his Space Marines has shaken the Blood Ravens and now the ImperialIt is ten years since the events of Chaos Rising and Sub-Sector Aurelia has been in a constant state of warfare with the Imperium struggling to retain control. The apparent betrayal of the chapter by Gabriel Angelos and his Space Marines has shaken the Blood Ravens and now the Imperial forces are beset on all sides by hostile aliens. Retribution allows the player to select the race of their choosing in a battle to determine the very survival or destruction of the entire sector. … Expand"}, {"name": "Zero D Beat Drop", "details_link": "https://www.metacritic.com/game/xbox-360/zero-d-beat-drop", "publisher": "Arc System Works", "release_date": "Nov 11 2009", "developers": ["Cyclone Zero"], "platforms": "Xbox 360", "num_players": "1-4 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/b52dea1c11d3aefde651283cd96af4ae-98.jpg", "descriptions": "[Xbox Live Arcade]  The fusion of \"rhythm\" and \"puzzle\" creates a completely new kind of game in 0D Beat Drop! Drop pieces along with the beat, and go for the win with explosive chains. In addition to the single player mode with over 100 stages, online play includes options such as playing[Xbox Live Arcade]  The fusion of \"rhythm\" and \"puzzle\" creates a completely new kind of game in 0D Beat Drop! Drop pieces along with the beat, and go for the win with explosive chains. In addition to the single player mode with over 100 stages, online play includes options such as playing against a single player, playing with four players total, or having a team battle! The unique \"Beat-O-Matic\" function analyzes your own songs and lets you use them in the game. Feel the rhythm of the beat! [Arc System Works]… Expand"}, {"name": "Capcom Arcade Stadium", "details_link": "https://www.metacritic.com/game/switch/capcom-arcade-stadium", "publisher": "Capcom", "release_date": "Feb 17 2021", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/cdb063fe0f11ba3255d45d2a38388642-98.jpg", "descriptions": "Relive the Capcom classics!1943 -The Battle of Midway-comes as a free download. Shooters, fighting, action—all your favorite genres in this exciting collection! Capcom Arcade Stadium brings back all the nostalgia of the arcade, while adding in new and exciting features you'll wish you hadRelive the Capcom classics!1943 -The Battle of Midway-comes as a free download. Shooters, fighting, action—all your favorite genres in this exciting collection! Capcom Arcade Stadium brings back all the nostalgia of the arcade, while adding in new and exciting features you'll wish you had back then. Just Like the Good Old Days\rFrom 3D-rendered arcade cabinets to scanline filters, there's everything you need to recreate that arcade atmosphere. Fully customizable display settings let you craft your own personal experience and truly relive the glory days of arcade gaming.\r Brand New Ways to Play\rWith gameplay rewind, speed adjustment, and the ability to save and load your game at any time, your old favorites will feel new all over again!\rEvery game has online leaderboard rankings, so you can see where you stack up against players all over the world!\rCapcom Arcade Stadium, where retro appeal meets cutting-edge features for a fresh take on Capcom's classics!… Expand"}, {"name": "NHL 16", "details_link": "https://www.metacritic.com/game/xbox-one/nhl-16", "publisher": "Electronic Arts", "release_date": "Sep 15 2015", "developers": ["EA Sports", "EA Canada"], "platforms": ["PlayStation 4", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Sports", "Team", "Ice Hockey", "Sim"], "meta_score": 80, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/792cc43da85a66ba8193b9bf38a35d41-98.jpg", "descriptions": "Players who are drawn to team experiences can jump into either 6 v. 6 Online Team Play, Online Couch Co-op, or the EA SPORTS Hockey League, that’s been re-formulated to deliver a new player class system for a more competitive and balanced experience. Players who want to build their ownPlayers who are drawn to team experiences can jump into either 6 v. 6 Online Team Play, Online Couch Co-op, or the EA SPORTS Hockey League, that’s been re-formulated to deliver a new player class system for a more competitive and balanced experience. Players who want to build their own legacy can dive into Be-A-Pro, which allows them to start their career in the minors and takes them through a new progression system where how they play on the ice shapes who they become in the NHL. And if players are more akin to armchair GMs, not only can they navigate the machinations of draft day and manage their AHL affiliate team, they can now also manage the morale of individual players on their team.… Expand"}, {"name": "Hand of Fate", "details_link": "https://www.metacritic.com/game/xbox-one/hand-of-fate", "publisher": "Defiant Development", "release_date": "Feb 18 2015", "developers": ["Defiant Development"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Role-Playing", "Miscellaneous", "General", "Board / Card Game"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/d2aeef60982228e96131c277c7d8ca57-98.jpg", "descriptions": "In Hand of Fate, players collect equipment, items, artifacts and enemies as in-game collectible cards in a card based RPG; then play their deck, bringing to video game life a beautiful 3D world in which gamers make difficult decisions.  Sometimes their choices have unexpected consequencesIn Hand of Fate, players collect equipment, items, artifacts and enemies as in-game collectible cards in a card based RPG; then play their deck, bringing to video game life a beautiful 3D world in which gamers make difficult decisions.  Sometimes their choices have unexpected consequences and players must crush their foes utilizing a third person action-adventure combat system. The more bosses a player defeats, the more cards they obtain.… Expand"}, {"name": "ZEN Pinball", "details_link": "https://www.metacritic.com/game/playstation-3/zen-pinball", "publisher": "Zen Studios", "release_date": "May 14 2009", "developers": ["Zen Studios"], "platforms": ["iPhone/iPad", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/ec557ae3f22b21125c9f301bdfd91749-98.jpg", "descriptions": "[Playstation Network]  ZEN Pinball delivers a variety of in-game missions, head-to-head online multi-player bouts and multi-day worldwide tournaments. In addition to the regular All-Time and Weekly scoreboards, ZEN Pinball features Score Speed, Best One Minute, and Multi-player Ranking[Playstation Network]  ZEN Pinball delivers a variety of in-game missions, head-to-head online multi-player bouts and multi-day worldwide tournaments. In addition to the regular All-Time and Weekly scoreboards, ZEN Pinball features Score Speed, Best One Minute, and Multi-player Ranking scoreboards, letting players test their mettle against pinball players from all over the world! [ZEN Studios]… Expand"}, {"name": "Dead Rising 2", "details_link": "https://www.metacritic.com/game/playstation-3/dead-rising-2", "publisher": "Capcom", "release_date": "Sep 28 2010", "developers": ["Blue Castle Games"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Horror", "Horror", "Open-World"], "meta_score": 80, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/acaf3bcb2e34f57dfb14648185671db7-98.jpg", "descriptions": "Dead Rising 2 takes the franchise to a new level of zombie-killing fun with tens of thousands of zombies, the all new gambling paradise of Fortune City to explore and conquer plus a host of new in-game objects that can all be used as deadly weapons to stave off the zombie assault. DeadDead Rising 2 takes the franchise to a new level of zombie-killing fun with tens of thousands of zombies, the all new gambling paradise of Fortune City to explore and conquer plus a host of new in-game objects that can all be used as deadly weapons to stave off the zombie assault. Dead Rising 2 is set several years after the infamous zombie invasion of Willamette. Unfortunately, the zombie virus was not contained at the conclusion of Dead Rising, spreading unchecked throughout the United States and Dead Rising 2 depicts a country where zombie outbreaks continue to strike. [Capcom]… Expand"}, {"name": "The Red Strings Club", "details_link": "https://www.metacritic.com/game/pc/the-red-strings-club", "publisher": "Devolver Digital", "release_date": "Jan 22 2018", "developers": ["Deconstructeam"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/1c12de512ec1377781f6c1934866722a-98.jpg", "descriptions": "The Red Strings Club is a cyberpunk narrative experience about fate and happiness featuring the extensive use of pottery, bartending and impersonating people on the phone to take down a corporate conspiracy."}, {"name": "Fuser", "details_link": "https://www.metacritic.com/game/switch/fuser", "publisher": "NCSOFT", "release_date": "Nov  9 2020", "developers": ["Harmonix Music Systems"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 12 ", "genres": ["Action", "Rhythm", "Music"], "meta_score": 80, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/07035240954efa8e02eef03fe6c91f4f-98.jpg", "descriptions": "Work your way from the basics of mixing all the way to expert level techniques as you perform shows across 6 larger than life stage venues, each with its own signature style."}, {"name": "Valfaris", "details_link": "https://www.metacritic.com/game/xbox-one/valfaris", "publisher": "Big Sugar Films", "release_date": "Nov 15 2019", "developers": ["Steel Mantis"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/daad649789adc3e3b3021de22b6309f9-98.jpg", "descriptions": "Set in the far reaches of space, Valfaris is a heavy metal infused 2D action-platformer and the next game from the team behind Unity Awards finalist, Slain: Back From Hell. Brutal combat. Deadly enemies. Stunning pixel art. Savage soundtrack. Get ready to rip the galaxy a new wormhole."}, {"name": "Bury Me, My Love", "details_link": "https://www.metacritic.com/game/pc/bury-me-my-love", "publisher": "Playdius", "release_date": "Jan 10 2019", "developers": ["The Pixel Hunt"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 80, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/5/7e90123e5fa41c0345b6e9e893adc199-98.jpg", "descriptions": "Bury me, my Love tells the story of Syrian refugee Nour and her husband Majd, as Nour undertakes a perilous journey to safety in Europe."}, {"name": "Ghost 1.0", "details_link": "https://www.metacritic.com/game/pc/ghost-10", "publisher": "@unepic_fran", "release_date": "Jun  7 2016", "developers": ["@unepic_fran"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "Metroidvania"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/84f56cf007fe7fc375daf8388dd7fdfe-98.jpg", "descriptions": "A mysterious agent, capable of becoming a digital ghost, sneaks aboard the Nakamura Space Station. This is where the fun begins: the station is well-protected with its heavy defences, never-ending arsenal of weapons, and mysterious artifacts. It will all have to be destroyed."}, {"name": "Virtua Tennis 3", "details_link": "https://www.metacritic.com/game/xbox-360/virtua-tennis-3", "publisher": "Sega", "release_date": "Mar 20 2007", "developers": ["Sumo Digital"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "16  Online", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/e488bdb3f7335ecce942601fc0f04457-98.jpg", "descriptions": "With Virtua Tennis 3, the series returns with enhanced photo-realistic graphics and advanced player animations that perfectly match the behavior and mannerisms of individual professional athletes. In Career Mode, gamers travel the world and take on the biggest stars of the tennis world.With Virtua Tennis 3, the series returns with enhanced photo-realistic graphics and advanced player animations that perfectly match the behavior and mannerisms of individual professional athletes. In Career Mode, gamers travel the world and take on the biggest stars of the tennis world. Improvements to the Player Creation Mode allow gamers to customize their own tennis star with a wealth of licensed tennis equipment and increased detail. No Virtua Tennis title would be complete without the popular and addictive mini-games, and Virtua Tennis 3 is no exception. In addition to the popular mini-games from previous titles used to sharpen players' skills, there are a host of brand new games to keep players in top form. [Sega]… Expand"}, {"name": "Bit.Trip Beat", "details_link": "https://www.metacritic.com/game/wii/bittrip-beat", "publisher": "Nintendo", "release_date": "Mar 16 2009", "developers": ["Gaijin Games"], "platforms": ["iPhone/iPad", "PC", "Switch", "Wii"], "num_players": "1-4 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/68bcc27a61a77b3abb96db63c48f2233-98.jpg", "descriptions": "[WiiWare]  BIT.TRIP BEAT is a rhythm game that brings retro action into the present, letting you use the motion-sensing Wii Remote controller to bounce beats. Retro visuals, classic game play, four-player multiplayer and an 8-bit soundtrack will get you in the zone and rock your world. The[WiiWare]  BIT.TRIP BEAT is a rhythm game that brings retro action into the present, letting you use the motion-sensing Wii Remote controller to bounce beats. Retro visuals, classic game play, four-player multiplayer and an 8-bit soundtrack will get you in the zone and rock your world. The challenges are mighty, but if you can stay cool as the difficulty increases, you'll discover the beginnings of the BIT.TRIP saga. [Nintendo]… Expand"}, {"name": "Pro Evolution Soccer 2012", "details_link": "https://www.metacritic.com/game/playstation-3/pro-evolution-soccer-2012", "publisher": "Konami", "release_date": "Sep 27 2011", "developers": ["Konami"], "platforms": ["3DS", "PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Football", "Soccer", "Sim", "Sim"], "meta_score": 80, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/4e2ff75ca9475f2079ff65b6b0726e4d-98.jpg", "descriptions": "Pro Evolution Soccer 2012 is the latest annual update to the long-running football franchise, once known as Winning Eleven."}, {"name": "Donkey Kong Country 2", "details_link": "https://www.metacritic.com/game/game-boy-advance/donkey-kong-country-2", "publisher": "Nintendo", "release_date": "Nov 15 2004", "developers": ["Rare Ltd."], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/66faa99b6ebb149597f5c1d15d6a70f8-98.jpg", "descriptions": "The Donkey Kong Country series returns to the Game Boy Advance in a sequel that features Dixie Kong. She and Diddy Kong must team up to rescue Donkey Kong from the evil Kaptain K. Rool. You'll play as both Diddy and Dixie, and master their different attacks. Test your skills and beat theThe Donkey Kong Country series returns to the Game Boy Advance in a sequel that features Dixie Kong. She and Diddy Kong must team up to rescue Donkey Kong from the evil Kaptain K. Rool. You'll play as both Diddy and Dixie, and master their different attacks. Test your skills and beat the clock in Diddy's Dash, or race against your friends to see who's the fastest. You can play the game solo or challenge your friends in new bonus games such as Funky's Flights and Bag a Bug.… Expand"}, {"name": "Cloning Clyde", "details_link": "https://www.metacritic.com/game/xbox-360/cloning-clyde", "publisher": "NinjaBee", "release_date": "Jul 19 2006", "developers": ["NinjaBee"], "platforms": ["PC", "Xbox 360"], "num_players": "4  Online", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/7188671af930d50d7564858fe46fa503-98.jpg", "descriptions": "[Xbox Live Arcade]  Have you ever been cloned? Ever wonder what it would be like to be a chicken? A monkey? A frog? Cloning Clyde is a 3-D side-scrolling adventure, featuring (of course!) multiplayer gameplay. Play split screen on a single console, or mutate online with your friends across[Xbox Live Arcade]  Have you ever been cloned? Ever wonder what it would be like to be a chicken? A monkey? A frog? Cloning Clyde is a 3-D side-scrolling adventure, featuring (of course!) multiplayer gameplay. Play split screen on a single console, or mutate online with your friends across the world. Can you free yourselves from the myriad sinister traps and mutations that await you? Get Cloning today and find out. Play as a variety of mutant Clydes, each with unique abilities, including Chicken-Clyde, Frog-Clyde, Sheep-Clyde, and more. Play not only as Clyde himself, but also as his hundreds of clones. On a single console, join with a friend in co-op mode, or go crazy with four player versus mode. Solve exciting and addictive puzzles with a variety of resolutions. Enjoy hours of fun with two distinct game modes including 40 cooperative levels and six versus arenas. Play online through Xbox Live with up to eight friends. [Microsoft]… Expand"}, {"name": "Aaero", "details_link": "https://www.metacritic.com/game/xbox-one/aaero", "publisher": "Mad Fellows Ltd", "release_date": "Apr 11 2017", "developers": ["Mad Fellows Ltd"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Rail"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/a2a11d88b19ffb2b99dd7273d5a97690-98.jpg", "descriptions": "Speed through stunning, stylized environments tracing ribbons of light, releasing the energy in the music. Battle strange enemies and fight epic boss battles all driven by an incredible licensed soundtrack. Featuring music from Noisia, Flux Pavilion, Katy B, The Prototypes, Neosignal and many more."}, {"name": "Magic: Duels of the Planeswalkers 2014", "details_link": "https://www.metacritic.com/game/playstation-3/magic-duels-of-the-planeswalkers-2014", "publisher": "Wizards of the Coast", "release_date": "Jun 25 2013", "developers": ["Stainless Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 80, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/175f6805d141567221994f62bb3e9530-98.jpg", "descriptions": "Available on the Android platform for the first time ever in addition to iPad, Xbox LIVE Arcade, Steam and PlayStation Network, Magic 2014 - Duels of the Planeswalkers will offer players exciting new features as they partner with Planeswalker Chandra Nalaar to track down a manipulative andAvailable on the Android platform for the first time ever in addition to iPad, Xbox LIVE Arcade, Steam and PlayStation Network, Magic 2014 - Duels of the Planeswalkers will offer players exciting new features as they partner with Planeswalker Chandra Nalaar to track down a manipulative and dangerous Planeswalker foe. An immersive storyline and strong integration with the Magic 2014 - Core Set ties the experience together for players, culminating in an end-of-summer Magic Celebration that brings all Magic fans together in stores across the world.… Expand"}, {"name": "Pokemon Conquest", "details_link": "https://www.metacritic.com/game/ds/pokemon-conquest", "publisher": "Nintendo", "release_date": "Jun 18 2012", "developers": ["Koei", "Koei Tecmo Games"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/ac8b2831161f28bc5b8e6e19a1673b33-98.jpg", "descriptions": "In Pokemon Conquest, players take on the role of a young Warlord who is linked with a Pokemon. Together, they must set out to recruit Warrior allies to strengthen their growing kingdom. Along their journey, players will encounter a variety of Pokemon, as well as Warriors and WarlordsIn Pokemon Conquest, players take on the role of a young Warlord who is linked with a Pokemon. Together, they must set out to recruit Warrior allies to strengthen their growing kingdom. Along their journey, players will encounter a variety of Pokemon, as well as Warriors and Warlords inspired by the Japanese feudal era. The game contains nearly 200 Pokemon, including many from the recent Pokemon Black Version and Pokemon White Version games, which have sold more than 4 million copies combined in the United States.\r As the battlefield unfolds in Pokemon Conquest, players must choose the correct Pokemon type to inflict maximum damage on their opponents. In the turn-based skirmishes, players choose different tactics for intense six-on-six battles, and battle conditions can change on every turn, keeping players on their toes in anticipation of what will happen next.… Expand"}, {"name": "Have a Nice Death", "details_link": "https://www.metacritic.com/game/switch/have-a-nice-death", "publisher": "Gearbox Publishing", "release_date": "Mar 22 2023", "developers": ["Magic Design Studios"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/3b48e94207eb226deed332e988cccb1f-98.jpg", "descriptions": "Have a Nice Death is a 2D action roguelike where you play as an overworked Death, whose employees have run rampant, completely throwing off the balance of souls - and his vacation plans. In order to restore order, you'll have to grab your trusty scythe and show your employees who's boss.Have a Nice Death is a 2D action roguelike where you play as an overworked Death, whose employees have run rampant, completely throwing off the balance of souls - and his vacation plans. In order to restore order, you'll have to grab your trusty scythe and show your employees who's boss. Since Death can't die, use what you've learned and earned to overcome the numerous minions and bosses in each department of Death Incorporated... over and over. A performance review after every run guarantees that you'll unlock interesting items and upgrades that will help you progress on your journey.… Expand"}, {"name": "Street Fighter: 30th Anniversary Collection", "details_link": "https://www.metacritic.com/game/xbox-one/street-fighter-30th-anniversary-collection", "publisher": "Capcom", "release_date": "May 29 2018", "developers": ["Capcom", "Digital Eclipse"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/4f0b6ac01874d27b01fbbf87247198b2-98.jpg", "descriptions": "Celebrate the 30th Anniversary of the iconic Street Fighter franchise with the ultimate tribute to its arcade legacy in the Street Fighter 30th Anniversary Collection. This content-rich all-in-one package highlights the series' past in an anthology of 12 classic titles with arcade-perfectCelebrate the 30th Anniversary of the iconic Street Fighter franchise with the ultimate tribute to its arcade legacy in the Street Fighter 30th Anniversary Collection. This content-rich all-in-one package highlights the series' past in an anthology of 12 classic titles with arcade-perfect balancing including the original Street Fighter, Street Fighter II, Street Fighter II: Champion Edition, Street Fighter II: Hyper Fighting, Super Street Fighter II, Super Street Fighter II: Turbo, Street Fighter Alpha, Street Fighter Alpha 2, Street Fighter Alpha 3, Street Fighter III, Street Fighter III: 2nd Impact and Street Fighter III: Third Strike.The collection also offers a definitive online experience across four of the included titles; Street Fighter II: Hyper Fighting, Super Street Fighter II: Turbo, Street Fighter Alpha 3 and Street Fighter III: Third Strike. Street Fighter players can recreate the classic arcade gaming experience by competing against the CPU whilst waiting for friends in online battles where they can put their fighting skills to the ultimate test. Fans of the series can also enjoy diving into the past 30 years of Street Fighter history with rich character bios, a huge Museum Mode including never before seen art and interactive timeline, and listen to tracks in the Music Player.GAMEPLAY FEATURES:* Celebrate 30 years of the most iconic fighting game series The hit series with over 39 million units in global sales returns for its 30th anniversary celebration with a compilation of 12 classic arcade titles in one package.* Relive the titles that made gaming history Includes the original Street Fighter released in 1987 which introduced two of gaming's most famous heroes, Ryu and Ken. Additionally, the iconic Street Fighter II became the first ever one-on-one video game that gave players a choice of characters, including the debut of the series' strongest female Chun-Li. Street Fighter III continued the core numbered series and was the first game to introduce the parry attack.* New gameplay options including online play Players can utilize save states as they progress through the game offline. In addition, players can duke it out online in four classic titles (Street Fighter II: Hyper Fighting, Super Street Fighter II: Turbo, Street Fighter Alpha 3 and Street Fighter III: Third Strike). In addition to Ranked and Casual Match options, up to four players can join a lobby where they can play against the CPU while waiting for their match. Each title will have their own Global leaderboard and the \"rewind\" tech ensures low-latency online battles.* Hadoken your way down memory lane Revisit historic moments from the series and explore an interactive timeline of events that helped create one of the world's leading fighting game series. View stunning pieces of concept art and uncover little known facts behind each game release.* Learn more about fan-favorite characters Scroll through character bios and learn new details about series favorites whilst enjoying sprites and key animations to see how the classic fighters have evolved over time.* Remember the tunes! Sit back and enjoy the most memorable Street Fighter tracks from the collection in the Music Player.… Expand"}, {"name": "Grand Theft Auto Online", "details_link": "https://www.metacritic.com/game/xbox-360/grand-theft-auto-online", "publisher": "Rockstar Games", "release_date": "Oct  1 2013", "developers": ["Rockstar North"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 80, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/6/fa317cf59352d078c37d803cb4b5694b-98.jpg", "descriptions": "Grand Theft Auto Online is a dynamic and persistent online world for SIXTEEN players that begins by sharing gameplay features, geography and mechanics with Grand Theft Auto V, but continues to expand and evolve with new content created by Rockstar Games and the Grand Theft Auto community.Grand Theft Auto Online is a dynamic and persistent online world for SIXTEEN players that begins by sharing gameplay features, geography and mechanics with Grand Theft Auto V, but continues to expand and evolve with new content created by Rockstar Games and the Grand Theft Auto community. Grand Theft Auto Online takes the fundamental Grand Theft Auto concepts of freedom, ambient activity and mission-based gameplay and makes them available to multiple players in a detailed and responsive online world. In GTA Online, players have the freedom to explore alone or with friends, work cooperatively to complete missions, come together to participate in activities and ambient events, or compete in traditional game modes with the larger community, all with the personality and refined mechanics of Grand Theft Auto V. Players can invest in their character through customizing their appearance, improving their stats, owning customized vehicles, purchasing personal property, and taking part in missions, jobs and activities to earn reputation and cash to open up new opportunities to rise through the criminal ranks. The world of Grand Theft Auto Online will constantly grow and change as new content is added, creating the first ever persistent and dynamic Grand Theft Auto game world. Access to Grand Theft Auto Online is free with every retail copy of Grand Theft Auto V. [Rockstar Games]… Expand"}, {"name": "Counter-Strike: Global Offensive", "details_link": "https://www.metacritic.com/game/playstation-3/counter-strike-global-offensive", "publisher": "Valve Software", "release_date": "Aug 21 2012", "developers": ["Valve Software", "Hidden Path Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern"], "meta_score": 80, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/9411f81025f1996446d5e25420f66107-98.jpg", "descriptions": "Counter-Strike: Global Offensive features new maps, characters, and weapons and\rdelivers updated versions of the classic CS content."}, {"name": "NBA Live 06", "details_link": "https://www.metacritic.com/game/psp/nba-live-06", "publisher": "EA Sports", "release_date": "Oct  4 2005", "developers": ["EA Canada"], "platforms": ["PC", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/6bacd872172ed220b9be73274de647fd-98.jpg", "descriptions": "Freestyle Superstars: You are in control of the top NBA stars, performing like their real-life counterparts based on distinct character types, including Power, Playmaker, Stopper and more. Authentic 5-on-5 Gameplay: The all-new animation system helps to visually present the up-tempo,Freestyle Superstars: You are in control of the top NBA stars, performing like their real-life counterparts based on distinct character types, including Power, Playmaker, Stopper and more. Authentic 5-on-5 Gameplay: The all-new animation system helps to visually present the up-tempo, fast-break brand of basketball that makes the NBA thrive. Also featured, is an improved transition game and a more physical brand of play with collisions and dunked-on scenarios. New Player Visuals: A new graphics engine now has player models not only playing and acting like their real life counterparts, but looking the part with striking detail and realism. [Electronic Arts]… Expand"}, {"name": "The Legend of Heroes: Trails of Cold Steel", "details_link": "https://www.metacritic.com/game/playstation-4/the-legend-of-heroes-trails-of-cold-steel", "publisher": "XSEED Games", "release_date": "Mar 26 2019", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/469e3ef8ca9d7a5c4dac44edf7d2077d-98.jpg", "descriptions": "Among the nations on the Zemurian continent, the mighty Erebonian Empire has been quick to stake its claim militarily; yet politically, ugly bouts of internal conflict between the upper class and commoners struggling to rise to power have been steadily intensifying with each passing month.Among the nations on the Zemurian continent, the mighty Erebonian Empire has been quick to stake its claim militarily; yet politically, ugly bouts of internal conflict between the upper class and commoners struggling to rise to power have been steadily intensifying with each passing month. The Noble and Reformist Factions have been none too kind to one another over the years, and tensions between the two only stand to worsen if compromises aren't reached in the very near future.\r Rean Schwarzer, like any other citizen of the Imperial nation, is no stranger to these rising conflicts: the class system has been deeply interwoven into the tapestry of Erebonian culture since the days of old. As a seventeen-year-old student preparing for his new life at Thors Military Academy, however, he notices that his crimson uniform differs from the standard outfits issued to his peerstypically green for commoners, and white for nobles.\r Enter, Class VII of Thors Military Academy. For the first time in the prestigious academy's history, rank means nothing and skill means everything. With nine hand-picked students of various backgrounds and abilities, Rean included, Class VII readies itself to dive deep into the political quagmire that threatens not only them, but the very foundations of the Empire.… Expand"}, {"name": "Yakuza Kiwami", "details_link": "https://www.metacritic.com/game/pc/yakuza-kiwami", "publisher": "Sega", "release_date": "Feb 19 2019", "developers": ["Ryu ga Gotoku Studios", "Lab42"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/8af075cbd7d58fe6b38e5f011a3503a9-98.jpg", "descriptions": "In 2005, a legend was born on the PlayStation 2 - the legend of Kazuma Kiryu, the Dragon of Dojima, in his video game debut with Yakuza. Now, 11 years after that release, a new generation of players will be able to experience the incomparable action and drama of the Yakuza series with theIn 2005, a legend was born on the PlayStation 2 - the legend of Kazuma Kiryu, the Dragon of Dojima, in his video game debut with Yakuza. Now, 11 years after that release, a new generation of players will be able to experience the incomparable action and drama of the Yakuza series with the rebuilt-from-scratch HD remake exclusive to PlayStation 4, Yakuza Kiwami.\r \"Kiwami\" means Extreme, and the game takes that concept to heart. It's not an HD-remaster or up-rezzing of PS2-era textures. Yakuza Kiwami was recreated from the ground up exclusively for the PlayStation 4. That means every visual element was optimized for the 1080p/60fps environment, every line of the script was re-recorded by series actors and for the first time in the West, gamers will be able to hear the original Japanese language track.\r Then there's the game itself! The PS2-era brawling gameplay is refined for the current gen with Kazuma Kiryu fighting his way through the ranks of Yakuza, only to wind up protecting a young girl whose aunt (who also happens to be Kiryu's childhood sweetheart) is missing... along with 10 billion yen.… Expand"}, {"name": "Olympia Soiree", "details_link": "https://www.metacritic.com/game/switch/olympia-soiree", "publisher": "Aksys Games", "release_date": "Sep  9 2021", "developers": ["Otomate"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/f0220540dba98af182fb929d620a7569-98.jpg", "descriptions": "With her entire clan wiped out years ago, Olympia has been isolated for most of her life. Now she lives as the only person on Tenguu Island who can perform a ritual that restores light to a world shrouded in darkness. The heads of each Primary district Red, Blue, and Yellow lead a societyWith her entire clan wiped out years ago, Olympia has been isolated for most of her life. Now she lives as the only person on Tenguu Island who can perform a ritual that restores light to a world shrouded in darkness. The heads of each Primary district Red, Blue, and Yellow lead a society governed by the island's rigid class structure.As Olympia travels between the districts, she discovers their wonders and their weaknesses, as well as an entire underground community of shunned individuals whom she becomes determined to help. If she can find the person destined to be her soulmate, she will finally be able to open her heart and reveal her true name, continue her bloodline, and save the world before it is destroyed.… Expand"}, {"name": "Final Fantasy Pixel Remaster", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-pixel-remaster", "publisher": "Square Enix", "release_date": "Jul 28 2021", "developers": ["Square Enix", "TOSE"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 80, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/21379c7bc6f4a4ad3111d4d7791d3784-98.jpg", "descriptions": "This is the ironically named game that started it all. You take control of the Warriors of Light, off on a journey to defeat four fiends and restore peace to the world.So many of the elements of the series that we've come to know and love make their debut right here in this very firstThis is the ironically named game that started it all. You take control of the Warriors of Light, off on a journey to defeat four fiends and restore peace to the world.So many of the elements of the series that we've come to know and love make their debut right here in this very first entry: a massive world full of mystery, some iconic monster designs and that incredible music.… Expand"}, {"name": "Faeria", "details_link": "https://www.metacritic.com/game/switch/faeria", "publisher": "Versus Evil", "release_date": "Aug 13 2020", "developers": ["Abrakam SA"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 80, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/5c362707d684e626e179398725656292-98.jpg", "descriptions": "With its unique living board, Faeria will challenge you with truly strategic card battles. Craft your deck, shape the battlefield, and fight for victory!\r\n\r\nA strategy game like no other. Build exciting decks and shape the battlefield as you fight epic battles. Raise mountains, build  With its unique living board, Faeria will challenge you with truly strategic card battles. Craft your deck, shape the battlefield, and fight for victory!\r A strategy game like no other. Build exciting decks and shape the battlefield as you fight epic battles. Raise mountains, build forests, fill lakes, or harness the sands of the deserts. You choose your own path to victory.\r Enjoy 100+ hours of solo content, co-operative missions, and puzzles! Explore a vast array of challenges that reward you in return. Journey through the Oversky and defeat devious World Bosses - or even play enemy AI in draft mode!\r Enter Pandora, Faeria's unique draft mode that where your deck-building skills are put to the ultimate test. Choose to play against the AI or put your deck to the ultimate test in PVP. Earn rewards based on how well you do. It’s the perfect way to increase your collection, or just have fun!\r… Expand"}, {"name": "Panzer Corps", "details_link": "https://www.metacritic.com/game/pc/panzer-corps", "publisher": "Slitherine", "release_date": "Jul 11 2011", "developers": ["The Lordz Games Studio"], "platforms": ["iPhone/iPad", "PC"], "num_players": "1-2 ", "genres": ["Strategy", "Turn-Based", "Real-Time", "Wargame", "Real-Time", "General", "Tactics"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/4f23b5f5ca58e737ee6f1ff896d224c0-98.jpg", "descriptions": "Panzer Corps will feature 26 scenarios on 21 unique maps, covering most major battles of the European Theatre of World War II and including a few hypothetical 'what if' scenarios based on your actions."}, {"name": "Virtua Tennis 3", "details_link": "https://www.metacritic.com/game/playstation-3/virtua-tennis-3", "publisher": "Sega", "release_date": "Mar 20 2007", "developers": ["Sega AM3"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/00fdacfc493aba47d372dec4a6fbdfb1-98.jpg", "descriptions": "With Virtua Tennis 3, the series returns with enhanced photo-realistic graphics and advanced player animations that perfectly match the behavior and mannerisms of individual professional athletes. In Career Mode, gamers travel the world and take on the biggest stars of the tennis world.With Virtua Tennis 3, the series returns with enhanced photo-realistic graphics and advanced player animations that perfectly match the behavior and mannerisms of individual professional athletes. In Career Mode, gamers travel the world and take on the biggest stars of the tennis world. Improvements to the Player Creation Mode allow gamers to customize their own tennis star with a wealth of licensed tennis equipment and increased detail. No Virtua Tennis title would be complete without the popular and addictive mini-games, and Virtua Tennis 3 is no exception. In addition to the popular mini-games from previous titles used to sharpen players' skills, there are a host of brand new games to keep players in top form. [Sega]… Expand"}, {"name": "Trauma Center: Second Opinion", "details_link": "https://www.metacritic.com/game/wii/trauma-center-second-opinion", "publisher": "Atlus", "release_date": "Nov 14 2006", "developers": ["Atlus"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "General", "General", "Virtual", "Career"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/5d1dbd5be5481a86f101fd6736f27349-98.jpg", "descriptions": "Trauma Center: Second Opinion is NOT a quick-and-dirty port of the DS title \"Trauma Center: Under the Knife.\" It has new graphics and animation; new surgical implements and operation types; a second playable character with new missions; multiple difficulty modes; and a revised control systemTrauma Center: Second Opinion is NOT a quick-and-dirty port of the DS title \"Trauma Center: Under the Knife.\" It has new graphics and animation; new surgical implements and operation types; a second playable character with new missions; multiple difficulty modes; and a revised control system that takes full advantage of the Wii Remote. It's a remake (or \"Wii-make,\" if you prefer) with gobs of added content. As with Under the Knife, the voice acting in Second Opinion is presented in the operation scenes to enhance the drama and punctuate the action. [Atlus USA]… Expand"}, {"name": "Grim Fandango Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/grim-fandango-remastered", "publisher": "Double Fine Productions", "release_date": "Jan 27 2015", "developers": ["Double Fine Productions"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "3D", "Third-Person", "Fantasy"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/912da846cd698eac36d8578cc810bebf-98.jpg", "descriptions": "Something is Rotten in the Land of the Dead... ...and you're being played for a sucker. He sells luxury packages to souls on their 4-year journey to eternal rest. But there is trouble in paradise. Help Manny untangle himself from a conspiracy that threatens his salvation."}]