[{"name": "The Blackout Club", "details_link": "https://www.metacritic.com/game/pc/the-blackout-club", "publisher": "Question", "release_date": "Jul 29 2019", "developers": ["Question"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 63, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/e3ee4eb8986b2c24e956721049d40afd-98.jpg", "descriptions": "The Blackout Club is a first-person co-op horror game centered around a group of teenage friends investigating a monstrous secret beneath the skin of their small town.Every night, everyone in town gets out of bed and sleepwalks. In the morning, they wake up with no recollection of whatThe Blackout Club is a first-person co-op horror game centered around a group of teenage friends investigating a monstrous secret beneath the skin of their small town.Every night, everyone in town gets out of bed and sleepwalks. In the morning, they wake up with no recollection of what happened or where they were.Some teenagers in this town woke up during a few of these \"Blackouts\" themselves, finding themselves in the woods or on train tracks with no idea how they got there. When they tell their parents, their teachers, the police... no one believes them. Taking matters into their own hands, they formed a club -- The Blackout Club -- to get to the bottom of it. Unfortunately, the recent disappearance of a close friend means that the sleepwalking isn't just strange - it could be deadly.You and your friends must team up to overcome the powerful forces that are arrayed against you. Using tools such as drones, noisemakers, and grappling hooks, you will outwit and outmaneuver the adults while attempting to obtain and record evidence that will prove what is happening to the rest of the world. With procedural elements that change goals, enemies, loot and more, no two nights in the neighborhood will be the same.… Expand"}, {"name": "Empire of Sin", "details_link": "https://www.metacritic.com/game/pc/empire-of-sin", "publisher": "Paradox Interactive", "release_date": "Dec  1 2020", "developers": ["Romero Games Ltd."], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 63, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/a02faf911066eb1fce11d961043a82b0-98.jpg", "descriptions": "Empire of sin, the strategy game from romero games and Paradox interactive, puts you at the heart of the ruthless criminal underworld of 1920S prohibition-era Chicago. It's up to you to Hustle, charm and intimidate your way to the top of the pile and do whatever it takes to stay there. ThisEmpire of sin, the strategy game from romero games and Paradox interactive, puts you at the heart of the ruthless criminal underworld of 1920S prohibition-era Chicago. It's up to you to Hustle, charm and intimidate your way to the top of the pile and do whatever it takes to stay there. This character-driven, noir-inspired game puts players smack dab in the glitz and glamor of the roaring 20S, all while working behind the scenes in the gritty underbelly of organized crime. … Expand"}, {"name": "Save Koch", "details_link": "https://www.metacritic.com/game/switch/save-koch", "publisher": "OverGamez", "release_date": "Mar  6 2020", "developers": ["Wooden Monkeys"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Adventure", "Real-Time", "General"], "meta_score": 63, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/00f6e1f3e353fb7a4e26f500ff6924ee-98.jpg", "descriptions": "In Save Koch you play mafia Godfather, who is basically besieged inside his own panic room. Danger-danger! Someone in the Сity decided to take your place, and there is a sleeper “mole” inside your Family, who is acting as we speak. Time is running out, you have only six days to solve theIn Save Koch you play mafia Godfather, who is basically besieged inside his own panic room. Danger-danger! Someone in the Сity decided to take your place, and there is a sleeper “mole” inside your Family, who is acting as we speak. Time is running out, you have only six days to solve the plot, resolve who is standing behind this conspiracy, resolve the problem and send the challenger to feed the fish.\r Each new game session of Save Koch is played in a completely different manner. At the start, the game shuffles the NPCs deck, which leads to all game events and, subsequently, your methods will be completely unique to that particular game session. It’s as if you were playing your favorite desktop game with a bunch of friends — you’ve just beat the game, but the fun only begins! Make strategic decisions, join unexpected alliances, hire detectives, bribe or even torture witnesses, if your tastes up to; do everything to find that criminal mastermind who challenges you. And also flush out that hiding mole. And also not become a victim.… Expand"}, {"name": "Titan Attacks!", "details_link": "https://www.metacritic.com/game/3ds/titan-attacks!", "publisher": "Curve Studios", "release_date": "Feb 26 2015", "developers": ["Puppy Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "3DS"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down", "Vertical"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/44174370e118717c5411145f5ab19feb-98.jpg", "descriptions": "As the last surviving tank commander on Earth, single-handedly turn back the evil invading alien army, drive back the Titans across the Solar System, and defeat them on their homeworld...\r Titan Attacks has the same easy-to-learn and addictive gameplay of the classic arcade shoot 'em up,As the last surviving tank commander on Earth, single-handedly turn back the evil invading alien army, drive back the Titans across the Solar System, and defeat them on their homeworld...\r Titan Attacks has the same easy-to-learn and addictive gameplay of the classic arcade shoot 'em up, but is packed full of extras - new features, new strategies, and stylish neo-retro visuals.\r Battle swarms of alien fighters, bombers and giant boss motherships, over 5 unique worlds and 100 levels of frantic action. Earn bounty money and upgrade your ship with extra cannon, rockets and lasers. Destroy falling wrecks, dodge hurtling asteroids and capture escaping aliens - or blast them from the skies! Win prizes in sharp-shooter challenge stages and compete on the online Hi-Scores table!… Expand"}, {"name": "Midway Arcade Treasures: Extended Play", "details_link": "https://www.metacritic.com/game/psp/midway-arcade-treasures-extended-play", "publisher": "Midway", "release_date": "Dec 13 2005", "developers": ["Digital Eclipse"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 63, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/baa0e23a04c85dbeb0c3f99db121a12e-98.jpg", "descriptions": "Now you can play classic arcade games anywhere, anytime with Midway Arcade Treasures: Extended Play for the Sony PSP Entertainment System. Enjoy the coin-op games of the past for the first time on a portable system with multiplayer wireless support.  Single Player: Spy Hunter, Sinistar,Now you can play classic arcade games anywhere, anytime with Midway Arcade Treasures: Extended Play for the Sony PSP Entertainment System. Enjoy the coin-op games of the past for the first time on a portable system with multiplayer wireless support.  Single Player: Spy Hunter, Sinistar, Defender, Paperboy and 720. Multiplayer Wireless: Klax, Joust, Marble Madness, Toobin’, Rampage - 3 player, Gauntlet - 4 player, Rampart - 3 player, Wizard of Wor, Xybots, Championship Sprint, Arch Rivals, Cyberball 2072, Xenophobe - 3 player, Mortal Kombat, Mortal Kombat 2 and Mortal Kombat 3. [Midway]… Expand"}, {"name": "The Occupation", "details_link": "https://www.metacritic.com/game/playstation-4/the-occupation", "publisher": "Sold Out", "release_date": "Mar  5 2019", "developers": ["White Paper Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 63, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/3/c82d4048d23c1c879a656fff31beeda3-98.jpg", "descriptions": "It's 1987 in North West England; A time of 80's British pop, grand architecture and political unrest. An explosion has triggered a controversial act which threatens to erode civil liberties of the population to be rushed into place. You are tasked with investigating and questioning people onIt's 1987 in North West England; A time of 80's British pop, grand architecture and political unrest. An explosion has triggered a controversial act which threatens to erode civil liberties of the population to be rushed into place. You are tasked with investigating and questioning people on their actions from a tumultuous night which resulted in the loss of many lives. Each person has a different account of the night's event and you must use the tools at your disposal to get the results you need for your investigation.Will you take the most direct route at the risk of getting caught, or plan your approach carefully whilst precious time ticks by? Events happen in real-time and you must make decisions based on the evidence. You are the reporter. You decide the narrative.… Expand"}, {"name": "Ace Combat: Assault Horizon Legacy+", "details_link": "https://www.metacritic.com/game/3ds/ace-combat-assault-horizon-legacy+", "publisher": "Bandai Namco Games", "release_date": "Feb 10 2015", "developers": ["Project Aces"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "Flight", "General", "Combat"], "meta_score": 63, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/dd6fcc3d688512a66f3fe1bfb25da118-98.jpg", "descriptions": "A collaboration between Ace Combat and Nintendo brings to fans aerial combat as they are able to cut through the skies while flaunting fresh paint to represent their favorite Nintendo characters like Samus, Captain Falcon, Bowser, and Pac-Man."}, {"name": "Freakyforms Deluxe: Your Creations, Alive!", "details_link": "https://www.metacritic.com/game/3ds/freakyforms-deluxe-your-creations-alive!", "publisher": "Nintendo", "release_date": "Nov  5 2012", "developers": ["Asobism", "Co. ltd.", "Asobism.Co.,Ltd", "Asobism"], "platforms": "3DS", "num_players": "1-4 ", "genres": ["Miscellaneous", "General", "General"], "meta_score": 63, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/4a010915b69ce543ac0b45b525a5aada-98.jpg", "descriptions": "Freakyforms Deluxe: Your Creations, Alive! contains new features not found in the original downloadable title, such as dungeons to explore, enhanced creating capabilities and new special powers to be used."}, {"name": "Destiny 2: Warmind", "details_link": "https://www.metacritic.com/game/playstation-4/destiny-2-warmind", "publisher": "Activision", "release_date": "May  8 2018", "developers": ["Bungie"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 63, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/0/d26aeababa83a6d7e61140e8faf3414b-98.jpg", "descriptions": "Destiny 2 Expansion II: Warmind continues your Guardian’s journey with an all-new story. Ana Bray, a Guardian long thought lost, searches for a connection to her past…one that could be lost forever on the polar ice caps of Mars. As Golden Age warsats begin slamming into the ice, the glaciersDestiny 2 Expansion II: Warmind continues your Guardian’s journey with an all-new story. Ana Bray, a Guardian long thought lost, searches for a connection to her past…one that could be lost forever on the polar ice caps of Mars. As Golden Age warsats begin slamming into the ice, the glaciers begin to thaw, revealing the core of the Warmind Rasputin – and an ancient Hive army bent on its destruction. Now free, the Hive swarm in service to their god Xol. Help Ana discover her past and destroy the Hive’s gargantuan worm-god before it is too late.… Expand"}, {"name": "MX vs. ATV Alive", "details_link": "https://www.metacritic.com/game/xbox-360/mx-vs-atv-alive", "publisher": "THQ", "release_date": "May 10 2011", "developers": ["THQ Digital Studio Phoenix"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Arcade", "Rally / Offroad", "Motorcycle", "Other", "Motocross", "Motocross"], "meta_score": 63, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/cd21e197cf94bd90386f912dc3065b61-98.jpg", "descriptions": "MX vs. ATV Alive is the newest title in this racing series."}, {"name": "Star Wars Battlefront: Elite Squadron", "details_link": "https://www.metacritic.com/game/psp/star-wars-battlefront-elite-squadron", "publisher": "LucasArts", "release_date": "Nov  3 2009", "developers": ["Savage Entertainment"], "platforms": "PSP", "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 63, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/bb11523fac6fbdc16c7f61b804ffd4bf-98.jpg", "descriptions": "For the first time ever in the Star Wars Battlefront series, players can fight on multi-level battlefronts, on the ground and in space. Players can start the fight on foot, commandeer a vehicle to battle on the ground or dogfight in space, and land their craft and fight on capital starships.For the first time ever in the Star Wars Battlefront series, players can fight on multi-level battlefronts, on the ground and in space. Players can start the fight on foot, commandeer a vehicle to battle on the ground or dogfight in space, and land their craft and fight on capital starships. The battles waged on each front are all directly effected by the player's actions, creating a combat experience where every shot fired and every enemy defeated can affect the outcome of a battle on another front. Star Wars Battlefront: Elite Squadron features a deep and engrossing single player campaign that spans the entire Star Wars Saga - and beyond. Gamers assume the identity of X2, a clone trooper created from the DNA of a Jedi Master. Originally tasked with eliminating Jedi during Order 66, X2 decides to leave his blood-stained past behind and joins the Rebellion. X2 isn’t the only Force-sensitive clone, however. X1, his clone brother, chooses a much more sinister path, leading to a confrontation that could determine the fate of both the Empire and the Rebellion. Additionally, players have at their disposal massive amounts of pick-up and play action for seemingly endless replay value. The PSP provides the deepest customization options ever seen in a Star Wars Battlefront title, allowing players to personalize and build their character with more weapons and items than ever before, including the weapons characters carry into battle, the armor they wear on their backs, their species, gender, appearance and physical strengths. Players can also unlock hundreds of other items and bonuses to help even the odds. On Nintendo DS, players can experience a unique class-based gameplay experience that allows them to outfit their characters with pre-determined weapon armaments, including heavy weapons, blasters and even lightsabers. Star Wars Battlefront: Elite Squadron on the PSP supports 16-player multiplayer, complete with in-depth stat tracking, and intense 4-player skirmishes on Nintendo DS across a wide number of modes, including the all-new \"Heroes and Villains.\" Take up arms as some of the most iconic Star Wars characters, including Luke Skywalker, Darth Vader, Boba Fett, Kit Fisto, Darth Maul and other familiar faces from Star Wars Battlefront: Renegade Squadron and Star Wars: The Force Unleashed. And battle for the fate of the galaxy on some of the most memorable Star Wars planets of all time, including the forest-covered landscape of Endor, the frozen wastes of Hoth and even the mysterious Yavin 4. [LucasArts]… Expand"}, {"name": "Code Lyoko", "details_link": "https://www.metacritic.com/game/ds/code-lyoko", "publisher": "The Game Factory", "release_date": "May 15 2007", "developers": ["DC Studios"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Role-Playing", "General", "General", "Action RPG"], "meta_score": 63, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/40161576fd349b8183e362e5afc0edec-98.jpg", "descriptions": "Join Yumi, Ulrich, Odd and Jeremy in their fight to save planet Earth and the parallel universe Lyoko from total destruction! The central computer that runs Lyoko, has been infected by a megalomaniacal virus, X.A.N.A, that wants to take over the world. Within Lyoko one virtual being by theJoin Yumi, Ulrich, Odd and Jeremy in their fight to save planet Earth and the parallel universe Lyoko from total destruction! The central computer that runs Lyoko, has been infected by a megalomaniacal virus, X.A.N.A, that wants to take over the world. Within Lyoko one virtual being by the name of Aelita is fighting to take X.A.N.A. down, but she can't do it alone, and has recruited a team of boarding school students from Earth to help her.  Now X.A.N.A. has set his sights on Earth and is sending pieces of the virus through to Earth. With an emphasis on team interaction, puzzle solving, exploration and intense combat, this game will provide a great deal of fun for fans of the Code Lyoko cartoon series. The fates of Lyoko and planet Earth are in your hands so fight, explore, drive and hack your way to victory in this Action packed RPG adventure in the digital realm. Take on the roles of each of the four characters – Odd, Yumi, Ulrich and Aelita – and customize play based on each of their individual strengths. [The Game Factory]… Expand"}, {"name": "The Incredibles", "details_link": "https://www.metacritic.com/game/gamecube/the-incredibles", "publisher": "THQ", "release_date": "Oct 31 2004", "developers": ["Heavy Iron Studios"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 63, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/cad94dc86b014002b4390e892cb5828d-98.jpg", "descriptions": "Superstrength, superspeed, invisibility, and elasticity are all the powers you have to combat evil in The Incredibles. You'll need them, because your enemies throw bombs, bullets, and lasers at you. Based on the movie from Pixar, The Incredibles tells the story of a family of undercoverSuperstrength, superspeed, invisibility, and elasticity are all the powers you have to combat evil in The Incredibles. You'll need them, because your enemies throw bombs, bullets, and lasers at you. Based on the movie from Pixar, The Incredibles tells the story of a family of undercover superheroes that is trying to live a quiet, suburban life but is forced back into action to save the world. As the film's main characters, you must fight, race, and solve puzzles in more than 18 action-packed levels.… Expand"}, {"name": "Ys I & II Chronicles", "details_link": "https://www.metacritic.com/game/psp/ys-i-ii-chronicles", "publisher": "XSEED Games", "release_date": "Feb 21 2011", "developers": ["Falcom"], "platforms": ["PC", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Miscellaneous", "Action RPG", "Action RPG", "Compilation"], "meta_score": 63, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/cf146d90a83ad966f21a832b6ebde585-98.jpg", "descriptions": "Ys I & II Chronicles combines the first two Ys games into one package."}, {"name": "Shaun White Snowboarding", "details_link": "https://www.metacritic.com/game/playstation-3/shaun-white-snowboarding", "publisher": "Ubisoft", "release_date": "Nov 16 2008", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Sports", "Alternative", "Individual", "Snowboarding", "Snowboarding", "Ski / Snowboard"], "meta_score": 63, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/ddb0635e4c0259d5a82b11244d267a4e-98.jpg", "descriptions": "Developed in close collaboration with Shaun White, Olympic Gold Medalist and eight-time X Games Gold Medalist, Shaun White Snowboarding allows players to enter a world of total freedom, where they can create their own experience and choose how, where, and with whom they want to ride. OpenDeveloped in close collaboration with Shaun White, Olympic Gold Medalist and eight-time X Games Gold Medalist, Shaun White Snowboarding allows players to enter a world of total freedom, where they can create their own experience and choose how, where, and with whom they want to ride. Open World Mountains: Choose how you ride in open-world mountains across the world. Conquer extreme peak conditions, create your own paths in the back country, or compete with fellow riders in the terrain parks. Your Friends Are Always Around: Play in a world where your friends are always around. Do your own runs on mountains populated by real gamers, or join your friends for a quick session from any mountain. More than Just Snowboarding: Have fun with your friends on and off the board! Throw snowballs, hike to access secret spots, film your friends doing ripping tricks. You can also upload your videos online to share with the world. Ride Your Way: Express yourself through tricks, riding styles, and highly customizable avatars – both in single-player and in the online world. Use the intuitive dual analog control to pull off a huge variety of tricks that express your style. Next-Gen Technology: Built on the Assassin's Creed engine, this game creates a massive world with gorgeous visuals and realistic NPC interactions. This is also the first time a snowboarding game is completely driven by physics instead of animation. Authentic Snowboarding: Ubisoft has worked closely with Shaun White to infuse the gaming experience with authenticity, personality and humor. Shaun is a friend and mentor in the game, and will help you with your skills. And, if you are deemed worthy, you may even be able to play as Shaun in the game. [Ubisoft]… Expand"}, {"name": "DanceMasters", "details_link": "https://www.metacritic.com/game/xbox-360/dancemasters", "publisher": "Konami", "release_date": "Nov  4 2010", "developers": ["GCP1"], "platforms": "Xbox 360", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 63, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/667b1f41565d2bc50766c0cb5ce9f561-98.jpg", "descriptions": "Being the pioneer of the franchise that started the dance game craze Konami introduces a brand new way to experience music and rhythm. The next generation in full body dancing is finally here! DanceMasters (also known as \"Dance Evolution\") utilizes Microsoft Natal to give gamers the ultimateBeing the pioneer of the franchise that started the dance game craze Konami introduces a brand new way to experience music and rhythm. The next generation in full body dancing is finally here! DanceMasters (also known as \"Dance Evolution\") utilizes Microsoft Natal to give gamers the ultimate dance club right in their living rooms, with no peripherals required! … Expand"}, {"name": "Taito Milestones", "details_link": "https://www.metacritic.com/game/switch/taito-milestones", "publisher": "ININ Games", "release_date": "Apr 15 2022", "developers": ["Taito Corporation", "Hamster"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/ee9f65e4b37a77756009641e6dbb018b-98.jpg", "descriptions": "Taito's arcade legacy began in the early 1970s, but it came into its own in the 80s. You now have the chance to play these milestone classics that paved the way for the decades of Taito's arcade dominance which followed.Ten games, each representing a specific breakthrough in developmentTaito's arcade legacy began in the early 1970s, but it came into its own in the 80s. You now have the chance to play these milestone classics that paved the way for the decades of Taito's arcade dominance which followed.Ten games, each representing a specific breakthrough in development and gaming history, spanning a variety of genres. Platform, sports, shooting, puzzle and more. And now those 10 classics will be available for the first time as a collection on a modern console!… Expand"}, {"name": "NCAA March Madness 07", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-march-madness-07", "publisher": "EA Sports", "release_date": "Jan 17 2007", "developers": ["EA Canada"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 63, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/591174aa95576c7a0dcbc8230d959c33-98.jpg", "descriptions": "NCAA March Madness 07 delivers an authentic college basketball gameplay experience by offering custom playbooks for each team through the Floor General Playcalling system, the EA SPORTS Lockdown Stick that allows your players to pressure the ball, force turnovers and harass opponents on theNCAA March Madness 07 delivers an authentic college basketball gameplay experience by offering custom playbooks for each team through the Floor General Playcalling system, the EA SPORTS Lockdown Stick that allows your players to pressure the ball, force turnovers and harass opponents on the court, and an enhanced Dynasty Mode with new School Pride and Recruiting features that let you build your school into a national powerhouse. In addition, the popular voices of college basketball are back with ESPN’s Dick Vitale and Brad Nessler calling the action courtside. [Electronic Arts]… Expand"}, {"name": "Skyhill", "details_link": "https://www.metacritic.com/game/pc/skyhill", "publisher": "Daedalic Entertainment", "release_date": "Oct  6 2015", "developers": ["Mandragora"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Survival", "Roguelike"], "meta_score": 63, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/cf9bc8f289baf84ac850839b903e6494-98.jpg", "descriptions": "Skyhill is a roguelike story about staying alive when there is no reason to. You are a resident of Skyhill hotel,who survived biological catastrophe. Goal - is to get out of your penthouse in search of other people and salvation. But all elevators in the building are off and floors areSkyhill is a roguelike story about staying alive when there is no reason to. You are a resident of Skyhill hotel,who survived biological catastrophe. Goal - is to get out of your penthouse in search of other people and salvation. But all elevators in the building are off and floors are flooded with hazards. You are not sure is there any other survivors, as far as you know everyone in the building died, or… changed beyond recognition. Those who provided room service and pushed buttons in elevators for you not so long ago… well now all they want is to rip off your flesh to get to your tasty insides… So much for customer service. You face the dilemma: on the one hand you have to get out from the damn building, on the other hand your hotel suite is your only “Fort” that protects from the horrors of post-apocalyptic reality.… Expand"}, {"name": "Fuse", "details_link": "https://www.metacritic.com/game/playstation-3/fuse", "publisher": "Electronic Arts", "release_date": "May 28 2013", "developers": ["Insomniac Games"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "General", "General"], "meta_score": 63, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/8/b3cacfe5659e930bb43764844da6044b-98.jpg", "descriptions": "What happens when human beings access powerful alien technology they were never meant to have been exposed to? When a volatile energy source they call Fuse falls into the wrong hands, the CIA calls upon an elite contact team to retrieve it, known as Overstrike 9. Huddle with up to 3 friendsWhat happens when human beings access powerful alien technology they were never meant to have been exposed to? When a volatile energy source they call Fuse falls into the wrong hands, the CIA calls upon an elite contact team to retrieve it, known as Overstrike 9. Huddle with up to 3 friends in team-based co-op play as you take down the rogue paramilitary corporation behind the theft. Use lethal teamwork, orchestrate devastating attacks, and provide cover for one another with fringe-tech weapons and gadgets. The unique LEAP feature lets you instantly shift from agent to agent during combat, allowing you to take advantage of each one’s special arsenal. You will need your partners and their arsenal to stop a global arms race from spinning out of control. … Expand"}, {"name": "Diddy Kong Racing DS", "details_link": "https://www.metacritic.com/game/ds/diddy-kong-racing-ds", "publisher": "Nintendo", "release_date": "Feb  5 2007", "developers": ["Rare Ltd."], "platforms": "DS", "num_players": "8  Online", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart"], "meta_score": 63, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/13948dc75238f0100c3941da621292b7-98.jpg", "descriptions": "A bloated space pig has taken control of Diddy Kong's Island paradise and only you can stop his nefarious plot. Take on this racing challenge as you drive, hover and fly your way across the massive island. This remastered take on a Nintendo 64 classic is sure to rev the engines of adventureA bloated space pig has taken control of Diddy Kong's Island paradise and only you can stop his nefarious plot. Take on this racing challenge as you drive, hover and fly your way across the massive island. This remastered take on a Nintendo 64 classic is sure to rev the engines of adventure racing fans everywhere. Diddy Kong Racing is the first handheld adventure racing game, a genre that lets you visit new locations, talk to interesting characters, advance the storyline and search for hidden secrets - all while engaging other drivers in a series of racing challenges to see who is king of the road. Race Online and in Local Wireless Battles. Drivers can use Nintendo Wi-Fi Connection to go online and race against up to seven other players from around the world. DKR also features eight-player single-card download play, as well as multi-card wireless play. Create Your Own Tracks. Wish Race mode gives you complete freedom to design, build, and race on the track of your dreams. Touch Screen control makes building the course a snap, and Nintendo WFC compatibility lets you share your work of genuis with everyone. Retextured and remixed tracks, new characters and racing challenges, brand new levels, improved vehicle control, Touch Screen controls, gamer tag designs and more make this an experience that both newcomers and seasoned vets will love. [Nintendo]… Expand"}, {"name": "Stela", "details_link": "https://www.metacritic.com/game/switch/stela", "publisher": "SkyBox Labs", "release_date": "Mar 13 2020", "developers": ["SkyBox Labs"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 63, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/2ce45d2d185896d7c8b8d47eab9d180c-98.jpg", "descriptions": "An expanded ending, visual improvements throughout the game to emphasize story elements and an array of bug and quality-of-life fixes will debut on Xbox One alongside the Nintendo Switch and Steam releases, with an Apple Arcade update to follow within days. These join December’s update forAn expanded ending, visual improvements throughout the game to emphasize story elements and an array of bug and quality-of-life fixes will debut on Xbox One alongside the Nintendo Switch and Steam releases, with an Apple Arcade update to follow within days. These join December’s update for Xbox One and Apple Arcade, which added 15 secret areas and unlockable 3D dioramas unveiling a prophecy about the world of Stela, and shed more light on the setting and apocalyptic narrative.… Expand"}, {"name": "Dragon Quest", "details_link": "https://www.metacritic.com/game/switch/dragon-quest", "publisher": "Square Enix", "release_date": "Sep 27 2019", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 63, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/61fdfa5ced34c6fefae8c6fee97215cf-98.jpg", "descriptions": "The game that started the legend of DRAGON QUEST is here at last for mobile devices!Discover the RPG that won the hearts of two generations!\nEnter a fantasy world of sword, magic, and monsters in one standalone package!\nDownload it once, and there's nothing else to buy, and nothing else toThe game that started the legend of DRAGON QUEST is here at last for mobile devices!Discover the RPG that won the hearts of two generations!Enter a fantasy world of sword, magic, and monsters in one standalone package!Download it once, and there's nothing else to buy, and nothing else to download! PrologueThe peace of fair Alefgard has been shattered by the appearance of the nefarious master of the night known as the Dragonlord, and the Sphere of Light which for so long kept the forces of darkness in check has been stolen!It's time for you, a young warrior through whose veins flows the blood of the legendary hero Erdrick, to set out on a quest to vanquish the Dragonlord, and save the land from darkness! Game Features* First in the Legendary SeriesOriginally released as Dragon Warrior, you can now experience the classic retro RPG experience that swept up millions of Japanese players back in the Eighties...and never let go!Become the descendant of the legendary hero Erdrick, and embark on an epic journey through the historic realm of Alefgard, tackling fearsome foes and perplexing puzzles on your way to the dread Dragonlord's lair!* Simple, Intuitive ControlsThe game's controls are designed to work perfectly with the vertical layout of any modern mobile device, and the position of the movement button can be changed to facilitate both one- and two-handed play.* Experience the legendary RPG loved by millions in Japan and worldwide! Created by a legendary trio with the master creator Yuji Horii, the revolutionary synthesizer score and orchestration by Koichi Sugiyama, and art by master manga artist Akira Toriyama (Dragon Ball).… Expand"}, {"name": "Sonic the Hedgehog 4: Episode II", "details_link": "https://www.metacritic.com/game/playstation-3/sonic-the-hedgehog-4-episode-ii", "publisher": "Sega", "release_date": "May 15 2012", "developers": ["Dimps Corporation"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 63, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/81a831e9c510489db6e5e51ad1c0851f-98.jpg", "descriptions": "Sonic the Hedgehog 4 Episode II will expand the Sonic 4 storyline with new areas to speed through and new challenges to face."}, {"name": "Trailblazers", "details_link": "https://www.metacritic.com/game/playstation-4/trailblazers", "publisher": "Rising Star Games", "release_date": "May  8 2018", "developers": ["Supergonk Ltd.", "Supergonk"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Racing", "Arcade", "Futuristic"], "meta_score": 63, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/754bbbb474e01b23eb30c293f803cb3b-98.jpg", "descriptions": "Welcome to the Trailblaze Tournament! Get ready for high-speed thrills with an explosion of color in Trailblazers, the first-ever second-to-second co-operative arcade racer."}, {"name": "Dangerous Golf", "details_link": "https://www.metacritic.com/game/xbox-one/dangerous-golf", "publisher": "Three Fields Entertainment", "release_date": "Jun  3 2016", "developers": ["Three Fields Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 63, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/b47f382068c57fef6a05d54193ff1573-98.jpg", "descriptions": "Welcome to the World of Dangerous Golf, an arcade style sports game with a very explosive twist.Play through a variety of indoor courses – make a mess in the Kitchen, wreak havoc in a Palace, cause chaos in a Castle and set fire to a Gas Station.\n\nRack up scores by causing as much damageWelcome to the World of Dangerous Golf, an arcade style sports game with a very explosive twist.Play through a variety of indoor courses – make a mess in the Kitchen, wreak havoc in a Palace, cause chaos in a Castle and set fire to a Gas Station.Rack up scores by causing as much damage and destruction as possible. Fire off a SmashBreaker. Blast the ball into the hole with an outrageous Trickshot.Set off on a World Tour, play co-operatively in Co-Op World Tour mode, or try Party Golf with up to 8 Players.You don’t need to wear loud trousers, funny shoes or a hat, or be a bore when you shout “Fore!” This is golf for everyone.… Expand"}, {"name": "Maskmaker", "details_link": "https://www.metacritic.com/game/playstation-4/maskmaker", "publisher": "Innerspace VR", "release_date": "Apr 20 2021", "developers": ["Innerspace VR"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/1e49b005e1f3fe23905d5829bae7982e-98.jpg", "descriptions": "Assume the role of a Maskmaker's apprentice and learn the magic of crafting masks to immerse yourself in the intriguing, enigmatic beings within the game. From mask-to-mask and puzzle-to-puzzle, explore your way through the \"mask realm\" to seek Prospero who appears to rule it and ultimatelyAssume the role of a Maskmaker's apprentice and learn the magic of crafting masks to immerse yourself in the intriguing, enigmatic beings within the game. From mask-to-mask and puzzle-to-puzzle, explore your way through the \"mask realm\" to seek Prospero who appears to rule it and ultimately unravel the secret of his identity.… Expand"}, {"name": "Sebastien Loeb Rally Evo", "details_link": "https://www.metacritic.com/game/xbox-one/sebastien-loeb-rally-evo", "publisher": "Square Enix", "release_date": "Jan 29 2016", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Racing", "General"], "meta_score": 63, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/4602a60b8400ae56e755436171a67847-98.jpg", "descriptions": "Sebastien Loeb Rally Evo is an off-road racing game experience that teams players with the greatest racer in Rally history: Sebastien Loeb."}, {"name": "NBA 07", "details_link": "https://www.metacritic.com/game/playstation-3/nba-07", "publisher": "SCEA", "release_date": "Nov 14 2006", "developers": ["SCEA"], "platforms": ["PlayStation 2", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 63, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/ef62d50c45804ffa3518dae9a7a081a7-98.jpg", "descriptions": "NBA '07 hits the hardwood for the PS3 showcasing detailed and lifelike graphics supported in true High Definition at 1080p. Taking advantage of the PS3's advanced processing power, NBA '07 delivers a true next-generation experience with advanced artificial intelligence (AI), realisticNBA '07 hits the hardwood for the PS3 showcasing detailed and lifelike graphics supported in true High Definition at 1080p. Taking advantage of the PS3's advanced processing power, NBA '07 delivers a true next-generation experience with advanced artificial intelligence (AI), realistic character movements, online functionality, and interaction with the new motion sensor controller. With its array of visuals and new gameplay features, NBA '07 delivers a realistic and engaging NBA experience. Full HD at 1080p – Experience a new era of NBA action with NBA '07 delivering the first sports game to run in 1080p at a blistering 60 frames per second. NBA Replay Mode – Score 81 points as Kobe, nab 21 rebounds with Big Ben, dish 22 assists as Nash – players will attempt to re-enact great performances from the '05-'06 season and work through the entire past season's worth of memorable gameplay scenarios. NBA Replay (Games of the Week) – Download five scenarios each week involving real NBA games from the '06-'07 season and attempt to replay those magical moments within the game. Never before has an NBA video game and the current NBA season been more relevant to one another. Motion Sensor Controller Control – Take advantage of jukes, crossovers, and spin moves as well as low-post moves using the PS3 motion sensor controller. \rMini-Games – Play on your own or against friends in multiple mini-games including \"Own The Court\", 3-Point Shootout, and the PlayStation Skills Challenge. [SCEA]… Expand"}, {"name": "Gangland", "details_link": "https://www.metacritic.com/game/pc/gangland", "publisher": "Whiptail Interactive", "release_date": "Mar  4 2004", "developers": ["MediaMobsters"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Modern", "General", "Modern"], "meta_score": 63, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/f4524ad87afac2bff67164340ac95403-98.jpg", "descriptions": "GANGLAND is a fast pace arcade style action game that combines the RTT, RPG & SIM genres into a whole new breed. All wannabe mobster bosses can look forward to a unique experience that'll blow your brains out! SINGLEPLAYER STORY: There were five brothers Romano, Angelo, Sonny, Chico andGANGLAND is a fast pace arcade style action game that combines the RTT, RPG & SIM genres into a whole new breed. All wannabe mobster bosses can look forward to a unique experience that'll blow your brains out! SINGLEPLAYER STORY: There were five brothers Romano, Angelo, Sonny, Chico and Mario. As kids they were inseparable as they grew up on Sicily with their grandparents. As they grew older three of the brothers became more and more unsatisfied with the quiet life in the Mediterranean and one day they killed their own brother Chico in a fight whereafter they fled to the land of opportunity where they began each their own criminal career. That made grandpa very upset? He sent his fourth grandchild to America to track down and kill his malicious brothers and avenge the murder. First thing Mario should do when he arrives is to look up his uncle Vincente... MULTIPLAYER STORY: You take on the role of one of the four Italian brothers, Mario, Angelo, Romano or Sonny. Born into Sicilian mafia, you must work your way up within the family and compete with other mobs and gangsters for supremacy in Paradise City. [Whiptail Interactive]… Expand"}, {"name": "Rocky", "details_link": "https://www.metacritic.com/game/game-boy-advance/rocky", "publisher": "Ubisoft", "release_date": "Nov 17 2002", "developers": ["Virtucraft"], "platforms": ["iPhone/iPad", "PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/84ce9a37f73478a78d7f9ca69a8b5fe2-98.jpg", "descriptions": "Jump into the ring as Rocky Balboa and go head-to-head against 29 tough opponents, including Apollo Creed, Clubber Lang, Ivan Drago, and Tommy Gunn. Mickey and company train you from the streets of Philadelphia to the world heavyweight championship bout. Master Rocky's powerful punch combosJump into the ring as Rocky Balboa and go head-to-head against 29 tough opponents, including Apollo Creed, Clubber Lang, Ivan Drago, and Tommy Gunn. Mickey and company train you from the streets of Philadelphia to the world heavyweight championship bout. Master Rocky's powerful punch combos and fast flurries. Practices your skills in Sparring mode and then test them out in the Knockout Tournament against 15 other players. Based on the movie trilogy, Rocky tests your dedication, skill, and heart through various gameplay modes.… Expand"}, {"name": "KAO the Kangaroo", "details_link": "https://www.metacritic.com/game/dreamcast/kao-the-kangaroo", "publisher": "Titus Software", "release_date": "Feb 13 2001", "developers": ["X-Ray Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "Dreamcast"], "genres": ["Action", "General"], "meta_score": 63, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/7845b3757a4e4f2160e0c1d1c90e7cdc-98.jpg", "descriptions": "After being kidneapped from his beautiful home, Kao must find his way back to Australia. Armed with comedy-sized boxing gloves, Kao hops, skips, and triple jumps his way across magnificently colored landscapes. Legs the size of a professional bodybuilders aren't the only means of locomotionAfter being kidneapped from his beautiful home, Kao must find his way back to Australia. Armed with comedy-sized boxing gloves, Kao hops, skips, and triple jumps his way across magnificently colored landscapes. Legs the size of a professional bodybuilders aren't the only means of locomotion for this furry bundle of fury. Use hang gliders, motorboats, snowboards, and even a space scooter.… Expand"}, {"name": "Medal of Honor: Vanguard", "details_link": "https://www.metacritic.com/game/playstation-2/medal-of-honor-vanguard", "publisher": "Electronic Arts", "release_date": "Mar 26 2007", "developers": ["Electronic Arts"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 63, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/a74d4f9764a0431d88bea6be86bee79d-98.jpg", "descriptions": "Step into the boots of Frank Keegan, Corporal of the 82nd Airborne Division and engage in battles throughout Europe. From Operation Husky on the shores of Sicily to Operation Varsity inside Nazi Germany, you’ll fight behind enemy lines in the epic WWII battles that turned America's firstStep into the boots of Frank Keegan, Corporal of the 82nd Airborne Division and engage in battles throughout Europe. From Operation Husky on the shores of Sicily to Operation Varsity inside Nazi Germany, you’ll fight behind enemy lines in the epic WWII battles that turned America's first paratroopers into heroes of WWII. Featuring spectacular graphics adding to epic combat intensity, Medal of Honor Vanguard makes you the driving force in the struggle to liberate Europe. [Electronic Arts]… Expand"}, {"name": "Ridge Racer DS", "details_link": "https://www.metacritic.com/game/ds/ridge-racer-ds", "publisher": "Namco", "release_date": "Dec  7 2004", "developers": ["Namco", "Nintendo Software Technology"], "platforms": "DS", "num_players": "1-6 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 63, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/13c99f6a5669cd772ba7ef6a2c0f1e93-98.jpg", "descriptions": "From the arcade racing series gamers know and love, Ridge Racer DS delivers a whole new experience to racing fans by offering true analog steering through the Nintendo DS touch screen, up to six-player multiplayer races, a variety of exciting single-player racing modes and much more. RidgeFrom the arcade racing series gamers know and love, Ridge Racer DS delivers a whole new experience to racing fans by offering true analog steering through the Nintendo DS touch screen, up to six-player multiplayer races, a variety of exciting single-player racing modes and much more. Ridge Racer DS offers all the fast-paced action gamers have come to expect from the Ridge Racer name -- now in the palm of their hands on the Nintendo DS. [Namco]… Expand"}, {"name": "Sir, You Are Being Hunted", "details_link": "https://www.metacritic.com/game/pc/sir-you-are-being-hunted", "publisher": "Big Robot Ltd", "release_date": "May  2 2014", "developers": ["Big Robot Ltd"], "platforms": "PC", "genres": ["Shooter", "Sci-Fi", "Sci-Fi", "Action", "Action Adventure", "Shooter", "Survival", "First-Person", "Arcade"], "meta_score": 63, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/c9b9f7ded127a09bdb63f560c16f3cbf-98.jpg", "descriptions": "Sir, You Are Being Hunted is a game where you're tasked with surviving on an island that is procedurally-generated, dodging robot hunters out to get you and scavenging for food along the way."}, {"name": "Deadpool", "details_link": "https://www.metacritic.com/game/pc/deadpool", "publisher": "Activision", "release_date": "Jun 24 2013", "developers": ["High Moon Studios"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Fighting", "3D", "Action", "Action Adventure", "Beat-'Em-Up", "Shooter", "Beat-'Em-Up", "Linear", "Third-Person", "3D", "Arcade"], "meta_score": 63, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/a1889e39313ec4ccfc6f86e9959b89bb-98.jpg", "descriptions": "Deadpool's oratory: \"There are a few important things I need to say before you crack into my insanely sweet game. (Oof. Here we go again.) I'm a mercenary with an accelerated healing factor. I've been described as unstable, which is just plain coo-coo. (Wait, do sane people say coo-coo?) I'mDeadpool's oratory: \"There are a few important things I need to say before you crack into my insanely sweet game. (Oof. Here we go again.) I'm a mercenary with an accelerated healing factor. I've been described as unstable, which is just plain coo-coo. (Wait, do sane people say coo-coo?) I'm gonna battle for the safety of humans and mutants. (And even mumans.) Be prepared for just about anything. (Holla!) • I made sure to capture all my good sides, so I made my game a third-person action-shooter. (Yep, you get to look at my heinie.) • Keep a look out cuz some of my X-Men pals (Whoa, what pals?!) are making an appearance. (Hope you don't mind picking hair out of your tacos.) • I'm really good at killing, so I made it a blast stringing together combos, and totally eviscerating my enemies. (Ev-is-cer-a-ting!) • I brought my skills and a buttload of my favorite things. Katanas (check), guns (bang!) explosives (boom), duct tape (quack) and of course, yours truly - ME! (Checkmate!)\"… Expand"}, {"name": "Cossacks 3", "details_link": "https://www.metacritic.com/game/pc/cossacks-3", "publisher": "GSC Game World", "release_date": "Sep 20 2016", "developers": ["GSC Game World"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["General", "Strategy", "Real-Time", "Command"], "meta_score": 63, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/63da66441e992eae4d2e6abc5a3238fc-98.jpg", "descriptions": "Cossacks 3 is a combination of war, economy, army developing, building and upgrading. This RTS gameplay promises to return old fans in the golden ages of the genre and give newcomers a unique experience."}, {"name": "Stacked with Daniel Negreanu", "details_link": "https://www.metacritic.com/game/psp/stacked-with-daniel-negreanu", "publisher": "Myelin Media", "release_date": "Oct  6 2006", "developers": ["3G Studios"], "platforms": ["PC", "PSP"], "num_players": "Up to 9 ", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 63, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/ef0d1af81da8eef2002506c57a209d79-98.jpg", "descriptions": "Stacked is a Texas Hold 'em poker game that captures the look, excitement and drama of the phenomenon that has captivated America. The game features a comprehensive poker school in which the player can receive tips and strategies from Daniel Negreanu (2004 ESPN Player of the Year, WorldStacked is a Texas Hold 'em poker game that captures the look, excitement and drama of the phenomenon that has captivated America. The game features a comprehensive poker school in which the player can receive tips and strategies from Daniel Negreanu (2004 ESPN Player of the Year, World Poker Tour Player of the Year)who will teach everything from the fundamentals of Hold 'em to advanced tournament strategies through full motion video, voiceovers and dynamic in-game features. As players progress through the game's career mode, they can apply Daniel's teachings to overcome some of poker's most renowned stars, including Josh Arieh, Jennifer Harman, Erick Lindgren, Carlos Mortenson, Evelyn Ng and David Williams. The Poki Artificial Intelligence system utilized in Stacked adapts its tactics in real-time to exploit the user's playing style, detecting tendencies and deploying appropriate counter-strategies to deliver a challenging and authentic experience. Gamers can organize a casual game with friends or compete to qualify for sanctioned multi-table tournaments. [Myelin Media]… Expand"}, {"name": "Warhammer: Chaosbane", "details_link": "https://www.metacritic.com/game/playstation-4/warhammer-chaosbane", "publisher": "Bigben Interactive", "release_date": "Jun  4 2019", "developers": ["Games Workshop"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 63, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/7/b4d3fbd8791d62e8a3c5b00e81ecd606-98.jpg", "descriptions": "In a world ravaged by war and dominated by magic, you must rise up to face the Chaos hordes. Playing solo or with up to four players in local or online co-op, choose a hero from four character classes and prepare for epic battles wielding some of the most powerful artefacts of the Old World."}, {"name": "The King of Fighters XII", "details_link": "https://www.metacritic.com/game/xbox-360/the-king-of-fighters-xii", "publisher": "Ignition Entertainment", "release_date": "Jul 24 2009", "developers": ["SNK Playmore"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "8  Online", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 63, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/3/700ef6c98d1271c43876d6e0ac34e5d0-98.jpg", "descriptions": "The legendary 3-on-3 fighting game series that united rival brawlers from SNK Playmore's classic arcade franchises celebrates its 15th Anniversary in style with the release of The King of Fighters XII. For the first time in its history, this epic martial arts showdown has undergone aThe legendary 3-on-3 fighting game series that united rival brawlers from SNK Playmore's classic arcade franchises celebrates its 15th Anniversary in style with the release of The King of Fighters XII. For the first time in its history, this epic martial arts showdown has undergone a complete graphical overhaul.  The antiquated character sprites used over the past 14 years have been dropped in favor of all-new, high-resolution fighters fluidly animating across painstakingly detailed, 100% hand-drawn backgrounds. [SNK Playmore]… Expand"}, {"name": "Way of the Hunter", "details_link": "https://www.metacritic.com/game/playstation-5/way-of-the-hunter", "publisher": "THQ Nordic", "release_date": "Aug 16 2022", "developers": ["Nine Rocks Games"], "platforms": ["PC", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Nature", "Hunting"], "meta_score": 63, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/01c23e17ec6f995d8841409595e1d429-98.jpg", "descriptions": "Become the new owner of a hunting lodge nestled among gorgeous habitats and rich animal populations. Explore vast open world environments across the USA and Europe. Hunt with a premium selection of firearms and equipment. Enjoy the perfect hunt on your own or with a friend in multiplayerBecome the new owner of a hunting lodge nestled among gorgeous habitats and rich animal populations. Explore vast open world environments across the USA and Europe. Hunt with a premium selection of firearms and equipment. Enjoy the perfect hunt on your own or with a friend in multiplayer coop.This authentic hunting experience lets you explore and hunt in large open-world environments in the USA and Europe. Discover true to life animals in beautiful natural habitats and handle various detailed and highly realistic weapons.Face the challenges of ethical hunting, supported by a compelling story, or simply enjoy hunting the rich environments freely.… Expand"}, {"name": "Garage", "details_link": "https://www.metacritic.com/game/switch/garage", "publisher": "tinyBuild", "release_date": "May 10 2018", "developers": ["tinyBuild"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 63, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/2db5460465a2110a7a2656cc62bf3b94-98.jpg", "descriptions": "Garage is a bloody shooter in the style of an 80s B-movie. Playing as a drug dealer named Butch, you stand alone against hordes of the living dead. Explore every dark corner of an underground parking garage and discover a passageway to a supernatural world that has never seen the light ofGarage is a bloody shooter in the style of an 80s B-movie. Playing as a drug dealer named Butch, you stand alone against hordes of the living dead. Explore every dark corner of an underground parking garage and discover a passageway to a supernatural world that has never seen the light of day. Find new weapons and master them in order to survive. Solve the mystery of this cursed place and the creatures that inhabit it.… Expand"}, {"name": "PlayStation Vita Pets", "details_link": "https://www.metacritic.com/game/playstation-vita/playstation-vita-pets", "publisher": "SCEA", "release_date": "Jun  3 2014", "developers": ["Spiral House"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Pet"], "meta_score": 63, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/9bc54f5d9c1b4bfe71bb1fa69e0ad5c2-98.jpg", "descriptions": "Puppy power\rDogs with real personality\r\r\nTeam up with a talking dog and embark on a quest to sniff out clues, dig up treasure and solve the mystery of Castlewood Island. Choose from a tough-talking husky, brave collie, fun-loving Labrador or giggly Dalmatian, then make friends for life asPuppy power\rDogs with real personality\r Team up with a talking dog and embark on a quest to sniff out clues, dig up treasure and solve the mystery of Castlewood Island. Choose from a tough-talking husky, brave collie, fun-loving Labrador or giggly Dalmatian, then make friends for life as your new puppy pal responds only to your voice and face.\r Teach your pup new tricks then help them solve puzzles - you can even bring your new (pedigree) chum into the real world to take lifelike photos together using the power of PS Vita and augmented reality technology.… Expand"}, {"name": "Defense Technica", "details_link": "https://www.metacritic.com/game/pc/defense-technica", "publisher": "Devolver Digital", "release_date": "Oct 24 2013", "developers": ["KUNO INTERACTIVE"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "General", "Defense"], "meta_score": 63, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/4fa5de2fe9cc5fea54653c739f49cc40-98.jpg", "descriptions": "The genre-defining 3D Tower Defense game, Defense Technica! Think you know tower defense? Think again.Experience a new kind of Defense game with Defense Technica, featuring stunning 3D graphics and ground-breaking new features like path rotation, tower construction, tower upgrades, and cardThe genre-defining 3D Tower Defense game, Defense Technica! Think you know tower defense? Think again.Experience a new kind of Defense game with Defense Technica, featuring stunning 3D graphics and ground-breaking new features like path rotation, tower construction, tower upgrades, and card collection and combination! * Unsupported devices: iPhone 3GS, 3rd/4th Gen iPod Touch, iPad 1* You may lose data if you update while playing as a guest. * Please sign up for a Hub account before updating.Defense Technica is the ultimate 3D Tower Defense Game! Check out these groundbreaking features:Path Rotation & Tower Building- Build towers in strategic places to defend against incoming enemies, and rotate paths.- Upgrade towers to increase striking power against the waves of incoming enemies.- Defeat enemies to receive a variety of resources to upgrade your tower.Collect & Combine Tower Cards- Use the special upgrade card system to create your own unique cards and upgrades.- Sell or combine unwanted cards to get new cards.Ether Repair & Attack Items- Later stages and waves have stronger enemies and continuous attacks.- Use Ether items to annihilate enemies and to repair your core. * This game supports English, français, Deutsch, ??, ?? and ???.* This is a singleplayer game. When deleting or initializing the game, please use the data backup/restoration service in options.* Follow Com2uS on Twitter for the latest game updates! http://twitter.com/com2us---------------------COM2US GAMES ---------------------- Golf Star™- Tiny Pop- The World of Magic- Homerun Battle 2- Heroes War™---------------------ABOUT COM2US ---------------------Follow us! twitter.com/Com2uS Like us on Facebook!facebook.com/Com2uS Tips and Updates com2us.com… Expand"}, {"name": "Mass Effect 2: Arrival", "details_link": "https://www.metacritic.com/game/pc/mass-effect-2-arrival", "publisher": "EA Games", "release_date": "Mar 29 2011", "developers": ["BioWare"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 63, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/c1776174c0ea07cc76ac463353b4302e-98.jpg", "descriptions": "In Mass Effect: Arrival, Commander Shepard is sent to the edge of the galaxy to rescue an undercover operative who may have evidence of an imminent Reaper invasion that has been looming since the very beginning of the series. Returning and playing a prominent role in Mass Effect: Arrival isIn Mass Effect: Arrival, Commander Shepard is sent to the edge of the galaxy to rescue an undercover operative who may have evidence of an imminent Reaper invasion that has been looming since the very beginning of the series. Returning and playing a prominent role in Mass Effect: Arrival is fan favorite Admiral Hackett, who is voiced by legendary science-fiction actor Lance Henriksen (Alien, Terminator).… Expand"}, {"name": "Professor Heinz Wolff's Gravity", "details_link": "https://www.metacritic.com/game/wii/professor-heinz-wolffs-gravity", "publisher": "Deep Silver", "release_date": "Apr  6 2009", "developers": ["Deep Silver"], "platforms": ["PC", "Wii"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "General"], "meta_score": 63, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/3d16080b9fa244e5ddf8268cc4e1ef17-98.jpg", "descriptions": "It contains 100 levels packed with physical puzzles. The player needs to place elements in the correct order to reach the next level. Many levels offer different ways of completing, sometimes with surprising results. The game does not contain the dry subject matter of a physic lesson inIt contains 100 levels packed with physical puzzles. The player needs to place elements in the correct order to reach the next level. Many levels offer different ways of completing, sometimes with surprising results. The game does not contain the dry subject matter of a physic lesson in school, instead the fun aspect dominates. The game becomes accomplished with dozens of high quality hand painted background arts and an atmospheric soundtrack.… Expand"}, {"name": "Angry Birds Trilogy", "details_link": "https://www.metacritic.com/game/xbox-360/angry-birds-trilogy", "publisher": "Activision", "release_date": "Sep 25 2012", "developers": ["Rovio Mobile", "Rovio Entertainment"], "platforms": ["3DS", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "General", "General", "Compilation"], "meta_score": 63, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/5/5e627730500b01eba65b5e7e57f94ae9-98.jpg", "descriptions": "Angry Birds Trilogy is a compilation of three blockbuster classics: Angry Birds, Angry Birds Seasons, and Angry Birds Rio."}, {"name": "SkateBIRD", "details_link": "https://www.metacritic.com/game/pc/skatebird", "publisher": "Glass Bottom Games", "release_date": "Sep 16 2021", "developers": ["Glass Bottom Games"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Skate / Skateboard"], "meta_score": 63, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/7/eab22e0584d8ee9857856eaedf0a26c4-98.jpg", "descriptions": "Grind on bendy straws, kickflip over staplers, and carve killer lines through cardboard and sticky tape parks. Above all else, skate birds try their best!"}, {"name": "Harvey Birdman: Attorney at Law", "details_link": "https://www.metacritic.com/game/playstation-2/harvey-birdman-attorney-at-law", "publisher": "Capcom", "release_date": "Jan  8 2008", "developers": ["High Voltage Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Adventure", "First-Person", "Modern"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/b842ddd825bebb06d49d5061514a39ed-98.jpg", "descriptions": "Harvey Birdman: Attorney at Law is a fully animated interactive adventure game that merges the fun and mayhem of the popular Adult Swim TV show with Capcom's unique style of gameplay. Players step into the shiny wingtips of Harvey Birdman, a third-rate superhero turned third-rate defenseHarvey Birdman: Attorney at Law is a fully animated interactive adventure game that merges the fun and mayhem of the popular Adult Swim TV show with Capcom's unique style of gameplay. Players step into the shiny wingtips of Harvey Birdman, a third-rate superhero turned third-rate defense attorney charged with exonerating parodied classic cartoon characters. Over the course of the game, players must guide Harvey through a series of odd and comical cases. Each of the game's five interactive stories takes the winged crusader of justice to familiar locations from the TV show. In order to prove his client's innocence, Harvey must peruse the scene of the crime, gather evidence, talk with other cartoon characters, occasionally have drinks with opposing council, and of course, tear holes – no matter how ridiculous – in the testimony provided by the witness for the prosecution. Harvey must bring the whole story together to defend his client in a court where anything can happen... including a confrontation with the prosecution who brandishes a Shrink Ray Gun. [Capcom]… Expand"}, {"name": "SBK Superbike World Championship", "details_link": "https://www.metacritic.com/game/xbox-360/sbk-superbike-world-championship", "publisher": "Conspiracy Entertainment", "release_date": "Nov  8 2008", "developers": ["Milestone S.r.l"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 63, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/3c80093f8ef9f3df826e44b5b9c69b28-98.jpg", "descriptions": "Pick up and play arcade mode allowing the player to access the race in just a few seconds. A genuinely technically accurate extreme simulation mode for real petrol heads. 4 well balanced racing styles giving genuine progression and satisfaction to the gamer. 6 game modes - Basic, Arcade,Pick up and play arcade mode allowing the player to access the race in just a few seconds. A genuinely technically accurate extreme simulation mode for real petrol heads. 4 well balanced racing styles giving genuine progression and satisfaction to the gamer. 6 game modes - Basic, Arcade, Advanced, Simulation, Extreme and Custom. Next generation giving players the chance to challenge their friends and opponents all over the world. [Black Bean Games]… Expand"}, {"name": "Assetto Corsa", "details_link": "https://www.metacritic.com/game/xbox-one/assetto-corsa", "publisher": "505 Games", "release_date": "Aug 30 2016", "developers": ["Kunos Simulazioni"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 63, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/1c2246bdbe494c6b8f201c1adfe5a139-98.jpg", "descriptions": "Assetto Corsa is designed to provide a very realistic driving experience, with single player and multiplayer options, officially licensed cars and tracks developed using Laser scan technology, and the highest level of accuracy possible in reproducing real world motor racing environments.Assetto Corsa is designed to provide a very realistic driving experience, with single player and multiplayer options, officially licensed cars and tracks developed using Laser scan technology, and the highest level of accuracy possible in reproducing real world motor racing environments. Also, Assetto Corsa allows for considerable customisation and modification, in order to satisfy the expectations of professional simracers, gamers who prefer to approach the driving experience more progressively, and hobbyists who just like to collect lots of cars and tracks.… Expand"}, {"name": "Life is Feudal: Your Own", "details_link": "https://www.metacritic.com/game/pc/life-is-feudal-your-own", "publisher": "Bitbox Ltd.", "release_date": "Nov 17 2015", "developers": ["Bitbox Ltd."], "platforms": "PC", "num_players": "Up to 64 ", "genres": ["Historic", "Role-Playing", "Action Adventure", "General", "Action RPG"], "meta_score": 63, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/6/b86d427f2603511a6b8d13099f92d909-98.jpg", "descriptions": "A medieval multiplayer sandbox with terraforming, free preset and modular building construction, rich crafting (smelting, forging, farming, animals breeding etc.), survival, no target physics based combat, original combat formation system and numerous other features."}, {"name": "Bubsy: Paws on Fire", "details_link": "https://www.metacritic.com/game/playstation-4/bubsy-paws-on-fire", "publisher": "Accolade", "release_date": "May 16 2019", "developers": ["Choice Provisions"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 63, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/541c5e0ed4876aba4987cd137392bd39-98.jpg", "descriptions": "From the developers of the Bit.Trip series comes the latest and greatest in bobcat-based gaming. Oinker P. Hamm is determined to capture every animal in the universe for his “Amazootorium.” Bubsy, fearing mostly for himself, is just as determined to stop him. No matter who emergesFrom the developers of the Bit.Trip series comes the latest and greatest in bobcat-based gaming. Oinker P. Hamm is determined to capture every animal in the universe for his “Amazootorium.” Bubsy, fearing mostly for himself, is just as determined to stop him. No matter who emerges victorious, there’s going to be a whole lot of yarn along the way.… Expand"}, {"name": "Planet Alpha", "details_link": "https://www.metacritic.com/game/playstation-4/planet-alpha", "publisher": "Team17", "release_date": "Sep  4 2018", "developers": ["Adrian Lazar"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 63, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/a61cf3f2d25e45233af20c818ca2abaa-98.jpg", "descriptions": "Planet Alpha, a beautiful alien world filled with mystery and danger. Injured, stranded and alone, you must harness the power of night and day as you struggle to survive while being pursued by relentless enemies."}, {"name": "Shiftlings", "details_link": "https://www.metacritic.com/game/xbox-one/shiftlings", "publisher": "Sierra Games", "release_date": "Mar  4 2015", "developers": ["Rock Pocket Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Wii U", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 63, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/bfed20be0a894c96e84406301d9e1b1c-98.jpg", "descriptions": "Rock Pocket Games' Shiftlings, a platform puzzler, which can be played both alone or with a friend, revolves around two Alien Twins who are attached to each other through a cable. In single player mode the player can switch the controls between the two aliens on top of switching the size ofRock Pocket Games' Shiftlings, a platform puzzler, which can be played both alone or with a friend, revolves around two Alien Twins who are attached to each other through a cable. In single player mode the player can switch the controls between the two aliens on top of switching the size of the two, while in co-op mode, each player controls one of the two twins. Switching size between the two characters is an important part of getting through the tricky puzzles. The smaller size enables higher jumps while the bigger Twin can't jump but instead is able to push boxes and can be used as a trampoline by the smaller counterpart. The Cable, that connects to two Twins, provides both challenges but also solutions to get the two through the puzzles and to the end goal of each level.… Expand"}, {"name": "Crush Your Enemies", "details_link": "https://www.metacritic.com/game/pc/crush-your-enemies", "publisher": "Gambitious", "release_date": "Jul 13 2016", "developers": ["Vile Monarch"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 63, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/038c19f7b50b703088e6a7c911dba38c-98.jpg", "descriptions": "Return to the glory days of Real-Time Strategy games. Crush Your Enemies has planning, choosing different types of units, managing resources, taking enemy territory and outwitting your opponent with the ingenious formations of your men."}, {"name": "Disney Tsum Tsum Festival", "details_link": "https://www.metacritic.com/game/switch/disney-tsum-tsum-festival", "publisher": "Bandai Namco Games", "release_date": "Nov  8 2019", "developers": ["Bandai Namco Games", "B.B.Studio"], "platforms": "Switch", "num_players": "2 ", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 63, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/9/421103035e6b3be79c578b357b656c22-98.jpg", "descriptions": "Earn coins, rack up points and collect Tsum Tsums. It's a big party with Disney's fluffiest little plushes. These cute and fluffy toys are coming to the Nintendo Switch and ready to delight Disney fans of all ages. Play a variety of activities with your Tsum Tsum and start racking up pointsEarn coins, rack up points and collect Tsum Tsums. It's a big party with Disney's fluffiest little plushes. These cute and fluffy toys are coming to the Nintendo Switch and ready to delight Disney fans of all ages. Play a variety of activities with your Tsum Tsum and start racking up points to build up your collection of little friends. … Expand"}, {"name": "Transformers: Revenge of the Fallen", "details_link": "https://www.metacritic.com/game/playstation-3/transformers-revenge-of-the-fallen", "publisher": "Activision", "release_date": "Jun 23 2009", "developers": ["Luxoflux", "Inc."], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Adventure", "Shooter", "Beat-'Em-Up", "Sci-Fi", "Sci-Fi", "Third-Person", "3D", "Arcade"], "meta_score": 63, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/d45466565bc17e38608d866caaf07c26-98.jpg", "descriptions": "Transformers: Revenge of the Fallen thrusts players into a battle for supremacy across the globe as either AUTOBOTS or DECEPTICONS to drive, fly, fight and blast their way through intense, pressure-packed levels. Delivering more control, players can select from a diverse range of playableTransformers: Revenge of the Fallen thrusts players into a battle for supremacy across the globe as either AUTOBOTS or DECEPTICONS to drive, fly, fight and blast their way through intense, pressure-packed levels. Delivering more control, players can select from a diverse range of playable TRANSFORMERS - each with distinct personalities, abilities and weaponry - and jump straight into action as they instantly switch between robot, vehicle and weapon modes to fight for the preservation or annihilation of all mankind. For the first time in the TRANSFORMERS universe, players can also fight the epic war between the AUTOBOTS and DECEPTICONS online in explosive, multiplayer combat. Players can take on the role of their favorite AUTOBOTS and DECEPTICONS such as Optimus Prime, Starscream, Bumblebee and Ironhide, along with new characters making their first appearance in a game.  With two distinct campaigns that allow players to save or destroy the human race, players can unlock and play missions in any order and with different characters for a whole new experience. Instantaneously convert from a colossal robot to a dynamic land or air vehicle such as a diesel truck, sports car, military chopper or fighter jet.  New, ultra-fluid transformations can be performed in-motion anytime and anywhere, allowing players to strategically propel through and decimate hordes of enemies with incredible agility. [Activision]… Expand"}, {"name": "Fracture", "details_link": "https://www.metacritic.com/game/xbox-360/fracture", "publisher": "LucasArts", "release_date": "Oct  7 2008", "developers": ["Day 1 Studios"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 63, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/0a30f70c9fca7bb974e68ca0822d2912-98.jpg", "descriptions": "Amidst a backdrop of worldwide ecological and seismological chaos in the mid-2100s, the United States has been split in two by the \"Great Flood\". As a result of the polar ice cap melting, the Mississippi River has destroyed the central portion of the United States, causing an ill-equippedAmidst a backdrop of worldwide ecological and seismological chaos in the mid-2100s, the United States has been split in two by the \"Great Flood\". As a result of the polar ice cap melting, the Mississippi River has destroyed the central portion of the United States, causing an ill-equipped Federal Government to fail and literally cutting the country in half. These two halves are left to fend for themselves in the aftermath. The East, now known as the Atlantic Alliance, symbolic of their union with Europe, puts its faith in surviving this new world in cybernetics, an established yet evolving technology now more than 150 years old. On the other side of the flooded continent, the Western states, now called the Republic of Pacifica and having allied with Asia, resort to solving their problems at the genetic level, effectively restructuring the DNA of its inhabitants -- a method the Atlantic Alliance finds morally reprehensible. By 2161, it only takes a hint of unauthorized military preparation in Pacifica for the newly restored president to order a strike in the heart of Pacifican territory -- an outpost in the now dry San Francisco Bay. This strike leads to the unthinkable: an epic conflict with global implications fought on U.S. soil. As a soldier in this struggle, Mason Briggs uses explosive, terrain-deforming weaponry to change the face of battle: He not only destroys the land in his path, he outright transforms it to gain the strategic advantage in completely unscripted ways no game has ever seen. With such a devastating arsenal at hand, Briggs never leaves any battlefield the way he found it. In addition to weaponry that allows players to do things previously only imagined, each side of the conflict, Pacifica and the Atlantic Alliance, boast soldiers with powers beyond those of ordinary men. Genetic augmentations provide Pacifican forces with amazing abilities, while Atlantic Alliance soldiers like Briggs counter the threat with the more \"traditional\" method: cybernetics. The differing states of superhumanity result in balanced yet stylistically different combat tactics that have never been seen before. [LucasArts]… Expand"}, {"name": "Madden NFL 21", "details_link": "https://www.metacritic.com/game/playstation-4/madden-nfl-21", "publisher": "Electronic Arts", "release_date": "Aug 25 2020", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Sports", "Team", "Football", "Sim"], "meta_score": 63, "users_score": 0.3, "image": "https://static.metacritic.com/images/products/games/5/cfd801b5d3413b35aeb8066b71afb5a9-98.jpg", "descriptions": "Innovative new gameplay mechanics in Madden NFL 21 deliver advanced levels of control and inspire creativity. Get crafty with the all-new Skill Stick that allows for enhanced precision on both sides of the ball. Push the limits of your legacy in Face of the Franchise: Rise To Fame. The newInnovative new gameplay mechanics in Madden NFL 21 deliver advanced levels of control and inspire creativity. Get crafty with the all-new Skill Stick that allows for enhanced precision on both sides of the ball. Push the limits of your legacy in Face of the Franchise: Rise To Fame. The new playable documentary career mode offers all-out levels of agency and depth throughout your journey to the Hall of Fame. Pull up for a brand-new season of Ultimate Team content as you earn rewards to finesse your depth chart and flex your fantasy roster on the competition. Your favorite NFL teams’ playbooks are updated in Play Now and Franchise based on new schemes and new plays utilized during the real-life NFL season. [Electronic Arts]… Expand"}, {"name": "Hasbro Family Game Night 2", "details_link": "https://www.metacritic.com/game/wii/hasbro-family-game-night-2", "publisher": "Electronic Arts", "release_date": "Oct 26 2009", "developers": ["Electronic Arts"], "platforms": ["PC", "Wii"], "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 63, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/dc104858d70e5d1319c88e942aaee527-98.jpg", "descriptions": "Everyone's favorite spud is back in HASBRO FAMILY GAME NIGHT 2 for the Nintendo Wii, and now he's got more moves than ever!  With new games like OPERATION, JENGA, BOPPIT, PICTUREKA and CONNECT 4x4, Mr. Potato head is so excited about the release of the popular family Wii game that he’sEveryone's favorite spud is back in HASBRO FAMILY GAME NIGHT 2 for the Nintendo Wii, and now he's got more moves than ever!  With new games like OPERATION, JENGA, BOPPIT, PICTUREKA and CONNECT 4x4, Mr. Potato head is so excited about the release of the popular family Wii game that he’s getting his boogie on to celebrate. [Electronic Arts]… Expand"}, {"name": "Call of Cthulhu", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-cthulhu", "publisher": "Focus Home Interactive", "release_date": "Oct 30 2018", "developers": ["Cyanide", "Cyanide Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "General", "Survival"], "meta_score": 63, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/4bd262a58a78f0e012910cd88757276b-98.jpg", "descriptions": "Plunge into Cyanide Studio's Call of Cthulhu, the official Cthulhu videogame inspired by Chaosium's classic pen and paper RPG. Uncover the chilling mysteries of this RPG-investigation game, descending deep into a world of cosmic horrors, creeping madness, and shrouded Old Gods withinPlunge into Cyanide Studio's Call of Cthulhu, the official Cthulhu videogame inspired by Chaosium's classic pen and paper RPG. Uncover the chilling mysteries of this RPG-investigation game, descending deep into a world of cosmic horrors, creeping madness, and shrouded Old Gods within Lovecraft's iconic universe.\r The Cthulhu Mythos has been fascinating audiences for generations, growing to become one of the largest shared universes ever envisioned and giving birth to countless stories, novels, movies, tabletop and videogames since the original publication of H.P. Lovecraft's The Call of Cthulhu. Adaptions and references have formed a widespread legacy stretching back to the very beginning of the 20th century, latching on to the key fear of the human psyche: that of the unknown. Now, Call of Cthulhu will bring the mythos to life like never before, on PlayStation 4, Xbox One and PC.\r In this world, nothing is as it seems. Sanity is an irregular bedfellow, all too often replaced by the whisperings in the dark. Strange creatures, weird science, and shadowy cults dominate the Cthulhu Mythos, intent on realizing their mad schemes to bring about the end of everything. Your mind will suffer -- balancing a razor-thin line between sanity and madness, your senses will be disrupted until you question the reality of everything around you. Trust no one. Creeping shadows hide lurking figures... and all the while, the Great Dreamer prepares for his awakening.… Expand"}, {"name": "OVERPASS", "details_link": "https://www.metacritic.com/game/xbox-one/overpass", "publisher": "Bigben Interactive", "release_date": "Mar 17 2020", "developers": ["Zordix Racing"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 63, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/0/b4eec99e7cd3ba36d3fd8a4ccf13d7f4-98.jpg", "descriptions": "In Overpass, the player takes control of powerful buggies and quads, scrabbling across extreme tracks and very hazardous terrain. This simulation, unique in its genre, pits the player against craggy slopes and puts their cool-headedness to the test throughout technical obstacle courses alongIn Overpass, the player takes control of powerful buggies and quads, scrabbling across extreme tracks and very hazardous terrain. This simulation, unique in its genre, pits the player against craggy slopes and puts their cool-headedness to the test throughout technical obstacle courses along wilderness tracks.Overpass's realistic physics engine requires you to keep precise and meticulous control of your speed and acceleration or you risk losing your grip and failing your crossing. You'll need to master the technical characteristics of official reproductions of buggies and quads from iconic brands such as Yamaha, Suzuki or Arctic Cat. Differential locking, 2 or 4 drive wheels, transmission type: the player has been given all the tools they need to discover the real vehicle options that will let them adapt their driving to the terrain.The Career mode lets you manage your buggies and quads and choose the one best adapted to each track and terrain type in order to win the competition and attract sponsors. In multi-player mode, you'll need to know and master the slightest detail of each track in order to post the best times and show that you are truly the master of off-roading!… Expand"}, {"name": "Outcry", "details_link": "https://www.metacritic.com/game/pc/outcry", "publisher": "The Adventure Company", "release_date": "Aug 28 2008", "developers": ["Phantomery Interactive"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "Third-Person", "Point-and-Click", "Modern"], "meta_score": 63, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/c5b060b86aec7cfb1cf576e98bed5026-98.jpg", "descriptions": "Assume the role of a middle-aged writer who receives a strange invitation from his brother that he hasn’t seen for years. Accepting his invitation, you are soon confronted with the discovery of his sudden disappearance and his connection to a mysterious machine which, according to yourAssume the role of a middle-aged writer who receives a strange invitation from his brother that he hasn’t seen for years. Accepting his invitation, you are soon confronted with the discovery of his sudden disappearance and his connection to a mysterious machine which, according to your brother, can separate one’s consciousness from his body. [DreamCatcher Interactive]… Expand"}, {"name": "Batman: Rise of Sin Tzu", "details_link": "https://www.metacritic.com/game/game-boy-advance/batman-rise-of-sin-tzu", "publisher": "Ubisoft", "release_date": "Oct 27 2003", "developers": ["Ubisoft"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 63, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/9521f6282218d2826aa7b554f5f81cb1-98.jpg", "descriptions": "In Batman: Rise of Sin Tzu, Batman faces a new enemy unlike any he has ever faced before.  The faceless foe plunges Gotham City into chaos on the night of the anniversary of Bruce Wayne's parents' murder.  Who is responsible for unleashing havoc on Gotham City?  The truth will be revealedIn Batman: Rise of Sin Tzu, Batman faces a new enemy unlike any he has ever faced before.  The faceless foe plunges Gotham City into chaos on the night of the anniversary of Bruce Wayne's parents' murder.  Who is responsible for unleashing havoc on Gotham City?  The truth will be revealed after you battle evil forces and super-villains, including Bane, Clayface, Scarecrow, and the new formidable foe--Sin Tzu.  In addition to Batman's martial arts attacks, Batman has an arsenal including the Batarang, Grappling Hook, and Smoke Bomb.… Expand"}, {"name": "Britney's Dance Beat", "details_link": "https://www.metacritic.com/game/playstation-2/britneys-dance-beat", "publisher": "THQ", "release_date": "May  8 2002", "developers": ["Metro Graphics"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 63, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/a20aedf58a71570c61d482c21c1a021b-98.jpg", "descriptions": "She's young, beautiful, and talented. Her dance moves are as hot as her songs. And, only the best dancers can join Britney Spears on her world tour. See if you have what it takes to back her up.  [THQ]"}, {"name": "Wits & Wagers", "details_link": "https://www.metacritic.com/game/xbox-360/wits-wagers", "publisher": "Microsoft Game Studios", "release_date": "May  7 2008", "developers": ["Hidden Path Entertainment"], "platforms": "Xbox 360", "num_players": "6  Online", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show", "Board / Card Game"], "meta_score": 63, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/6a4f59c3769c59f16ec9472969c2c04e-98.jpg", "descriptions": "[Xbox Live Arcade]  Wits & Wagers is a trivia party game where you don't need the right answers to win. For each question, bet on the answer you think is closest to the truth, whether or not that answer is your own. Use your knowledge of trivia, your intuition, and the odds to help decide[Xbox Live Arcade]  Wits & Wagers is a trivia party game where you don't need the right answers to win. For each question, bet on the answer you think is closest to the truth, whether or not that answer is your own. Use your knowledge of trivia, your intuition, and the odds to help decide where to bet. Seven rounds of questions - plus dancing characters and upbeat music - keep a fifteen-minute game lively for family and friends, local or online. Wits & Wagers includes 700 unique and fun questions for up to 25 hours of exciting play. The game supports one to four players at one console, or two to six players online. Invite your friends over to your house, or invite your friends online. Wits & Wagers supports both the Xbox Live Vision Camera and the Big Button Pad controller. [Hidden Path]… Expand"}, {"name": "Missile Command", "details_link": "https://www.metacritic.com/game/xbox-360/missile-command", "publisher": "Atari", "release_date": "Jul  4 2007", "developers": ["Stainless Games"], "platforms": ["iPhone/iPad", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/a4e8f653cb9473b19f3d5a9bb645418b-98.jpg", "descriptions": "[Xbox Live Arcade]  In one of the most well-known arcade games of all time, players must defend the coast from mysterious enemy invasions in Missile Command. Try your hand at this classic arcade game in its original old-school form, then experience the completely re-stylized version[Xbox Live Arcade]  In one of the most well-known arcade games of all time, players must defend the coast from mysterious enemy invasions in Missile Command. Try your hand at this classic arcade game in its original old-school form, then experience the completely re-stylized version featuring evolved graphics and the newly introduced Throttle Monkey mode. Cutting-edge next-gen graphic and sound support: Support for 4:3 and 16:9 aspect ratios, including HDTV, with Dolby Digital surround sound and full-screen anti-aliasing. Full Xbox LIVE support: Player profiles, leaderboards, and twelve all-new achievements are available for missile commanders. Accessibility: The game features a rich and immersive environment. Defend the coast against all comers. [Microsoft]… Expand"}, {"name": "Galaxy On Fire 2 Full HD", "details_link": "https://www.metacritic.com/game/pc/galaxy-on-fire-2-full-hd", "publisher": "bitComposer Games", "release_date": "Aug 21 2012", "developers": ["Fishlabs"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "General", "Space", "Combat"], "meta_score": 63, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/1d0dd0b58e7a2f6b76e588f6fb03f5c3-98.jpg", "descriptions": "Galaxy On Fire 2 Full HD is an outer space adventure with over 20 solar systems and dozen of planets."}, {"name": "Time Pilot", "details_link": "https://www.metacritic.com/game/xbox-360/time-pilot", "publisher": "Konami", "release_date": "Aug 30 2006", "developers": ["Digital Eclipse"], "platforms": ["PlayStation 4", "Switch", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Top-Down", "Vertical"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/7528b51986906f715fa2b2ff15f1fc52-98.jpg", "descriptions": "[Xbox Live Arcade] Pilot a jet fighter with the capability to travel through time to destroy wave after wave of enemies. Start in 1910 and gun down biplanes and work your way through to the 21st century piloting your craft against UFOs. Collect parachuting pilots to gain point bonuses and[Xbox Live Arcade] Pilot a jet fighter with the capability to travel through time to destroy wave after wave of enemies. Start in 1910 and gun down biplanes and work your way through to the 21st century piloting your craft against UFOs. Collect parachuting pilots to gain point bonuses and destroy enemy ships to call forth the boss in order to advance through time. [Konami]… Expand"}, {"name": "Arcania: Gothic 4", "details_link": "https://www.metacritic.com/game/pc/arcania-gothic-4", "publisher": "JoWooD Entertainment AG", "release_date": "Oct 15 2010", "developers": ["Spellbound"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "General", "Action RPG"], "meta_score": 63, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/1/9e3d84f5c1c5a6dba0b1aa713548cf8f-98.jpg", "descriptions": "The Gothic series rolls out more epic RPG action."}, {"name": "Sudden Strike 3: Arms for Victory", "details_link": "https://www.metacritic.com/game/pc/sudden-strike-3-arms-for-victory", "publisher": "cdv Software", "release_date": "Apr  1 2008", "developers": ["Fireglow"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 63, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/b46e1ffbe2b68094b313558a8fa19d78-98.jpg", "descriptions": "The game focuses on real events of the World War II. There are four campaigns; two of them are on the Pacific islands, and two of them in Europe. The player is able to play for the American or Japanese armies in the Pacific, and for the Allies or Germans in Europe. This is the first RTSThe game focuses on real events of the World War II. There are four campaigns; two of them are on the Pacific islands, and two of them in Europe. The player is able to play for the American or Japanese armies in the Pacific, and for the Allies or Germans in Europe. This is the first RTS engine to render accurate vast marine and land battlefields (maps contain more than 150 \"virtual\" square kilometers). The game introduces tight team play between all arms of the fighting forces: Naval battles supported by aviations - There are short- and long-range bomber, torpedo bombers, attack bombers, fighters, and transports. Groups of ships with carriers are a powerful force capable of not only to conduct operations at sea, but also to support the large ground operations (supported by carrier-based aircrafts and large-caliber on-ship guns). Submarines and aviation hunting enemy's transport ships caravans - Using different types of submarines in special operations, one can make sudden strikes on transports and battle ships of opponents; if the strike succeeds, the enemy will lose part of the reinforcement, and will lose opportunity to have significant navy. Radar systems allow players to more successfully defend of air and naval attacks of opponents. [Fireglow]… Expand"}, null, {"name": "Hunting Simulator 2", "details_link": "https://www.metacritic.com/game/xbox-one/hunting-simulator-2", "publisher": "Maximum Games", "release_date": "Jun 30 2020", "developers": ["Neopica", "Maximum Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Nature", "Hunting"], "meta_score": 63, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/85aeaa6ca7fafe3ec1808979bf6759ed-98.jpg", "descriptions": "With your hunting dog by your side, explore the Texan desert and forests of Colorado and Europe as you track down 33 animal species. Choose your gear from over 160 official weapons, accessories and clothing items (including Browning, Winchester and Bushnell)."}, {"name": "Shiftlings", "details_link": "https://www.metacritic.com/game/playstation-4/shiftlings", "publisher": "Sierra Games", "release_date": "Mar  3 2015", "developers": ["Rock Pocket Games"], "platforms": ["PC", "Switch", "Wii U", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 63, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/a4977af6a711fc679f9b2bf9477bc50e-98.jpg", "descriptions": "Rock Pocket Games' Shiftlings, a platform puzzler, which can be played both alone or with a friend, revolves around two Alien Twins who are attached to each other through a cable. In single player mode the player can switch the controls between the two aliens on top of switching the size ofRock Pocket Games' Shiftlings, a platform puzzler, which can be played both alone or with a friend, revolves around two Alien Twins who are attached to each other through a cable. In single player mode the player can switch the controls between the two aliens on top of switching the size of the two, while in co-op mode, each player controls one of the two twins. Switching size between the two characters is an important part of getting through the tricky puzzles. The smaller size enables higher jumps while the bigger Twin can't jump but instead is able to push boxes and can be used as a trampoline by the smaller counterpart. The Cable, that connects to two Twins, provides both challenges but also solutions to get the two through the puzzles and to the end goal of each level.… Expand"}, {"name": "Teen Titans", "details_link": "https://www.metacritic.com/game/gamecube/teen-titans", "publisher": "THQ", "release_date": "May 24 2006", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action Adventure", "Modern"], "meta_score": 63, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/6cb7d0f5a50440c47d7c1e97556b5a1b-98.jpg", "descriptions": "Teen Titans, the popular TV show and DC comic, crosses to another medium as the five main characters undertake a video game-based adventure. All five main characters--Robin, Starfire, Beast Boy, Cyborg, and Raven--use their powers to battle against the team's main archvillains. This actionTeen Titans, the popular TV show and DC comic, crosses to another medium as the five main characters undertake a video game-based adventure. All five main characters--Robin, Starfire, Beast Boy, Cyborg, and Raven--use their powers to battle against the team's main archvillains. This action game lets you switch characters on the fly, which lets you maximize their unique abilities throughout each level.… Expand"}, {"name": "Quest for Infamy", "details_link": "https://www.metacritic.com/game/pc/quest-for-infamy", "publisher": "Phoenix Online Publishing", "release_date": "Jul 10 2014", "developers": ["Infamous Quests"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 63, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/8dfe5de1cf076ebeb0f06c8df5aaec28-98.jpg", "descriptions": "Why Be Famous When You Can Be Infamous?Return to the glory days of role-playing and adventure with this humor-filled fantasy epic, styled in the vein of classic PC RPGs, where you play the charming villain. Blending turn-based combat and spellcasting with puzzle solving and adventure,Why Be Famous When You Can Be Infamous?Return to the glory days of role-playing and adventure with this humor-filled fantasy epic, styled in the vein of classic PC RPGs, where you play the charming villain. Blending turn-based combat and spellcasting with puzzle solving and adventure, players can choose from three character classes -- brigand (strength), rogue (stealth), or sorcerer (magic), each with unique storylines and adventures -- in one of the largest retro role-playing experiences ever. A spiritual heir to yesteryear's heroic quests, adventurers are invited to explore a world of hand-drawn wonder, as they wind their way through trap-infested dungeons, battle slavering beasts with swords or custom-made spells, and steal entire town's worth of treasure from unsuspecting townsfolk. Being bad has never felt so good!… Expand"}, {"name": "Pirates of the Caribbean: Dead Man's Chest", "details_link": "https://www.metacritic.com/game/ds/pirates-of-the-caribbean-dead-mans-chest", "publisher": "Buena Vista Games", "release_date": "Jun 27 2006", "developers": ["Amaze Entertainment"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 63, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/2b06469c4407d103edc153a7985d2271-98.jpg", "descriptions": "Players will be able to play as Captain Jack Sparrow, Will Turner and Elizabeth Swann as they explore and brawl across land and sea on a memorable quest in search of the legendary Dead Man's Chest. The game features thrilling moments from the movie and expands the fantasy of the franchise byPlayers will be able to play as Captain Jack Sparrow, Will Turner and Elizabeth Swann as they explore and brawl across land and sea on a memorable quest in search of the legendary Dead Man's Chest. The game features thrilling moments from the movie and expands the fantasy of the franchise by offering exciting new adventures and locations inspired by the rich \"Pirates of the Caribbean\" universe. [Buena Vista Games]… Expand"}, {"name": "The Book of Unwritten Tales 2", "details_link": "https://www.metacritic.com/game/playstation-4/the-book-of-unwritten-tales-2", "publisher": "Nordic Games Publishing", "release_date": "Sep 18 2015", "developers": ["KING Art"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 63, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/dc38d11affda5dbcf5d88d895a4ba380-98.jpg", "descriptions": "Join Wilbur, Ivo, Nate and Critter in another classic point-and-click adventure in the wicked world of Aventasia."}, {"name": "Tokyo Twilight Ghost Hunters", "details_link": "https://www.metacritic.com/game/playstation-vita/tokyo-twilight-ghost-hunters", "publisher": "Aksys Games", "release_date": "Mar 10 2015", "developers": ["TOYBOX"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita"], "genres": ["Role-Playing", "Strategy", "Turn-Based", "General"], "meta_score": 63, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/f293ee2d71c189d9d8d9a9197e91465c-98.jpg", "descriptions": "A gaggle of teens are prepared to square off against the evil spirits that have been the cause of strange incidents all across Tokyo..."}, {"name": "Bakugan Battle Brawlers", "details_link": "https://www.metacritic.com/game/playstation-3/bakugan-battle-brawlers", "publisher": "Activision", "release_date": "Oct 20 2009", "developers": ["Now Production"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 63, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/092057e1afb39581c31b612bd9a08ffa-98.jpg", "descriptions": "Bakugan is based on the story of Dan and his friends whose lives were forever changed when mysterious cards fell from the sky.  Creating a game from the cards where powerful creatures known as Bakugan battle, it wasn’t long before they discovered that their hobby was much more than just aBakugan is based on the story of Dan and his friends whose lives were forever changed when mysterious cards fell from the sky.  Creating a game from the cards where powerful creatures known as Bakugan battle, it wasn’t long before they discovered that their hobby was much more than just a simple pastime.  Utilizing special game cards Bakugan battle masters roll spheres onto the cards, which activate and transform into Bakugan “battle brawling” action figures. [Activision]… Expand"}, {"name": "Track & Field", "details_link": "https://www.metacritic.com/game/xbox-360/track-field", "publisher": "Konami", "release_date": "Aug  8 2007", "developers": ["Digital Eclipse"], "platforms": ["PlayStation 4", "Switch", "Xbox 360"], "num_players": "4  Online", "genres": ["Action", "Sports", "General", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 63, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/302789c0cc83a0949d52b3cf0fe1a988-98.jpg", "descriptions": "[Xbox Live Arcade]  Race the 100m Dash and 110m Hurdles, test your skills with the Javelin and Hammer Throw, and hop to it with the Long Jump and High Jump. Global leaderboards will compare your skills to see where you truly rank in the world. Compete with up to four other athletes on one[Xbox Live Arcade]  Race the 100m Dash and 110m Hurdles, test your skills with the Javelin and Hammer Throw, and hop to it with the Long Jump and High Jump. Global leaderboards will compare your skills to see where you truly rank in the world. Compete with up to four other athletes on one Xbox or over Xbox LIVE. Button-smashing multiplayer experience:Compete in events with up to four players in Xbox LIVE Versus Mode. Go head-to-head in the running events. Host your own World Champion party. Track your achievements with all-time and weekly leaderboards for high score, event results, and win/loss ratios. Choose either the authentic original graphics or the enhanced graphics including new special effects and hand-painted game sprites and backgrounds. All music and sound effects have been digitally enhanced to sound richer and deeper. Twelve new achievements ranging from easy to hard encourage you to become a World Champion atTrack & Field. [Microsoft]… Expand"}, {"name": "Impact Winter", "details_link": "https://www.metacritic.com/game/pc/impact-winter", "publisher": "Bandai Namco Games", "release_date": "May 22 2017", "developers": ["Mojo Bones"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 63, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/5/8f9a1ec16b5dec3d698f804086d0629c-98.jpg", "descriptions": "\"In 30 days, help is coming…\" A mysterious radio transmission claims that help is inbound. You are Jacob Solomon: leader of a makeshift team trying to survive the aftermath of a devastating asteroid collision. Your goal: lead your team to survival."}, {"name": "Wakeboarding HD", "details_link": "https://www.metacritic.com/game/playstation-3/wakeboarding-hd", "publisher": "Creat Studios", "release_date": "Mar 25 2010", "developers": ["Creat Studios", "Tik Games", "LLC", "TikGames"], "platforms": "PlayStation 3", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Individual", "Wakeboarding", "Wakeboarding", "Surf / Wakeboard"], "meta_score": 63, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/7cc0b7aa93225575b7b10c2026f169bc-98.jpg", "descriptions": "[Playstation Network]  Grab your board and hold on tight!  Wakeboarding HD drops players into 20 high-speed, water-filled, arcade levels to maneuver through tracks, perform high-flying tricks, collect bonuses and avoid dangers from exploding mines to bloodthirsty sharks.  Gamers of all ages[Playstation Network]  Grab your board and hold on tight!  Wakeboarding HD drops players into 20 high-speed, water-filled, arcade levels to maneuver through tracks, perform high-flying tricks, collect bonuses and avoid dangers from exploding mines to bloodthirsty sharks.  Gamers of all ages can show their skills and wreak havoc as the tropical paradise resort transforms into an action-packed extreme playground.… Expand"}, {"name": "Chaos Field", "details_link": "https://www.metacritic.com/game/gamecube/chaos-field", "publisher": "O3 Entertainment", "release_date": "Dec 20 2005", "developers": ["MileStone Inc."], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 63, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/fc79a95facdf9f02943deffec94b13f0-98.jpg", "descriptions": "Chaos Field is O3 Entertainment's adaptation of the space-shooting Japanese arcade hit of the same name. The game includes three characters, five levels, and multiple weapons to assist you in your 2D shootouts. During gameplay, you can shoot other bullets as they fly at you and use an energyChaos Field is O3 Entertainment's adaptation of the space-shooting Japanese arcade hit of the same name. The game includes three characters, five levels, and multiple weapons to assist you in your 2D shootouts. During gameplay, you can shoot other bullets as they fly at you and use an energy field to absorb the ones you miss. The game will be released on the Dreamcast in Japan. … Expand"}, {"name": "Dragon Ball Z Budokai HD Collection", "details_link": "https://www.metacritic.com/game/xbox-360/dragon-ball-z-budokai-hd-collection", "publisher": "Namco Bandai Games", "release_date": "Nov  6 2012", "developers": ["Pyramid"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 63, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/b7fdf9ca3ccdb65eb1b3ed3acc412698-98.jpg", "descriptions": "The Dragon Ball Z Budokai HD Collection includes two blockbuster fighting games based on the Dragon Ball Z anime series. Included are Dragon Ball Z Budokai and Dragon Ball Z Budokai 3.Dragon Ball Z Budokai --- Fight to the finish against the deadliest fighters in the universe and take onThe Dragon Ball Z Budokai HD Collection includes two blockbuster fighting games based on the Dragon Ball Z anime series. Included are Dragon Ball Z Budokai and Dragon Ball Z Budokai 3.Dragon Ball Z Budokai --- Fight to the finish against the deadliest fighters in the universe and take on the most powerful heroes and the most evil villains in Dragon Ball Z. The more you win, the more difficult it gets. Can you survive?Dragon Ball Z Budokai 3 -- A \"Hall of Fame\" cast of warriors from Dragon Ball Z, Dragon Ball GT, and DBZ movies come together for a tournament of champions. With the power of the new Saiyan Overdrive Fighting System, players have unprecedented gameplay control and Dragon Ball Z authenticity.… Expand"}, {"name": "Michael Jackson The Experience", "details_link": "https://www.metacritic.com/game/xbox-360/michael-jackson-the-experience", "publisher": "Ubisoft", "release_date": "Apr 12 2011", "developers": ["Ubisoft Montreal"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Rhythm", "General", "Dancing", "Dancing"], "meta_score": 63, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/841be38b320719418ec204253caae6b6-98.jpg", "descriptions": "Michael Jackson, one of the most widely beloved entertainers and the most popular global icons of all time, leaves an indelible imprint on popular music and culture. During his extraordinary career Jackson sold an estimated 750 million records worldwide, released 13 No.1 singles and becameMichael Jackson, one of the most widely beloved entertainers and the most popular global icons of all time, leaves an indelible imprint on popular music and culture. During his extraordinary career Jackson sold an estimated 750 million records worldwide, released 13 No.1 singles and became one of a handful of artists to be inducted twice into the Rock and Roll Hall of Fame. He won 13 Grammy Awards and received the American Music Award's Artist of the Century Award. His album “Thriller” is the world’s best-selling album of all time with more than 110 million copies sold. … Expand"}, {"name": "Space Hack", "details_link": "https://www.metacritic.com/game/pc/space-hack", "publisher": "Meridian4", "release_date": "Nov 18 2005", "developers": ["Rebelmind"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 63, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/020a9fe2e11e3bcc5a8a57c4b328907e-98.jpg", "descriptions": "Space Hack is a sci-fi Action/RPG title with Diablo-inspired gameplay mechanics, presented in real-time 3D graphics. The story puts gamers on a colony transport ship that suddenly gets trapped inside a Black Nebula, but thatâ??s only their first problem. While trapped, they get boarded bySpace Hack is a sci-fi Action/RPG title with Diablo-inspired gameplay mechanics, presented in real-time 3D graphics. The story puts gamers on a colony transport ship that suddenly gets trapped inside a Black Nebula, but thatâ??s only their first problem. While trapped, they get boarded by aliens that take over the ship and begin to kill and eat the colonists. Playing the role of a tough, gristled ex-military man, gamers will struggle to reach an emergency transport module at the far end of the ship to free the remaining colonists, hacking and slashing their way through hordes of alien creatures along the way. [Meridian4]… Expand"}, {"name": "THE HOUSE OF THE DEAD: Remake", "details_link": "https://www.metacritic.com/game/playstation-4/the-house-of-the-dead-remake", "publisher": "Forever Entertainment", "release_date": "Apr 28 2022", "developers": ["MegaPixel Studio"], "platforms": ["PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 63, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/e1f7c153374da357025e49cd46f33834-98.jpg", "descriptions": "Nobody leaves here alive!The House of the Dead: Remake is a remade version of the game introduced in 1997 in arcade platform. A classic arcade rail-shooter receives a whole new entourage and gameplay changes to suit modern gaming standards.\n\n* Hordes of the undead monstrosities in aNobody leaves here alive!The House of the Dead: Remake is a remade version of the game introduced in 1997 in arcade platform. A classic arcade rail-shooter receives a whole new entourage and gameplay changes to suit modern gaming standards.* Hordes of the undead monstrosities in a fast-paced rail-shooter. * True to the original gameplay. * Well known arcade classic with modern graphics and controls. * Multiple endings.… Expand"}, {"name": "Reverie Knights Tactics", "details_link": "https://www.metacritic.com/game/pc/reverie-knights-tactics", "publisher": "1C Entertainment", "release_date": "Jan 25 2022", "developers": ["40 Giants Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/223238461e1a7207fb2e56a477b63ffa-98.jpg", "descriptions": "Reverie Knights Tactics is a turn-based tactical RPG with strategic battles in isometric grids where every decision can alter the story. Travel through a hand-drawn fantasy world and lead your heroes in a story-rich adventure, visual novel style."}, {"name": "Astria Ascending", "details_link": "https://www.metacritic.com/game/playstation-5/astria-ascending", "publisher": "Dear Villagers", "release_date": "Sep 30 2021", "developers": ["Artisan Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 63, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/4fa0536fd59fc0458373a0cf0ff5de6a-98.jpg", "descriptions": "Explore a vast world on the brink of chaos in a mature, emotional JRPG. Experience an epic story with rewarding turn-based combat and expansive customization rendered in glorious 4K hand drawn visuals."}, {"name": "Gods Will Fall", "details_link": "https://www.metacritic.com/game/playstation-4/gods-will-fall", "publisher": "Deep Silver", "release_date": "Jan 28 2021", "developers": ["Clever Beans"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 63, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/941754cd6964cc5a6ea2c812be5e139b-98.jpg", "descriptions": "The gods’ torturous rule over humanity has lasted for millennia. Bent on cruelty and suffering, they demand to be served with blind worship through an oath of fealty pledged from every man, woman and child. To those who don't submit to the gods’ will; a slow and merciless death awaits."}, {"name": "Bookbound Brigade", "details_link": "https://www.metacritic.com/game/pc/bookbound-brigade", "publisher": "IntraGames", "release_date": "Jan 30 2020", "developers": ["Digital Tales"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "Metroidvania"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/d166593f725ff1306d18cc0d0bf47122-98.jpg", "descriptions": "Can you imagine if all the protagonists of books lost their memory? Venture into their world and beat the hell out of historical and literary characters you studied in school. Bookbound Brigade is a new take on the established Metroidvania genre where you get to lead a colorful bunch of realCan you imagine if all the protagonists of books lost their memory? Venture into their world and beat the hell out of historical and literary characters you studied in school. Bookbound Brigade is a new take on the established Metroidvania genre where you get to lead a colorful bunch of real and fictional heroes.… Expand"}, {"name": "The Low Road", "details_link": "https://www.metacritic.com/game/switch/the-low-road", "publisher": "XGenStudios", "release_date": "Aug 23 2018", "developers": ["XGenStudios"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/9a0032991461b35fd5f647e05c583ff1-98.jpg", "descriptions": "Lie, blackmail, and steal your way down The Low Road. The Low Road is a point-and-click graphic adventure game in which rookie agent Noomi Kovacs must navigate her way through the world of corporate espionage in this dark spy comedy set in the 1970s. Sporting a unique visual style inspiredLie, blackmail, and steal your way down The Low Road. The Low Road is a point-and-click graphic adventure game in which rookie agent Noomi Kovacs must navigate her way through the world of corporate espionage in this dark spy comedy set in the 1970s. Sporting a unique visual style inspired by gouache paintings and a pulsating rock and roll score, \"The Low Road\" will captivate players through intricate puzzles, branching moral dilemmas, and a quirky cast of memorable characters. … Expand"}, {"name": "Pop-Up Pilgrims", "details_link": "https://www.metacritic.com/game/playstation-4/pop-up-pilgrims", "publisher": "Dakko Dakko", "release_date": "Feb 13 2018", "developers": ["Dakko Dakko"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/52b1e16960a0ab6a59ae73b6c346aced-98.jpg", "descriptions": "Wear your PS VR headset and use the simple controls to guide the pilgrims around a variety of stages."}, {"name": "Sudden Strike 4", "details_link": "https://www.metacritic.com/game/playstation-4/sudden-strike-4", "publisher": "Kalypso", "release_date": "Aug 15 2017", "developers": ["Kalypso"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 63, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/36c371267e46157275d55cc17d23ed49-98.jpg", "descriptions": "Sudden Strike is back! The beloved Real Time Strategy series returns, this time with bigger battlefields, more units, better graphics, new scenarios and legendary commanders with individual abilities  all of which makes Sudden Strike 4 more tactical and realistic than ever before!\r SuddenSudden Strike is back! The beloved Real Time Strategy series returns, this time with bigger battlefields, more units, better graphics, new scenarios and legendary commanders with individual abilities  all of which makes Sudden Strike 4 more tactical and realistic than ever before!\r Sudden Strike 4 sends you off on three extensive campaigns set amongst the battlefields of World War 2. Commanding the British and American, German or Soviet troops, you will lead over 100 different units into battle; like the German bomber Heinkel He111, the Russian T-34 tank, the British Hawker Typhoon fighter plane and the notorious German PanzerkampfwagenVI Tiger. In a first for the Sudden Strike series, you can now choose from one of nine individual commanders, such as George Patton or Bernard Montgomery, who will each allow for different approaches to combat and boast unique abilities.\r Prove your strategic expertise in over 20 demanding single player scenarios, the challenge-focused skirmish mode and the ultra-competitive multiplayer mode. Excellence will be rewarded through a unique reward system, where successfully completing missions will unlock exclusive content, such as historical film footage from the era.\r Sudden Strike 4 offers countless ways to vanquish your opponents. Exploit the weak spots of tanks, set up an ambush, occupy buildings with infantry, outmaneuver the enemy with clever positioning or unleash devastating air strikes  how you approach each mission is up to you!… Expand"}, {"name": "Ninja Usagimaru: The Mysterious Karakuri Castle", "details_link": "https://www.metacritic.com/game/3ds/ninja-usagimaru-the-mysterious-karakuri-castle", "publisher": "Aksys Games", "release_date": "Sep 29 2016", "developers": ["Arc System Works"], "platforms": "3DS", "genres": ["Puzzle", "General"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/a028ac596dbd8d34763f0124ad1a363a-98.jpg", "descriptions": "Ninja Usagimaru: The Mysterious Karakuri Castle is an action puzzle game that challenges players to put their sharpened ninja skills to the test! Taking place in a time long forgotten by men, players assume the role of Usagimaru, a legendary hero who embarks on a massive quest to save hisNinja Usagimaru: The Mysterious Karakuri Castle is an action puzzle game that challenges players to put their sharpened ninja skills to the test! Taking place in a time long forgotten by men, players assume the role of Usagimaru, a legendary hero who embarks on a massive quest to save his village from the clutches of vile monsters.… Expand"}, {"name": "The Westport Independent", "details_link": "https://www.metacritic.com/game/pc/the-westport-independent", "publisher": "Coffee Stain Studios", "release_date": "Jan 21 2016", "developers": ["Double Zero One Zero"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 63, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/0068520cfe47c07830a6678eebf8358a-98.jpg", "descriptions": "The Westport Independent is a censorship simulator set in a post-war country, governed by the recently elected Loyalist Party. As the editor of one of the final remaining independent newspapers in the country, your task is to remove and edit the content of your paper, affecting the people’sThe Westport Independent is a censorship simulator set in a post-war country, governed by the recently elected Loyalist Party. As the editor of one of the final remaining independent newspapers in the country, your task is to remove and edit the content of your paper, affecting the people’s opinion of both the rebels and the Loyalist government. With an increase of rebel activity and an ever watching government breathing down your neck, whose truth will you print?… Expand"}, {"name": "Sword Art Online: Lost Song", "details_link": "https://www.metacritic.com/game/playstation-4/sword-art-online-lost-song", "publisher": "Bandai Namco Games", "release_date": "Nov 17 2015", "developers": ["Bandai Namco Games", "Artdink"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 63, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/d3188d9c3fce7efff30f602207c786fe-98.jpg", "descriptions": "Sword Art Online: Lost Song features all-new Aerial Battles and an array of customization features. With an original story based on the ALfheim Online realm, fans will be able to play as Kirito or other key characters from Sword Art Online including Leafa and Asuna to explore Svart ALfheim,Sword Art Online: Lost Song features all-new Aerial Battles and an array of customization features. With an original story based on the ALfheim Online realm, fans will be able to play as Kirito or other key characters from Sword Art Online including Leafa and Asuna to explore Svart ALfheim, a brand new area of ALfheim Online. Players will also be able to create their own customizable avatar and experience co-op play with up to three other friends online.… Expand"}, {"name": "Samurai Warriors Chronicles 3", "details_link": "https://www.metacritic.com/game/3ds/samurai-warriors-chronicles-3", "publisher": "Koei Tecmo Games", "release_date": "Jun 30 2015", "developers": ["Omega Force"], "platforms": ["PlayStation Vita", "3DS"], "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 63, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/bf80f6901e567d1d51c3fb3ef2e9ecf3-98.jpg", "descriptions": "In the Story Mode, players control either a uniquely customized character or one of the much loved, historically-inspired Samurai. Stories and lives unfold in multiple ways offering numerous resolutions to large scale battles and multiple endings affected by the players’ choices, actions,In the Story Mode, players control either a uniquely customized character or one of the much loved, historically-inspired Samurai. Stories and lives unfold in multiple ways offering numerous resolutions to large scale battles and multiple endings affected by the players’ choices, actions, and affiliations.… Expand"}]