[{"name": "Resident Evil 2", "details_link": "https://www.metacritic.com/game/dreamcast/resident-evil-2", "publisher": "Capcom", "release_date": "Dec  6 2000", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "Dreamcast"], "genres": ["Action Adventure", "Horror"], "meta_score": 77, "users_score": 9.2, "image": "https://static.metacritic.com/images/products/games/2/3cbfa139086a7eed9baf67e236e876c8-98.jpg", "descriptions": "Ready or not, the terror of Resident Evil 2 is here.  In chapter one, the case of the disastrous T-virus outbreak--a mutagenic toxin designed for biological weapons--was eventually closed but the experiments were far from over.  Control the destiny of Leon Kennedy or Claire Redfield as theirReady or not, the terror of Resident Evil 2 is here.  In chapter one, the case of the disastrous T-virus outbreak--a mutagenic toxin designed for biological weapons--was eventually closed but the experiments were far from over.  Control the destiny of Leon Kennedy or Claire Redfield as their nightmare begins when a biotech terror runs rampant in Raccoon City.  Relentless zombies and hideous monsters are all out for a taste of your blood.  If the suspense doesn't kill you, something else will.… Expand"}, {"name": "Demolition Racer: No Exit", "details_link": "https://www.metacritic.com/game/dreamcast/demolition-racer-no-exit", "publisher": "Infogrames", "release_date": "Oct 23 2000", "developers": ["Pitbull Syndicate"], "platforms": "Dreamcast", "num_players": "1-2 ", "genres": ["Driving", "Demolition Derby"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/37c73c7c2d79ace02783d7071f29b300-98.jpg", "descriptions": "Infogrames has lifted a formerly average game on the PlayStation to greatness on the Dreamcast."}, {"name": "SimCity 3000 Unlimited", "details_link": "https://www.metacritic.com/game/pc/simcity-3000-unlimited", "publisher": "Maxis", "release_date": "May 16 2000", "developers": ["Maxis"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "City Building", "Management", "Modern", "Modern", "Government"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/8738a2ef4e66ad95b5381560b5167575-98.jpg", "descriptions": "Create and control your urban empire with more power than ever before. With SimCity 3000™ plus much more. Expand your SimCities with two new building sets from Asia and Europe. Take on 13 challenging scenarios or create your own. Unleash four new disasters including an unforgivingCreate and control your urban empire with more power than ever before. With SimCity 3000™ plus much more. Expand your SimCities with two new building sets from Asia and Europe. Take on 13 challenging scenarios or create your own. Unleash four new disasters including an unforgiving whirlpool and plummenting space junk. This is truly SimCity™ without limits!… Expand"}, {"name": "SkyDrift", "details_link": "https://www.metacritic.com/game/xbox-360/skydrift", "publisher": "Digital Reality", "release_date": "Sep  7 2011", "developers": ["Digital Reality"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Arcade", "Arcade", "Other", "Automobile"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/f438ea53ee618b954b3aee7b35f5881a-98.jpg", "descriptions": "Admire the amazingly detailed dynamic terrains and incredible vistas, from a desert canyon to a tropical island to arctic glaciers based on the most spectacular and exotic locations all over the planet. The breathtaking landscape includes monumental rocks, volcanic lava flows, scenic riversAdmire the amazingly detailed dynamic terrains and incredible vistas, from a desert canyon to a tropical island to arctic glaciers based on the most spectacular and exotic locations all over the planet. The breathtaking landscape includes monumental rocks, volcanic lava flows, scenic rivers and ice fields that provide a memorable experience in incredible graphics rarely seen in digital-only titles.… Expand"}, {"name": "NCAA Football 14", "details_link": "https://www.metacritic.com/game/xbox-360/ncaa-football-14", "publisher": "EA Sports", "release_date": "Jul  9 2013", "developers": ["EA Tiburon"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Online Multiplayer", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 77, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/03fce77de73dcd53a9664c278f2dca2d-98.jpg", "descriptions": "This year's new physics-based animation system and a wholly re-engineered spread and read option game affect the outcome of every play allowing you to stay true to your favorite team."}, {"name": "Evolve", "details_link": "https://www.metacritic.com/game/pc/evolve", "publisher": "2K Games", "release_date": "Feb  9 2015", "developers": ["Turtle Rock Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 77, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/6/fcddf699f6c39f2fee4ce71c7bb6010f-98.jpg", "descriptions": "In a savage world of man vs nature, are you the hunter or the hunted? The creators of Left 4 Dead, Turtle Rock Studios, bring you EVOLVE, the next-generation of multiplayer shooters where four hunters face-off against a single, player-controlled monster. Stalk your prey, execute your attackIn a savage world of man vs nature, are you the hunter or the hunted? The creators of Left 4 Dead, Turtle Rock Studios, bring you EVOLVE, the next-generation of multiplayer shooters where four hunters face-off against a single, player-controlled monster. Stalk your prey, execute your attack and prove you are the apex predator in adrenaline-pumping 4V1 matches.… Expand"}, {"name": "Need for Speed: Hot Pursuit Remastered", "details_link": "https://www.metacritic.com/game/xbox-one/need-for-speed-hot-pursuit-remastered", "publisher": "Electronic Arts", "release_date": "Nov  6 2020", "developers": ["Criterion Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 77, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/23e2c980f493f9be12a494df017bbdc9-98.jpg", "descriptions": "Feel the thrill of the chase and the rush of escape in Need for Speed™ Hot Pursuit Remastered on Nintendo Switch™. Unleash a savage sense of speed both as an outlaw and a cop in the world's hottest high-performance cars. Outsmart the heat or take down lawbreakers with the tactical weaponryFeel the thrill of the chase and the rush of escape in Need for Speed™ Hot Pursuit Remastered on Nintendo Switch™. Unleash a savage sense of speed both as an outlaw and a cop in the world's hottest high-performance cars. Outsmart the heat or take down lawbreakers with the tactical weaponry at your disposal in a heart-pumping, socially competitive racing experience. Updated with enhanced visuals, cross-platform multiplayer – including the asynchronous competition powered by Autolog – plus all additional DLC content, this is the ultimate edition of Criterion Games’ critically acclaimed Need for Speed debut. It’s time to reignite the pursuit.\r CROSS-PLATFORM MULTIPLAYER AND AUTOLOG – Bolt down the winding Seacrest County roads headfirst in racing that is socially competitive at its core. The groundbreaking Autolog connects you and your friends in head-to-head pursuits and races and instinctively delivers challenges based on your friends’ activities. This highly dynamic system is fueled by friendly competition and is now supported with cross-platform sync and new multiplayer gameplay so that you can race each other no matter what platform you are on.\r ALL DLC INCLUDED, PLUS MORE UPDATES – Get all the additional DLC content delivered at launch including an extra six hours of gameplay and more than 30 challenges. Brand new achievements, wraps, car colors, reduced hard stops, an updated photo mode and gallery, and multiple quality of life updates create an even more well-rounded gameplay experience this time around.\r EXOTIC CARS WITH WEAPONS – Drive the world’s most desirable supercars on both sides of the law. Bust suspects in supercharged cop interceptors enhanced with tactical weaponry, or level the playing field with counterattacks and defensive maneuvers as an elite racer. Strategize to gain an edge over the competition, no matter what side you’re on!\r CHASE AND ESCAPE – A deep and fully-defined single-player career delivers the action of both cops and racers, with a seamlessly linked multiplayer experience across all race modes. Take on friends or play through the career solo to earn Bounty and unlock new cars, weapons, and equipment.\r ENHANCED VISUALS – Need for Speed: Hot Pursuit Remastered delivers a timeless racing experience updated for today’s generation of hardware with enhanced visuals.… Expand"}, {"name": "Cross Racing Championship 2005", "details_link": "https://www.metacritic.com/game/pc/cross-racing-championship-2005", "publisher": "Graphsim Entertainment", "release_date": "Oct  4 2005", "developers": ["Invictus"], "platforms": "PC", "num_players": "8  Online", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/87ed482290c77cfff55f287073c1b27c-98.jpg", "descriptions": "Utilizing the next generation of the Invictus Engine which incorporates its new real-time physics module, Cross Racing Championship (CRC) will allow the player to experience the thrills of high-speed on and off road racing across vast open terrains. The player can contest over 60 racesUtilizing the next generation of the Invictus Engine which incorporates its new real-time physics module, Cross Racing Championship (CRC) will allow the player to experience the thrills of high-speed on and off road racing across vast open terrains. The player can contest over 60 races across six distinct environments, ranging from icy mountainous regions and lush countryside to parched desert areas and beaches. CRC will appeal to Rally fans and road-racing fans with its crossover approach to vehicles and race circuits. CRC features multiplayer action and extensive set-up options which are an integral part of the game, along with realistic real-time damage and stunning graphical effects including High Dynamic Range imaging, bump mapping, dynamic environmental reflections and motion blur and dynamic and automatic image contrast balancing.\rThe vehicles are fully user-customisable, both in their appearance and performance, using an intuitive and powerful interface. The game also features TV replay options and realistic sound effects. [Project 3]… Expand"}, {"name": "Disney Classic Games: Aladdin and the Lion King", "details_link": "https://www.metacritic.com/game/playstation-4/disney-classic-games-aladdin-and-the-lion-king", "publisher": "Nighthawk Interactive", "release_date": "Oct 29 2019", "developers": ["Digital Eclipse"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 77, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/7/c133a3b3563b4ee23b9cfa44a38a1fba-98.jpg", "descriptions": "Two Disney games make their long-awaited return to modern consoles in Disney Classic Games: Aladdin and The Lion King. This package of Disney classics is filled with tons of new features, enhancements, game modes, and display options, plus multiple versions of the games. Join Aladdin and hisTwo Disney games make their long-awaited return to modern consoles in Disney Classic Games: Aladdin and The Lion King. This package of Disney classics is filled with tons of new features, enhancements, game modes, and display options, plus multiple versions of the games. Join Aladdin and his sidekick, Abu, as they race through the marketplace toward their date with destiny. Relive Aladdin’s classic adventure as you travel through Agrabah, the Cave of Wonders and more to defeat Jafar and rescue Jasmine.  Jump, fight, dodge and carpet-ride your way through this adventure, collecting gems along the way.  The Lion King brings to life the majesty and mystery of Africa through the tale of Simba, a lion cub faced with the challenging transition to maturity. Now, you too can be part of the adventure.  Driven into the wilderness by his evil uncle Scar, Simba finds salvation and Hakuna Matata with Pumbaa the warthog and Timon the meerkat.  Tackle heinous hyenas in the elephant’s graveyard, avoid the trampling hooves of stampeding wildebeest as you battle through 10 levels to ensure Simba claims his rightful place as The Lion King.… Expand"}, {"name": "Inazuma Eleven Go: Chrono Stones: Wildfire", "details_link": "https://www.metacritic.com/game/3ds/inazuma-eleven-go-chrono-stones-wildfire", "publisher": "Level 5", "release_date": "Mar 27 2015", "developers": ["Level 5"], "platforms": "3DS", "genres": ["Sports", "Soccer", "Arcade", "Team"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/bdc9a8bbf1a5d702d3da61c3e3fe5d82-98.jpg", "descriptions": "Fight for the future of football in Inazuma Eleven GO Chrono Stones: Wildfire and Thunderflash on Nintendo 3DS and 2DS, as the Raimon Jr. High team thrust themselves into a time-bending RPG, where new armourfied Fighting Spirits, new characters, and new footballing adventures await."}, {"name": "MotoGP 21", "details_link": "https://www.metacritic.com/game/playstation-5/motogp-21", "publisher": "Koch Media", "release_date": "Apr 22 2021", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 22 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 77, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/298a9419fa24f742a3499157e0c310d6-98.jpg", "descriptions": "Discover all the official rosters and tracks and experience the thrill of the 2021 Season. And if you want to dive into the past, you can relive the MotoGP™ history with more than 40 riders and their iconic bikes. Take critical decisions and find a winning strategy to take over theDiscover all the official rosters and tracks and experience the thrill of the 2021 Season. And if you want to dive into the past, you can relive the MotoGP™ history with more than 40 riders and their iconic bikes. Take critical decisions and find a winning strategy to take over the Championship! Create your crew, choosing between official teams or a new one. Pick your staff, choosing your Personal Manager, a Chief Engineer, and a Data Analyst who will help you to make crucial choices such as the best contract to get and the bike development. Reach the MotoGP™ or Moto2™ class and assemble your very own Junior team. How you ride your bike will directly affect the tires wear. Worn tires make it more difficult to handle the bike. Manage it cautiously. Forget automatic respawns. If you fall, you must get up and get back on your bike as fast as possible. Never lose control. Customize helmet, suit, stickers, racing number, and livery with 5 incredible Graphic Editors! Once you’re done, share* your designs online or try on some of your fellow player’s creations. *You can share helmet, racing number and rider stickers. Just like the real riders, you’ll have to play by the rules of the official championship or you’ll face the consequences, including, for the first time, the Long Lap Penalty. Enjoy the most authentic MotoGP™ experience.\r… Expand"}, {"name": "Grow: Song of the Evertree", "details_link": "https://www.metacritic.com/game/switch/grow-song-of-the-evertree", "publisher": "505 Games", "release_date": "Nov 16 2021", "developers": ["Prideful Sloth"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/b93674e1b5cb98b3a72959a4babd2ad8-98.jpg", "descriptions": "Grow your own worlds and nurture a deep natural connection with everything they hold. See your actions change the world for better! Bring the Evertree back to life in this breathtaking world-crafting sandbox, with life management and adventure elements."}, {"name": "Unruly Heroes", "details_link": "https://www.metacritic.com/game/xbox-one/unruly-heroes", "publisher": "Magic Design Studios", "release_date": "Jan 23 2019", "developers": ["Magic Design Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/7e37cf3a3030d069f16d8fb27b665b49-98.jpg", "descriptions": "Unruly Heroes is an action-adventure game inspired by the famous chinese legend ‘A journey to the west’ better known as the Monkey King Legend. Through this epic adventure, the game will make you live a fantastic and unforgettable experience. The game can be played in coop up to 4 players,Unruly Heroes is an action-adventure game inspired by the famous chinese legend ‘A journey to the west’ better known as the Monkey King Legend. Through this epic adventure, the game will make you live a fantastic and unforgettable experience. The game can be played in coop up to 4 players, but you can decide to play online in fierce Player vs Player modes. Who will be your favorite character?… Expand"}, {"name": "Ruiner", "details_link": "https://www.metacritic.com/game/xbox-one/ruiner", "publisher": "Devolver Digital", "release_date": "Sep 26 2017", "developers": ["Reikon Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/5dd83d95c9737ebc634424dae26d8c8b-98.jpg", "descriptions": "RUINER is a brutal action shooter set in the year 2091 in the cyber metropolis Rengkok. A wired sociopath lashes out against a corrupt system to uncover the truth and retrieve his kidnapped brother under the guidance of a secretive hacker friend."}, {"name": "Borderlands: The Pre-Sequel", "details_link": "https://www.metacritic.com/game/playstation-3/borderlands-the-pre-sequel", "publisher": "2K Games", "release_date": "Oct 14 2014", "developers": ["2K Australia"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/bf9996cdadac43362e14f5e8daaf36e3-98.jpg", "descriptions": "Learn the story behind Borderlands 2’s villain, Handsome Jack, and his ascendance to power in this new game in the Borderlands series. Taking place between the original Borderlands and Borderlands 2, the Pre-Sequel gives you a bunch of new gameplay featuring the genre fusion of shooter andLearn the story behind Borderlands 2’s villain, Handsome Jack, and his ascendance to power in this new game in the Borderlands series. Taking place between the original Borderlands and Borderlands 2, the Pre-Sequel gives you a bunch of new gameplay featuring the genre fusion of shooter and RPG gameplay.… Expand"}, {"name": "Transformers: War for Cybertron", "details_link": "https://www.metacritic.com/game/playstation-3/transformers-war-for-cybertron", "publisher": "Activision", "release_date": "Jun 22 2010", "developers": ["High Moon Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Action Adventure", "Sci-Fi", "Sci-Fi", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/5d6843302dc383bc7b842762026dff31-98.jpg", "descriptions": "Transformers: War for Cybertron challenges players to become the ultimate weapon as a TRANSFORMERS character in the final, epic war that will determine the survival of their entire race. Armed with a diverse arsenal of lethal, high-tech weaponry and the ability to instantly convert fromTransformers: War for Cybertron challenges players to become the ultimate weapon as a TRANSFORMERS character in the final, epic war that will determine the survival of their entire race. Armed with a diverse arsenal of lethal, high-tech weaponry and the ability to instantly convert from robot to vehicle at any time, players will engage in heart-pounding battles on land and in the air in this gripping, 3rd person action shooter set in the TRANSFORMERS’ war-ravaged homeland. Complete with several multiplayer modes, Transformers: War for Cybertron allows gamers to play through story missions with their friends in drop in/drop out online co-op, and also create their own TRANSFORMERS character for competitive head-to-head multiplayer modes, choosing among four distinct character classes, personalizing its look and selecting from a huge variety of weapons, skills and abilities. [Activision]… Expand"}, {"name": "NHL 18", "details_link": "https://www.metacritic.com/game/xbox-one/nhl-18", "publisher": "Electronic Arts", "release_date": "Sep 12 2017", "developers": ["EA Sports"], "platforms": ["PlayStation 4", "Xbox One"], "genres": ["Sports", "Team", "Ice Hockey", "Sim"], "meta_score": 77, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/3/2ed3eec56d9c9f336d3925a4cf9fd6aa-98.jpg", "descriptions": "NHL 18 is built to deliver the speed, skill, and creativity of today’s young new NHL through Creative Attack controls and the all-new Defensive Skill stick. The new 3-on-3 NHL THREES mode introduces fast-paced, arcade-inspired action and, in Franchise Mode, the Expansion Draft feature letsNHL 18 is built to deliver the speed, skill, and creativity of today’s young new NHL through Creative Attack controls and the all-new Defensive Skill stick. The new 3-on-3 NHL THREES mode introduces fast-paced, arcade-inspired action and, in Franchise Mode, the Expansion Draft feature lets fans be the first to play as the Vegas Golden Knights, or create and draft their very own 32nd NHL team from the ground up. All of these new features are delivered with the most ways to play multiplayer ever in an EA SPORTS NHL game. [Electronic Arts]… Expand"}, {"name": "NHL 20", "details_link": "https://www.metacritic.com/game/playstation-4/nhl-20", "publisher": "Electronic Arts", "release_date": "Sep 10 2019", "developers": ["Electronic Arts"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Sports", "Team", "Ice Hockey", "Sim"], "meta_score": 77, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/8/bc9afe0fd5c4a02fc462679c00c60322-98.jpg", "descriptions": "EA SPORTS NHL 20 introduces cutting-edge gameplay innovation to showcase your skills, more customization to unlock your style, and new modes to compete with friends. RPM Tech-powered gameplay introduces Signature Shots that replicate your favourite NHL players' real-world shot styles. OverEA SPORTS NHL 20 introduces cutting-edge gameplay innovation to showcase your skills, more customization to unlock your style, and new modes to compete with friends. RPM Tech-powered gameplay introduces Signature Shots that replicate your favourite NHL players' real-world shot styles. Over 45 new shot animations make every attack a threat, and new passing and puck pick-ups create faster, fluid gameplay executed at full speed.\r A revamped broadcast package delivers all-new visuals and commentary. Combined with over 1,100 new customization items for your club and character, your biggest goals look incredible during the action and in the highlight reel.\r Finally, NHL 20 adds three new game modes. HUT Squad Battles features weekly teams, built by athletes and artists, to challenge for unique rewards. The fan-favourite ONES can now be played with friends on the couch, and the all-new Eliminator mode in World of CHEL introduces a winner-take-all competition where you and your friends compete to be the best in the barn.… Expand"}, {"name": "Darksiders Genesis", "details_link": "https://www.metacritic.com/game/xbox-one/darksiders-genesis", "publisher": "THQ Nordic", "release_date": "Feb 14 2020", "developers": ["Airship Syndicate Entertainment"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/34a4b8fa1e7f70f1945a7e595f187de0-98.jpg", "descriptions": "From the dawn of creation, the council has maintained the Balance across existence. Carrying out their orders are the Horsemen, Nephilim (powerful beings spawned from the unnatural union of angels and demons) who have pledged themselves to the Council and been granted immense power.From the dawn of creation, the council has maintained the Balance across existence. Carrying out their orders are the Horsemen, Nephilim (powerful beings spawned from the unnatural union of angels and demons) who have pledged themselves to the Council and been granted immense power.However, this power came at a tragic cost: the Horsemen were ordered to use their newfound strength to wipe out the rest of their kind. What followed was a bloody battle on Eden where the Horsemen, obeying the will of the Council, annihilated the Nephilim.Darksiders: Genesis is an action/adventure that tears its way through hordes of demons, angels, and everything in-between on its way to Hell and back with guns blazing and swords swinging. Genesis gives players their first look at the world of Darksiders before the events of the original game, as well as introduces the horseman Strife.… Expand"}, {"name": "Virtua Tennis 4: World Tour Edition", "details_link": "https://www.metacritic.com/game/playstation-vita/virtua-tennis-4-world-tour-edition", "publisher": "Sega", "release_date": "Feb 15 2012", "developers": ["Sega"], "platforms": "PlayStation Vita", "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/6152bb13f52a0c097c4563bef04b1cb2-98.jpg", "descriptions": "Virtua Tennis 4 with the PlayStation Move is more than just hitting the ball; it's about the angle of the racquet, the spin and speed of the ball and the power of the shot.  The advanced motion sensors of PlayStation Move precisely track both the fast and subtle movements of the controllerVirtua Tennis 4 with the PlayStation Move is more than just hitting the ball; it's about the angle of the racquet, the spin and speed of the ball and the power of the shot.  The advanced motion sensors of PlayStation Move precisely track both the fast and subtle movements of the controller allowing for pinpoint accurate shots as players improve their racquet skills.  Virtua Tennis 4 will also support 3D technology delivering unprecedented realism to the tennis experience, bringing you closer than ever to being out on the court.… Expand"}, {"name": "Tropico 4", "details_link": "https://www.metacritic.com/game/xbox-360/tropico-4", "publisher": "Kalypso", "release_date": "Oct 18 2011", "developers": ["Haemimont", "Haemimont Games"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Government"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/73dbd275bda91ed8ee6e8966216fc86d-98.jpg", "descriptions": "Tropico 4 sees you return as El Presidente, the tyrannical (or benevolent) dictator of the island paradise of Tropico. The world is changing and Tropico is moving with the times Ã¯Â¿Â½ geographical powers rise and fall and the world market is dominated by new players with new demands andTropico 4 sees you return as El Presidente, the tyrannical (or benevolent) dictator of the island paradise of Tropico. The world is changing and Tropico is moving with the times Ã¯Â¿Â½ geographical powers rise and fall and the world market is dominated by new players with new demands and offers -- and you, as El Presidente, face a whole new set of challenges. If you are to triumph over your naysayers you will need to gain as much support from your people as possible. Your decisions will shape the future of your nation, and more importantly, the size of your Swiss bank account. … Expand"}, {"name": "WWE 2K22", "details_link": "https://www.metacritic.com/game/playstation-5/wwe-2k22", "publisher": "2K Games", "release_date": "Mar  8 2022", "developers": ["Take-Two Interactive", "Visual Concepts"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 8 ", "genres": ["Sports", "Individual", "Combat", "Wrestling"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/86723f0cf0b91ad95a875391f56dfc34-98.jpg", "descriptions": "Get ripped out of the stands and hit with complete control of the WWE Universe. Hit with the biggest and most realistic-looking WWE Superstars and Legends: The Rock, Sasha Banks, Goldberg, Brock Lesnar & more. Relive pivotal moments in Rey Mysterio’s iconic career in 2K Showcase and 619 yourGet ripped out of the stands and hit with complete control of the WWE Universe. Hit with the biggest and most realistic-looking WWE Superstars and Legends: The Rock, Sasha Banks, Goldberg, Brock Lesnar & more. Relive pivotal moments in Rey Mysterio’s iconic career in 2K Showcase and 619 your way to superstardom. Booyaka! Call the shots as a WWE General Manager in MyGM - Take the reins of Raw, SmackDown, NXT or NXT UK and draft your ultimate roster then compete against rival GM’s to build the biggest brand in the WWE Universe.\r Take on not one, but two MyRISE adventures, featuring unique male & female storylines that let you choose your journey like never before.\r The Creation Suite is back & better than ever. Be yourself or someone else. Then step in the ring anytime, anywhere in the world.\r In a franchise-first, the all-new MyFACTION lets you build a faction that rivals the nWo, with weekly events and regular updates! … Expand"}, {"name": "Trajectile", "details_link": "https://www.metacritic.com/game/ds/trajectile", "publisher": "Nintendo", "release_date": "Jan  4 2010", "developers": ["Q-Games"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "General", "General"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/53fb59cafec2ec3ad70057adbd8e8525-98.jpg", "descriptions": "[DSiWare; also known as \"Reflect Missile\"]  Trajectile is a puzzle game that's as much about firepower as it is about brainpower, requiring you to line up your shot and launch a flurry of missiles at enemy targets. Three types of missiles are at your disposal, each one with its own[DSiWare; also known as \"Reflect Missile\"]  Trajectile is a puzzle game that's as much about firepower as it is about brainpower, requiring you to line up your shot and launch a flurry of missiles at enemy targets. Three types of missiles are at your disposal, each one with its own characteristics - but all of them can bounce off walls on their path to smash, blast or drill through enemies and blocks. Along the way, you'll find item blocks just waiting to be destroyed so that you can obtain special power-ups ... and cause even more destruction. Be careful though, as missile type and position are predetermined and you get only a limited number of launches per stage. Complete multiple classes containing numerous individual stages, earning medals when you clear stages in fewer than the given number of turns. Are you ready to take aim at becoming a Trajectile master? [Nintendo]… Expand"}, {"name": "The Godfather", "details_link": "https://www.metacritic.com/game/xbox-360/the-godfather", "publisher": "Electronic Arts", "release_date": "Sep 19 2006", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic", "Open-World"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/cecfef347fe524232a968fead9e28481-98.jpg", "descriptions": "The book by Mario Puzo and classic film by Paramount Pictures serve as inspiration for The Godfather, as gamers join the Corleone family and earn respect through loyalty and fear as they rise through the ranks to become Don in a living 1945-1955 New York. Gamers create their own mobThe book by Mario Puzo and classic film by Paramount Pictures serve as inspiration for The Godfather, as gamers join the Corleone family and earn respect through loyalty and fear as they rise through the ranks to become Don in a living 1945-1955 New York. Gamers create their own mob character in the game, putting themselves into the action while reliving classic moments from the fiction and experiencing original missions alongside memorable characters from the film. After a life of small-time jobs and petty thefts the player is accepted into the Corleone family, America's most famous criminal organization. It is up to the player to carry out orders, earn respect and make New York City their own. Featuring non-linear action-adventure gameplay, The Godfather offers gamers countless choices for solving the family’s problems with brutal violence, skillful diplomacy, or a cunning mixture of both. From mob hits and bank heists to drive-bys and extortion, step deep inside the world of The Godfather where intimidation and negotiation are your tickets to the top. Players use their powers of loyalty and fear to earn respect through interactions with characters in the world. Decisions made by the player in the game have lasting consequences, just as it was in the mob underworld featured in The Godfather fiction. James Caan, Robert Duvall, and the late Marlon Brando provided voice acting and likenesses for the game. [Electronic Arts]… Expand"}, {"name": "Strider", "details_link": "https://www.metacritic.com/game/playstation-4/strider", "publisher": "Capcom", "release_date": "Feb 18 2014", "developers": ["Double Helix Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Fantasy", "Action Adventure", "General", "Fantasy"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/a5bdbeb1a7c78a824fe9c5f8603bba89-98.jpg", "descriptions": "Originally released in 1989, Strider remains one of Capcom's most enduring franchises.  The game tells the story of Hiryu, the youngest ever \"Super A\" ranked agent of an elite corps known as the Striders.  Strider Hiryu receives orders to assassinate Grandmaster Meio, supremeOriginally released in 1989, Strider remains one of Capcom's most enduring franchises.  The game tells the story of Hiryu, the youngest ever \"Super A\" ranked agent of an elite corps known as the Striders.  Strider Hiryu receives orders to assassinate Grandmaster Meio, supreme dictator of Earth, who has plunged humanity into a dystopian dark age.… Expand"}, {"name": "Grandia III", "details_link": "https://www.metacritic.com/game/playstation-2/grandia-iii", "publisher": "Square Enix", "release_date": "Feb 14 2006", "developers": ["Game Arts"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 77, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/738c69afd185b782ed7564c974f78b91-98.jpg", "descriptions": "Yuki has idolized the legendary pilot Schmidt since he was a young boy and has been trying to build his own ever since. Loving the freedom of flight, he dreams of one day leaving his small island and reaching the mainland. In the woods not far away, Alfina rides alone on a horse-drawnYuki has idolized the legendary pilot Schmidt since he was a young boy and has been trying to build his own ever since. Loving the freedom of flight, he dreams of one day leaving his small island and reaching the mainland. In the woods not far away, Alfina rides alone on a horse-drawn carriage. She is a Communicator, one of the few who can speak with the Guardians, gods that protect the world. She is hurrying to a temple to take the place of her brother, Emelious. Resentment of his obligated duty as a Communicator has turned Emelious into a cruel and violent being filled with hate. Fate will bring together Yuki and Alfina just as the world is about to fall apart. [Square Enix]… Expand"}, {"name": "Relayer", "details_link": "https://www.metacritic.com/game/playstation-5/relayer", "publisher": "Clouded Leopard Entertainment", "release_date": "Mar 24 2022", "developers": ["Kadokawa"], "platforms": ["PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 77, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/89dcd545b01539ad7fd669963802549f-98.jpg", "descriptions": "A next-generation robot SRPG set in a sci-fi alternate reality, in which Starchildren—humans who have been granted special abilities—take on an extraterrestrial threat known as the Relayers. Command a squadron of Stellar Gear, humanoid weapons developed from the technology of ancient alienA next-generation robot SRPG set in a sci-fi alternate reality, in which Starchildren—humans who have been granted special abilities—take on an extraterrestrial threat known as the Relayers. Command a squadron of Stellar Gear, humanoid weapons developed from the technology of ancient alien civilizations, to defend Earth from the invading Relayer aliens. Approximately 100 unique cutscenes play during battles throughout the game, and stage maps are all illustrated in high-quality, full 3D.\rRelayer also features exciting special attacks such as Backstab and the Big Bang. Players must use a wide range of strategies in order to lead the Starchildren to victory!… Expand"}, {"name": "Super Monkey Ball: Banana Mania", "details_link": "https://www.metacritic.com/game/xbox-series-x/super-monkey-ball-banana-mania", "publisher": "Sega", "release_date": "Oct  5 2021", "developers": ["Sega"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "genres": ["Miscellaneous", "Compilation"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/2bee2fe297609647d566646caa44dc34-98.jpg", "descriptions": "Go Bananas with your favorite monkey gang in the ultimate Super Monkey Ball adventure. Roll through wondrous worlds with AiAi and friends as you race to stop monkey mad scientist Dr. Bad-Boon from blowing up Jungle Island! Join the all-star monkey team of AiAi, MeeMee, GonGon, Baby, YanYanGo Bananas with your favorite monkey gang in the ultimate Super Monkey Ball adventure. Roll through wondrous worlds with AiAi and friends as you race to stop monkey mad scientist Dr. Bad-Boon from blowing up Jungle Island! Join the all-star monkey team of AiAi, MeeMee, GonGon, Baby, YanYan and Doctor as you bounce, tilt, and roll your way across hundreds of delightfully crafted levels and mazes. It’s monkey business for the gang - play solo or with friends as you take down Dr. Bad-Boon and steal back your beloved bananas!\rFeatures:\r The ultimate Super Monkey Ball Experience – More than 300 stages from Super Monkey Ball, Super Monkey Ball 2 and Super Monkey Ball Deluxe. \r Go Bananas with 12 fun minigames including Monkey Racing, Monkey Soccer, Monkey Bowling, Monkey Baseball and much more! \r Challenge your friends as you compete for top banana on the online leaderboards!\r  Assemble your all-star monkey team of up to 4 friends and work together to save Jungle Island with 4-player local co-op. \r Immerse yourself in the Super Monkey Ball world with creative comic book-style story telling in Story Mode.\r  Want to be the coolest monkey on the block? Customize your character and Super Monkey Ball to make it your own!\r… Expand"}, {"name": "DOOM Eternal: The Ancient Gods Part Two", "details_link": "https://www.metacritic.com/game/xbox-one/doom-eternal-the-ancient-gods-part-two", "publisher": "Bethesda Softworks", "release_date": "Mar 18 2021", "developers": ["id Software"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/14c2223c82d7911e979bec5eb7eaee3f-98.jpg", "descriptions": "Unite the Sentinel armies and take the war to the stronghold of the Dark Lord himself in one last effort to seal away evil once and for all. With the all-new Sentinel Hammer in hand, the Slayer will rip, tear and now smash every demon in his path across ancient Sentinel settlements,Unite the Sentinel armies and take the war to the stronghold of the Dark Lord himself in one last effort to seal away evil once and for all. With the all-new Sentinel Hammer in hand, the Slayer will rip, tear and now smash every demon in his path across ancient Sentinel settlements, devastated Earth cities and beyond, tackling stronger new enemy variants as he nears his final battle.Everything you've fought for has led to this moment. Your war against Hell ends here.… Expand"}, {"name": "Ys Origin", "details_link": "https://www.metacritic.com/game/playstation-4/ys-origin", "publisher": "DotEmu", "release_date": "May 30 2017", "developers": ["Falcom"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/b4b4ca3634ac98af501de6009b024327-98.jpg", "descriptions": "700 years before the events of Ys I & II, the land of Ys was on the brink of destruction. Demons came in droves and forced the twin Goddesses who ruled the land to whisk their subjects away from the surface, into the safe embrace of the clouds. The demons were persistent, however,700 years before the events of Ys I & II, the land of Ys was on the brink of destruction. Demons came in droves and forced the twin Goddesses who ruled the land to whisk their subjects away from the surface, into the safe embrace of the clouds. The demons were persistent, however, erecting a massive tower in pursuit. The battle that raged upon the ground had begun ascending for a second round up above.… Expand"}, {"name": "Day of Infamy", "details_link": "https://www.metacritic.com/game/pc/day-of-infamy", "publisher": "New World Interactive", "release_date": "Jul 28 2016", "developers": ["New World Interactive"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/e7c739ce2e9b494e043f23159f6e6673-98.jpg", "descriptions": "Experience close-quarters battles in iconic WWII settings. Defend the line, storm the beach, torch the enemy, or use a radio to call in fire support. Day of Infamy is a teamwork-oriented shooter that will keep you on your toes and coming back for more with its diverse game modes andExperience close-quarters battles in iconic WWII settings. Defend the line, storm the beach, torch the enemy, or use a radio to call in fire support. Day of Infamy is a teamwork-oriented shooter that will keep you on your toes and coming back for more with its diverse game modes and authentic arsenal.… Expand"}, {"name": "Crusader Kings II: Sons of Abraham", "details_link": "https://www.metacritic.com/game/pc/crusader-kings-ii-sons-of-abraham", "publisher": "Paradox Interactive", "release_date": "Nov 18 2013", "developers": ["Paradox Development Studio"], "platforms": "PC", "genres": ["Historic", "Strategy", "Real-Time", "General", "Historic"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/2605b35e578a026243592be43ec7f4e5-98.jpg", "descriptions": "Crusader Kings II: Sons of Abraham is the fifth expansion for the strategy/RPG , focusing on the Abrahamic religions; Christianity, Islam and Judaism. Get your bishops appointed cardinals and tap the  might of the Papacy, borrow money from the Knights Templar and send troublesome relativesCrusader Kings II: Sons of Abraham is the fifth expansion for the strategy/RPG , focusing on the Abrahamic religions; Christianity, Islam and Judaism. Get your bishops appointed cardinals and tap the  might of the Papacy, borrow money from the Knights Templar and send troublesome relatives off to live out their days in a monastery. Sons of Abraham also introduces the Jewish religion and allows you to recreate the Kingdom of Israel and rebuild the Temple in Jerusalem. The expansion for Crusader Kings II explores one of the defining periods in world history in an experience crafted by Paradox Development Studio, the masters of Grand Strategy. Medieval Europe is brought to life in this epic game of knights, schemes, and thrones.… Expand"}, {"name": "Secret Weapons Over Normandy", "details_link": "https://www.metacritic.com/game/xbox/secret-weapons-over-normandy", "publisher": "LucasArts", "release_date": "Nov 18 2003", "developers": ["Totally Games"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Simulation", "Flight", "WWII"], "meta_score": 77, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/4/a8861134b4bfec105087b51e2fa3a1dd-98.jpg", "descriptions": "Join a secret squad of pilots dedicated to thwarting the most heinous plans of the Third Reich.  In the new WWII action-flyer, Secret Weapons Over Normandy, you will fly over 20 authentic aircraft across 30 daring missions.  Embark on an action-packed and intriguing journey over Europe andJoin a secret squad of pilots dedicated to thwarting the most heinous plans of the Third Reich.  In the new WWII action-flyer, Secret Weapons Over Normandy, you will fly over 20 authentic aircraft across 30 daring missions.  Embark on an action-packed and intriguing journey over Europe and other territories.  Engage in air-to-air and air-to-ground battle scenarios as you make your way through the ranks of an elite fighter squadron.  Can you be trusted with the most dangerous secrets of the war? … Expand"}, {"name": "Risen", "details_link": "https://www.metacritic.com/game/pc/risen", "publisher": "Deep Silver", "release_date": "Oct  2 2009", "developers": ["Piranha Bytes"], "platforms": ["PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Action RPG"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/8ec6c18db1289cbeceb7bc16eec2a69b-98.jpg", "descriptions": "An epic story in an authentic world hand-crafted with an eye for detail and populated by \"real\", plausible characters. A Mysterious Volcanic Island The heavy tremors on the island bode ill for its inhabitants. Ancient temples have risen from the ground recently, bizarre creatures areAn epic story in an authentic world hand-crafted with an eye for detail and populated by \"real\", plausible characters. A Mysterious Volcanic Island The heavy tremors on the island bode ill for its inhabitants. Ancient temples have risen from the ground recently, bizarre creatures are terrorising the area. Fear and terror is spreading among the population. The End of All Hope? A group of powerful men who call themselves \"The Inquisitors\" have taken it upon them-selves to put an end to these events. They send an exhibition to this remote island, but a storm takes hold of the ship and destroys it at sea. A Hero Will Come - As if by a miracle, the player survives the shipwreck and is stranded on the volcanic island alone. He finds himself amidst a chaos of rebellion, tyranny and mystic rituals. He must now decide to which side the pendulum of fate will swing. [Deep Silver]… Expand"}, {"name": "VA-11 Hall-A: Cyberpunk Bartender Action", "details_link": "https://www.metacritic.com/game/pc/va-11-hall-a-cyberpunk-bartender-action", "publisher": "Ysbryd Games", "release_date": "Jun 21 2016", "developers": ["Sukeban Games"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "General"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/4dcd90d42b64497d4a769c2b00b92223-98.jpg", "descriptions": "VA-11 HALL-A: Cyberpunk Bartender Action is a booze em' up about waifus, technology, and post-dystopia life."}, {"name": "X-Men Origins: Wolverine", "details_link": "https://www.metacritic.com/game/pc/x-men-origins-wolverine", "publisher": "Activision", "release_date": "May  1 2009", "developers": ["Raven Software"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "General", "Beat-'Em-Up", "2D", "3D"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/985945111f85ac2360d458914c1a60ad-98.jpg", "descriptions": "Unleash the razor sharp adamantium claws, feral instincts, and mutant regeneration powers of the world's fiercest Super Hero - Wolverine - and uncage the story of how the ultimate weapon was created. The team at Raven Software has dedicated Wolverine's development to unstoppable,Unleash the razor sharp adamantium claws, feral instincts, and mutant regeneration powers of the world's fiercest Super Hero - Wolverine - and uncage the story of how the ultimate weapon was created. The team at Raven Software has dedicated Wolverine's development to unstoppable, true-to-character authenticity. Take on impossible odds and exact revenge. [Activision]… Expand"}, {"name": "Penny Arcade Adventures: Episode Three", "details_link": "https://www.metacritic.com/game/pc/penny-arcade-adventures-episode-three", "publisher": "Zeboyd Games", "release_date": "Jun 25 2012", "developers": ["Zeboyd Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Adventure", "General", "Console-style RPG", "Japanese-Style"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/d2a41b2ad8c85208aef682bfeedee349-98.jpg", "descriptions": "The Startling Developments Detective Agency springs into action as On the Rain-Slick Precipice of Darkness 3 begins, set in motion by a call from a mysterious source. The ever escalating perils on the Rain-Slick Precipice of Darkness will season our tender heroes to their very core!"}, {"name": "Hard West 2", "details_link": "https://www.metacritic.com/game/pc/hard-west-2", "publisher": "Good Shepherd Entertainment", "release_date": "Aug  4 2022", "developers": ["Ice Code Games", "Ice Cold Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/84c80cd20105eb2f78e11209126fdf5d-98.jpg", "descriptions": "Hard West 2 is a journey to the heart of darkness in the American West. Take control of a supernatural posse and catch the mysterious Ghost Train. Outsmart, outcheat and outgun your enemies in this turn-based tactics game set in a Wild West world where nothing is as it seems."}, {"name": "Valiant Hearts: The Great War", "details_link": "https://www.metacritic.com/game/switch/valiant-hearts-the-great-war", "publisher": "Ubisoft", "release_date": "Nov  8 2018", "developers": ["Ubisoft Montpellier"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/109ee9483a1973e2bf5f8396d72d4b94-98.jpg", "descriptions": "This is the story of 5 crossed destinies and a broken love in a world torn apart. All of them will try to survive the horror of the trenches following their faithful canine companion. From the green forests of the French countryside, to dank trenches and snowy fields, go back through historyThis is the story of 5 crossed destinies and a broken love in a world torn apart. All of them will try to survive the horror of the trenches following their faithful canine companion. From the green forests of the French countryside, to dank trenches and snowy fields, go back through history in this emotional adventure as friendship, love, sacrifice and tragedy befall each one as they help each other to retain their humanity against the horrors of war.… Expand"}, {"name": "Resident Evil: Revelations 2 - Episode 3: Judgment", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-revelations-2---episode-3-judgment", "publisher": "Capcom", "release_date": "Mar 10 2015", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Survival"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/346632da308bfb323ac739adafd4a2e3-98.jpg", "descriptions": "Resident Evil Revelations 2 - Episode 1 required; sold separately. Xbox Live free membership required. Xbox Live Gold membership required for multiplayer features. Episode Three: Judgment Neil is caught in the Overseer's trap. Following a clue he left behind, Claire and Moira search for aResident Evil Revelations 2 - Episode 1 required; sold separately. Xbox Live free membership required. Xbox Live Gold membership required for multiplayer features. Episode Three: Judgment Neil is caught in the Overseer's trap. Following a clue he left behind, Claire and Moira search for a way into the Overseer's tower. Meanwhile, Barry confronts a dangerous figure with a mysterious connection to Natalia's past. Lives and ulterior motives intertwine, never knowing what fate the island has in store.\r*Additional Raid Mode characters and stages included.\r*Episode One required to play.… Expand"}, {"name": "Donkey Kong Country 3", "details_link": "https://www.metacritic.com/game/game-boy-advance/donkey-kong-country-3", "publisher": "Nintendo", "release_date": "Nov  7 2005", "developers": ["Rare Ltd."], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/e488f23610678bb647b674296328a205-98.jpg", "descriptions": "In a world where ostriches wear tennis shoes and the Kongs clamber through exotic island adventures, KAOS is on the rampage and you must use Dixie's skills to save the day. Dixie and Kiddy Kong take a run through the jungle to rescue Diddy and Donkey Kong! Baron K. Roolenstein, the leader ofIn a world where ostriches wear tennis shoes and the Kongs clamber through exotic island adventures, KAOS is on the rampage and you must use Dixie's skills to save the day. Dixie and Kiddy Kong take a run through the jungle to rescue Diddy and Donkey Kong! Baron K. Roolenstein, the leader of the Kremlings, kidnapped Donkey and Diddy, and Dixie and Kiddy must run, roll, hop, and swing across enemy-infested stages. Let the Kremling-crushin' commence with all-new minigames, nine worlds to journey through, more than 50 levels and two-player mode. The beloved side-scrollin' sequel to Donkey Kong Country 1 & 2 is now in the palm of your hands! Use Kiddy Kong's and Dixie Kong's unique abilities like the water skip and helicopter spin to go ape on the baddies. A ninth world, Pacifica, has been added to the original eight worlds. It includes six all-new levels - set from the deepest drain pipes to the tallest treetops - and adds two to three hours of brand-new gameplay. Play all-new mini-games to earn money and items. Compete in a series of boat races in Funky's Challenge, use a shield to block an onslaught of spiked creatures in Cranky's Dojo, or race through tunnels collecting stars in Swanky's Dash. Check back for more information on this game as the release date approaches, and be on the lookout for \"Where is Donkey Kong?\" Help us find DK in a charity benefit for all his real-life animal friends.… Expand"}, {"name": "The Gunstringer", "details_link": "https://www.metacritic.com/game/xbox-360/the-gunstringer", "publisher": "Twisted Pixel Games", "release_date": "Sep 13 2011", "developers": ["Twisted Pixel Games"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Rail", "Fantasy", "Fantasy"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/1d805d749f08292fbdf2cba853ae4dd0-98.jpg", "descriptions": "The Gunstringer is a Kinect game about a marionette out for revenge."}, {"name": "Dragon's Dogma: Dark Arisen", "details_link": "https://www.metacritic.com/game/xbox-360/dragons-dogma-dark-arisen", "publisher": "Capcom", "release_date": "Apr 23 2013", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox One", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/b5d8fb8816709413344b718fda7b5b3d-98.jpg", "descriptions": "A mysterious island known as Bitterblack Isle appears off the coast of Gransys. Its depths have claimed the lives of many Arisen; their voices still haunt the labyrinth that lies deep beneath its surface--a labyrinth ripe with secrets waiting to be discovered. The time to take up arms hasA mysterious island known as Bitterblack Isle appears off the coast of Gransys. Its depths have claimed the lives of many Arisen; their voices still haunt the labyrinth that lies deep beneath its surface--a labyrinth ripe with secrets waiting to be discovered. The time to take up arms has come once again. Delve into the isle's depths and uncover its dark secret.… Expand"}, {"name": "Soul Hackers 2", "details_link": "https://www.metacritic.com/game/xbox-series-x/soul-hackers-2", "publisher": "Sega", "release_date": "Aug 26 2022", "developers": ["Atlus"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 77, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/5aafb5f07ed97e8a8f484feea11bd785-98.jpg", "descriptions": "In the Soul Hackers 2 , 2 characters--Ringo and Figue--awaken in order to prevent the destruction of the world by \"The Great One.\" The game features a new storyline and roster of characters, so it's not necessary to have played its predecessor."}, {"name": "Little Big Workshop", "details_link": "https://www.metacritic.com/game/pc/little-big-workshop", "publisher": "HandyGames", "release_date": "Oct 17 2019", "developers": ["Mirage Game Studios"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/71209bbbd884f995046c8b2eebeec2c0-98.jpg", "descriptions": "Manage your workers, stations, machines and create awesome stuff as your little big workshop grows into your dream factory."}, {"name": "Assassin's Creed III Remastered", "details_link": "https://www.metacritic.com/game/xbox-one/assassins-creed-iii-remastered", "publisher": "Ubisoft", "release_date": "Mar 29 2019", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 77, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/8/413fd6ee84963efd03865fb12f1bf964-98.jpg", "descriptions": "Relive the American Revolution or experience it for the first time in Assassin's Creed® III Remastered, with enhanced graphics and improved gameplay mechanics. Plus, Assassin's Creed Liberation Remastered and all solo DLC content are included."}, {"name": "Battlestar Galactica Deadlock", "details_link": "https://www.metacritic.com/game/pc/battlestar-galactica-deadlock", "publisher": "Slitherine", "release_date": "Aug 31 2017", "developers": ["Black Lab Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "4X"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/388bce56785c33c2ddf1fde9102d4bb0-98.jpg", "descriptions": "In Battlestar Galactica Deadlock™ you’ll take command of the Colonial Fleet in defense of the Twelve Colonies during the First Cylon War. Lead many different types of ships in this 3D tactical game. Every decision counts, your strategy will be vital – can you ensure mankind’s survival?"}, {"name": "Doom 3: Resurrection of Evil", "details_link": "https://www.metacritic.com/game/xbox/doom-3-resurrection-of-evil", "publisher": "Activision", "release_date": "Oct  5 2005", "developers": ["id Software", "Nerve Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox"], "num_players": "4  Online", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/2290a394047366356da22f3847d7c440-98.jpg", "descriptions": "Reload your weapons for the first expansion pack to Doom 3. In Resurrection of Evil, you'll return to the abandoned facilities of Mars to investigate a mysterious beacon buried deep in the ruins of an ancient civilization. This time, you can wield new weapons, such as the double-barreledReload your weapons for the first expansion pack to Doom 3. In Resurrection of Evil, you'll return to the abandoned facilities of Mars to investigate a mysterious beacon buried deep in the ruins of an ancient civilization. This time, you can wield new weapons, such as the double-barreled shotgun, and control time and gravity to defeat your enemies, which include six new demons. The expansion also adds all-new eight-player arenas for capture-the-flag matches. … Expand"}, {"name": "Heavy Weapon: Atomic Tank", "details_link": "https://www.metacritic.com/game/xbox-360/heavy-weapon-atomic-tank", "publisher": "Microsoft Game Studios", "release_date": "Jan 17 2007", "developers": ["PopCap"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/e8fe53784960d7d08642c60e2ae3de36-98.jpg", "descriptions": "[Xbox Live Arcade]  Heavy Weapon: Atomic Tank unleashes adrenaline-soaked side-scrolling shoot-'em-up arcade action. With a blast of retro eighties videogame chic, Heavy Weapon brings classic shooter action and explosive power to Xbox Live Arcade. Fight through 19 story-based missions to[Xbox Live Arcade]  Heavy Weapon: Atomic Tank unleashes adrenaline-soaked side-scrolling shoot-'em-up arcade action. With a blast of retro eighties videogame chic, Heavy Weapon brings classic shooter action and explosive power to Xbox Live Arcade. Fight through 19 story-based missions to upgrade six different weapon banks, or jump into instant action with the blazing Survival mode. Grab your friends and storm across enemy lines in co-operative multiplayer modes. Are you ready for the furious fun of Heavy Weapon? [Microsoft]… Expand"}, {"name": "Mortal Kombat: Deception", "details_link": "https://www.metacritic.com/game/gamecube/mortal-kombat-deception", "publisher": "Midway", "release_date": "Mar  1 2005", "developers": ["Midway"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/f17d3b9091c648a443cc784166a3d914-98.jpg", "descriptions": "Mortal Kombat: Deception takes the series to the next level with multiple fatalities per character, interactive backgrounds, and new game modes. For the first time in the Mortal Kombat series, you can play a free-roaming Konquest mode, board games, and a puzzle game, in addition to theMortal Kombat: Deception takes the series to the next level with multiple fatalities per character, interactive backgrounds, and new game modes. For the first time in the Mortal Kombat series, you can play a free-roaming Konquest mode, board games, and a puzzle game, in addition to the enhanced one-on-one fighting mode. Mortal Kombat: Deception supports online play for both the PS2 and Xbox Live and features online matches and tournaments as well as online gameplay capabilities for both the board game and puzzle modes.… Expand"}, {"name": "Pro Evolution Soccer 2012", "details_link": "https://www.metacritic.com/game/pc/pro-evolution-soccer-2012", "publisher": "Konami", "release_date": "Sep 27 2011", "developers": ["Konami"], "platforms": ["3DS", "PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 77, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/a20f546cc8f2936f288a3f515eb137dc-98.jpg", "descriptions": "(Currently available in the UK/EU only)  Pro Evolution Soccer makes its return this fall, Pro Evolution Soccer 2012! This year, Konami is determined to give global football fans a truly realistic, immersive and a delightfully playable take on the beautiful game. Creative Producer Shingo(Currently available in the UK/EU only)  Pro Evolution Soccer makes its return this fall, Pro Evolution Soccer 2012! This year, Konami is determined to give global football fans a truly realistic, immersive and a delightfully playable take on the beautiful game. Creative Producer Shingo \"Seabass\" Takatsuka has been sourcing the desires of fans across the globe and working non-stop on marrying the digital game to the real life game so fans can get as close to the real thing. All elements have been examined - defense, offense, AI, penalties, officiating and of course, graphics! The result is a game truly represents the key attributes of the game and it's players. Pro Evolution Soccer \"Can you play?\"… Expand"}, {"name": "Summon Night: Swordcraft Story", "details_link": "https://www.metacritic.com/game/game-boy-advance/summon-night-swordcraft-story", "publisher": "Atlus Co.", "release_date": "Jul 26 2006", "developers": ["Flight-Plan"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/62a6de0b570c2b01bf35173a3d74c62f-98.jpg", "descriptions": "Summon Night: Swordcraft Story is an RPG set in the strange world of Lyndbaum, a sacred land linked to four magical dimensions from which Summoners can call forth spirits called Guardian Beasts to do their bidding."}, {"name": "NFL Street 2", "details_link": "https://www.metacritic.com/game/playstation-2/nfl-street-2", "publisher": "EA Sports Big", "release_date": "Dec 22 2004", "developers": ["EA Tiburon"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 77, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/1/8f524892753db421e39d75a00c614bca-98.jpg", "descriptions": "NFL Street 2 adds a whole new dimension to gameplay with wall moves and high flying football this year. Now for the first time, receivers can run off the walls, change passing lanes by running the QB up a building, and take advantage of eye-popping wall jukes and all-new hurdles. PlayersNFL Street 2 adds a whole new dimension to gameplay with wall moves and high flying football this year. Now for the first time, receivers can run off the walls, change passing lanes by running the QB up a building, and take advantage of eye-popping wall jukes and all-new hurdles. Players will descend on Bay City?s 10 new environments in an all-new persistent world to build their teams, their reps, and their battle plans one field at a time. Once you own the walls, you will own the city. [Electronic Arts]… Expand"}, {"name": "Chaos;Head Noah / Chaos;Child Double Pack", "details_link": "https://www.metacritic.com/game/switch/chaoshead-noah-chaoschild-double-pack", "publisher": "Spike Chunsoft", "release_date": "Oct  7 2022", "developers": ["Mages."], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/05ba0458f867d1b05acc7c2a6f8319a9-98.jpg", "descriptions": "Chaos;Head Noah - \"If you were God, and your delusions could become reality. What kind of delusions would you imagine? A sensual world? A dystopic society? Destructive punishment? Or...\"Nishijou Takumi, a shut-in gamer and anime otaku, spends his days locked away in a shipping containerChaos;Head Noah - \"If you were God, and your delusions could become reality. What kind of delusions would you imagine? A sensual world? A dystopic society? Destructive punishment? Or...\"Nishijou Takumi, a shut-in gamer and anime otaku, spends his days locked away in a shipping container while occasionally attending classes. In his place of residence, Shibuya, a bizarre string of serial killings is set in motion as he is dragged into the ordeal.Chaos;Child - It's been six years since a massive earthquake leveled the city of Shibuya. Now, in October 2015, while researching a number of recent murders, Takuru Miyashiro realizes a horrible truth. These murders are the return of a series of killings that plunged Shibuya into terror six years ago. And at the same time, people called gigalomaniacs, with the powers to make their delusions real, are beginning to awaken.… Expand"}, {"name": "Remnant: From the Ashes", "details_link": "https://www.metacritic.com/game/playstation-4/remnant-from-the-ashes", "publisher": "Perfect World Entertainment", "release_date": "Aug 20 2019", "developers": ["Gunfire Games"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/8227466db4496b24f06aff31f977c8e8-98.jpg", "descriptions": "The world has been thrown into chaos by an ancient evil from another dimension. As one of the last remnants of humanity, you must set out alone or alongside up to two other survivors to face down hordes of deadly enemies to try to carve a foothold, rebuild, and retake what was lost."}, {"name": "Sleeping Dogs: Definitive Edition", "details_link": "https://www.metacritic.com/game/playstation-4/sleeping-dogs-definitive-edition", "publisher": "Square Enix", "release_date": "Oct 14 2014", "developers": ["United Front Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Open-World"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/69fa7ea2de78328f18b9d8b99496c6b4-98.jpg", "descriptions": "The Definitive Edition of the critically acclaimed, award winning open-world action adventure, reworked, rebuilt and re-mastered for Xbox One. All 24 previously available DLC extensions from the Xbox 360 version have been integrated into the game, including the story-extending episode YearThe Definitive Edition of the critically acclaimed, award winning open-world action adventure, reworked, rebuilt and re-mastered for Xbox One. All 24 previously available DLC extensions from the Xbox 360 version have been integrated into the game, including the story-extending episode Year of the Snake and the horror-themed Nightmare in North Point. Alongside a wealth of new technological, audio and visual improvements, Hong Kong has never felt so alive. A vibrant, neon city teaming with life, Hong Kongs exotic locations and busy streets and markets hide one of the most powerful and dangerous criminal organizations in the world: the notorious Triads. Play as Wei Shen - the highly skilled undercover cop trying to take down the Triads from the inside out. You'll have to prove yourself worthy as you fight your way up the organization, taking part in brutal criminal activities without blowing your cover. Destroy your opponents in brutal hand-to-hand combat using an unmatched martial arts system. Dominate Hong Kongs buzzing streets in thrilling illegal street races and tear it up in explosive firearms action. Sleeping Dogs Hong Kong is the ultimate playground. Undercover, the rules are different.\rFEATURES:\r-With all previously available content included and a wealth of new improvements, Hong Kong has never felt so alive.\r-A mature, gritty undercover cop drama where a wrong decision can blow your cover at any time.\r-Explosive action fuelled by a seamless mix of deadly martial arts, intense gunfights and brutal takedowns.\r-Epic high-speed thrills: Burn up the streets or tear up the sea in a vast array of exotic cars, superbikes and speedboats.\r-Hong Kong is your ultimate playground: Enter illegal street races, gamble on cock fights, or kick back with some karaoke. There are countless ways to entertain yourself in Hong Kong's diverse districts.… Expand"}, {"name": "Grey Goo", "details_link": "https://www.metacritic.com/game/pc/grey-goo", "publisher": "Grey Box", "release_date": "Jan 23 2015", "developers": ["Petroglyph"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "General", "Modern", "Command"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/4c80bb24855d2cf8b1bde87c1ac58800-98.jpg", "descriptions": "Grey Goo is a real-time strategy game (RTS for short) with roots in classic strategy mechanics. Utilizing traditional base building as its core, the game aims to reinvent the modern standard of RTS gaming by placing emphasis on tactics over micro-management. By freeing players from having toGrey Goo is a real-time strategy game (RTS for short) with roots in classic strategy mechanics. Utilizing traditional base building as its core, the game aims to reinvent the modern standard of RTS gaming by placing emphasis on tactics over micro-management. By freeing players from having to issue hundreds of orders in a match, each decision is made more valuable and can mean the difference between victory and defeat.… Expand"}, {"name": "The Adventures of Shuggy", "details_link": "https://www.metacritic.com/game/xbox-360/the-adventures-of-shuggy", "publisher": "Valcon Games", "release_date": "Jun 15 2011", "developers": ["Smudged Cat Games"], "platforms": ["PC", "Xbox 360"], "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/b3f9dc7fae570b80dfa0c7ef6ca57495-98.jpg", "descriptions": "\"The Adventures of Shuggy\" is part platformer, part puzzler, and 100 percent pure type-O negative fun. Shuggy boasts a suite of novel play mechanics that are mixed and matched throughout 116 unique single-player levels, each with their own clever twist."}, {"name": "F1 2013", "details_link": "https://www.metacritic.com/game/playstation-3/f1-2013", "publisher": "Codemasters", "release_date": "Oct  8 2013", "developers": ["Codemasters Birmingham"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 77, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/09acbac1e0328dd402d8c5e52bd86c4f-98.jpg", "descriptions": "F1 2013 sees Codemasters introducing a new F1 Classics mode, opening up circuits and drivers from the 1980s."}, {"name": "Xenonauts", "details_link": "https://www.metacritic.com/game/pc/xenonauts", "publisher": "Goldhawk Interactive", "release_date": "Nov  4 2011", "developers": ["Gamethunks", "Goldhawk Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Strategy", "General"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/3793ecc464e65eaa3030ae327c1c6069-98.jpg", "descriptions": "Xenonauts is a strategy game through which you control a multi-national military organization defending a Cold War-era Earth from alien invasion, using small squads of persistent soldiers to eliminate the extraterrestrials and recover their technology in turn-based ground combat."}, {"name": "Magic: The Gathering - Duels of the Planeswalkers 2012", "details_link": "https://www.metacritic.com/game/pc/magic-the-gathering---duels-of-the-planeswalkers-2012", "publisher": "Wizards of the Coast", "release_date": "Jun 15 2011", "developers": ["Stainless Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 77, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/000d506167a02f6fdbae89f02ebc9b58-98.jpg", "descriptions": "Building on the success of the original Duels of the Planeswalkers, Duels of the Planeswalkers 2012 will introduce all new game modes, Planeswalker opponents, decks, puzzle challenges and other exciting new features including a new-to-digital multiplayer game mode called Archenemy whereBuilding on the success of the original Duels of the Planeswalkers, Duels of the Planeswalkers 2012 will introduce all new game modes, Planeswalker opponents, decks, puzzle challenges and other exciting new features including a new-to-digital multiplayer game mode called Archenemy where players gather up to two allies and team up against the AI.… Expand"}, {"name": "Hitman - Intro Pack", "details_link": "https://www.metacritic.com/game/playstation-4/hitman---intro-pack", "publisher": "Square Enix", "release_date": "Mar 11 2016", "developers": ["Io Interactive"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 77, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/bd1894e0fdc256aaa7ec45cf32779342-98.jpg", "descriptions": "With the Intro Pack, you'll get an introduction to the world of HITMAN, with the Prologue and Paris episode. You'll get full access to Contracts Mode, Escalation Mode, elusive targets and all other live content."}, {"name": "Forza Horizon 4: LEGO Speed Champions", "details_link": "https://www.metacritic.com/game/xbox-one/forza-horizon-4-lego-speed-champions", "publisher": "Xbox Game Studios", "release_date": "Jun 13 2019", "developers": ["Playground Games"], "platforms": ["PC", "Xbox One"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 77, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/0/fe446342b0c7722cdcba9fac07fa8776-98.jpg", "descriptions": "Forza Horizon 4 LEGO Speed Champions, the second major expansion for the award-winning Forza Horizon 4, presents a wonderous new LEGO Valley to race and explore.Amass your own Brick Collection and construct a Master Builder's House with a garage of amazing LEGO Speed Champions carsForza Horizon 4 LEGO Speed Champions, the second major expansion for the award-winning Forza Horizon 4, presents a wonderous new LEGO Valley to race and explore.Amass your own Brick Collection and construct a Master Builder's House with a garage of amazing LEGO Speed Champions cars including the McLaren Senna, Ferrari F40 Competizione, and 1967 Mini Cooper S Rally. Complete fun new LEGO Brick Challenges, collect hidden Bonus Cubes and earn 31 Achievements for 500 GS.… Expand"}, {"name": "The Vanishing of Ethan Carter", "details_link": "https://www.metacritic.com/game/xbox-one/the-vanishing-of-ethan-carter", "publisher": "The Astronauts", "release_date": "Jan 19 2018", "developers": ["The Astronauts"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/627e78d32f3243ad91463049615eafe0-98.jpg", "descriptions": "The Vanishing of Ethan Carter is a first-person story-driven mystery game that focuses entirely on exploration and discovery. It contains no combat or explosions of any kind. If our game leaves any scars, we hope you wont be able to see them.\r You play the game as Paul Prospero, anThe Vanishing of Ethan Carter is a first-person story-driven mystery game that focuses entirely on exploration and discovery. It contains no combat or explosions of any kind. If our game leaves any scars, we hope you wont be able to see them.\r You play the game as Paul Prospero, an occult-minded detective who receives a disturbing letter from Ethan Carter. Realizing the boy is in grave danger, Paul arrives at Ethans home of Red Creek Valley, where things turn out to be even worse than he imagined. Ethan has vanished in the wake of a brutal murder, which Paul quickly discerns might not be the only local murder worth looking into.\r Inspired by the weird fiction (and other tales of the macabre) from the early twentieth century, The Vanishing of Ethan Carter aims to significantly evolve immersive storytelling in games. While it features a private detective and quite a few mental challenges, The Vanishing of Ethan Carter is not an especially puzzle-ridden game. Our focus is on atmosphere, mood, and the essential humanity of our characters.\r Still, the discoveries wont happen on their own, or without your help. Using both Pauls supernatural skill of being able to communicate with the dead, and your own powers of observation, you will discover the mystery behind a trail of corpses, the roots of a dark ancient force lurking in Red Creek Valley, and the fate of a missing boy.\r Key Features:\r *    Explore and interact with the beautiful yet ominous world of Red Creek Valley, which was created with the use of revolutionary photogrammetry technology that allows for nearly photorealistic environments.\r*    Communicate with the dead and see how they died in order to gather clues that help you piece together the truth behind Ethans disappearance -- and the fate of his family.\r*    Experience, in non-linear fashion, a story that combines the pleasures of pulp, private eye, and horror fiction, all of it inspired by writers such as Raymond Chandler, Algernon Blackwood, Stefan Grabinski, and H. P. Lovecraft.\r*    Conduct the investigation on your own terms and at your own pace. Although there are a few scary bits in the game, players will have no need for sedatives. Our game is less about terror and more about clammy unease.… Expand"}, {"name": "Warhammer: End Times - Vermintide", "details_link": "https://www.metacritic.com/game/xbox-one/warhammer-end-times---vermintide", "publisher": "Fatshark AB", "release_date": "Oct  4 2016", "developers": ["Fatshark AB", "Nordic Games Publishing"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/b3ac62c72c17bde2e9b4fef676031a49-98.jpg", "descriptions": "Vermintide is an epic co-operative action combat adventure set in the End Times of the iconic Warhammer Fantasy world."}, {"name": "Aviary Attorney", "details_link": "https://www.metacritic.com/game/pc/aviary-attorney", "publisher": "Sketchy Logic", "release_date": "Dec 21 2015", "developers": ["Sketchy Logic"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/00c3a0ca184298288f6be96243cab8b3-98.jpg", "descriptions": "The hottest bird lawyering game to come out of 1840s France. Join Jayjay Falcon and his witty apprentice, Sparrowson, as the two take on clients, interview witnesses, collect evidence, and deliver justice to the guilty."}, {"name": "La-Mulana EX", "details_link": "https://www.metacritic.com/game/playstation-vita/la-mulana-ex", "publisher": "Rising Star Games", "release_date": "Mar  3 2015", "developers": ["Pygmy Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PlayStation Vita"], "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "2D", ""], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/63fe5304bfec382f9c4e7fc176ce336f-98.jpg", "descriptions": "Will you fall victim to deadly traps or unravel the secrets of LA-MULANA?"}, {"name": "The Darkness II", "details_link": "https://www.metacritic.com/game/pc/the-darkness-ii", "publisher": "2K Games", "release_date": "Feb  6 2012", "developers": ["Digital Extremes"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/d2da92b089bc942e1c0d87f71b4d6af6-98.jpg", "descriptions": "Inspired by the comic book series, The Darkness II is a first-person shooter that thrusts you into the role of Jackie Estacado, don of a New York crime family and wielder of an ancient chaotic force known as The Darkness. It has been 2 years since Jackie used his power to kill the guysInspired by the comic book series, The Darkness II is a first-person shooter that thrusts you into the role of Jackie Estacado, don of a New York crime family and wielder of an ancient chaotic force known as The Darkness. It has been 2 years since Jackie used his power to kill the guys responsible for his girlfriend’s murder. He has been unable to free himself of the  memory of Jenny’s death since bottling up The Darkness and now it wants out. A botched attempt to end Jackie’s life opens the door for The Darkness to reemerge and sets Jackie on a brutal journey as he unravels the mystery behind the attack and the motives of The Darkness. [2K Games]… Expand"}, {"name": "Uno Rush", "details_link": "https://www.metacritic.com/game/xbox-360/uno-rush", "publisher": "Microsoft Game Studios", "release_date": "Mar 25 2009", "developers": ["Carbonated Games"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/1fb9f80d2d5f238a5bb78217ef8c7ae7-98.jpg", "descriptions": "[Xbox Live Arcade]  UNO RUSH is a four-player, social party game that's easy to jump into, but hard to leave because you'll have so much fun playing. Sort your cards (even off-turn) so you can play them sequentially when it is your turn. The first player to get rid of all their cards wins[Xbox Live Arcade]  UNO RUSH is a four-player, social party game that's easy to jump into, but hard to leave because you'll have so much fun playing. Sort your cards (even off-turn) so you can play them sequentially when it is your turn. The first player to get rid of all their cards wins the round, and scores points based on the remaining cards in opponents' hands. This fast-paced, family-friendly game is sure to become a hit with you and your friends. Full support: Full avatar, LIVE Party Chat, Xbox LIVE Vision camera, and Big Button Pad support is provided. Multiplayer action: It's couch play for the whole family, with up to four players per console, and full guest support for multiple users per console over Xbox LIVE. Exciting UNO-style gameplay: Several special command cards affect different aspects of the game, including skipping the next player's turn, reversing the direction of play, changing the color of the discard pile, scrambling the next player's hand, or making the next player draw two or four cards. [Microsoft]… Expand"}, {"name": "Perimeter", "details_link": "https://www.metacritic.com/game/pc/perimeter", "publisher": "Codemasters", "release_date": "Jun 30 2004", "developers": ["K-D Lab"], "platforms": "PC", "num_players": "4  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/66380912b6c5c9c3956a1e61222da76b-98.jpg", "descriptions": "Perimeter is a ground breaking real-time strategy game which brings, a range of fresh ideas to the RTS genre. Use strategic Terraforming to acquire resources, project a impenetrable perimeter force shield to protect from attack and marshal your forces though manipulation of nano-technology.Perimeter is a ground breaking real-time strategy game which brings, a range of fresh ideas to the RTS genre. Use strategic Terraforming to acquire resources, project a impenetrable perimeter force shield to protect from attack and marshal your forces though manipulation of nano-technology. These key gameplay elements deliver a new challenging and rewarding experience for single and multiplayer. Perimeter is set in a universe where the earth is dying and multiple civilisations are in a race across a newly discovered galaxy to colonise the only suitable planet. This epic journey will involve exploring many new worlds, battling against other civilisations and indigenous species, all to acquire energy to continue the search for a new home. [Codemasters]… Expand"}, {"name": "Romance of the Three Kingdoms VIII", "details_link": "https://www.metacritic.com/game/playstation-2/romance-of-the-three-kingdoms-viii", "publisher": "Koei", "release_date": "Aug 13 2003", "developers": ["Koei"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Strategy", "Turn-Based", "Historic"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/fb37255c749e35155cb1e096fd6bfccd-98.jpg", "descriptions": "Brave souls, come forth! Romance of the Three Kingdoms VIII takes the series to new heights. Choose from over 700 commanders, 100 of which you create. Forge relationships such as \"Marriage\" and \"Sworn Brother.\" Wander, claim territory, enlist, revolt, or unify China and create your ownBrave souls, come forth! Romance of the Three Kingdoms VIII takes the series to new heights. Choose from over 700 commanders, 100 of which you create. Forge relationships such as \"Marriage\" and \"Sworn Brother.\" Wander, claim territory, enlist, revolt, or unify China and create your own history! [KOEI]… Expand"}, {"name": "Outlaw Volleyball", "details_link": "https://www.metacritic.com/game/xbox/outlaw-volleyball", "publisher": "Simon & Schuster", "release_date": "Jul  9 2003", "developers": ["Hypnotix"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Volleyball"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/aff6f59c6232537e3e00177373add367-98.jpg", "descriptions": "From a group of 16 social outcasts, it's up to you to find the perfect team to compete in unfriendly games of beach volleyball. Outlaw Volleyball brings its twisted characters from the Outlaw series to volleyball courts set in a jailhouse, a jungle, and a sewer. In addition to bumping,From a group of 16 social outcasts, it's up to you to find the perfect team to compete in unfriendly games of beach volleyball. Outlaw Volleyball brings its twisted characters from the Outlaw series to volleyball courts set in a jailhouse, a jungle, and a sewer. In addition to bumping, setting, and spiking, you must throw punches to achieve victory. Outlaw Volleyball provides Xbox Live support, so up to four players around the world can smash balls and beat each other up.… Expand"}, {"name": "Mega Man Battle Network 3 White", "details_link": "https://www.metacritic.com/game/game-boy-advance/mega-man-battle-network-3-white", "publisher": "Capcom", "release_date": "Jun 24 2003", "developers": ["Capcom"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/88bd58468edef1fe088dac2395aab68a-98.jpg", "descriptions": "Join Mega Mega.EXE, his pal Lan and friends as they keep the net safe from viruses and cyber menaces. You'll travel through new virtual and real worlds, fight-off new bosses, interact with new characters and even find new Battle Chips. It's cyber mayhem at it's best!"}, {"name": "Metal Gear Solid 2: Substance", "details_link": "https://www.metacritic.com/game/pc/metal-gear-solid-2-substance", "publisher": "Konami", "release_date": "Mar 27 2003", "developers": ["KCEJ"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/f5a96ee0b5353a648ffa9a6eb5eb0620-98.jpg", "descriptions": "Solid Snake returns in Metal Gear Solid 2: Substance, the expanded edition of Metal Gear Solid 2: Sons of Liberty with all-new game modes, hidden characters and storylines. Top-secret weapons technology is being mysteriously transported under cover of an oil tanker to an unknown destination.Solid Snake returns in Metal Gear Solid 2: Substance, the expanded edition of Metal Gear Solid 2: Sons of Liberty with all-new game modes, hidden characters and storylines. Top-secret weapons technology is being mysteriously transported under cover of an oil tanker to an unknown destination. It's up to Snake to infiltrate the transport and keep this deadly weapon of mass destruction from falling into the wrong hands! Featuers 350+ VR Missions and 150+ Alternate Missions, as well as 5 all-new \"Snake Tales\" side stories. [Konami]… Expand"}, {"name": "Harry Potter and the Chamber of Secrets", "details_link": "https://www.metacritic.com/game/pc/harry-potter-and-the-chamber-of-secrets", "publisher": "Electronic Arts", "release_date": "Nov 15 2002", "developers": ["KnowWonder"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Open-World"], "meta_score": 77, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/1a39e8954e3dd0ef44816a3635db2779-98.jpg", "descriptions": "Players enter fantastical free-roaming 3D environments from Harry's world. Players become Harry Potter and delve not only into Harry's world, but also into his personality, via an internal \"voice.\" Conversing with unique characters like Moaning Myrtle, shopping in Diagon Alley, and exploringPlayers enter fantastical free-roaming 3D environments from Harry's world. Players become Harry Potter and delve not only into Harry's world, but also into his personality, via an internal \"voice.\" Conversing with unique characters like Moaning Myrtle, shopping in Diagon Alley, and exploring the convoluted corridors of Hogwarts, players make crucial and independent decisions within Harry's world. Additionally, Harry can, of course, cast spells against foes - but these spells must be perfectly executed, or they could be miscast with humorous or critical consequences! Mini-games within levels can be revisited, so players can help Mrs. Weasley with \"de-gnoming\" her garden, challenge other students in Professor Lockhart's Dueling Club, or complete other mini-games again and again. [EA Games]… Expand"}, {"name": "RalliSport Challenge", "details_link": "https://www.metacritic.com/game/pc/rallisport-challenge", "publisher": "Microsoft Game Studios", "release_date": "Nov  6 2002", "developers": ["Digital Illusions"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 77, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/026c640a73db1eda2d322237442d0a06-98.jpg", "descriptions": "RalliSport Challenge delivers an action-packed racing experience by combining four different types of Rally competition into one pulse-pounding game: Hill Climb, traditional Rally, RallyCross, and Ice Racing. This variety of race types allows for gamers to experience traditional rally racingRalliSport Challenge delivers an action-packed racing experience by combining four different types of Rally competition into one pulse-pounding game: Hill Climb, traditional Rally, RallyCross, and Ice Racing. This variety of race types allows for gamers to experience traditional rally racing against the clock, as well as fierce, wheel-to-wheel grudge matches against computer opponents or over a network against friends. With 29 licensed cars (and several ?bonus? vehicles), 48 tracks, realistic AI opponents, and spectacular crashes with realistic car damage, RalliSport Challenge packs more fun and thrills into every race across a variety of terrain. [Microsoft]… Expand"}, {"name": "Mech Platoon", "details_link": "https://www.metacritic.com/game/game-boy-advance/mech-platoon", "publisher": "Kemco", "release_date": "Jan  3 2002", "developers": ["Will"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Strategy", "Real-Time", "Sci-Fi"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/848e6956d44e5ddc0b16a68b3dc193da-98.jpg", "descriptions": "The wise men say \"there is no end to the truth.\" In this war-town place, there are two things without end - the universe and greed.\rGlittering stars give the impression of eternal serenity, but the reality is that they hide a lie.\rAmong them blazes an endless war over limitedThe wise men say \"there is no end to the truth.\" In this war-town place, there are two things without end - the universe and greed.\rGlittering stars give the impression of eternal serenity, but the reality is that they hide a lie.\rAmong them blazes an endless war over limited resources; skirmishes that grow as the universe expands.… Expand"}, {"name": "Makai Kingdom: Chronicles of the Sacred Tome", "details_link": "https://www.metacritic.com/game/playstation-2/makai-kingdom-chronicles-of-the-sacred-tome", "publisher": "NIS America", "release_date": "Jul 26 2005", "developers": ["Nippon Ichi Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/e4543e00f6ca4bf1d10827f30063f82e-98.jpg", "descriptions": "An attempt to rewrite history gone terribly wrong, Lord Zetta the ruler of netherworld brought destruction upon himself. When all seemed lost, three evil overlords appear before Lord Zetta to help him recreate his world. Now Lord Zetta wages war on a new world to become the supreme rulerAn attempt to rewrite history gone terribly wrong, Lord Zetta the ruler of netherworld brought destruction upon himself. When all seemed lost, three evil overlords appear before Lord Zetta to help him recreate his world. Now Lord Zetta wages war on a new world to become the supreme ruler once again, while the three overlords entertain themselves by creating more trouble for Lord Zetta. Players assume the role of Lord Zetta to command an army of determined fighters to reclaim what has righteously been his, the netherworld.  Gamers will battle enemies ranging from vicious demons to determined soldiers with both modern and ancient warfare.  Slash your enemies with the good old broadsword or blast your way through with the deadly rocket launcher; the choices are yours. Makai Kingdom introduces a new summoning system referred to as the INVITE system that summons your facilities that contain army units to the battlefield. Every facility summoned to the battlefield will contain your troops that are then deployed to battle your hated enemies. In Makai Kingdom, battle maps are randomly generated, offering a new gaming experience every time you play.  With unlimited variations of maps, gamers can expect countless hours of game play. [NIS America]… Expand"}, {"name": "Broken Sword 5: The Serpent's Curse", "details_link": "https://www.metacritic.com/game/xbox-one/broken-sword-5-the-serpents-curse", "publisher": "Revolution Software", "release_date": "Sep  4 2015", "developers": ["Revolution Software"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One"], "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/eb4475581151618fafbe2d7bcad9ac2f-98.jpg", "descriptions": "Paris in the spring. Shots ring out from a gallery… A robbery… a murder… and the beginning of another epic, original Broken Sword adventure. From Revolution Software comes the latest explosive episode in this classic series."}, {"name": "Madden NFL 10", "details_link": "https://www.metacritic.com/game/wii/madden-nfl-10", "publisher": "Electronic Arts", "release_date": "Aug 14 2009", "developers": ["EA Tiburon"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/c1a3cd96596c83fc42fe633e8e411e4f-98.jpg", "descriptions": "Madden NFL 10 epitomizes what fun looks like on the Wii, delivering the most social and dynamic experience from the franchise to date. This year, Madden NFL 10 arrives on the Wii with breath-taking visuals that will captivate both seasoned veterans and new comers to the franchise. CompletelyMadden NFL 10 epitomizes what fun looks like on the Wii, delivering the most social and dynamic experience from the franchise to date. This year, Madden NFL 10 arrives on the Wii with breath-taking visuals that will captivate both seasoned veterans and new comers to the franchise. Completely redesigned and built from the ground up, Madden NFL 10 introduces a unique art style that will define the look of sports games on the Wii. All-new player models embody characteristics of your favorite athletes, plus new larger-than-life stadiums showcase details found at each of the 32 NFL fields. [Electronic Arts]… Expand"}, {"name": "Gun", "details_link": "https://www.metacritic.com/game/gamecube/gun", "publisher": "Activision", "release_date": "Nov  8 2005", "developers": ["Neversoft Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Historic"], "meta_score": 77, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/81969596278124a4cc68d68ca125290c-98.jpg", "descriptions": "You can experience the lawless Wild West as gunslinger Colton White in the action title Gun. Traverse an expansive world where you'll encounter outlaws, Native Americans, corrupt lawmen, and army psychopaths. You can assault a fort, hunt for bounties, and upgrade your equipment as you battleYou can experience the lawless Wild West as gunslinger Colton White in the action title Gun. Traverse an expansive world where you'll encounter outlaws, Native Americans, corrupt lawmen, and army psychopaths. You can assault a fort, hunt for bounties, and upgrade your equipment as you battle through a variety of gameplay styles. Gun also features a story written by Hollywood script writer Randall Jahnson.… Expand"}, {"name": "Assetto Corsa Competizione", "details_link": "https://www.metacritic.com/game/pc/assetto-corsa-competizione", "publisher": "505 Games", "release_date": "May 29 2019", "developers": ["Kunos Simulazioni"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/18038a6ca96be6b8fe2754b907f6537d-98.jpg", "descriptions": "Assetto Corsa Competizione is the new official Blancpain GT Series videogame. Thanks to the extraordinary quality of simulation, the game will allow you to experience the real atmosphere of the FIA ​​GT3 homologated championship, competing against official drivers, teams, cars and circuits."}, {"name": "Donut County", "details_link": "https://www.metacritic.com/game/pc/donut-county", "publisher": "Annapurna Interactive", "release_date": "Aug 28 2018", "developers": ["Ben Esposito"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/b6c13a3e1c7fff0e22d4eeef75db153c-98.jpg", "descriptions": "Donut County is a story-based physics puzzle game where you play as an ever-growing hole in the ground. Meet cute characters, steal their trash, and throw them in a hole."}, {"name": "Headlander", "details_link": "https://www.metacritic.com/game/playstation-4/headlander", "publisher": "Adult Swim", "release_date": "Jul 26 2016", "developers": ["Double Fine Productions"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Action Adventure", "General", "Platformer", "2D"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/e81529d366956987ba226f2dd9341519-98.jpg", "descriptions": "Assume the role of the last known human in the universe, and all that's left of you is a disembodied head. Seeking clues to your fractured past, you must travel through a hostile world of machines using a special helmet that allows you to dock into and take control of any robotic host body.Assume the role of the last known human in the universe, and all that's left of you is a disembodied head. Seeking clues to your fractured past, you must travel through a hostile world of machines using a special helmet that allows you to dock into and take control of any robotic host body. As you launch from one body to the next, you'll start to discover that things are not quite what they appear to be, and the fate of humanity has yet to be decided. From Double Fine Productions, Headlander is a a retro-futuristic, side-scrolling, action-adventure game set in a world inspired by 70’s science fiction. It's a world of automation, a utopia gone wrong in which all of humanity have transferred their minds into robotic imposter bodies and are ruled by a deranged computer.… Expand"}, {"name": "ZombiU", "details_link": "https://www.metacritic.com/game/wii-u/zombiu", "publisher": "Ubisoft", "release_date": "Nov 18 2012", "developers": ["Ubisoft Montpellier"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Wii U"], "num_players": "1-4 ", "genres": ["General", "Action", "Action Adventure", "Shooter", "Shooter", "Survival", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/01c4e9de63c60f7462be21908c8f22b7-98.jpg", "descriptions": "For only the second time in history, a great plague has descended upon London, infecting the human race with a deadly disease. Big Ben tolls as hundreds upon thousands of the unprepared die or are infected by a sickness worse than death... You continue to breathe, for now. But how long willFor only the second time in history, a great plague has descended upon London, infecting the human race with a deadly disease. Big Ben tolls as hundreds upon thousands of the unprepared die or are infected by a sickness worse than death... You continue to breathe, for now. But how long will you survive in the labyrinth of London streets and underground as the infected close in around you? The horrifying remains of humanity ravaged by the foul disease shuffle through the streets, waiting to prey on your living flesh at every turn. ZombiU is designed to take advantage of the Wii U and its new controller and will test your will to survive in a zombie Survival-Horror First Person Shooter. So grab hold of the height of survival kits – your new controller – and stock up your Bug-Out Bag with supplies. Make every second count; you only get one chance. … Expand"}, {"name": "The Pathless", "details_link": "https://www.metacritic.com/game/switch/the-pathless", "publisher": "Annapurna Interactive", "release_date": "Feb  2 2023", "developers": ["Giant Squid"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/1b7056b2e991bb81d0e60e4c1fe627d2-98.jpg", "descriptions": "From the creators of ABZÛ, The Pathless is the mythic adventure of an archer and an eagle in a vast forest.Explore an open world and travel to a mystical island to dispel a curse of darkness that grips the world. Together with your eagle companion, discover the history of the island, andFrom the creators of ABZÛ, The Pathless is the mythic adventure of an archer and an eagle in a vast forest.Explore an open world and travel to a mystical island to dispel a curse of darkness that grips the world. Together with your eagle companion, discover the history of the island, and fight epic battles to restore light to the land.… Expand"}, {"name": "Mario Kart 8 Deluxe: Booster Course Pass - Wave 2", "details_link": "https://www.metacritic.com/game/switch/mario-kart-8-deluxe-booster-course-pass---wave-2", "publisher": "Nintendo", "release_date": "Aug  4 2022", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 77, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/16f692ae5c63ffb26cda04fa22ea67ac-98.jpg", "descriptions": "Wave 2 includes the Turnip Cup and the Propeller Cup, with fast and familiar courses appearing from the Mario Kart series across the Super NES, Game Boy Advance, Nintendo 64, Nintendo DS, Wii and Mario Kart Tour games. Each course can be played locally or online."}, {"name": "Vampire: The Masquerade - Bloodhunt", "details_link": "https://www.metacritic.com/game/playstation-5/vampire-the-masquerade---bloodhunt", "publisher": "Sharkmob", "release_date": "Apr 27 2022", "developers": ["Sharkmob"], "platforms": ["PC", "PlayStation 5"], "genres": ["Role-Playing", "Western-Style", "Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 77, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/1b6c7d9690c93e08e688c79d72e525dc-98.jpg", "descriptions": "A treacherous betrayal has stirred a war amongst vampires, who are also targeted for annihilation by the secret society known as the Entity. Use your supernatural powers, weapons, and wit in this third-person battle royale game to dominate the night and restore the masquerade.\r Feed onA treacherous betrayal has stirred a war amongst vampires, who are also targeted for annihilation by the secret society known as the Entity. Use your supernatural powers, weapons, and wit in this third-person battle royale game to dominate the night and restore the masquerade.\r Feed on potent blood to grow in power then hunt using your supernatural abilities and senses. With Prague in lockdown, defy gravity and strike from anywhere in your quest to dominate the night.\r Choose your Clan allegiance to define your playstyle and let your personality shine through as you create your most unique looks for rivals to remember.\r Form unholy alliances or fight alone away from human eyesight. As the hunters become the hunted, fight to the last drop to become the ultimate vampire and restore order.… Expand"}, {"name": "The Ascent", "details_link": "https://www.metacritic.com/game/playstation-5/the-ascent", "publisher": "Curve Digital", "release_date": "Mar 24 2022", "developers": ["Neon Giant"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/7fb25ecf59df4026f813514c22347337-98.jpg", "descriptions": "You belong to the corporation.Can you survive without it?\nThe Ascent is a solo and co-op action RPG set in a cyberpunk world. The mega corporation that owns you and everyone, The Ascent Group, has just collapsed. Confusion and chaos ensue, security and order are in disarray, and withoutYou belong to the corporation.Can you survive without it?The Ascent is a solo and co-op action RPG set in a cyberpunk world. The mega corporation that owns you and everyone, The Ascent Group, has just collapsed. Confusion and chaos ensue, security and order are in disarray, and without protection, everyone is left to fend for themselves. Stop gangs and hostile corporations from taking over and discover what really happened.… Expand"}, {"name": "Nioh 2: The Tengu's Disciple", "details_link": "https://www.metacritic.com/game/playstation-4/nioh-2-the-tengus-disciple", "publisher": "Sony Interactive Entertainment", "release_date": "Jul 30 2020", "developers": ["Team Ninja"], "platforms": "PlayStation 4", "num_players": "Up to 3 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/8e0a59835863689c449eb5bc42af1fc1-98.jpg", "descriptions": "Nioh 2: The Tengu's Disciple is a Role-Playing game, developed by Team Ninja and published by Sony Interactive Entertainment."}, {"name": "Northgard", "details_link": "https://www.metacritic.com/game/switch/northgard", "publisher": "Merge Games", "release_date": "Sep 26 2019", "developers": ["Shiro Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 6 ", "genres": ["Strategy", "Turn-Based", "Real-Time", "4X", "Command"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/df307a6733c37d9b6a1d3c6ca8b83171-98.jpg", "descriptions": "After years of tireless explorations, brave Vikings have discovered a new land filled with mystery, danger and riches: Northgard. The boldest Northmen have set sail to explore and conquer these new shores, bring fame to their Clan and write history through conquest, trading, or devotion toAfter years of tireless explorations, brave Vikings have discovered a new land filled with mystery, danger and riches: Northgard. The boldest Northmen have set sail to explore and conquer these new shores, bring fame to their Clan and write history through conquest, trading, or devotion to the Gods. That is, if they can survive the dire Wolves and Undead Warriors roaming the land, befriend or defeat the giants, and survive the harshest winters ever witnessed in the North.… Expand"}, {"name": "Mega Man Legacy Collection 2", "details_link": "https://www.metacritic.com/game/switch/mega-man-legacy-collection-2", "publisher": "Capcom", "release_date": "May 22 2018", "developers": ["Capcom", "Now Production"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/0136357d553e98893dbf6ed9a92e7cc7-98.jpg", "descriptions": "The Blue Bomber is back in this second collection of classic Capcom titles! Featuring faithful reproductions of Mega Man 7, 8, 9, & 10, this collection spans the iconic series' evolution and retro revolution. Take on the nefarious Dr. Wily and his diverse Robot Masters in these timelessThe Blue Bomber is back in this second collection of classic Capcom titles! Featuring faithful reproductions of Mega Man 7, 8, 9, & 10, this collection spans the iconic series' evolution and retro revolution. Take on the nefarious Dr. Wily and his diverse Robot Masters in these timeless 8-bit, 16-bit, and 32-bit adventures!\r Mega Man Legacy Collection 2 is bursting with additional content, including time trials, remix challenges, a music player, and an extensive gallery of rare illustrations. Also included are the additional modes originally released as DLC for Mega Man 9 and 10, featuring extra stages and playable characters. For anyone who wants a little extra help with these challenging classic platformers, you now have the option to reduce the amount of damage received.\r… Expand"}, {"name": "Batman: The Enemy Within - Episode 4: What Ails You", "details_link": "https://www.metacritic.com/game/playstation-4/batman-the-enemy-within---episode-4-what-ails-you", "publisher": "Telltale Games", "release_date": "Jan 22 2018", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/41229072b2a03257c4b5c509bf1b26aa-98.jpg", "descriptions": "The star of this installment in Telltale's Batman series is John, the would be Joker, who finally unravels, going from the well-meaning if a bit unhinged friend to something much closer to the Clown Prince of Crime we're used to seeing terrorize Gotham City and Batman. [GameSpot]"}, {"name": "Toukiden 2", "details_link": "https://www.metacritic.com/game/playstation-4/toukiden-2", "publisher": "Koei Tecmo Games", "release_date": "Mar 21 2017", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/8c69d55091aa6301010959e2be951934-98.jpg", "descriptions": "Slayers: Go forth and eradicate the Oni menace. Experience the latest hunting action game featuring a dynamic targeted destruction system. From the battlefield to the village that serves as your base of operations, the game takes place in a vast “open world.” Explore the vast world forSlayers: Go forth and eradicate the Oni menace. Experience the latest hunting action game featuring a dynamic targeted destruction system. From the battlefield to the village that serves as your base of operations, the game takes place in a vast “open world.” Explore the vast world for yourself, and enjoy hunting action from an entirely new perspective. [Playstation.com]… Expand"}, {"name": "Ar nosurge Plus: Ode to an Unborn Star", "details_link": "https://www.metacritic.com/game/playstation-vita/ar-nosurge-plus-ode-to-an-unborn-star", "publisher": "NIS America", "release_date": "Jul  2 2015", "developers": ["Gust"], "platforms": ["PlayStation 3", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/56022fd9e3d8d909628bccb28cd613a6-98.jpg", "descriptions": "In AR NOSURGE: ODE TO AN UNBORN STAR, the player follows two sets of characters: Delta and Casty, whose goal is to protect humanity and save the world, and Ion & Earthes, who are trying to find Ion a way home to Earth. The player can interchange between both pairs and soon discover a way toIn AR NOSURGE: ODE TO AN UNBORN STAR, the player follows two sets of characters: Delta and Casty, whose goal is to protect humanity and save the world, and Ion & Earthes, who are trying to find Ion a way home to Earth. The player can interchange between both pairs and soon discover a way to combine their storylines and strengths to eventually solve the mystery that shrouds their ongoing struggle.… Expand"}, {"name": "Three Fourths Home", "details_link": "https://www.metacritic.com/game/pc/three-fourths-home", "publisher": "Digerati Distribution", "release_date": "Mar 20 2015", "developers": ["[bracket]games"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Text"], "meta_score": 77, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/be6069a2c822635e655761ffd3fda4cb-98.jpg", "descriptions": "A visual short story set in Nebraska, Three Fourths Home follows an extended exchange between Kelly and her family during a drive home through an intense thunderstorm."}, {"name": "Pix the Cat", "details_link": "https://www.metacritic.com/game/pc/pix-the-cat", "publisher": "Focus Home Interactive", "release_date": "Jan 29 2015", "developers": ["Pasta Games"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "genres": ["Action", "General", "Arcade"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/2b11d47b5e6bb224aba248a012219a72-98.jpg", "descriptions": "PIX the CAT is an intense arcade game designed to make your pads sore!Rescue forsaken ducklings from the nested levels of the infamous GRID of INFINITY. Perfect your skills to SPEED and COMBO UP until you reach the explosive FEVER TIME! Defeat your friends at home in the combat ARENA andPIX the CAT is an intense arcade game designed to make your pads sore!Rescue forsaken ducklings from the nested levels of the infamous GRID of INFINITY. Perfect your skills to SPEED and COMBO UP until you reach the explosive FEVER TIME! Defeat your friends at home in the combat ARENA and compete online with the GHOST feature. Surprising surprises are hidden along your adventure, eager to please you when you least expect it!… Expand"}, {"name": "BlazBlue: Continuum Shift II", "details_link": "https://www.metacritic.com/game/psp/blazblue-continuum-shift-ii", "publisher": "Aksys Games", "release_date": "May 30 2011", "developers": ["Arc System Works"], "platforms": ["3DS", "PSP"], "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 77, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/1585a21a95831f2a0df22209a270cb58-98.jpg", "descriptions": "BlazBlue: Continuum Shift II contains the complete set of single player features from the console version, such as Arcade, Story Attack, Training, and Story mode, and also has an ad-hoc Network mode for multiplayer play. This impressive list of features is topped off with new content createdBlazBlue: Continuum Shift II contains the complete set of single player features from the console version, such as Arcade, Story Attack, Training, and Story mode, and also has an ad-hoc Network mode for multiplayer play. This impressive list of features is topped off with new content created solely for the handheld version, including extra story material and brand new modes such as Legion 1.5 and Abyss Mode.… Expand"}, {"name": "Tomena Sanner", "details_link": "https://www.metacritic.com/game/wii/tomena-sanner", "publisher": "Konami", "release_date": "Feb  8 2010", "developers": ["Konami"], "platforms": ["iPhone/iPad", "Wii"], "num_players": "1-4 ", "genres": ["Action", "General", "General"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/bfc0da4b819e4bf43980ee010c2e7207-98.jpg", "descriptions": "[WiiWare]   Businessman Hitoshi Susumu is behind schedule and in quite a rush. In fact, once he starts running, he won't stop! Dashing past samurais, T-Rexes, cowboys and all manner of wacky obstacles, Mr. Susumu must get to the goal as fast as he can for the ultimate 2-D dance party. Tomena[WiiWare]   Businessman Hitoshi Susumu is behind schedule and in quite a rush. In fact, once he starts running, he won't stop! Dashing past samurais, T-Rexes, cowboys and all manner of wacky obstacles, Mr. Susumu must get to the goal as fast as he can for the ultimate 2-D dance party. Tomena Sanner is a high-speed side-scrolling action game with a unique timing-based control system that's as challenging as it is fun. As they fly, jump and dance over the many zany obstacles, players need to time their moves to keep their speed up and perform awesome tricks. Using just one button on the Wii Remote™ controller, players of all ages and skill levels will be able to play and help Mr. Susumu get to his goal. Four players can compete to see who is the fastest at running through the bizarre and comical world of Tomena Sanner.… Expand"}, {"name": "Star Wars Galaxies: Jump to Lightspeed", "details_link": "https://www.metacritic.com/game/pc/star-wars-galaxies-jump-to-lightspeed", "publisher": "LucasArts", "release_date": "Oct 26 2004", "developers": ["Sony Online Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi", "Sci-Fi"], "meta_score": 77, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/d4017e24a6268f41c4addb5624f04ef7-98.jpg", "descriptions": "This highly anticipated addition dramatically expands the \"Star Wars Galaxies\" franchise by providing players more than 15 different vehicles for space exploration and combat. Starfighters and other starships are featured in the expansion that can be used for both space exploration andThis highly anticipated addition dramatically expands the \"Star Wars Galaxies\" franchise by providing players more than 15 different vehicles for space exploration and combat. Starfighters and other starships are featured in the expansion that can be used for both space exploration and combat, allowing players to join up with allies and fly familiar X-wings and TIE fighters into battle against faction-aligned opponents and AI-controlled ships. Transport ships similar to the well-known Millennium Falcon are also added into the game, allowing players to venture through space with friends aboard. Set in the Star Wars timeframe between Episode IV and Episode V, this first extension to the \"Star Wars Galaxies\" foundation opens 10 vast and distinct space sectors, spanning from the Core Worlds to the Outer Rim, for players to explore while engaging their opponents in intense real-time combat or uniting with friends in battle or exploration. Players can embark on more than 100 new missions, venturing through asteroid fields, nebulae and space junkyards while honing skills in four new space-specific professions. The game also features two new and completely customizable species. [LucasArts]… Expand"}]